Public Member Functions | List of all members
AcDbDictionaryIterator Class Referenceabstract
_ More...
#include <AcDbDictionaryIterator.h>
 Public Member Functions
virtual bool  | done () const =0
Returns a flag indicating if the iterator is at its end position. More...
virtual Acad::ErrorStatus  | getObject (AcDbObject *&, AcDb::OpenMode)=0
Opens the object referenced by this Iterator object. More...
virtual const ACHAR *  | name () const =0
Returns the dictionary key at the current entry. More...
virtual bool  | next ()=0
Sets the iterator to its next position. More...
virtual AcDbObjectId  | objectId () const =0
Returns the Object ID of the dictionary entry currently referenced by this Iterator object. More...
virtual bool  | setPosition (AcDbObjectId)=0
Sets the iterator to the position corresponding to the ID. More...
 Public Member Functions inherited from AcRxObject
virtual AcRxObject *  | clone () const
Exported and implemented. More...
 virtual AcRx::Ordering  | comparedTo (const AcRxObject *) const
Exported and implemented.
virtual Acad::ErrorStatus  | copyFrom (const AcRxObject *)
Exported and implemented. More...
 virtual AcRxClass *  | isA () const
Exported and implemented.
virtual Adesk::Boolean  | isEqualTo (const AcRxObject *) const
Exported and implemented. More...
bool  | isKindOf (const AcRxClass *) const
Checks the object class. More...
AcRxObject *  | queryX (const AcRxClass *) const
returns the protocol extension object assigned to this class or a parent class. More...
AcRxObject *  | x (const AcRxClass *) const
returns the protocol extension object assigned to this class or a parent class. More...
 virtual  | ~AcRxObject ()
Destructor.
 Additional Inherited Members
 Static Public Member Functions inherited from AcRxObject
 static AcRxObject *  | cast (const AcRxObject *)
 static AcRxClass *  | desc ()
Exported and implemented.
 Protected Member Functions inherited from AcRxObject
AcRxObject ()
Exported and implemented.
Detailed Description
_
Member Function Documentation
◆ done()
 bool AcDbDictionaryIterator::done  |  ( |   | ) |   const
pure virtual
Returns a flag indicating if the iterator is at its end position.
Returns
true if ended, else false
◆ getObject()
 Acad::ErrorStatus AcDbDictionaryIterator::getObject  |  ( |  AcDbObject *&  |  pObj,
|  AcDb::OpenMode  |  openMode
)
pure virtual
Opens the object referenced by this Iterator object.
Parameters
[out] | pObj | pointer to opened object or NULL if there was an open error
[in] | openMode | mode to open object
Returns
Acad::eOk if the object is opened error code otherwise
◆ name()
 const ACHAR * AcDbDictionaryIterator::name  |  ( |   | ) |   const
pure virtual
Returns the dictionary key at the current entry.
Returns
string holding the key, or NULL on error
◆ next()
 bool AcDbDictionaryIterator::next  |  ( |   | )
pure virtual
Sets the iterator to its next position.
Returns
true if a next position is found, else false
◆ objectId()
 AcDbObjectId AcDbDictionaryIterator::objectId  |  ( |   | ) |   const
pure virtual
Returns the Object ID of the dictionary entry currently referenced by this Iterator object.
Returns
objectId of the currently referenced entity
◆ setPosition()
 bool AcDbDictionaryIterator::setPosition  |  ( |  AcDbObjectId  |  objectId | )
pure virtual
Sets the iterator to the position corresponding to the ID.
Returns
true on success, else false