Public Types | Public Member Functions | Public Attributes | Protected Member Functions | List of all members
AcDbBlockTableRecord Class Reference
_ More...
#include <AcDbBlockTableRecord.h>
 Public Types
enum  | BlockScaling { kAny = 0 , kUniform }
 typedef AcArray< Adesk::UInt8 >  | PreviewIcon
 typedef AcDbBlockTable  | TableType
 Public Types inherited from AcDbSymbolTableRecord
 typedef AcDbSymbolTable  | TableType
 Public Types inherited from AcGiDrawable
enum  | DrawableType {
 kGeometry = 0 , kDistantLight , kPointLight , kSpotLight ,
 kAmbientLight , kSolidBackground , kGradientBackground , kImageBackground ,
 kGroundPlaneBackground , kViewport
 }
enum  | SetAttributesFlags {
 kDrawableNone = 0 , kDrawableIsAnEntity = 1 , kDrawableUsesNesting = 2 , kDrawableIsCompoundObject = 4 ,
 kDrawableViewIndependentViewportDraw = 8 , kDrawableIsInvisible = 16 , kDrawableHasAttributes = 32 , kDrawableRegenTypeDependentGeometry = 64 ,
 kDrawableIsDimension = 133 , kDrawableRegenDraw = 256 , kDrawableStandardDisplaySingleLOD = 512 , kDrawableShadedDisplaySingleLOD = 1024 ,
 kDrawableViewDependentViewportDraw = 2048 , kDrawableBlockDependentViewportDraw = 4096 , kDrawableIsExternalReference = 8192 , kDrawableNotPlottable = 16384 ,
 kDrawableNotAllowLCS = 32768 , kDrawableMergeControlOff = 65536 , kThreadedWorldDrawViewportDraw = 131072
 }
 Public Member Functions
Acad::ErrorStatus  | addAnnoScalestoBlkRefs (const bool=false)
Applies annotative context data to each AcDbBlockReference using this AcDbBlockTableRecord. More...
Acad::ErrorStatus  | appendAcDbEntity (AcDbEntity *)
Appends the specified entity to the block and the database. More...
Acad::ErrorStatus  | appendAcDbEntity (AcDbObjectId &, AcDbEntity *)
Appends the specified entity to the block and the database and returns the entities id. More...
virtual Acad::ErrorStatus  | assumeOwnershipOf (AcDbObjectIdArray)
Assumes ownership of all entities specified to this block table record. More...
AcDb::UnitsValue  | blockInsertUnits () const
Gets the INSUNITS value of the block table record. More...
BlockScaling  | blockScaling () const
Gets the scaling modality for the block ref (uniform or non uniform kUniform respective kAny. More...
Acad::ErrorStatus  | comments (ACHAR *&) const
Gets a pointer to the description (DXF 4). More...
Acad::ErrorStatus  | comments (const ACHAR *&) const
Gets a pointer to the description (DXF 4). More...
virtual Acad::ErrorStatus  | decomposeForSave (AcDb::AcDbDwgVersion, AcDbObject *&, AcDbObjectId &, Adesk::Boolean &)
Determines behavior for derived custom objects when saving to an older drawing formats. More...
AcGiDrawable *  | drawable ()
Returns the AcGiDrawable for the object. More...
virtual Acad::ErrorStatus  | dwgOutFields (AcDbDwgFiler *) const
virtual Acad::ErrorStatus  | dxfOutFields (AcDbDxfFiler *) const
dxfOutFields. More...
bool  | explodable () const
Returns whether this BlockTableRecord can be exploded. More...
Acad::ErrorStatus  | getBlockReferenceIds (AcDbObjectIdArray &, bool=true, bool=false) const
Gets a list of active AcDbBlockReferences that are referencing this block Checks also the nested blocks. More...
Acad::ErrorStatus  | getErasedBlockReferenceIds (AcDbObjectIdArray &)
Gets a list of erased AcDbBlockReferences that are referencing this block. More...
AcDbObjectId  | getLayoutId () const
Returns the related AcDbLayout objectid. More...
Acad::ErrorStatus  | getPreviewIcon (PreviewIcon &) const
Gets the preview icon data from this block table record. More...
Acad::ErrorStatus  | getSortentsTable (AcDbSortentsTable *&, AcDb::OpenMode, bool=false)
Gets the sortents table. More...
bool  | hasAttributeDefinitions () const
Returns whether the block table record has attribute definitions (DXF 70, bit 1) More...
bool  | hasPreviewIcon () const
Checks this block table record preview icon data. More...
bool  | isAnonymous () const
Returns true if this block table record represents an anonymous xref (DXF 70, bit 0) @intenal. More...
bool  | isFromExternalReference () const
Returns true if this block table record represents an xref (DXF 70, bit 3) @intenal. More...
bool  | isFromOverlayReference () const
Returns true if this block table record represents an overlaid xref (DXF 70, bit 4) More...
bool  | isLayout () const
Returns true if this block table record represents a layout @intenal. More...
bool  | isUnloaded () const
Returns true if this block table record is an unloaded xref (DXF 71) @intenal. More...
Acad::ErrorStatus  | newBlockReferenceIdIterator (AcDbBlockReferenceIdIterator *&) const
Returns an iterator that can iterate over the object ids of the block references, which refer to this block table record. More...
Acad::ErrorStatus  | newIterator (AcDbBlockTableRecordIterator *&, bool=true, bool=true) const
Creates an iterator to go over the elements of this block. More...
Acad::ErrorStatus  | openBlockBegin (AcDbBlockBegin *&, AcDb::OpenMode)
Returns the AcDbBlockBegin object associated with this block table record. More...
Acad::ErrorStatus  | openBlockEnd (AcDbBlockEnd *&, AcDb::OpenMode)
Returns the AcDbBlockEnd object associated with this block table record. More...
AcGePoint3d  | origin () const
Returns the origin (in WCS) of the block (DXF 10). More...
Acad::ErrorStatus  | pathName (ACHAR *&) const
Returns the pathname for an xref blocktable record (DXF 1) More...
Acad::ErrorStatus  | pathName (const ACHAR *&) const
Returns the pathname for an xref blocktable record (DXF 1) More...
Acad::ErrorStatus  | postProcessAnnotativeBTR (int &, const bool=false, const bool=true)
Applies annotative context data to each AcDbBlockReference using this AcDbBlockTableRecord. More...
Acad::ErrorStatus  | setBlockInsertUnits (AcDb::UnitsValue)
Sets the INSUNITS value for the block table record. More...
Acad::ErrorStatus  | setBlockScaling (BlockScaling)
Sets the scaling modality for the block ref (uniform or non uniform kUniform respective kAny). More...
Acad::ErrorStatus  | setComments (const ACHAR *)
Sets the description of this blocktablerecord (DXF 4). More...
Acad::ErrorStatus  | setExplodable (bool)
Defines whether this BlockTableRecord is allowed to be exploded. More...
Acad::ErrorStatus  | setIsUnloaded (bool)
Defines whether this BlockTableRecord is allowed to be exploded. More...
Acad::ErrorStatus  | setLayoutId (AcDbObjectId)
Sets the forward pointer from the block table record to the corresponding AcDbLayout object @intenal. More...
Acad::ErrorStatus  | setOrigin (const AcGePoint3d &)
Sets the origin (in WCS) of the block (DXF 10). More...
Acad::ErrorStatus  | setPathName (const ACHAR *)
Sets the pathname for an xref blocktable record (DXF 1) More...
Acad::ErrorStatus  | setPreviewIcon (const PreviewIcon &)
Sets this block table record preview icon data. More...
AcDbDatabase *  | xrefDatabase (bool=false) const
Returns the xref database of the block. More...
AcDb::XrefStatus  | xrefStatus () const
Returns the xref status of the block. More...
 virtual  | ~AcDbBlockTableRecord ()
Destructor.
 Public Member Functions inherited from AcDbSymbolTableRecord
Acad::ErrorStatus  | getName (ACHAR *&) const
getName. More...
Acad::ErrorStatus  | getName (AcString &) const
getName. More...
Acad::ErrorStatus  | getName (const ACHAR *&) const
getName. More...
bool  | isDependent () const
Returns whether this AcDbSymbolTableRecord is dependending on xref database. More...
bool  | isResolved () const
Returns whether this AcDbSymbolTableRecord is dependending on xref database. More...
Acad::ErrorStatus  | setName (const ACHAR *)
setName. More...
 virtual  | ~AcDbSymbolTableRecord ()
destructor.
 Public Member Functions inherited from AcDbObject
virtual Acad::ErrorStatus  | addPersistentReactor (AcDbObjectId)
Adds a persistent reactor to this object reactor list. More...
Acad::ErrorStatus  | addReactor (AcDbObjectReactor *) const
Adds a transient reactor to this object. More...
virtual Acad::ErrorStatus  | applyPartialUndo (AcDbDwgFiler *, AcRxClass *)
This function is called during Undo operations on objects, that use the 'Partial Undo meachanism'; this is, this object is opened with assertWriteEnabled(Adesk::kFalse) to indicate that custom Undo filing is used rather than the default Undo filing. More...
 void  | assertNotifyEnabled () const
 void  | assertReadEnabled () const
 void  | assertWriteEnabled (Adesk::Boolean=Adesk::kTrue, Adesk::Boolean=Adesk::kTrue)
virtual Acad::ErrorStatus  | audit (AcDbAuditInfo *)
Performs the audit operation for this object. More...
Acad::ErrorStatus  | cancel ()
Reverts all changes since the object had been opened and closes the object. More...
virtual void  | cancelled (const AcDbObject *)
A handler function for persistent reactors. More...
virtual AcRxObject *  | clone () const
Creates a shallow clone of this object. More...
Acad::ErrorStatus  | close ()
Closes the object. More...
Acad::ErrorStatus  | closeAndPage (Adesk::Boolean=Adesk::kTrue)
Closes the object. More...
virtual Acad::ErrorStatus  | composeForLoad (AcDb::OdaSaveType, AcDb::AcDbDwgVersion)
This function is intended for future MT file loading support. More...
virtual void  | copied (const AcDbObject *, const AcDbObject *)
A handler function for persistent reactors. More...
virtual Acad::ErrorStatus  | copyFrom (const AcRxObject *)
Copies the pSrc object information in this object. More...
Acad::ErrorStatus  | createExtensionDictionary ()
Creates a dictionary as extension dictionary for this object. More...
AcDbDatabase *  | database () const
Returns the database that contains this object. More...
virtual Acad::ErrorStatus  | decomposeForSave (AcDb::AcDbDwgVersion, AcDbObject *&, AcDbObjectId &, Adesk::Boolean &)
This function is called during dwg and dxf output, to allow a custom object to decompose itself, due to provided dwg/dxf target file version. More...
virtual Acad::ErrorStatus  | deepClone (AcDbObject *, AcDbObject *&, AcDbIdMapping &, Adesk::Boolean=Adesk::kTrue) const final
Clones this object, appends it to the owner pOwner and adds an AcDbIdPair record to the idMap. More...
void  | disableUndoRecording (Adesk::Boolean)
Disables or enables the undo recording for the object. More...
Acad::ErrorStatus  | downgradeOpen ()
Sets the open mode for an object opened for write to be opened for read. More...
Acad::ErrorStatus  | downgradeToNotify (Adesk::Boolean)
Sets the open mode for an object opened for write to be opened for notify. More...
virtual AcGiDrawable *  | drawable ()
Retrieves the AcGiDrawable instance of this object. More...
Acad::ErrorStatus  | dwgIn (AcDbDwgFiler *)
Calls the object's dwgInFields function, and reads any XData if present. More...
virtual Acad::ErrorStatus  | dwgInFields (AcDbDwgFiler *)
Reads the object from the DWG filer. More...
Acad::ErrorStatus  | dwgOut (AcDbDwgFiler *) const
Calls the object's dwgOutFields function, and writes any XData if present. More...
virtual Acad::ErrorStatus  | dwgOutFields (AcDbDwgFiler *) const
Writes the object to the DWG filer. More...
Acad::ErrorStatus  | dxfIn (AcDbDxfFiler *)
Calls the object's dxfInFields function, and reads any XData if present. More...
virtual Acad::ErrorStatus  | dxfInFields (AcDbDxfFiler *)
Reads the object from the DXF filer. More...
Acad::ErrorStatus  | dxfOut (AcDbDxfFiler *, Adesk::Boolean, Adesk::uchar *) const
Calls the object's dxfOutFields function, and writes any XData if present. More...
virtual Acad::ErrorStatus  | dxfOutFields (AcDbDxfFiler *) const
Writes the object to the DXF filer. More...
Acad::ErrorStatus  | erase (Adesk::Boolean=Adesk::kTrue)
Sets the bit that indicates that the object is erased. More...
virtual void  | erased (const AcDbObject *, Adesk::Boolean)
A handler function for persistent reactors. More...
AcDbObjectId  | extensionDictionary () const
Returns the object id of the extension dictionary for this object. More...
void  | getAcDbHandle (AcDbHandle &) const
Returns handle of this object. More...
Acad::ErrorStatus  | getBinaryData (const ACHAR *, Adesk::Int32 &, char *&) const
Creates a copy of the binary data stored as chunks of maximum 127 bytes in the resbuf chain of this object's extension dictionary xrecord entry given by entryName. More...
int  | getBrxOpenCount () const
This function returns the number of open BRX instances for this object. More...
int  | getBrxOpenState () const
This function returns the BRX object open state flags as bitfields, for diagnostic purpose. More...
virtual Acad::ErrorStatus  | getClassID (CLSID *) const final
Gets the COM wrapper Class ID for this entity. More...
int  | getCustomObjectState () const
This function returns the custom object status : 1=isCustomObject 2=DifferentialUndoDisabled. More...
Acad::ErrorStatus  | getField (const ACHAR *, AcDbField *&, AcDb::OpenMode) const
Retrieves the specified Field from this object, and opens it in mode. More...
Acad::ErrorStatus  | getField (const ACHAR *, AcDbObjectId &) const
Gets the pszPropName field object from field dictionary of this AcDbObject object, using pszPropName as key. More...
AcDbObjectId  | getFieldDictionary () const
Returns the Field dictionary associated with this object,. More...
Acad::ErrorStatus  | getFieldDictionary (AcDbDictionary *&, AcDb::OpenMode) const
Gets and opens the field dictionary for this. More...
Acad::ErrorStatus  | getObjectBirthVersion (AcDb::AcDbDwgVersion &, AcDb::MaintenanceReleaseVersion &)
This function is currently not supported by the CAD engine, always returns Acad::eOk, and 'kDHL_CURRENT' + 'kMReleaseCurrent' results. More...
virtual Acad::ErrorStatus  | getObjectSaveVersion (const AcDbDwgFiler *, AcDb::AcDbDwgVersion &, AcDb::MaintenanceReleaseVersion &)
Returns the DWG version for saving the object. More...
virtual Acad::ErrorStatus  | getObjectSaveVersion (const AcDbDxfFiler *, AcDb::AcDbDwgVersion &, AcDb::MaintenanceReleaseVersion &)
Returns the DWG version for saving the object. More...
int  | getOdaOpenCount () const
This function returns the number of open ODA instances for this object. More...
int  | getOdaOpenState () const
This function returns the ODA object open state flags as bitfields, for diagnostic purpose. More...
virtual void  | goodbye (const AcDbObject *)
A handler function for persistent reactors. More...
Acad::ErrorStatus  | handOverTo (AcDbObject *, Adesk::Boolean=Adesk::kTrue, Adesk::Boolean=Adesk::kTrue)
Hands over objects identity to another object. More...
bool  | hasFields () const
Return true if this object has single or multiple fields associated with him. More...
bool  | hasPersistentReactor (AcDbObjectId) const
Checks the input objectId in this object reactor list. More...
bool  | hasSaveVersionOverride ()
This function indicates whether this object overrides the filer's save version. More...
virtual AcDbObjectId  | id () const
Returns the database id of this object. More...
Adesk::Boolean  | isAcDbObjectIdsInFlux () const
Checks whether a deep clone operation was completed. More...
Adesk::Boolean  | isAProxy () const
Adesk::Boolean  | isCancelling () const
Adesk::Boolean  | isErased () const
Returns whether this object is erased. More...
Adesk::Boolean  | isEraseStatusToggled () const
Checks whether the object erase status has been toggled. More...
Adesk::Boolean  | isModified () const
Returns whether this object's assertWriteEnabled() has been called since it was opened. More...
Adesk::Boolean  | isModifiedGraphics () const
Checks whether this object graphics will be updated when the object is closed. More...
Adesk::Boolean  | isModifiedXData () const
Checks whether this object's xData was modified. More...
Adesk::Boolean  | isNewObject () const
Returns true if and only if this object has not been closed since it was created. More...
Adesk::Boolean  | isNotifyEnabled () const
Returns whether this object is opened for notify. More...
Adesk::Boolean  | isNotifying () const
virtual Adesk::Boolean  | isPersistent () const
Returns the 'persistent' status of a database object. More...
Adesk::Boolean  | isReadEnabled () const
Returns whether this object is opened for read. More...
 Adesk::Boolean  | isReallyClosing () const
Checks whether the next close call will completely close this object return true if on the next call the object will be completely closed false otherwise.
Adesk::Boolean  | isTransactionResident () const
Gets the object transaction status. More...
Adesk::Boolean  | isUndoing () const
bool  | isUndoRecordingDisabled () const
Returns whether the undo recording for the object is enabled or not. More...
Adesk::Boolean  | isWriteEnabled () const
Returns whether this object is opened for write. More...
virtual AcDb::DuplicateRecordCloning  | mergeStyle () const
Returns the object's merge behavior during cloning. More...
virtual void  | modified (const AcDbObject *)
A handler function for persistent reactors. More...
virtual void  | modifiedGraphics (const AcDbEntity *)
A handler function for persistent reactors. More...
virtual void  | modifiedXData (const AcDbObject *)
A handler function for persistent reactors. More...
virtual void  | modifyUndone (const AcDbObject *)
A handler function for persistent reactors. More...
virtual void  | objectClosed (const AcDbObjectId)
A handler function for persistent reactors. More...
AcDbObjectId  | objectId () const
Returns object id. More...
virtual void  | openedForModify (const AcDbObject *)
A handler function for persistent reactors. More...
AcDbObjectId  | ownerId () const
Returns object id of the owner. More...
AcDbVoidPtrArray *  | reactors ()
Gets the object pointers to reactors. More...
const AcDbVoidPtrArray *  | reactors () const
Gets the object pointers to reactors. More...
virtual void  | reappended (const AcDbObject *)
A handler function for persistent reactors. More...
 virtual void  | recvPropagateModify (const AcDbObject *)
Not implemented yet.
Acad::ErrorStatus  | releaseExtensionDictionary ()
Removes the extension dictionary associated with this object. More...
virtual Acad::ErrorStatus  | removeField (AcDbObjectId)
Removes the Field specified by acFieldId from this object. More...
virtual Acad::ErrorStatus  | removeField (const ACHAR *)
Removes the Field specified by szKeyString from this object. More...
virtual Acad::ErrorStatus  | removeField (const ACHAR *, AcDbObjectId &)
Removes the Field specified by acPszKeyString from this object, and returns its ObjectId value. More...
virtual Acad::ErrorStatus  | removePersistentReactor (AcDbObjectId)
Removes a persistent reactor from this object reactor list. More...
Acad::ErrorStatus  | removeReactor (AcDbObjectReactor *) const
Removes a transient reactor to this object. More...
void  | setAcDbObjectIdsInFlux ()
Call this function to indicate that the object IDs of this object and its sub-objects (if any) are not yet valid. More...
Acad::ErrorStatus  | setBinaryData (const ACHAR *, Adesk::Int32, const char *)
Creates a copy of the binary data, divides it in up to 127 bytes binary chunks and
 sets them as resbufs in the resbuf chain of this object's extension dictionary xrecord entry given by entryName. More...
virtual Acad::ErrorStatus  | setField (const ACHAR *, AcDbField *, AcDbObjectId &)
Adds the pAcField field object to field dictionary of this AcDbObject object, using pKey as key. More...
void  | setHasSaveVersionOverride (bool)
This function can be called to specify that the object has a "save version override". More...
virtual Acad::ErrorStatus  | setOwnerId (AcDbObjectId)
Sets the ownerId data member of the object to be objId. More...
virtual Acad::ErrorStatus  | setXData (const resbuf *)
Sets/removes xData associated with this object. More...
virtual Acad::ErrorStatus  | subCancel ()
Possibility to veto a cancel operation from within custom entities. More...
virtual Acad::ErrorStatus  | subClose ()
virtual Acad::ErrorStatus  | subErase (Adesk::Boolean)
This hook is called during an AcDbObject::erase call, before any actual erase operation is performed. More...
 virtual Acad::ErrorStatus  | subHandOverTo (AcDbObject *)
virtual void  | subObjModified (const AcDbObject *, const AcDbObject *)
A handler function for persistent reactors. More...
 virtual Acad::ErrorStatus  | subOpen (AcDb::OpenMode)
virtual Acad::ErrorStatus  | subSwapIdWith (AcDbObjectId, Adesk::Boolean=Adesk::kFalse, Adesk::Boolean=Adesk::kFalse)
This hook is called during an AcDbObject::swapIdWith() call, before any actual swap operation is performed. More...
Acad::ErrorStatus  | swapIdWith (AcDbObjectId, Adesk::Boolean=Adesk::kFalse, Adesk::Boolean=Adesk::kFalse)
Swaps the object id's between the object identified by param swapId and this object. More...
virtual Acad::ErrorStatus  | swapReferences (const AcDbIdMapping &)
Not implemented yet. More...
virtual void  | unappended (const AcDbObject *)
A handler function for persistent reactors. More...
AcDbDwgFiler *  | undoFiler ()
Gets the undo filer for this object. More...
Acad::ErrorStatus  | upgradeFromNotify (Adesk::Boolean &)
Upgrades the open status of this object to AcDb::kForWrite, if this object is already open (either in AcDb::kForRead, AcDb::kForNotify or AcDb::kForWrite) More...
Acad::ErrorStatus  | upgradeOpen ()
Changes the objects open mode to AcDb::kForWrite and sends notifications. More...
virtual Acad::ErrorStatus  | wblockClone (AcRxObject *, AcDbObject *&, AcDbIdMapping &, Adesk::Boolean=Adesk::kTrue) const final
Clones this object, appends it to the owner pOwner and adds an AcDbIdPair record to the idMap. More...
virtual resbuf *  | xData (const ACHAR *=NULL) const
Returns the xData associated with this object. More...
Acad::ErrorStatus  | xDataTransformBy (const AcGeMatrix3d &)
Transforms the extended data according to parameter transformation matrix. More...
 virtual void  | xmitPropagateModify () const
Not implemented yet.
 virtual  | ~AcDbObject ()
Destructor.
 Public Member Functions inherited from AcGiDrawable
virtual bool  | bounds (AcDbExtents &) const
virtual DrawableType  | drawableType () const
 virtual AcGiDrawStream *  | drawStream () const
 AcGsNode *  | gsNode () const
virtual AcDbObjectId  | id () const =0
virtual Adesk::Boolean  | isPersistent () const =0
virtual Adesk::UInt32  | regenSupportFlags () const final
Returns whether and to which level this object supports MultiThreading. More...
 virtual Adesk::Boolean  | RolloverHit (Adesk::ULongPtr, Adesk::ULongPtr, Adesk::Boolean)
 virtual Adesk::UInt32  | setAttributes (AcGiDrawableTraits *) final
 virtual void  | setDrawStream (AcGiDrawStream *)
 void  | setGsNode (AcGsNode *)
 virtual void  | viewportDraw (AcGiViewportDraw *) final
 virtual Adesk::UInt32  | viewportDrawLogicalFlags (AcGiViewportDraw *) final
 virtual Adesk::Boolean  | worldDraw (AcGiWorldDraw *) final
 Public Member Functions inherited from AcRxObject
virtual AcRxObject *  | clone () const
Exported and implemented. More...
 virtual AcRx::Ordering  | comparedTo (const AcRxObject *) const
Exported and implemented.
virtual Acad::ErrorStatus  | copyFrom (const AcRxObject *)
Exported and implemented. More...
 virtual AcRxClass *  | isA () const
Exported and implemented.
virtual Adesk::Boolean  | isEqualTo (const AcRxObject *) const
Exported and implemented. More...
bool  | isKindOf (const AcRxClass *) const
Checks the object class. More...
AcRxObject *  | queryX (const AcRxClass *) const
returns the protocol extension object assigned to this class or a parent class. More...
AcRxObject *  | x (const AcRxClass *) const
returns the protocol extension object assigned to this class or a parent class. More...
 virtual  | ~AcRxObject ()
Destructor.
 Public Attributes
AcDbBlockTableRecord
Default constructor.
 Public Attributes inherited from AcDbSymbolTableRecord
AcDbSymbolTableRecord
only derived constructors are used.
 Protected Member Functions
virtual Acad::ErrorStatus  | subGetClassID (CLSID *) const
Gets the COM wrapper Class ID for this entity. More...
virtual Adesk::UInt32  | subSetAttributes (AcGiDrawableTraits *)
Sets the object's subentity traits. More...
virtual void  | subViewportDraw (AcGiViewportDraw *)
Creates a viewport-dependent graphical representation of thie object. More...
virtual Adesk::Boolean  | subWorldDraw (AcGiWorldDraw *)
Creates a viewport-independent graphical representation of the object. More...
 Protected Member Functions inherited from AcDbObject
virtual Acad::ErrorStatus  | subDeepClone (AcDbObject *, AcDbObject *&, AcDbIdMapping &, Adesk::Boolean=true) const
virtual Acad::ErrorStatus  | subGetClassID (CLSID *) const
virtual Adesk::UInt32  | subSetAttributes (AcGiDrawableTraits *)
Sets the values of this object's subentity traits and returns with the calling object's subentity traits. More...
virtual void  | subViewportDraw (AcGiViewportDraw *)
virtual Adesk::UInt32  | subViewportDrawLogicalFlags (AcGiViewportDraw *)
virtual Acad::ErrorStatus  | subWblockClone (AcRxObject *, AcDbObject *&, AcDbIdMapping &, Adesk::Boolean=true) const
virtual Adesk::Boolean  | subWorldDraw (AcGiWorldDraw *)
 Protected Member Functions inherited from AcGiDrawable
virtual Adesk::UInt32  | subRegenSupportFlags () const
Returns whether and to which level this object supports MultiThreading. More...
virtual Adesk::UInt32  | subSetAttributes (AcGiDrawableTraits *)=0
virtual void  | subViewportDraw (AcGiViewportDraw *)=0
 virtual Adesk::UInt32  | subViewportDrawLogicalFlags (AcGiViewportDraw *)
virtual Adesk::Boolean  | subWorldDraw (AcGiWorldDraw *)=0
 Protected Member Functions inherited from AcRxObject
AcRxObject ()
Exported and implemented.
 Additional Inherited Members
 Static Public Member Functions inherited from AcRxObject
 static AcRxObject *  | cast (const AcRxObject *)
 static AcRxClass *  | desc ()
Exported and implemented.
 Static Public Member Functions inherited from AcHeapOperators
 static void  | operator delete (void *)
_
 static void  | operator delete (void *, const char *, int)
 static void  | operator delete (void *, void *)
 static void  | operator delete[] (void *)
_
 static void  | operator delete[] (void *, const char *, int)
 static void *  | operator new (size_t)
_
 static void *  | operator new (size_t, const char *, int)
 static void *  | operator new (size_t, void *p)
 static void *  | operator new[] (size_t)
_
 static void *  | operator new[] (size_t, const char *, int)
Detailed Description
_
Member Function Documentation
◆ addAnnoScalestoBlkRefs()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbBlockTableRecord::addAnnoScalestoBlkRefs  |  ( |  const bool  |  scaleEntities = false | )
Applies annotative context data to each AcDbBlockReference using this AcDbBlockTableRecord.
Parameters
[in] | scaleEntities | defines whether the block references will be set as 1.0 (effectively divided by scale)
Returns
Acad::eOk if successful, error status otherwise
◆ appendAcDbEntity() [1/2]
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbBlockTableRecord::appendAcDbEntity  |  ( |  AcDbEntity *  |  pEntToAdd | )
Appends the specified entity to the block and the database.
Parameters
[in] | pEntToAdd | Entity to be added to database' block table record
Returns
Acad::eOk if successful,
 Acad::eNotAnEntity if given entity is invalid,
 Acad::eAlreadyInDb if given entity is already in the database of this blocktable record,
 Acad::eIllegalEntityType if AcDbAttribute passed.
Remarks
AcDbText objects of zero height added to database receive height equal to TEXTSIZE system variable.
◆ appendAcDbEntity() [2/2]
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbBlockTableRecord::appendAcDbEntity  |  ( |  AcDbObjectId &  |  pIdOut,
|  AcDbEntity *  |  pEntToAdd
)
Appends the specified entity to the block and the database and returns the entities id.
Parameters
[out] | pIdOut | of the newly added entity
[in] | pEntToAdd | Entity to be added to database' block table record
Returns
Acad::eOk if successful,
 Acad::eNotAnEntity if given entity is invalid,
 Acad::eAlreadyInDb if given entity is already in the database of this blocktable record,
 Acad::eIllegalEntityType if AcDbAttribute passed.
Remarks
AcDbText objects of zero height added to database receive height equal to TEXTSIZE system variable.
◆ assumeOwnershipOf()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbBlockTableRecord::assumeOwnershipOf  |  ( |  AcDbObjectIdArray  |  entityArray | )
virtual
Assumes ownership of all entities specified to this block table record.
Parameters
[in] | entityArray | array of entities for which ownership will be changed
Returns
Acad::eOk if successful, error code otherwise
◆ blockInsertUnits()
 UX_EXPORT_FUNCTION AcDb::UnitsValue AcDbBlockTableRecord::blockInsertUnits  |  ( |   | ) |   const
Gets the INSUNITS value of the block table record.
Returns
AcDb::UnitsValue for the block table record
◆ blockScaling()
 UX_EXPORT_FUNCTION AcDbBlockTableRecord::BlockScaling AcDbBlockTableRecord::blockScaling  |  ( |   | ) |   const
Gets the scaling modality for the block ref (uniform or non uniform kUniform respective kAny.
Returns
kAny for non uniform, kUniform for uniform
◆ comments() [1/2]
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbBlockTableRecord::comments  |  ( |  ACHAR *&  |  comment | ) |   const
Gets a pointer to the description (DXF 4).
Caller must release the string !
Parameters
[out] | comment | pointer the newly allocated description string.
Returns
Acad::eOk if successful
◆ comments() [2/2]
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbBlockTableRecord::comments  |  ( |  const ACHAR *&  |  comment | ) |   const
Gets a pointer to the description (DXF 4).
Parameters
[out] | comment | pointer the description string.
Returns
Acad::eOk if successful
◆ decomposeForSave()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbBlockTableRecord::decomposeForSave  |  ( |  AcDb::AcDbDwgVersion  |  version,
|  AcDbObject *&  |  replacingObject,
|  AcDbObjectId &  |  replacingId,
|  Adesk::Boolean &  |  replaceXData
)
virtual
Determines behavior for derived custom objects when saving to an older drawing formats.
Parameters
[in] | version | Drawing version to save as.
[out] | replacingObject | AcDbObject for a non- database -resident (NDBRO) replacement object or NULL for a DBRO object.
[out] | replacingId | Object ID of the database resident (DBRO) object replacing this object or AcDbObjectId::kNull for a NDBRO object.
[out] | replaceXData | Set to true if this function did not add XData to the replacement object, otherwise set to false.
Returns
Acad::eOk, if successful
 appropriate error status, else
Reimplemented from AcDbObject.
◆ drawable()
 UX_EXPORT_FUNCTION AcGiDrawable * AcDbBlockTableRecord::drawable  |  ( |   | )
virtual
Returns the AcGiDrawable for the object.
If the object doesn't have an AcGiDrawable, this function returns NULL.
Returns
objects AcGiDrawable or NULL.
Remarks
exported but not yet implemented.
Reimplemented from AcDbObject.
◆ dwgOutFields()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbBlockTableRecord::dwgOutFields  |  ( |  AcDbDwgFiler *  |  dwgFiler | ) |   const
virtual
See also
AcDbSymbolTableRecord::dwgOutFields(AcDbDwgFiler*)
Reimplemented from AcDbObject.
◆ dxfOutFields()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbBlockTableRecord::dxfOutFields  |  ( |  AcDbDxfFiler *  |  dxfFiler | ) |   const
virtual
dxfOutFields.
Parameters
[in] | dxfFiler | used filer
Returns
Acad::eOk, if successful
 any other error status, mostly dwgFiler->filerStatus()
Reimplemented from AcDbObject.
◆ explodable()
 UX_EXPORT_FUNCTION bool AcDbBlockTableRecord::explodable  |  ( |   | ) |   const
Returns whether this BlockTableRecord can be exploded.
Returns
true if this BlockTableRecord can be exploded, false otherwise
◆ getBlockReferenceIds()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbBlockTableRecord::getBlockReferenceIds  |  ( |  AcDbObjectIdArray &  |  referenceIds,
|  bool  |  noParents = true,
|  bool  |  loadFull = false
) |   |  const
Gets a list of active AcDbBlockReferences that are referencing this block Checks also the nested blocks.
Parameters
[out] | referenceIds | array of references found
[in] | noParents | if true and this block is nested, references of the parent blocks will NOT be returned
if false references of the parent blocks are returned
[in] | loadFull | if true, forces the loading of partially loaded older drawings works only when parameter noParents = false
Returns
Acad::eOk if successful,
 Acad::eSomeInputDataLeftUnread if loadFull is set to false and not all ids are returned.
◆ getErasedBlockReferenceIds()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbBlockTableRecord::getErasedBlockReferenceIds  |  ( |  AcDbObjectIdArray &  |  referenceIds | )
Gets a list of erased AcDbBlockReferences that are referencing this block.
Does not check the nested blocks
Parameters
[out] | referenceIds | array of erased block references found
Returns
Acad::eOk, if successful
◆ getLayoutId()
 UX_EXPORT_FUNCTION AcDbObjectId AcDbBlockTableRecord::getLayoutId  |  ( |   | ) |   const
Returns the related AcDbLayout objectid.
Returns
Object ID of the AcDbLayout associated with this Block.
◆ getPreviewIcon()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbBlockTableRecord::getPreviewIcon  |  ( |  PreviewIcon &  |  acIcon | ) |   const
Gets the preview icon data from this block table record.
Parameters
[out] | icon | bytes array composing the preview icon
Returns
always Acad::eOk
◆ getSortentsTable()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbBlockTableRecord::getSortentsTable  |  ( |  AcDbSortentsTable *&  |  pTable,
|  AcDb::OpenMode  |  mode,
|  bool  |  createIfNotFound = false
)
Gets the sortents table.
Parameters
[out] | pTable | pointer to the sortents table
[in] | mode | input mode to open table, not used, table always opened for write
[in] | createIfNotFound | controls the table creation if it does not exist
Returns
Acad::eOk, if successful errorCode otherwise
◆ hasAttributeDefinitions()
 UX_EXPORT_FUNCTION bool AcDbBlockTableRecord::hasAttributeDefinitions  |  ( |   | ) |   const
Returns whether the block table record has attribute definitions (DXF 70, bit 1)
Returns
true or false (has attribute definitions or not)
◆ hasPreviewIcon()
 UX_EXPORT_FUNCTION bool AcDbBlockTableRecord::hasPreviewIcon  |  ( |   | ) |   const
Checks this block table record preview icon data.
Returns
true if there is a preview icon defined - false othervise
◆ isAnonymous()
 UX_EXPORT_FUNCTION bool AcDbBlockTableRecord::isAnonymous  |  ( |   | ) |   const
Returns true if this block table record represents an anonymous xref (DXF 70, bit 0) @intenal.
Date
2009-05-11 arturs added support for closed objects
 2008-10-05 torstenm created
◆ isFromExternalReference()
 UX_EXPORT_FUNCTION bool AcDbBlockTableRecord::isFromExternalReference  |  ( |   | ) |   const
Returns true if this block table record represents an xref (DXF 70, bit 3) @intenal.
Date
2009-05-11 arturs added support for closed objects
 2008-09-29 cristians created
◆ isFromOverlayReference()
 UX_EXPORT_FUNCTION bool AcDbBlockTableRecord::isFromOverlayReference  |  ( |   | ) |   const
Returns true if this block table record represents an overlaid xref (DXF 70, bit 4)
Returns
@intenal
Date
2009-05-11 arturs added support for closed objects
 2008-09-29 cristians created
◆ isLayout()
 UX_EXPORT_FUNCTION bool AcDbBlockTableRecord::isLayout  |  ( |   | ) |   const
Returns true if this block table record represents a layout @intenal.
Date
2009-05-11 arturs added support for closed objects
 2008-04-24 radui created
◆ isUnloaded()
 UX_EXPORT_FUNCTION bool AcDbBlockTableRecord::isUnloaded  |  ( |   | ) |   const
Returns true if this block table record is an unloaded xref (DXF 71) @intenal.
Date
2009-05-11 arturs added support for closed objects
 2008-10-05 torstenm created
◆ newBlockReferenceIdIterator()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbBlockTableRecord::newBlockReferenceIdIterator  |  ( |  AcDbBlockReferenceIdIterator *&  |  resultIterator | ) |   const
Returns an iterator that can iterate over the object ids of the block references, which refer to this block table record.
Parameters
[out] | resultIterator | iterator over all the objectIds of the inserts, referring to this block table record.
Returns
one of Acad::eOk, Acad::eOutOfMemory
◆ newIterator()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbBlockTableRecord::newIterator  |  ( |  AcDbBlockTableRecordIterator *&  |  pIter,
|  bool  |  startAtFront = true,
|  bool  |  skipErased = true
) |   |  const
Creates an iterator to go over the elements of this block.
Parameters
[out] | pIter | the created iterator
[in] | startAtFront | start the iterator at the beginning or at the end.
[in] | skipErased | Skip deleted elements.
Returns
Acad::eOk, if successful
 Acad::eOutOfMemory, if there is not enough memory to create the iterator.
◆ openBlockBegin()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbBlockTableRecord::openBlockBegin  |  ( |  AcDbBlockBegin *&  |  pBlockBegin,
|  AcDb::OpenMode  |  openMode
)
Returns the AcDbBlockBegin object associated with this block table record.
Parameters
[out] | pBlockBegin | the block begin object
[in] | openMode | mode in which to open the object
◆ openBlockEnd()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbBlockTableRecord::openBlockEnd  |  ( |  AcDbBlockEnd *&  |  pBlockEnd,
|  AcDb::OpenMode  |  openMode
)
Returns the AcDbBlockEnd object associated with this block table record.
Parameters
[out] | pBlockEnd | the block end object
[in] | openMode | mode in which to open the object
◆ origin()
 UX_EXPORT_FUNCTION AcGePoint3d AcDbBlockTableRecord::origin  |  ( |   | ) |   const
Returns the origin (in WCS) of the block (DXF 10).
Returns
blocks WCS origin.
◆ pathName() [1/2]
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbBlockTableRecord::pathName  |  ( |  ACHAR *&  |  pPathName | ) |   const
Returns the pathname for an xref blocktable record (DXF 1)
Parameters
[out] | pPathName | the pathname of the xref blocktable record
Remarks
if this blocktable record does not belong to a xref, pPathName is set to NULL; the caller must deallocate the memory of returned string by free or delete !
◆ pathName() [2/2]
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbBlockTableRecord::pathName  |  ( |  const ACHAR *&  |  pPathName | ) |   const
Returns the pathname for an xref blocktable record (DXF 1)
Parameters
[out] | pPathName | the pathname of the xref blocktable record
Remarks
if this blocktable record is not a xref, pPathName is set to empty string ! do not deallocate the memory of returned string !
◆ postProcessAnnotativeBTR()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbBlockTableRecord::postProcessAnnotativeBTR  |  ( |  int &  |  numStripped,
|  const bool  |  computeOnly = false,
|  const bool  |  scaleEntities = true
)
Applies annotative context data to each AcDbBlockReference using this AcDbBlockTableRecord.
Parameters
[out] | numStripped | returns the number of those entities, which were set as non-annotative
[in] | computeOnly | instructs the function to only count the numStripped value, no modifications are made
[in] | scaleEntities | if 'true' the block content entities are scaled due to the annotative scale
Returns
Acad::eOk if successful, error status otherwise
◆ setBlockInsertUnits()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbBlockTableRecord::setBlockInsertUnits  |  ( |  AcDb::UnitsValue  |  unitsVal | )
Sets the INSUNITS value for the block table record.
Parameters
[in] | unitsVal | INSUNITS to set
Returns
Acad::eOk if successful
 Acad::eInvalidInput if the insUnits value not in range [AcDb::kUnitsUndefined, AcDb::kUnitsMaxkUnitsMax]
◆ setBlockScaling()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbBlockTableRecord::setBlockScaling  |  ( |  AcDbBlockTableRecord::BlockScaling  |  uniformScaling | )
Sets the scaling modality for the block ref (uniform or non uniform kUniform respective kAny).
Parameters
[in] | uniformScaling | kAny for non uniform, kUniform for uniform
Returns
Acad::eOk
◆ setComments()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbBlockTableRecord::setComments  |  ( |  const ACHAR *  |  comment | )
Sets the description of this blocktablerecord (DXF 4).
Parameters
[in] | comment | pointer to the description string
Returns
Acad::eOk if successful
 Acad::eOutOfMemory if not enough memory for the string
◆ setExplodable()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbBlockTableRecord::setExplodable  |  ( |  bool  |  allowExplode | )
Defines whether this BlockTableRecord is allowed to be exploded.
Parameters
[in] | allowExplode | true, if this BlockTableRecord is allowed to be exploded, false otherwise
Returns
Adesk::kTrue if successful, Adesk::kFalse otherwise
◆ setIsUnloaded()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbBlockTableRecord::setIsUnloaded  |  ( |  bool  |  setUnloaded | )
Defines whether this BlockTableRecord is allowed to be exploded.
Parameters
[in] | setUnloaded | true, to set BlockTableRecord as unloaded, false otherwise
Returns
Adesk::kTrue if successful, Adesk::kFalse otherwise
◆ setLayoutId()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbBlockTableRecord::setLayoutId  |  ( |  AcDbObjectId  |  id | )
Sets the forward pointer from the block table record to the corresponding AcDbLayout object @intenal.
Date
2008-04-24 radui created
◆ setOrigin()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbBlockTableRecord::setOrigin  |  ( |  const AcGePoint3d &  |  origin | )
Sets the origin (in WCS) of the block (DXF 10).
Parameters
[in] | origin | origin to set.
Returns
Acad::eOk, if successful
 Acad::eInvalidInput if origin can not be set as origin.
◆ setPathName()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbBlockTableRecord::setPathName  |  ( |  const ACHAR *  |  pPathName | )
Sets the pathname for an xref blocktable record (DXF 1)
Parameters
[in] | pPathName | the pathname of the xref blocktable record
Returns
Acad::eOk if successful
Acad::eInvalidInput otherwise
◆ setPreviewIcon()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbBlockTableRecord::setPreviewIcon  |  ( |  const PreviewIcon &  |  acIcon | )
Sets this block table record preview icon data.
Parameters
[in] | icon | bytes array composing the preview icon
Returns
always Acad::eOk
◆ subGetClassID()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbBlockTableRecord::subGetClassID  |  ( |  CLSID *  |  pClassId | ) |   const
protectedvirtual
Gets the COM wrapper Class ID for this entity.
Parameters
[out] | pClassId
Reimplemented from AcDbObject.
◆ subSetAttributes()
 UX_EXPORT_FUNCTION Adesk::UInt32 AcDbBlockTableRecord::subSetAttributes  |  ( |  AcGiDrawableTraits *  |  pSubentTraits | )
protectedvirtual
Sets the object's subentity traits.
Parameters
[in] | pSubentTraits | Pointer to the subentitytraits to be set
Returns
a value combined of AcGiDrawable::SetAttributesFlags.
Remarks
exported but not yet implemented.
Reimplemented from AcDbObject.
◆ subViewportDraw()
 UX_EXPORT_FUNCTION void AcDbBlockTableRecord::subViewportDraw  |  ( |  AcGiViewportDraw *  |  pV | )
protectedvirtual
Creates a viewport-dependent graphical representation of thie object.
This function is called for every viewport, if the objects worldDraw returns false.
Parameters
[in] | pV | Pointer to initialized AcGiViewportDraw interface.
Reimplemented from AcDbObject.
◆ subWorldDraw()
 UX_EXPORT_FUNCTION Adesk::Boolean AcDbBlockTableRecord::subWorldDraw  |  ( |  AcGiWorldDraw *  |  pW | )
protectedvirtual
Creates a viewport-independent graphical representation of the object.
Parameters
[in] | pW | Pointer to initialized AcGiWorldDraw interface.
Returns
if false, viewportDraw() must be called, if true the graphical representation is viewport-independent.
Reimplemented from AcDbObject.
◆ xrefDatabase()
 UX_EXPORT_FUNCTION AcDbDatabase * AcDbBlockTableRecord::xrefDatabase  |  ( |  bool  |  includeUnresolved = false | ) |   const
Returns the xref database of the block.
Parameters
[in] | includeUnresolved | determines whether the database for an unresolved xref should be returned
Returns
xref database
Remarks
if includeUnresolved is true, it returns a database only if the xref is unresolved for reasons other the xref file is not found
◆ xrefStatus()
 UX_EXPORT_FUNCTION AcDb::XrefStatus AcDbBlockTableRecord::xrefStatus  |  ( |   | ) |   const
Returns the xref status of the block.
Returns
xref status.