Public Types | Public Member Functions | Public Attributes | Protected Member Functions | List of all members
AcDbPolyline Class Reference
_ More...
#include <AcDbPolyline.h>
 Public Types
enum  | SegType {
 kLine = 0 , kArc , kCoincident , kPoint ,
 kEmpty
 }
 Public Types inherited from AcDbEntity
enum  | VisualStyleType { kFullVisualStyle = 0 , kFaceVisualStyle = 1 , kEdgeVisualStyle = 2 }
 Public Types inherited from AcGiDrawable
enum  | DrawableType {
 kGeometry = 0 , kDistantLight , kPointLight , kSpotLight ,
 kAmbientLight , kSolidBackground , kGradientBackground , kImageBackground ,
 kGroundPlaneBackground , kViewport
 }
enum  | SetAttributesFlags {
 kDrawableNone = 0 , kDrawableIsAnEntity = 1 , kDrawableUsesNesting = 2 , kDrawableIsCompoundObject = 4 ,
 kDrawableViewIndependentViewportDraw = 8 , kDrawableIsInvisible = 16 , kDrawableHasAttributes = 32 , kDrawableRegenTypeDependentGeometry = 64 ,
 kDrawableIsDimension = 133 , kDrawableRegenDraw = 256 , kDrawableStandardDisplaySingleLOD = 512 , kDrawableShadedDisplaySingleLOD = 1024 ,
 kDrawableViewDependentViewportDraw = 2048 , kDrawableBlockDependentViewportDraw = 4096 , kDrawableIsExternalReference = 8192 , kDrawableNotPlottable = 16384 ,
 kDrawableNotAllowLCS = 32768 , kDrawableMergeControlOff = 65536 , kThreadedWorldDrawViewportDraw = 131072
 }
 Public Member Functions
AcDbPolyline (unsigned int)
virtual Acad::ErrorStatus  | addVertexAt (unsigned int, const AcGePoint2d &, double=0.0, double=-1.0, double=-1.0, Adesk::Int32=0)
Adds a vertex to a polyline,. More...
virtual Acad::ErrorStatus  | applyPartialUndo (AcDbDwgFiler *, AcRxClass *)
virtual bool  | castShadows () const
See AcDbCurve::castShadows() . More...
virtual Acad::ErrorStatus  | convertFrom (AcDbEntity *&, Adesk::Boolean=Adesk::kTrue)
Sets the polyline with values taken from a given AcDb2dPolyline. More...
Acad::ErrorStatus  | convertTo (AcDb2dPolyline *&, Adesk::Boolean=Adesk::kTrue) const
Sets a given AcDb2dPolyline with values taken from this polyline. More...
virtual Acad::ErrorStatus  | dwgInFields (AcDbDwgFiler *)
virtual Acad::ErrorStatus  | dwgOutFields (AcDbDwgFiler *) const
virtual Acad::ErrorStatus  | dxfInFields (AcDbDxfFiler *)
virtual Acad::ErrorStatus  | dxfOutFields (AcDbDxfFiler *) const
double  | elevation () const
Returns the elevation. More...
virtual Acad::ErrorStatus  | extend (Adesk::Boolean, const AcGePoint3d &)
virtual Acad::ErrorStatus  | extend (double)
virtual Acad::ErrorStatus  | getAcGeCurve (AcGeCurve3d *&, const AcGeTol &=AcGeContext::gTol) const
Acad::ErrorStatus  | getArcSegAt (unsigned int, AcGeCircArc2d &) const
Returns a 2D arc from this polyline given the index cardinal. More...
Acad::ErrorStatus  | getArcSegAt (unsigned int, AcGeCircArc3d &) const
Returns a 3D arc from this polyline given the index cardinal. More...
virtual Acad::ErrorStatus  | getArea (double &) const
Gets the polyline area. More...
Acad::ErrorStatus  | getBulgeAt (unsigned int, double &) const
Gets the bulge value at the given vertex index. More...
virtual Acad::ErrorStatus  | getClosestPointTo (const AcGePoint3d &, AcGePoint3d &, Adesk::Boolean=Adesk::kFalse) const
Finds the nearest point to inputPoint and sets returnPoint as the result. More...
virtual Acad::ErrorStatus  | getClosestPointTo (const AcGePoint3d &, const AcGeVector3d &, AcGePoint3d &, Adesk::Boolean=Adesk::kFalse) const
Acad::ErrorStatus  | getConstantWidth (double &) const
Gets polyline's constant width, in case it is constant. More...
virtual Acad::ErrorStatus  | getDistAtParam (double, double &) const
Computes the distance from the polyline start point to param. More...
virtual Acad::ErrorStatus  | getDistAtPoint (const AcGePoint3d &, double &) const
virtual void  | getEcs (AcGeMatrix3d &) const
Gets the transformation matrix from OCS (Object Coordinate System) to WCS (World Coordinate System). More...
virtual Acad::ErrorStatus  | getEndParam (double &) const
Computes the parameter corresponding to the end point of the polyline. More...
virtual Acad::ErrorStatus  | getEndPoint (AcGePoint3d &) const
Sets the passed point to end point of the polyline, if successful. More...
virtual Acad::ErrorStatus  | getFirstDeriv (const AcGePoint3d &, AcGeVector3d &) const
virtual Acad::ErrorStatus  | getFirstDeriv (double, AcGeVector3d &) const
Acad::ErrorStatus  | getLineSegAt (unsigned int, AcGeLineSeg2d &) const
Copies the line data of vertex with index cardinal to outSeg, if this vertex is a line. More...
Acad::ErrorStatus  | getLineSegAt (unsigned int, AcGeLineSeg3d &) const
Copies the line data of vertex with index cardinal to outSeg, if this vertex is a line. More...
virtual Acad::ErrorStatus  | getOffsetCurves (double, AcDbVoidPtrArray &) const
virtual Acad::ErrorStatus  | getOrthoProjectedCurve (const AcGePlane &, AcDbCurve *&) const
virtual Acad::ErrorStatus  | getParamAtDist (double, double &) const
virtual Acad::ErrorStatus  | getParamAtPoint (const AcGePoint3d &, double &) const
virtual Acad::ErrorStatus  | getPlane (AcGePlane &, AcDb::Planarity &) const
 Acad::ErrorStatus  | getPointAt (unsigned int, AcGePoint2d &) const
 Acad::ErrorStatus  | getPointAt (unsigned int, AcGePoint3d &) const
virtual Acad::ErrorStatus  | getPointAtDist (double, AcGePoint3d &) const
virtual Acad::ErrorStatus  | getPointAtParam (double, AcGePoint3d &) const
virtual Acad::ErrorStatus  | getProjectedCurve (const AcGePlane &, const AcGeVector3d &, AcDbCurve *&) const
virtual Acad::ErrorStatus  | getSecondDeriv (const AcGePoint3d &, AcGeVector3d &) const
virtual Acad::ErrorStatus  | getSecondDeriv (double, AcGeVector3d &) const
virtual Acad::ErrorStatus  | getSpline (AcDbSpline *&) const
virtual Acad::ErrorStatus  | getSplitCurves (const AcGeDoubleArray &, AcDbVoidPtrArray &) const
virtual Acad::ErrorStatus  | getSplitCurves (const AcGePoint3dArray &, AcDbVoidPtrArray &) const
virtual Acad::ErrorStatus  | getStartParam (double &) const
virtual Acad::ErrorStatus  | getStartPoint (AcGePoint3d &) const
Sets the passed point to start point of the polyline, if successful. More...
Acad::ErrorStatus  | getVertexIdentifierAt (unsigned int, Adesk::Int32 &) const
Returns the unique identifier for the specified polyline vertex. More...
Acad::ErrorStatus  | getWidthsAt (unsigned int, double &, double &) const
Returns a vertex's width values. More...
Adesk::Boolean  | hasBulges () const
Returns whether at least one vertex has bulge set. More...
Adesk::Boolean  | hasPlinegen () const
Returns linetype generation of the polyline. More...
Adesk::Boolean  | hasVertexIdentifiers () const
Returns whether the polyline object uses vertex identifiers. More...
Adesk::Boolean  | hasWidth () const
Returns whether the polyline or any vertex has a width assigned. More...
Adesk::Boolean  | isClosed () const
Adesk::Boolean  | isOnlyLines () const
Returns whether the polyline contains only line vertices. More...
virtual Adesk::Boolean  | isPeriodic () const
virtual Adesk::Boolean  | isPlanar () const
Acad::ErrorStatus  | maximizeMemory ()
Expands the memory used by this polyline, minimizing the processing time. More...
Acad::ErrorStatus  | minimizeMemory ()
Shrinks the memory used by this polyline. More...
AcGeVector3d  | normal () const
Returns the normal vector of the polyline. More...
unsigned int  | numVerts () const
Returns number of vertices. More...
virtual Adesk::Boolean  | onSegAt (unsigned int, const AcGePoint2d &, double &) const
Returns true if the given acPoint2d resides on the segment starting at index segIndex. More...
virtual bool  | receiveShadows () const
See AcDbCurve::receiveShadows() . More...
 virtual Acad::ErrorStatus  | removeVertexAt (unsigned int)
virtual void  | reset (Adesk::Boolean, unsigned int)
Deletes all existing vertices. More...
virtual Acad::ErrorStatus  | reverseCurve ()
Reverses the curve parameterization of this curve entity. More...
virtual void  | saveAs (AcGiWorldDraw *, AcDb::SaveType)
SegType  | segType (unsigned int) const
Returns the type of the segment cardinal. More...
virtual Acad::ErrorStatus  | setBulgeAt (unsigned int, double)
Sets new bulge value at the given vertex (cardinal). More...
virtual void  | setClosed (Adesk::Boolean)
Sets the closed status of the polyline to bClosed. More...
virtual Acad::ErrorStatus  | setConstantWidth (double)
Sets polyline's constant to a constant width of width. More...
virtual void  | setElevation (double)
Sets the elevation. More...
virtual Acad::ErrorStatus  | setFromAcGeCurve (const AcGeCurve3d &, AcGeVector3d *=NULL, const AcGeTol &=AcGeContext::gTol)
virtual Acad::ErrorStatus  | setNormal (const AcGeVector3d &)
Sets the normal vector. More...
void  | setPlinegen (Adesk::Boolean)
Sets whether the linetype should run over vertices. More...
 virtual Acad::ErrorStatus  | setPointAt (unsigned int, const AcGePoint2d &)
virtual Acad::ErrorStatus  | setThickness (double)
Sets the thickness for a polyline,. More...
virtual Acad::ErrorStatus  | setVertexIdentifierAt (unsigned int, Adesk::Int32)
Assigns a unique identifier for the specified polyline vertex. More...
virtual Acad::ErrorStatus  | setWidthsAt (unsigned int, double, double)
This function sets startWidth to be the start width and endWidth to be the end width for vertex index. More...
double  | thickness () const
Gets the thickness from a polyline,. More...
 virtual  | ~AcDbPolyline ()
Destructor.
 Public Member Functions inherited from AcDbCurve
virtual Acad::ErrorStatus  | extend (Adesk::Boolean, const AcGePoint3d &)
virtual Acad::ErrorStatus  | extend (double)
 virtual Acad::ErrorStatus  | getAcGeCurve (AcGeCurve3d *&, const AcGeTol &=AcGeContext::gTol) const
virtual Acad::ErrorStatus  | getArea (double &) const
virtual Acad::ErrorStatus  | getClosestPointTo (const AcGePoint3d &, AcGePoint3d &, Adesk::Boolean=Adesk::kFalse) const
virtual Acad::ErrorStatus  | getClosestPointTo (const AcGePoint3d &, const AcGeVector3d &, AcGePoint3d &, Adesk::Boolean=Adesk::kFalse) const
virtual Acad::ErrorStatus  | getDistAtParam (double, double &) const
Gets the length of the curve from its start point to the one given by value. More...
virtual Acad::ErrorStatus  | getDistAtPoint (const AcGePoint3d &, double &) const
Gets the lenght of the curve measured from the start point of the curve to the param ptOnCurve. More...
virtual Acad::ErrorStatus  | getEndParam (double &) const
Gets this curve end parameter. More...
virtual Acad::ErrorStatus  | getEndPoint (AcGePoint3d &) const
Set the passed point to end point of the curve, if successful. More...
virtual Acad::ErrorStatus  | getFirstDeriv (const AcGePoint3d &, AcGeVector3d &) const
Gets the first derivative of the curve at the specified point. More...
virtual Acad::ErrorStatus  | getFirstDeriv (double, AcGeVector3d &) const
Gets the first derivative of the curve at the point with curve parameter of value. More...
virtual Acad::ErrorStatus  | getOffsetCurves (double, AcDbVoidPtrArray &) const
virtual Acad::ErrorStatus  | getOffsetCurvesGivenPlaneNormal (const AcGeVector3d &, double, AcDbVoidPtrArray &) const
virtual Acad::ErrorStatus  | getOrthoProjectedCurve (const AcGePlane &, AcDbCurve *&) const
virtual Acad::ErrorStatus  | getParamAtDist (double, double &) const
Gets the parameter of the curve at a point located along the curve at a distance of length from its start point. More...
virtual Acad::ErrorStatus  | getParamAtPoint (const AcGePoint3d &, double &) const
Gets the parameter of the specified point. More...
virtual Acad::ErrorStatus  | getPointAtDist (double, AcGePoint3d &) const
Gets the point on this curve at the distance lenght measured from the start point. More...
virtual Acad::ErrorStatus  | getPointAtParam (double, AcGePoint3d &) const
Gets the point on the curve specified by the passed in param. More...
virtual Acad::ErrorStatus  | getProjectedCurve (const AcGePlane &, const AcGeVector3d &, AcDbCurve *&) const
virtual Acad::ErrorStatus  | getSecondDeriv (const AcGePoint3d &, AcGeVector3d &) const
virtual Acad::ErrorStatus  | getSecondDeriv (double, AcGeVector3d &) const
 virtual Acad::ErrorStatus  | getSpline (AcDbSpline *&) const
virtual Acad::ErrorStatus  | getSplitCurves (const AcGeDoubleArray &, AcDbVoidPtrArray &) const
virtual Acad::ErrorStatus  | getSplitCurves (const AcGePoint3dArray &, AcDbVoidPtrArray &) const
virtual Acad::ErrorStatus  | getStartParam (double &) const
Gets this curve start parameter. More...
virtual Acad::ErrorStatus  | getStartPoint (AcGePoint3d &) const
Set the passed point to start point of the curve, if successful. More...
virtual Adesk::Boolean  | isClosed () const
Returns whether this curve entity is closed. More...
virtual Adesk::Boolean  | isPeriodic () const
Returns whether this curve entity is periodic. More...
virtual Acad::ErrorStatus  | reverseCurve ()
 virtual Acad::ErrorStatus  | setFromAcGeCurve (const AcGeCurve3d &, AcGeVector3d *=NULL, const AcGeTol &=AcGeContext::gTol)
 virtual  | ~AcDbCurve ()
Destructor.
 Public Member Functions inherited from AcDbEntity
 virtual Acad::ErrorStatus  | addSubentPaths (const AcDbFullSubentPathArray &) final
virtual Acad::ErrorStatus  | applyPartialUndo (AcDbDwgFiler *, AcRxClass *)
virtual Acad::ErrorStatus  | audit (AcDbAuditInfo *)
AcDbObjectId  | blockId () const
Returns the Object ID of the BlockTableRecord that owns this entity. More...
Acad::ErrorStatus  | boundingBoxIntersectWith (const AcDbEntity *, AcDb::Intersect, AcGePoint3dArray &, Adesk::GsMarker, Adesk::GsMarker) const
Finds the intersection between the edges of the bounding box for this entity and the pOhter entity. More...
Acad::ErrorStatus  | boundingBoxIntersectWith (const AcDbEntity *, AcDb::Intersect, const AcGePlane &, AcGePoint3dArray &, Adesk::GsMarker, Adesk::GsMarker) const
First, the function projects the other entity and the bounding box of this entity on plane specified by plane. More...
virtual bool  | bounds (AcDbExtents &) const
Returns the extents of this entity as AcDbExtents. More...
virtual bool  | castShadows () const
Checks if this entity is able to cast shadows. More...
virtual Adesk::Boolean  | cloneMeForDragging () final
Checks if a clone will be created for this entity in case of a drag operation. More...
 virtual AcDb::CollisionType  | collisionType () const
AcCmColor  | color () const
Returns the true color information of the entity. More...
Adesk::UInt16  | colorIndex () const
Returns the color number in a range from 0 to 256. More...
 virtual Acad::ErrorStatus  | deleteSubentPaths (const AcDbFullSubentPathArray &) final
virtual void  | dragStatus (const AcDb::DragStat)
Acad::ErrorStatus  | draw ()
Draws or redraws the entity on screen. More...
virtual AcGiDrawable *  | drawable ()
virtual Acad::ErrorStatus  | dwgInFields (AcDbDwgFiler *)
virtual Acad::ErrorStatus  | dwgOutFields (AcDbDwgFiler *) const
virtual Acad::ErrorStatus  | dxfInFields (AcDbDxfFiler *)
virtual Acad::ErrorStatus  | dxfOutFields (AcDbDxfFiler *) const
AcCmEntityColor  | entityColor () const
Returns the lightweight color information of the entity. More...
virtual Acad::ErrorStatus  | explode (AcDbVoidPtrArray &) const final
virtual Acad::ErrorStatus  | getCompoundObjectTransform (AcGeMatrix3d &) const final
It is used for object without geometry like AcDbMleader. More...
virtual void  | getEcs (AcGeMatrix3d &) const
Returns the transformation matrix from OCS (Object Coordinate System) to WCS (World Coordinate System). More...
virtual Acad::ErrorStatus  | getGeomExtents (AcDbExtents &) const final
Returns extents of this entity. More...
 virtual Acad::ErrorStatus  | getGripEntityUCS (const void *, AcGeVector3d &, AcGePoint3d &, AcGeVector3d &) const final
 virtual Acad::ErrorStatus  | getGripPoints (AcDbGripDataPtrArray &, const double, const int, const AcGeVector3d &, const int) const final
virtual Acad::ErrorStatus  | getGripPoints (AcGePoint3dArray &, AcDbIntArray &, AcDbIntArray &) const final
Append grip points to the specified array. More...
 virtual Acad::ErrorStatus  | getGripPointsAtSubentPath (const AcDbFullSubentPath &, AcDbGripDataPtrArray &, const double, const int, const AcGeVector3d &, const int) const final
virtual Acad::ErrorStatus  | getGsMarkersAtSubentPath (const AcDbFullSubentPath &, AcArray< Adesk::GsMarker > &) const final
virtual Acad::ErrorStatus  | getMaterialMapper (AcGiMapper &) const
virtual Acad::ErrorStatus  | getOsnapPoints (AcDb::OsnapMode, Adesk::GsMarker, const AcGePoint3d &, const AcGePoint3d &, const AcGeMatrix3d &, AcGePoint3dArray &, AcDbIntArray &) const final
Gets the entity osnap points. More...
virtual Acad::ErrorStatus  | getOsnapPoints (AcDb::OsnapMode, Adesk::GsMarker, const AcGePoint3d &, const AcGePoint3d &, const AcGeMatrix3d &, AcGePoint3dArray &, AcDbIntArray &, const AcGeMatrix3d &) const final
Gets the entity osnap points. More...
virtual Acad::ErrorStatus  | getPlane (AcGePlane &, AcDb::Planarity &) const
Returns the plane that contains this entity. More...
AcDb::PlotStyleNameType  | getPlotStyleNameId (AcDbObjectId &) const
Returns the plot style name type and its associated id. More...
virtual Acad::ErrorStatus  | getStretchPoints (AcGePoint3dArray &) const final
Append stretch points to the specified array. More...
 virtual Acad::ErrorStatus  | getSubentClassId (const AcDbFullSubentPath &, CLSID *) const final
 virtual Acad::ErrorStatus  | getSubentPathGeomExtents (const AcDbFullSubentPath &, AcDbExtents &) const final
virtual Acad::ErrorStatus  | getSubentPathsAtGsMarker (AcDb::SubentType, Adesk::GsMarker, const AcGePoint3d &, const AcGeMatrix3d &, int &, AcDbFullSubentPath *&, int=0, AcDbObjectId *=NULL) const final
Gets the subentity paths appropriate for the passed in gs marker. More...
virtual Acad::ErrorStatus  | getTransformedCopy (const AcGeMatrix3d &, AcDbEntity *&) const final
Creates a copy of the current entity applying the transformation matrix. More...
 virtual void  | gripStatus (const AcDb::GripStat) final
 virtual bool  | hideMeForDragging () const final
virtual Acad::ErrorStatus  | highlight (const AcDbFullSubentPath &=kNullSubent, const Adesk::Boolean=Adesk::kFalse) const final
Highlights part of, or entire entity. More...
virtual Acad::ErrorStatus  | intersectWith (const AcDbEntity *, AcDb::Intersect, AcGePoint3dArray &, Adesk::GsMarker=0, Adesk::GsMarker=0) const final
Finds the intersection between this entity and the pOhter entity. More...
virtual Acad::ErrorStatus  | intersectWith (const AcDbEntity *, AcDb::Intersect, const AcGePlane &, AcGePoint3dArray &, Adesk::GsMarker=0, Adesk::GsMarker=0) const final
Projects this entity and the pOhter entity on plane, finds the intersection points between these projections and then projects back the points onto the caller entity. More...
 virtual bool  | isContentSnappable () const final
virtual Adesk::Boolean  | isPlanar () const
ACHAR *  | layer () const
Returns the layername. More...
AcDbObjectId  | layerId () const
Returns the Object ID of the LayerTableRecord referenced by this entity. More...
ACHAR *  | linetype () const
Gets the linetype value. More...
AcDbObjectId  | linetypeId () const
Gets the linetypeId value. More...
 double  | linetypeScale () const
returns the linetype scale factor for the entity
AcDb::LineWeight  | lineWeight () const
Gets the entity line weight. More...
virtual void  | list () const final
Prints the properties in drawing window. More...
ACHAR *  | material () const
Gets the material assigned to this entity. More...
AcDbObjectId  | materialId () const
Gets the AcDbObjectId of the material assigned to this entity. More...
virtual Acad::ErrorStatus  | moveGripPointsAt (const AcDbIntArray &, const AcGeVector3d &) final
Move the grip points pointed by the indexes specified in indexArray using the translationVector param direction and length Override this method in custom entities to define your own behaviour. More...
 virtual Acad::ErrorStatus  | moveGripPointsAt (const AcDbVoidPtrArray &, const AcGeVector3d &, const int) final
 virtual Acad::ErrorStatus  | moveGripPointsAtSubentPaths (const AcDbFullSubentPathArray &, const AcDbVoidPtrArray &, const AcGeVector3d &, const int) final
virtual Acad::ErrorStatus  | moveStretchPointsAt (const AcDbIntArray &, const AcGeVector3d &) final
Move the stretch points pointed by the indexes specified in indexArray with the offest specified by translationVector Override this method in custom entities to define your own behaviour. More...
ACHAR *  | plotStyleName () const
Returns the name of the plotStyleName string associated with this entity (DXF 390). More...
virtual bool  | receiveShadows () const
Checks if this entity is able to receive shadows. More...
void  | recordGraphicsModified (Adesk::Boolean=Adesk::kTrue)
Controls the entity display update when closing it Entities not updated when closed are updated at the first regen. More...
virtual void  | saveAs (AcGiWorldDraw *, AcDb::SaveType)
Generates the graphics primitives when a DWG save requiring proxy graphics to be saved is made. More...
virtual void  | setCastShadows (bool)
Sets this entity's flag regarding casting shadows. More...
virtual Acad::ErrorStatus  | setColor (const AcCmColor &, Adesk::Boolean=Adesk::kTrue)
Sets the color information of this entity from an AcCmColor instance. More...
virtual Acad::ErrorStatus  | setColor (const AcCmColor &, bool, AcDbDatabase *)
Sets the color property of this entity from an AcCmColor instance. More...
virtual Acad::ErrorStatus  | setColorIndex (Adesk::UInt16, Adesk::Boolean=Adesk::kTrue)
Sets the color index of this entity (DXF 62). More...
void  | setDatabaseDefaults ()
Applies the default properties of the entities database to this entity. More...
void  | setDatabaseDefaults (AcDbDatabase *)
Applies the default properties of the specified database to this entity. More...
virtual Acad::ErrorStatus  | setLayer (AcDbObjectId, Adesk::Boolean=Adesk::kTrue, bool=false)
Sets the layer to be referenced by this entity (DXF 8). More...
virtual Acad::ErrorStatus  | setLayer (const ACHAR *, Adesk::Boolean=Adesk::kTrue, bool=false)
Sets the layer to be referenced by this entity (DXF 8). More...
virtual Acad::ErrorStatus  | setLinetype (AcDbObjectId, Adesk::Boolean=Adesk::kTrue)
Sets the entities linetype to ltypeObjectId. More...
virtual Acad::ErrorStatus  | setLinetype (const ACHAR *, Adesk::Boolean=Adesk::kTrue)
Sets the entities linetype to the linetpye referenced by layerName. More...
virtual Acad::ErrorStatus  | setLinetypeScale (double, Adesk::Boolean=Adesk::kTrue)
sets value as entity linetype scale factor More...
virtual Acad::ErrorStatus  | setLineWeight (AcDb::LineWeight, Adesk::Boolean=Adesk::kTrue)
Sets the entity line weight. More...
virtual Acad::ErrorStatus  | setMaterial (AcDbObjectId, Adesk::Boolean=Adesk::kTrue)
Not implemented yet. More...
virtual Acad::ErrorStatus  | setMaterial (const ACHAR *, Adesk::Boolean=Adesk::kTrue)
Assigns the material to the entity. More...
virtual Acad::ErrorStatus  | setMaterialMapper (const AcGiMapper &, Adesk::Boolean=Adesk::kTrue)
It is used for apply material (scale, rotation, projection, mode overrides) to an identity.If it is used AcGiMapper::kIdentity it will apply for entity a default mapper. More...
virtual Acad::ErrorStatus  | setPlotStyleName (AcDb::PlotStyleNameType, AcDbObjectId=AcDbObjectId::kNull, Adesk::Boolean=Adesk::kTrue)
Sets the plot style of this entity. More...
virtual Acad::ErrorStatus  | setPlotStyleName (const ACHAR *, Adesk::Boolean=Adesk::kTrue)
Sets the plot style of this entity. More...
Acad::ErrorStatus  | setPropertiesFrom (const AcDbEntity *, Adesk::Boolean=Adesk::kTrue)
Copies the properties color, layer, linetype, linetypescale and visibility from the source entity pEntity to this entity. More...
virtual void  | setReceiveShadows (bool)
Sets this entity's flag regarding receiving shadows. More...
virtual Acad::ErrorStatus  | setTransparency (const AcCmTransparency &, Adesk::Boolean=Adesk::kTrue)
Sets the transparency setting of this entity, and returns eOk if successful. More...
virtual Acad::ErrorStatus  | setVisibility (AcDb::Visibility, Adesk::Boolean=Adesk::kTrue) final
notyetdocumented. More...
 virtual Acad::ErrorStatus  | setVisualStyle (AcDbObjectId, VisualStyleType=kFullVisualStyle, Adesk::Boolean=true)
 virtual void  | subentGripStatus (const AcDb::GripStat, const AcDbFullSubentPath &) final
virtual AcDbEntity *  | subentPtr (const AcDbFullSubentPath &) const final
Creates an entity as a copy of the subentity given by acSubentPath. More...
virtual void  | subSetDatabaseDefaults (AcDbDatabase *)
This function is called by AcDbEntity::setDatabaseDefaults(), to allow custom entities to set their related sub entities, if any; default implementation does nothing. More...
virtual Acad::ErrorStatus  | transformBy (const AcGeMatrix3d &) final
Applies given transformation (matrix) to the entity. More...
 virtual Acad::ErrorStatus  | transformSubentPathsBy (const AcDbFullSubentPathArray &, const AcGeMatrix3d &) final
 AcCmTransparency  | transparency () const
Returns the transparency setting of this entity.
virtual Acad::ErrorStatus  | unhighlight (const AcDbFullSubentPath &=kNullSubent, const Adesk::Boolean=Adesk::kFalse) const final
Unhighlights previously highlighted part of entity, or entire entity. More...
AcDb::Visibility  | visibility () const
Gets the visibility state. More...
 AcDbObjectId  | visualStyleId (VisualStyleType=kFullVisualStyle) const
 Public Member Functions inherited from AcDbObject
virtual Acad::ErrorStatus  | addPersistentReactor (AcDbObjectId)
Adds a persistent reactor to this object reactor list. More...
Acad::ErrorStatus  | addReactor (AcDbObjectReactor *) const
Adds a transient reactor to this object. More...
virtual Acad::ErrorStatus  | applyPartialUndo (AcDbDwgFiler *, AcRxClass *)
This function is called during Undo operations on objects, that use the 'Partial Undo meachanism'; this is, this object is opened with assertWriteEnabled(Adesk::kFalse) to indicate that custom Undo filing is used rather than the default Undo filing. More...
 void  | assertNotifyEnabled () const
 void  | assertReadEnabled () const
 void  | assertWriteEnabled (Adesk::Boolean=Adesk::kTrue, Adesk::Boolean=Adesk::kTrue)
virtual Acad::ErrorStatus  | audit (AcDbAuditInfo *)
Performs the audit operation for this object. More...
Acad::ErrorStatus  | cancel ()
Reverts all changes since the object had been opened and closes the object. More...
virtual void  | cancelled (const AcDbObject *)
A handler function for persistent reactors. More...
virtual AcRxObject *  | clone () const
Creates a shallow clone of this object. More...
Acad::ErrorStatus  | close ()
Closes the object. More...
Acad::ErrorStatus  | closeAndPage (Adesk::Boolean=Adesk::kTrue)
Closes the object. More...
virtual Acad::ErrorStatus  | composeForLoad (AcDb::OdaSaveType, AcDb::AcDbDwgVersion)
This function is intended for future MT file loading support. More...
virtual void  | copied (const AcDbObject *, const AcDbObject *)
A handler function for persistent reactors. More...
virtual Acad::ErrorStatus  | copyFrom (const AcRxObject *)
Copies the pSrc object information in this object. More...
Acad::ErrorStatus  | createExtensionDictionary ()
Creates a dictionary as extension dictionary for this object. More...
AcDbDatabase *  | database () const
Returns the database that contains this object. More...
virtual Acad::ErrorStatus  | decomposeForSave (AcDb::AcDbDwgVersion, AcDbObject *&, AcDbObjectId &, Adesk::Boolean &)
This function is called during dwg and dxf output, to allow a custom object to decompose itself, due to provided dwg/dxf target file version. More...
virtual Acad::ErrorStatus  | deepClone (AcDbObject *, AcDbObject *&, AcDbIdMapping &, Adesk::Boolean=Adesk::kTrue) const final
Clones this object, appends it to the owner pOwner and adds an AcDbIdPair record to the idMap. More...
void  | disableUndoRecording (Adesk::Boolean)
Disables or enables the undo recording for the object. More...
Acad::ErrorStatus  | downgradeOpen ()
Sets the open mode for an object opened for write to be opened for read. More...
Acad::ErrorStatus  | downgradeToNotify (Adesk::Boolean)
Sets the open mode for an object opened for write to be opened for notify. More...
virtual AcGiDrawable *  | drawable ()
Retrieves the AcGiDrawable instance of this object. More...
Acad::ErrorStatus  | dwgIn (AcDbDwgFiler *)
Calls the object's dwgInFields function, and reads any XData if present. More...
virtual Acad::ErrorStatus  | dwgInFields (AcDbDwgFiler *)
Reads the object from the DWG filer. More...
Acad::ErrorStatus  | dwgOut (AcDbDwgFiler *) const
Calls the object's dwgOutFields function, and writes any XData if present. More...
virtual Acad::ErrorStatus  | dwgOutFields (AcDbDwgFiler *) const
Writes the object to the DWG filer. More...
Acad::ErrorStatus  | dxfIn (AcDbDxfFiler *)
Calls the object's dxfInFields function, and reads any XData if present. More...
virtual Acad::ErrorStatus  | dxfInFields (AcDbDxfFiler *)
Reads the object from the DXF filer. More...
Acad::ErrorStatus  | dxfOut (AcDbDxfFiler *, Adesk::Boolean, Adesk::uchar *) const
Calls the object's dxfOutFields function, and writes any XData if present. More...
virtual Acad::ErrorStatus  | dxfOutFields (AcDbDxfFiler *) const
Writes the object to the DXF filer. More...
Acad::ErrorStatus  | erase (Adesk::Boolean=Adesk::kTrue)
Sets the bit that indicates that the object is erased. More...
virtual void  | erased (const AcDbObject *, Adesk::Boolean)
A handler function for persistent reactors. More...
AcDbObjectId  | extensionDictionary () const
Returns the object id of the extension dictionary for this object. More...
void  | getAcDbHandle (AcDbHandle &) const
Returns handle of this object. More...
Acad::ErrorStatus  | getBinaryData (const ACHAR *, Adesk::Int32 &, char *&) const
Creates a copy of the binary data stored as chunks of maximum 127 bytes in the resbuf chain of this object's extension dictionary xrecord entry given by entryName. More...
int  | getBrxOpenCount () const
This function returns the number of open BRX instances for this object. More...
int  | getBrxOpenState () const
This function returns the BRX object open state flags as bitfields, for diagnostic purpose. More...
virtual Acad::ErrorStatus  | getClassID (CLSID *) const final
Gets the COM wrapper Class ID for this entity. More...
int  | getCustomObjectState () const
This function returns the custom object status : 1=isCustomObject 2=DifferentialUndoDisabled. More...
Acad::ErrorStatus  | getField (const ACHAR *, AcDbField *&, AcDb::OpenMode) const
Retrieves the specified Field from this object, and opens it in mode. More...
Acad::ErrorStatus  | getField (const ACHAR *, AcDbObjectId &) const
Gets the pszPropName field object from field dictionary of this AcDbObject object, using pszPropName as key. More...
AcDbObjectId  | getFieldDictionary () const
Returns the Field dictionary associated with this object,. More...
Acad::ErrorStatus  | getFieldDictionary (AcDbDictionary *&, AcDb::OpenMode) const
Gets and opens the field dictionary for this. More...
Acad::ErrorStatus  | getObjectBirthVersion (AcDb::AcDbDwgVersion &, AcDb::MaintenanceReleaseVersion &)
This function is currently not supported by the CAD engine, always returns Acad::eOk, and 'kDHL_CURRENT' + 'kMReleaseCurrent' results. More...
virtual Acad::ErrorStatus  | getObjectSaveVersion (const AcDbDwgFiler *, AcDb::AcDbDwgVersion &, AcDb::MaintenanceReleaseVersion &)
Returns the DWG version for saving the object. More...
virtual Acad::ErrorStatus  | getObjectSaveVersion (const AcDbDxfFiler *, AcDb::AcDbDwgVersion &, AcDb::MaintenanceReleaseVersion &)
Returns the DWG version for saving the object. More...
int  | getOdaOpenCount () const
This function returns the number of open ODA instances for this object. More...
int  | getOdaOpenState () const
This function returns the ODA object open state flags as bitfields, for diagnostic purpose. More...
virtual void  | goodbye (const AcDbObject *)
A handler function for persistent reactors. More...
Acad::ErrorStatus  | handOverTo (AcDbObject *, Adesk::Boolean=Adesk::kTrue, Adesk::Boolean=Adesk::kTrue)
Hands over objects identity to another object. More...
bool  | hasFields () const
Return true if this object has single or multiple fields associated with him. More...
bool  | hasPersistentReactor (AcDbObjectId) const
Checks the input objectId in this object reactor list. More...
bool  | hasSaveVersionOverride ()
This function indicates whether this object overrides the filer's save version. More...
virtual AcDbObjectId  | id () const
Returns the database id of this object. More...
Adesk::Boolean  | isAcDbObjectIdsInFlux () const
Checks whether a deep clone operation was completed. More...
Adesk::Boolean  | isAProxy () const
Adesk::Boolean  | isCancelling () const
Adesk::Boolean  | isErased () const
Returns whether this object is erased. More...
Adesk::Boolean  | isEraseStatusToggled () const
Checks whether the object erase status has been toggled. More...
Adesk::Boolean  | isModified () const
Returns whether this object's assertWriteEnabled() has been called since it was opened. More...
Adesk::Boolean  | isModifiedGraphics () const
Checks whether this object graphics will be updated when the object is closed. More...
Adesk::Boolean  | isModifiedXData () const
Checks whether this object's xData was modified. More...
Adesk::Boolean  | isNewObject () const
Returns true if and only if this object has not been closed since it was created. More...
Adesk::Boolean  | isNotifyEnabled () const
Returns whether this object is opened for notify. More...
Adesk::Boolean  | isNotifying () const
virtual Adesk::Boolean  | isPersistent () const
Returns the 'persistent' status of a database object. More...
Adesk::Boolean  | isReadEnabled () const
Returns whether this object is opened for read. More...
 Adesk::Boolean  | isReallyClosing () const
Checks whether the next close call will completely close this object return true if on the next call the object will be completely closed false otherwise.
Adesk::Boolean  | isTransactionResident () const
Gets the object transaction status. More...
Adesk::Boolean  | isUndoing () const
bool  | isUndoRecordingDisabled () const
Returns whether the undo recording for the object is enabled or not. More...
Adesk::Boolean  | isWriteEnabled () const
Returns whether this object is opened for write. More...
virtual AcDb::DuplicateRecordCloning  | mergeStyle () const
Returns the object's merge behavior during cloning. More...
virtual void  | modified (const AcDbObject *)
A handler function for persistent reactors. More...
virtual void  | modifiedGraphics (const AcDbEntity *)
A handler function for persistent reactors. More...
virtual void  | modifiedXData (const AcDbObject *)
A handler function for persistent reactors. More...
virtual void  | modifyUndone (const AcDbObject *)
A handler function for persistent reactors. More...
virtual void  | objectClosed (const AcDbObjectId)
A handler function for persistent reactors. More...
AcDbObjectId  | objectId () const
Returns object id. More...
virtual void  | openedForModify (const AcDbObject *)
A handler function for persistent reactors. More...
AcDbObjectId  | ownerId () const
Returns object id of the owner. More...
AcDbVoidPtrArray *  | reactors ()
Gets the object pointers to reactors. More...
const AcDbVoidPtrArray *  | reactors () const
Gets the object pointers to reactors. More...
virtual void  | reappended (const AcDbObject *)
A handler function for persistent reactors. More...
 virtual void  | recvPropagateModify (const AcDbObject *)
Not implemented yet.
Acad::ErrorStatus  | releaseExtensionDictionary ()
Removes the extension dictionary associated with this object. More...
virtual Acad::ErrorStatus  | removeField (AcDbObjectId)
Removes the Field specified by acFieldId from this object. More...
virtual Acad::ErrorStatus  | removeField (const ACHAR *)
Removes the Field specified by szKeyString from this object. More...
virtual Acad::ErrorStatus  | removeField (const ACHAR *, AcDbObjectId &)
Removes the Field specified by acPszKeyString from this object, and returns its ObjectId value. More...
virtual Acad::ErrorStatus  | removePersistentReactor (AcDbObjectId)
Removes a persistent reactor from this object reactor list. More...
Acad::ErrorStatus  | removeReactor (AcDbObjectReactor *) const
Removes a transient reactor to this object. More...
void  | setAcDbObjectIdsInFlux ()
Call this function to indicate that the object IDs of this object and its sub-objects (if any) are not yet valid. More...
Acad::ErrorStatus  | setBinaryData (const ACHAR *, Adesk::Int32, const char *)
Creates a copy of the binary data, divides it in up to 127 bytes binary chunks and
 sets them as resbufs in the resbuf chain of this object's extension dictionary xrecord entry given by entryName. More...
virtual Acad::ErrorStatus  | setField (const ACHAR *, AcDbField *, AcDbObjectId &)
Adds the pAcField field object to field dictionary of this AcDbObject object, using pKey as key. More...
void  | setHasSaveVersionOverride (bool)
This function can be called to specify that the object has a "save version override". More...
virtual Acad::ErrorStatus  | setOwnerId (AcDbObjectId)
Sets the ownerId data member of the object to be objId. More...
virtual Acad::ErrorStatus  | setXData (const resbuf *)
Sets/removes xData associated with this object. More...
virtual Acad::ErrorStatus  | subCancel ()
Possibility to veto a cancel operation from within custom entities. More...
virtual Acad::ErrorStatus  | subClose ()
virtual Acad::ErrorStatus  | subErase (Adesk::Boolean)
This hook is called during an AcDbObject::erase call, before any actual erase operation is performed. More...
 virtual Acad::ErrorStatus  | subHandOverTo (AcDbObject *)
virtual void  | subObjModified (const AcDbObject *, const AcDbObject *)
A handler function for persistent reactors. More...
 virtual Acad::ErrorStatus  | subOpen (AcDb::OpenMode)
virtual Acad::ErrorStatus  | subSwapIdWith (AcDbObjectId, Adesk::Boolean=Adesk::kFalse, Adesk::Boolean=Adesk::kFalse)
This hook is called during an AcDbObject::swapIdWith() call, before any actual swap operation is performed. More...
Acad::ErrorStatus  | swapIdWith (AcDbObjectId, Adesk::Boolean=Adesk::kFalse, Adesk::Boolean=Adesk::kFalse)
Swaps the object id's between the object identified by param swapId and this object. More...
virtual Acad::ErrorStatus  | swapReferences (const AcDbIdMapping &)
Not implemented yet. More...
virtual void  | unappended (const AcDbObject *)
A handler function for persistent reactors. More...
AcDbDwgFiler *  | undoFiler ()
Gets the undo filer for this object. More...
Acad::ErrorStatus  | upgradeFromNotify (Adesk::Boolean &)
Upgrades the open status of this object to AcDb::kForWrite, if this object is already open (either in AcDb::kForRead, AcDb::kForNotify or AcDb::kForWrite) More...
Acad::ErrorStatus  | upgradeOpen ()
Changes the objects open mode to AcDb::kForWrite and sends notifications. More...
virtual Acad::ErrorStatus  | wblockClone (AcRxObject *, AcDbObject *&, AcDbIdMapping &, Adesk::Boolean=Adesk::kTrue) const final
Clones this object, appends it to the owner pOwner and adds an AcDbIdPair record to the idMap. More...
virtual resbuf *  | xData (const ACHAR *=NULL) const
Returns the xData associated with this object. More...
Acad::ErrorStatus  | xDataTransformBy (const AcGeMatrix3d &)
Transforms the extended data according to parameter transformation matrix. More...
 virtual void  | xmitPropagateModify () const
Not implemented yet.
 virtual  | ~AcDbObject ()
Destructor.
 Public Member Functions inherited from AcGiDrawable
virtual bool  | bounds (AcDbExtents &) const
virtual DrawableType  | drawableType () const
 virtual AcGiDrawStream *  | drawStream () const
 AcGsNode *  | gsNode () const
virtual AcDbObjectId  | id () const =0
virtual Adesk::Boolean  | isPersistent () const =0
virtual Adesk::UInt32  | regenSupportFlags () const final
Returns whether and to which level this object supports MultiThreading. More...
 virtual Adesk::Boolean  | RolloverHit (Adesk::ULongPtr, Adesk::ULongPtr, Adesk::Boolean)
 virtual Adesk::UInt32  | setAttributes (AcGiDrawableTraits *) final
 virtual void  | setDrawStream (AcGiDrawStream *)
 void  | setGsNode (AcGsNode *)
 virtual void  | viewportDraw (AcGiViewportDraw *) final
 virtual Adesk::UInt32  | viewportDrawLogicalFlags (AcGiViewportDraw *) final
 virtual Adesk::Boolean  | worldDraw (AcGiWorldDraw *) final
 Public Member Functions inherited from AcRxObject
virtual AcRxObject *  | clone () const
Exported and implemented. More...
 virtual AcRx::Ordering  | comparedTo (const AcRxObject *) const
Exported and implemented.
virtual Acad::ErrorStatus  | copyFrom (const AcRxObject *)
Exported and implemented. More...
 virtual AcRxClass *  | isA () const
Exported and implemented.
virtual Adesk::Boolean  | isEqualTo (const AcRxObject *) const
Exported and implemented. More...
bool  | isKindOf (const AcRxClass *) const
Checks the object class. More...
AcRxObject *  | queryX (const AcRxClass *) const
returns the protocol extension object assigned to this class or a parent class. More...
AcRxObject *  | x (const AcRxClass *) const
returns the protocol extension object assigned to this class or a parent class. More...
 virtual  | ~AcRxObject ()
Destructor.
 Public Attributes
AcDbPolyline
Default constructor. More...
 Public Attributes inherited from AcDbCurve
AcDbCurve
Default constructor.
 Public Attributes inherited from AcDbEntity
AcDbEntity
This protected constructor sets the initial value for color to 257, and for the objectids for layer and linetype to AcDbObjectId::kNull. More...
 Protected Member Functions
virtual Acad::ErrorStatus  | subExplode (AcDbVoidPtrArray &) const
virtual Acad::ErrorStatus  | subGetGeomExtents (AcDbExtents &) const
Returns extents of this entity. More...
virtual Acad::ErrorStatus  | subGetGripPoints (AcDbGripDataPtrArray &, const double, const int, const AcGeVector3d &, const int) const
virtual Acad::ErrorStatus  | subGetGripPoints (AcGePoint3dArray &, AcDbIntArray &, AcDbIntArray &) const
virtual Acad::ErrorStatus  | subGetOsnapPoints (AcDb::OsnapMode, Adesk::GsMarker, const AcGePoint3d &, const AcGePoint3d &, const AcGeMatrix3d &, AcGePoint3dArray &, AcDbIntArray &) const
virtual Acad::ErrorStatus  | subGetStretchPoints (AcGePoint3dArray &) const
virtual Acad::ErrorStatus  | subGetSubentPathsAtGsMarker (AcDb::SubentType, Adesk::GsMarker, const AcGePoint3d &, const AcGeMatrix3d &, int &, AcDbFullSubentPath *&, int, AcDbObjectId *) const
virtual Acad::ErrorStatus  | subGetTransformedCopy (const AcGeMatrix3d &, AcDbEntity *&) const
virtual void  | subGripStatus (const AcDb::GripStat)
virtual Acad::ErrorStatus  | subIntersectWith (const AcDbEntity *, AcDb::Intersect, AcGePoint3dArray &, Adesk::GsMarker=0, Adesk::GsMarker=0) const
virtual Acad::ErrorStatus  | subIntersectWith (const AcDbEntity *, AcDb::Intersect, const AcGePlane &, AcGePoint3dArray &, Adesk::GsMarker=0, Adesk::GsMarker=0) const
virtual Acad::ErrorStatus  | subMoveGripPointsAt (const AcDbIntArray &, const AcGeVector3d &)
virtual Acad::ErrorStatus  | subMoveStretchPointsAt (const AcDbIntArray &, const AcGeVector3d &)
virtual AcDbEntity *  | subSubentPtr (const AcDbFullSubentPath &) const
virtual Acad::ErrorStatus  | subTransformBy (const AcGeMatrix3d &)
Applies given transformation (matrix) to the entity. More...
virtual void  | subViewportDraw (AcGiViewportDraw *)
Creates a viewport-dependent graphical representation of this object. More...
virtual Adesk::Boolean  | subWorldDraw (AcGiWorldDraw *)
Creates a viewport-independent graphical representation of the object. More...
 Protected Member Functions inherited from AcDbEntity
 virtual Acad::ErrorStatus  | subAddSubentPaths (const AcDbFullSubentPathArray &)
 virtual Adesk::Boolean  | subCloneMeForDragging ()
 virtual Acad::ErrorStatus  | subDeleteSubentPaths (const AcDbFullSubentPathArray &)
virtual Acad::ErrorStatus  | subExplode (AcDbVoidPtrArray &) const
 virtual Acad::ErrorStatus  | subGetCompoundObjectTransform (AcGeMatrix3d &) const
virtual Acad::ErrorStatus  | subGetGeomExtents (AcDbExtents &) const
virtual Acad::ErrorStatus  | subGetGripEntityUCS (const void *, AcGeVector3d &, AcGePoint3d &, AcGeVector3d &) const
virtual Acad::ErrorStatus  | subGetGripPoints (AcDbGripDataPtrArray &, const double, const int, const AcGeVector3d &, const int) const
virtual Acad::ErrorStatus  | subGetGripPoints (AcGePoint3dArray &, AcDbIntArray &, AcDbIntArray &) const
 virtual Acad::ErrorStatus  | subGetGripPointsAtSubentPath (const AcDbFullSubentPath &, AcDbGripDataPtrArray &, const double, const int, const AcGeVector3d &, const int) const
virtual Acad::ErrorStatus  | subGetGsMarkersAtSubentPath (const AcDbFullSubentPath &, AcArray< Adesk::GsMarker > &) const
virtual Acad::ErrorStatus  | subGetOsnapPoints (AcDb::OsnapMode, Adesk::GsMarker, const AcGePoint3d &, const AcGePoint3d &, const AcGeMatrix3d &, AcGePoint3dArray &, AcDbIntArray &) const
 virtual Acad::ErrorStatus  | subGetOsnapPoints (AcDb::OsnapMode, Adesk::GsMarker, const AcGePoint3d &, const AcGePoint3d &, const AcGeMatrix3d &, AcGePoint3dArray &, AcDbIntArray &, const AcGeMatrix3d &) const
virtual Acad::ErrorStatus  | subGetStretchPoints (AcGePoint3dArray &) const
 virtual Acad::ErrorStatus  | subGetSubentClassId (const AcDbFullSubentPath &, CLSID *) const
 virtual Acad::ErrorStatus  | subGetSubentPathGeomExtents (const AcDbFullSubentPath &, AcDbExtents &) const
virtual Acad::ErrorStatus  | subGetSubentPathsAtGsMarker (AcDb::SubentType, Adesk::GsMarker, const AcGePoint3d &, const AcGeMatrix3d &, int &, AcDbFullSubentPath *&, int=0, AcDbObjectId *=nullptr) const
virtual Acad::ErrorStatus  | subGetTransformedCopy (const AcGeMatrix3d &, AcDbEntity *&) const
virtual void  | subGripStatus (const AcDb::GripStat)
 virtual bool  | subHideMeForDragging () const
virtual Acad::ErrorStatus  | subHighlight (const AcDbFullSubentPath &=kNullSubent, const Adesk::Boolean=false) const
virtual Acad::ErrorStatus  | subIntersectWith (const AcDbEntity *, AcDb::Intersect, AcGePoint3dArray &, Adesk::GsMarker=0, Adesk::GsMarker=0) const
virtual Acad::ErrorStatus  | subIntersectWith (const AcDbEntity *, AcDb::Intersect, const AcGePlane &, AcGePoint3dArray &, Adesk::GsMarker=0, Adesk::GsMarker=0) const
virtual bool  | subIsContentSnappable () const
virtual void  | subList () const
virtual Acad::ErrorStatus  | subMoveGripPointsAt (const AcDbIntArray &, const AcGeVector3d &)
virtual Acad::ErrorStatus  | subMoveGripPointsAt (const AcDbVoidPtrArray &, const AcGeVector3d &, const int)
 virtual Acad::ErrorStatus  | subMoveGripPointsAtSubentPaths (const AcDbFullSubentPathArray &, const AcDbVoidPtrArray &, const AcGeVector3d &, const int)
virtual Acad::ErrorStatus  | subMoveStretchPointsAt (const AcDbIntArray &, const AcGeVector3d &)
virtual Adesk::UInt32  | subSetAttributes (AcGiDrawableTraits *)
Sets the values of this object's subentity traits and returns with the calling object's subentity traits. More...
virtual Acad::ErrorStatus  | subSetVisibility (AcDb::Visibility, Adesk::Boolean=true)
 virtual void  | subSubentGripStatus (const AcDb::GripStat, const AcDbFullSubentPath &)
virtual AcDbEntity *  | subSubentPtr (const AcDbFullSubentPath &) const
virtual Acad::ErrorStatus  | subTransformBy (const AcGeMatrix3d &)
 virtual Acad::ErrorStatus  | subTransformSubentPathsBy (const AcDbFullSubentPathArray &, const AcGeMatrix3d &)
virtual Acad::ErrorStatus  | subUnhighlight (const AcDbFullSubentPath &=kNullSubent, const Adesk::Boolean=false) const
virtual void  | subViewportDraw (AcGiViewportDraw *)
 virtual AcDb::Visibility  | subVisibility () const
virtual Adesk::Boolean  | subWorldDraw (AcGiWorldDraw *)
 Protected Member Functions inherited from AcDbObject
virtual Acad::ErrorStatus  | subDeepClone (AcDbObject *, AcDbObject *&, AcDbIdMapping &, Adesk::Boolean=true) const
virtual Acad::ErrorStatus  | subGetClassID (CLSID *) const
virtual Adesk::UInt32  | subSetAttributes (AcGiDrawableTraits *)
Sets the values of this object's subentity traits and returns with the calling object's subentity traits. More...
virtual void  | subViewportDraw (AcGiViewportDraw *)
virtual Adesk::UInt32  | subViewportDrawLogicalFlags (AcGiViewportDraw *)
virtual Acad::ErrorStatus  | subWblockClone (AcRxObject *, AcDbObject *&, AcDbIdMapping &, Adesk::Boolean=true) const
virtual Adesk::Boolean  | subWorldDraw (AcGiWorldDraw *)
 Protected Member Functions inherited from AcGiDrawable
virtual Adesk::UInt32  | subRegenSupportFlags () const
Returns whether and to which level this object supports MultiThreading. More...
virtual Adesk::UInt32  | subSetAttributes (AcGiDrawableTraits *)=0
virtual void  | subViewportDraw (AcGiViewportDraw *)=0
 virtual Adesk::UInt32  | subViewportDrawLogicalFlags (AcGiViewportDraw *)
virtual Adesk::Boolean  | subWorldDraw (AcGiWorldDraw *)=0
 Protected Member Functions inherited from AcRxObject
AcRxObject ()
Exported and implemented.
 Additional Inherited Members
 Static Public Member Functions inherited from AcDbCurve
 static Acad::ErrorStatus  | createFromAcGeCurve (const AcGeCurve3d &, AcDbCurve *&, AcGeVector3d *=NULL, const AcGeTol &=AcGeContext::gTol)
 Static Public Member Functions inherited from AcRxObject
 static AcRxObject *  | cast (const AcRxObject *)
 static AcRxClass *  | desc ()
Exported and implemented.
 Static Public Member Functions inherited from AcHeapOperators
 static void  | operator delete (void *)
_
 static void  | operator delete (void *, const char *, int)
 static void  | operator delete (void *, void *)
 static void  | operator delete[] (void *)
_
 static void  | operator delete[] (void *, const char *, int)
 static void *  | operator new (size_t)
_
 static void *  | operator new (size_t, const char *, int)
 static void *  | operator new (size_t, void *p)
 static void *  | operator new[] (size_t)
_
 static void *  | operator new[] (size_t, const char *, int)
Detailed Description
_
Member Function Documentation
◆ addVertexAt()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbPolyline::addVertexAt  |  ( |  unsigned int  |  cardinal,
|  const AcGePoint2d &  |  startPnt,
|  double  |  bulge = 0.0,
|  double  |  startWidth = -1.0,
|  double  |  endWidth = -1.0,
|  Adesk::Int32  |  ident = 0
)
virtual
Adds a vertex to a polyline,.
Date
2007-07-02 laurentiuv CREATED
◆ applyPartialUndo()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbPolyline::applyPartialUndo  |  ( |  AcDbDwgFiler *  |  container,
|  AcRxClass *  |  pObject
)
virtual
See also
AcDbCurve::
Reimplemented from AcDbEntity.
◆ castShadows()
 UX_EXPORT_FUNCTION bool AcDbPolyline::castShadows  |  ( |   | ) |   const
virtual
See AcDbCurve::castShadows() .
Returns
always false for this type
Reimplemented from AcDbEntity.
◆ convertFrom()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbPolyline::convertFrom  |  ( |  AcDbEntity *&  |  pPline,
|  Adesk::Boolean  |  bDbR = Adesk::kTrue
)
virtual
Sets the polyline with values taken from a given AcDb2dPolyline.
If bDbR is true, the polyline vertices positions, objectId, handle, extended entity data, extension dictionary, and reactors becomes the same as the source 2dPolyline. The polyline is then made database resident and the source 2dPolyline is deleted.
 If bDbR is false, the polyline acquires vertices positions. It stays non-database resident and 2dPolyline stays database resident.
Parameters
[in] | pPline | source AcDb2dPolyline
[in] | bDbR | true to do a handOverTo() between the source AcDb2dPolyline and this AcDbPolyline
Returns
Acad::eOk if successful,
 Acad::eInvalidInput if bDbR == true and pPline is not database resident
 Acad::eIllegalEntityType if pPline is not an AcDb2dPolyline
 Acad::eAlreadyInDb if the calling polyline is already database resident
 Acad::eNotApplicable if pPline is not a k2dSimplePoly or k2dFitCurvePoly or there is extended entity data attached to any vertex
◆ convertTo()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbPolyline::convertTo  |  ( |  AcDb2dPolyline *&  |  pPline,
|  Adesk::Boolean  |  pDbR = Adesk::kTrue
) |   |  const
Sets a given AcDb2dPolyline with values taken from this polyline.
Parameters
[in,out] | pPline | will be set to point to the newly created AcDb2dPolyline
[in] | pDbR | true to do a handOverTo() between the destination AcDb2dPolyline and this AcDbPolyline
Returns
Acad::eOk if successful and pDbR equal false
 Acad::eObjectToBeDeleted if successful and pDbR == true. The caller should be deleted.
 Acad::eIllegalReplacement if pDbR == true and pPline is not database resident
Remarks
◆ dwgInFields()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbPolyline::dwgInFields  |  ( |  AcDbDwgFiler *  |  dwgFiler | )
virtual
See also
AcDbCurve::applyPartialUndo(AcDbDwgFiler*, AcRxClass*)
Reimplemented from AcDbEntity.
◆ dwgOutFields()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbPolyline::dwgOutFields  |  ( |  AcDbDwgFiler *  |  dwgFiler | ) |   const
virtual
See also
AcDbCurve::dwgOutFields(AcDbDwgFiler*)
Reimplemented from AcDbEntity.
◆ dxfInFields()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbPolyline::dxfInFields  |  ( |  AcDbDxfFiler *  |  dxfFiler | )
virtual
See also
AcDbCurve::dxfInFields(AcDbDxfFiler*)
Reimplemented from AcDbEntity.
◆ dxfOutFields()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbPolyline::dxfOutFields  |  ( |  AcDbDxfFiler *  |  dxfFiler | ) |   const
virtual
See also
AcDbCurve::dxfOutFields(AcDbDxfFiler*)
Reimplemented from AcDbEntity.
◆ elevation()
 UX_EXPORT_FUNCTION double AcDbPolyline::elevation  |  ( |   | ) |   const
Returns the elevation.
Returns
elevation
◆ extend() [1/2]
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbPolyline::extend  |  ( |  Adesk::Boolean  |  bFromStart,
|  const AcGePoint3d &  |  upToPnt
)
virtual
See also
AcDbCurve::extend(Adesk::Boolean, const AcGePoint3d&)
Reimplemented from AcDbCurve.
◆ extend() [2/2]
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbPolyline::extend  |  ( |  double  |  param | )
virtual
See also
AcDbCurve::extend(double value)
Reimplemented from AcDbCurve.
◆ getAcGeCurve()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbPolyline::getAcGeCurve  |  ( |  AcGeCurve3d *&  |  geCurve,
|  const AcGeTol &  |  tol = AcGeContext::gTol
) |   |  const
virtual
Reimplemented from AcDbCurve.
◆ getArcSegAt() [1/2]
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbPolyline::getArcSegAt  |  ( |  unsigned int  |  cardinal,
|  AcGeCircArc2d &  |  outArc
) |   |  const
Returns a 2D arc from this polyline given the index cardinal.
Parameters
[in] | cardinal | start vertex index
[out] | outArc | a copy of the arc
Returns
Acad::eInvalidIndex if index is not valid Acad::eOk if successful
◆ getArcSegAt() [2/2]
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbPolyline::getArcSegAt  |  ( |  unsigned int  |  cardinal,
|  AcGeCircArc3d &  |  outArc
) |   |  const
Returns a 3D arc from this polyline given the index cardinal.
Parameters
[in] | cardinal | start vertex index
[out] | outArc | a copy of the arc
Returns
Acad::eInvalidInput if index is not valid Acad::eOk if successful
◆ getArea()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbPolyline::getArea  |  ( |  double &  |  polylineArea | ) |   const
virtual
Gets the polyline area.
Parameters
[out] | polyline | area
Returns
Acad::eOk if successful
error code otherwise
Reimplemented from AcDbCurve.
◆ getBulgeAt()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbPolyline::getBulgeAt  |  ( |  unsigned int  |  cardinal,
|  double &  |  bulge
) |   |  const
Gets the bulge value at the given vertex index.
Parameters
[in] | cardinal | of the vertex
[in] | bulge | value at given vertex
Returns
Acad::eOk if successful,
 Acad::eInvalidIndex if cardinal is not valid for this polyline
◆ getClosestPointTo() [1/2]
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbPolyline::getClosestPointTo  |  ( |  const AcGePoint3d &  |  acPoint,
|  AcGePoint3d &  |  acResult,
|  Adesk::Boolean  |  isExtended = Adesk::kFalse
) |   |  const
virtual
Finds the nearest point to inputPoint and sets returnPoint as the result.
Parameters
[in] | acPoint | input point
[out] | acResult | the point on the curve closest to inputPoint
[in] | isExtended | indicates if the curve should be extended along its path
Returns
Acad::eOk if successful
Reimplemented from AcDbCurve.
◆ getClosestPointTo() [2/2]
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbPolyline::getClosestPointTo  |  ( |  const AcGePoint3d &  |  inputPoint,
|  const AcGeVector3d &  |  normalVector,
|  AcGePoint3d &  |  returnPoint,
|  Adesk::Boolean  |  bBeyond = Adesk::kFalse
) |   |  const
virtual
See also
AcDbCurve::getClosestPointTo(const AcGePoint3d&, const AcGeVector3d&, AcGePoint3d&, Adesk::Boolean)
Reimplemented from AcDbCurve.
◆ getConstantWidth()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbPolyline::getConstantWidth  |  ( |  double &  |  width | ) |   const
Gets polyline's constant width, in case it is constant.
Parameters
[out] | width | polyline's constant width
Returns
Acad::eOk if successful,
 Acad::eInvalidInput if the width is not constant
◆ getDistAtParam()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbPolyline::getDistAtParam  |  ( |  double  |  value,
|  double &  |  length
) |   |  const
virtual
Computes the distance from the polyline start point to param.
Parameters
[in] | value | end point of calculation
[out] | length | length on polyline
Returns
Acad::eOk, if successful, Acad::eInvalidInput in case of param is out of range, appropriate error code in any other case
Reimplemented from AcDbCurve.
◆ getDistAtPoint()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbPolyline::getDistAtPoint  |  ( |  const AcGePoint3d &  |  ptOnCurve,
|  double &  |  length
) |   |  const
virtual
See also
AcDbCurve::getDistAtPoint(const AcGePoint3d&, double&)
Reimplemented from AcDbCurve.
◆ getEcs()
 UX_EXPORT_FUNCTION void AcDbPolyline::getEcs  |  ( |  AcGeMatrix3d &  |  retMat | ) |   const
virtual
Gets the transformation matrix from OCS (Object Coordinate System) to WCS (World Coordinate System).
Parameters
[out] | resultMatrix | transformation matrix from OCS to WCS
Reimplemented from AcDbEntity.
◆ getEndParam()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbPolyline::getEndParam  |  ( |  double &  |  endParam | ) |   const
virtual
Computes the parameter corresponding to the end point of the polyline.
Parameters
[out] | endParam | end parameter
Returns
Acad::eOk
Reimplemented from AcDbCurve.
◆ getEndPoint()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbPolyline::getEndPoint  |  ( |  AcGePoint3d &  |  pnt | ) |   const
virtual
Sets the passed point to end point of the polyline, if successful.
Parameters
[out] | pnt | end point of the polyline
Returns
Acad::eOk if successful,
 Acad::eDegenerateGeometry if polyline's end point has not been set.
Reimplemented from AcDbCurve.
◆ getFirstDeriv() [1/2]
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbPolyline::getFirstDeriv  |  ( |  const AcGePoint3d &  |  point,
|  AcGeVector3d &  |  fstDerivative
) |   |  const
virtual
See also
AcDbCurve::getFirstDeriv(const AcGePoint3d&, AcGeVector3d&)
Reimplemented from AcDbCurve.
◆ getFirstDeriv() [2/2]
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbPolyline::getFirstDeriv  |  ( |  double  |  value,
|  AcGeVector3d &  |  fstDerivative
) |   |  const
virtual
See also
AcDbCurve::getFirstDeriv(double, AcGeVector3d&)
Reimplemented from AcDbCurve.
◆ getLineSegAt() [1/2]
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbPolyline::getLineSegAt  |  ( |  unsigned int  |  cardinal,
|  AcGeLineSeg2d &  |  outSeg
) |   |  const
Copies the line data of vertex with index cardinal to outSeg, if this vertex is a line.
Parameters
[in] | cardinal | index
[out] | outSeg | vertex's line data in OCS
Returns
error status
◆ getLineSegAt() [2/2]
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbPolyline::getLineSegAt  |  ( |  unsigned int  |  cardinal,
|  AcGeLineSeg3d &  |  outSeg
) |   |  const
Copies the line data of vertex with index cardinal to outSeg, if this vertex is a line.
Parameters
[in] | cardinal | index
[out] | outSeg | vertex's line data in WCS
Returns
error status
◆ getOffsetCurves()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbPolyline::getOffsetCurves  |  ( |  double  |  distance,
|  AcDbVoidPtrArray &  |  curveArray
) |   |  const
virtual
See also
AcDbCurve::getOffsetCurves(double, AcDbVoidPtrArray&)
Reimplemented from AcDbCurve.
◆ getOrthoProjectedCurve()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbPolyline::getOrthoProjectedCurve  |  ( |  const AcGePlane &  |  plane,
|  AcDbCurve *&  |  projectedCurve
) |   |  const
virtual
See also
AcDbCurve::getOrthoProjectedCurve(const AcGePlane&, AcDbCurve*&)
Reimplemented from AcDbCurve.
◆ getParamAtDist()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbPolyline::getParamAtDist  |  ( |  double  |  length,
|  double &  |  value
) |   |  const
virtual
See also
AcDbCurve::getParamAtDist(double, double&)
Reimplemented from AcDbCurve.
◆ getParamAtPoint()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbPolyline::getParamAtPoint  |  ( |  const AcGePoint3d &  |  point,
|  double &  |  value
) |   |  const
virtual
See also
AcDbCurve::getParamAtPoint(const AcGePoint3d&, double&)
Reimplemented from AcDbCurve.
◆ getPlane()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbPolyline::getPlane  |  ( |  AcGePlane &  |  acPlane,
|  AcDb::Planarity &  |  ePlanarity
) |   |  const
virtual
Reimplemented from AcDbEntity.
◆ getPointAtDist()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbPolyline::getPointAtDist  |  ( |  double  |  length,
|  AcGePoint3d &  |  ptOnCurve
) |   |  const
virtual
See also
AcDbCurve::getPointAtDist(double, AcGePoint3d&)
Reimplemented from AcDbCurve.
◆ getPointAtParam()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbPolyline::getPointAtParam  |  ( |  double  |  value,
|  AcGePoint3d &  |  point
) |   |  const
virtual
See also
AcDbCurve::getPointAtParam(double, AcGePoint3d&)
Reimplemented from AcDbCurve.
◆ getProjectedCurve()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbPolyline::getProjectedCurve  |  ( |  const AcGePlane &  |  plane,
|  const AcGeVector3d &  |  direction,
|  AcDbCurve *&  |  projectedCurve
) |   |  const
virtual
See also
AcDbCurve::getProjectedCurve(const AcGePlane&, const AcGeVector3d&, AcDbCurve*&)
Reimplemented from AcDbCurve.
◆ getSecondDeriv() [1/2]
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbPolyline::getSecondDeriv  |  ( |  const AcGePoint3d &  |  point,
|  AcGeVector3d &  |  secDerivative
) |   |  const
virtual
See also
AcDbCurve::getSecondDeriv(const AcGePoint3d&, AcGeVector3d&)
Reimplemented from AcDbCurve.
◆ getSecondDeriv() [2/2]
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbPolyline::getSecondDeriv  |  ( |  double  |  value,
|  AcGeVector3d &  |  secDerivative
) |   |  const
virtual
See also
AcDbCurve::getSecondDeriv(double, AcGeVector3d&)
Reimplemented from AcDbCurve.
◆ getSpline()
 DOIT UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbPolyline::getSpline  |  ( |  AcDbSpline *&  |   | ) |   const
virtual
Reimplemented from AcDbCurve.
◆ getSplitCurves() [1/2]
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbPolyline::getSplitCurves  |  ( |  const AcGeDoubleArray &  |  parameterArray,
|  AcDbVoidPtrArray &  |  subCurveArray
) |   |  const
virtual
See also
AcDbCurve::getSplitCurves(const AcGeDoubleArray&, AcDbVoidPtrArray&)
Reimplemented from AcDbCurve.
◆ getSplitCurves() [2/2]
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbPolyline::getSplitCurves  |  ( |  const AcGePoint3dArray &  |  pointArray,
|  AcDbVoidPtrArray &  |  subCurveArray
) |   |  const
virtual
See also
AcDbCurve::getSplitCurves(const AcGePoint3dArray&, AcDbVoidPtrArray&)
Reimplemented from AcDbCurve.
◆ getStartParam()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbPolyline::getStartParam  |  ( |  double &  |  p | ) |   const
virtual
Reimplemented from AcDbCurve.
◆ getStartPoint()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbPolyline::getStartPoint  |  ( |  AcGePoint3d &  |  pnt | ) |   const
virtual
Sets the passed point to start point of the polyline, if successful.
Parameters
[out] | pnt | that receives coordinates of the start point
Returns
Acad::eOk if successful,
 Acad::eDegenerateGeometry if polyline's start point has not been set.
Reimplemented from AcDbCurve.
◆ getVertexIdentifierAt()
 Acad::ErrorStatus AcDbPolyline::getVertexIdentifierAt  |  ( |  unsigned int  |  idx,
|  Adesk::Int32 &  |  ident
) |   |  const
Returns the unique identifier for the specified polyline vertex.
Parameters
[in] | idx | the polyline vertex index to retrieve the unique identifier
[out] | ident | identifier number for the vertex
Returns
Acad::eOk if successful - error code otherwise
◆ getWidthsAt()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbPolyline::getWidthsAt  |  ( |  unsigned int  |  cardinal,
|  double &  |  startWidth,
|  double &  |  endWidth
) |   |  const
Returns a vertex's width values.
Parameters
[in] | cardinal | index
[out] | startWidth | starting width of the vertex at index cardinal
[out] | endWidth | ending width of the vertex at index cardinal
Returns
error status
◆ hasBulges()
 UX_EXPORT_FUNCTION Adesk::Boolean AcDbPolyline::hasBulges  |  ( |   | ) |   const
Returns whether at least one vertex has bulge set.
Returns
whether at least one bulge is set
◆ hasPlinegen()
 UX_EXPORT_FUNCTION Adesk::Boolean AcDbPolyline::hasPlinegen  |  ( |   | ) |   const
Returns linetype generation of the polyline.
Returns
polylines PLINEGEN
◆ hasVertexIdentifiers()
 Adesk::Boolean AcDbPolyline::hasVertexIdentifiers  |  ( |   | ) |   const
Returns whether the polyline object uses vertex identifiers.
Returns
Adesk::kTrue is vertex identifiers are used, Adesk::kFalse otherwise
◆ hasWidth()
 UX_EXPORT_FUNCTION Adesk::Boolean AcDbPolyline::hasWidth  |  ( |   | ) |   const
Returns whether the polyline or any vertex has a width assigned.
Returns
whether at least one vertex has a width
◆ isClosed()
 UX_EXPORT_FUNCTION Adesk::Boolean AcDbPolyline::isClosed  |  ( |   | ) |   const
virtual
Reimplemented from AcDbCurve.
◆ isOnlyLines()
 UX_EXPORT_FUNCTION Adesk::Boolean AcDbPolyline::isOnlyLines  |  ( |   | ) |   const
Returns whether the polyline contains only line vertices.
Returns
only line vertices or not
◆ isPeriodic()
 UX_EXPORT_FUNCTION Adesk::Boolean AcDbPolyline::isPeriodic  |  ( |   | ) |   const
virtual
Reimplemented from AcDbCurve.
◆ isPlanar()
 UX_EXPORT_FUNCTION Adesk::Boolean AcDbPolyline::isPlanar  |  ( |   | ) |   const
virtual
Reimplemented from AcDbEntity.
◆ maximizeMemory()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbPolyline::maximizeMemory  |  ( |   | )
Expands the memory used by this polyline, minimizing the processing time.
Returns
Acad::eOk
◆ minimizeMemory()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbPolyline::minimizeMemory  |  ( |   | )
Shrinks the memory used by this polyline.
Returns
Acad::eOk
◆ normal()
 UX_EXPORT_FUNCTION AcGeVector3d AcDbPolyline::normal  |  ( |   | ) |   const
Returns the normal vector of the polyline.
Returns
the normal vector of the polyline.
◆ numVerts()
 UX_EXPORT_FUNCTION unsigned int AcDbPolyline::numVerts  |  ( |   | ) |   const
Returns number of vertices.
Returns
number of vertices
◆ onSegAt()
 UX_EXPORT_FUNCTION Adesk::Boolean AcDbPolyline::onSegAt  |  ( |  unsigned int  |  segIndex,
|  const AcGePoint2d &  |  acPoint2d,
|  double &  |  parameter
) |   |  const
virtual
Returns true if the given acPoint2d resides on the segment starting at index segIndex.
Parameters
[in] | segIndex | index of the segment
[in] | acPoint2d | point to check
[out] | parameter | the point's parameter
Returns
◆ receiveShadows()
 UX_EXPORT_FUNCTION bool AcDbPolyline::receiveShadows  |  ( |   | ) |   const
virtual
See AcDbCurve::receiveShadows() .
Returns
always false for this type
Reimplemented from AcDbEntity.
◆ reset()
 UX_EXPORT_FUNCTION void AcDbPolyline::reset  |  ( |  Adesk::Boolean  |  bUnused,
|  unsigned int  |  vertexNumber
)
virtual
Deletes all existing vertices.
Parameters
[in] | bUnused | ignored. Always false.
[in] | vertexNumber | ignored
◆ reverseCurve()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbPolyline::reverseCurve  |  ( |   | )
virtual
Reverses the curve parameterization of this curve entity.
Returns
Acad::eOk if successful, error code otherwise
Reimplemented from AcDbCurve.
◆ saveAs()
 UX_EXPORT_FUNCTION void AcDbPolyline::saveAs  |  ( |  AcGiWorldDraw *  |  wd,
|  AcDb::SaveType  |  type
)
virtual
See also
AcDbCurve::saveAs(AcGiWorldDraw*, AcDb::SaveType)
Reimplemented from AcDbEntity.
◆ segType()
 UX_EXPORT_FUNCTION AcDbPolyline::SegType AcDbPolyline::segType  |  ( |  unsigned int  |  cardinal | ) |   const
Returns the type of the segment cardinal.
For a wrong index cardinal kCoincident will be returned.
Parameters
[in]
index of the vertex
Returns
segment type of the vertex
◆ setBulgeAt()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbPolyline::setBulgeAt  |  ( |  unsigned int  |  cardinal,
|  double  |  bulge
)
virtual
Sets new bulge value at the given vertex (cardinal).
Parameters
[in] | cardinal | of the vertex
[in] | bulge | value to be set at given vertex
Returns
Acad::eOk if successful,
 Acad::eInvalidIndex if cardinal is not valid for this polyline
◆ setClosed()
 UX_EXPORT_FUNCTION void AcDbPolyline::setClosed  |  ( |  Adesk::Boolean  |  bClosed | )
virtual
Sets the closed status of the polyline to bClosed.
Parameters
[in] | bClosed | Adesk::kTrue to indicate, that the polyine is closed, Adesk::kFalse for a non closed polyline.
◆ setConstantWidth()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbPolyline::setConstantWidth  |  ( |  double  |  width | )
virtual
Sets polyline's constant to a constant width of width.
Parameters
[in] | width | polyline's constant width
Returns
Acad::eOk if successful,
 Acad::eInvalidIndex if the width is negativ
◆ setElevation()
 UX_EXPORT_FUNCTION void AcDbPolyline::setElevation  |  ( |  double  |  elevation | )
virtual
Sets the elevation.
Parameters
[in] | elevation | elevation to set
◆ setFromAcGeCurve()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbPolyline::setFromAcGeCurve  |  ( |  const AcGeCurve3d &  |  geCurve,
|  AcGeVector3d *  |  dbCurve = NULL,
|  const AcGeTol &  |  tol = AcGeContext::gTol
)
virtual
Reimplemented from AcDbCurve.
◆ setNormal()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbPolyline::setNormal  |  ( |  const AcGeVector3d &  |  normalVec | )
virtual
Sets the normal vector.
Parameters
[in] | normalVec | The normal vector in WCS of the polyline.
Returns
error status
◆ setPlinegen()
 UX_EXPORT_FUNCTION void AcDbPolyline::setPlinegen  |  ( |  Adesk::Boolean  |  lineGen | )
Sets whether the linetype should run over vertices.
param[in] lineGen indicates whether the linetype should run over vertices
◆ setThickness()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbPolyline::setThickness  |  ( |  double  |  thickness | )
virtual
Sets the thickness for a polyline,.
Date
2007-07-02 laurentiuv CREATED
◆ setVertexIdentifierAt()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbPolyline::setVertexIdentifierAt  |  ( |  unsigned int  |  idx,
|  Adesk::Int32  |  ident
)
virtual
Assigns a unique identifier for the specified polyline vertex.
Parameters
[in] | idx | the polyline vertex index to assign the unique identifier
[in] | ident | identifier number for the vertex
Returns
Acad::eOk if successful - error code otherwise
◆ setWidthsAt()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbPolyline::setWidthsAt  |  ( |  unsigned int  |  cardinal,
|  double  |  startWidth,
|  double  |  endWidth
)
virtual
This function sets startWidth to be the start width and endWidth to be the end width for vertex index.
Date
2007-07-02 laurentiuv CREATED
◆ subExplode()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbPolyline::subExplode  |  ( |  AcDbVoidPtrArray &  |  pointerArray | ) |   const
protectedvirtual
Parameters
[in,out] | pointerArray | Array of pointers to existing and new entities
Returns
Acad::eOk if successful
Reimplemented from AcDbEntity.
◆ subGetGeomExtents()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbPolyline::subGetGeomExtents  |  ( |  AcDbExtents &  |  resultBox | ) |   const
protectedvirtual
Returns extents of this entity.
Parameters
[out] | extents | box of the entity
Returns
Acad::eOk if successful.
Remarks
for the calculation of extents the widths are ignored
Reimplemented from AcDbEntity.
◆ subGetGripPoints() [1/2]
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbPolyline::subGetGripPoints  |  ( |  AcDbGripDataPtrArray &  |  gripArray,
|  const double  |  sizeOfDrawingUnit,
|  const int  |  pixelSize,
|  const AcGeVector3d &  |  directionVector,
|  const int  |  gripBitmap
) |   |  const
protectedvirtual
See also
AcDbCurve::subGetGripPoints(AcDbGripDataPtrArray&, const double, const int, const AcGeVector3d&, const int)
Reimplemented from AcDbEntity.
◆ subGetGripPoints() [2/2]
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbPolyline::subGetGripPoints  |  ( |  AcGePoint3dArray &  |  pointArray,
|  AcDbIntArray &  |  snapSettingsArray,
|  AcDbIntArray &  |  idArray
) |   |  const
protectedvirtual
Reimplemented from AcDbEntity.
◆ subGetOsnapPoints()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbPolyline::subGetOsnapPoints  |  ( |  AcDb::OsnapMode  |  mode,
|  Adesk::GsMarker  |  subEntSelectMarker,
|  const AcGePoint3d &  |  pickedPnt,
|  const AcGePoint3d &  |  lastSelectedPnt,
|  const AcGeMatrix3d &  |  matrix,
|  AcGePoint3dArray &  |  snapIOArray,
|  AcDbIntArray &  |  idArray
) |   |  const
protectedvirtual
See also
AcDbCurve::getOsnapPoints(AcDb::OsnapMode, Adesk::GsMarker, const AcGePoint3d&, const AcGePoint3d&, const AcGeMatrix3d&, AcGePoint3dArray&, AcDbIntArray&)
Reimplemented from AcDbEntity.
◆ subGetStretchPoints()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbPolyline::subGetStretchPoints  |  ( |  AcGePoint3dArray &  |  pointArray | ) |   const
protectedvirtual
See also
AcDbCurve::subGetStretchPoints(AcGePoint3dArray&)
Reimplemented from AcDbEntity.
◆ subGetSubentPathsAtGsMarker()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbPolyline::subGetSubentPathsAtGsMarker  |  ( |  AcDb::SubentType  |  eSubentType,
|  Adesk::GsMarker  |  gsMarker,
|  const AcGePoint3d &  |  pntIn,
|  const AcGeMatrix3d &  |  transformationMatrix,
|  int &  |  pathCnt,
|  AcDbFullSubentPath *&  |  pSubentPathArr,
|  int  |  insCnt,
|  AcDbObjectId *  |  pContainerArray
) |   |  const
protectedvirtual
See also
AcDbCurve::getSubentPathsAtGsMarker(AcDb::SubentType, Adesk::GsMarker, const AcGePoint3d&, const AcGeMatrix3d&, int&, AcDbFullSubentPath*&, int, AcDbObjectId*)
Reimplemented from AcDbEntity.
◆ subGetTransformedCopy()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbPolyline::subGetTransformedCopy  |  ( |  const AcGeMatrix3d &  |  matrix,
|  AcDbEntity *&  |  resultEntity
) |   |  const
protectedvirtual
See also
AcDbCurve::getTransformedCopy(const AcGeMatrix3d&, AcDbEntity*&)
Reimplemented from AcDbEntity.
◆ subGripStatus()
 UX_EXPORT_FUNCTION void AcDbPolyline::subGripStatus  |  ( |  const AcDb::GripStat  |  value | )
protectedvirtual
See also
AcDbCurve::gripStatus(const AcDb::GripStat)
Reimplemented from AcDbEntity.
◆ subIntersectWith() [1/2]
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbPolyline::subIntersectWith  |  ( |  const AcDbEntity *  |  pEntity,
|  AcDb::Intersect  |  type,
|  AcGePoint3dArray &  |  pointArray,
|  Adesk::GsMarker  |  thisSubEntId = 0,
|  Adesk::GsMarker  |  inputSubEntId = 0
) |   |  const
protectedvirtual
See also
AcDbCurve::intersectWith(const AcDbEntity*, AcDb::Intersect, AcGePoint3dArray&, int, int)
Reimplemented from AcDbEntity.
◆ subIntersectWith() [2/2]
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbPolyline::subIntersectWith  |  ( |  const AcDbEntity *  |  pEntity,
|  AcDb::Intersect  |  type,
|  const AcGePlane &  |  plane,
|  AcGePoint3dArray &  |  pointArray,
|  Adesk::GsMarker  |  thisSubEntId = 0,
|  Adesk::GsMarker  |  inputSubEntId = 0
) |   |  const
protectedvirtual
See also
AcDbCurve::intersectWith(const AcDbEntity*, AcDb::Intersect, const AcGePlane&, AcGePoint3dArray&, int, int)
Reimplemented from AcDbEntity.
◆ subMoveGripPointsAt()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbPolyline::subMoveGripPointsAt  |  ( |  const AcDbIntArray &  |  indexArray,
|  const AcGeVector3d &  |  translationVector
)
protectedvirtual
See also
AcDbCurve::subMoveGripPointsAt(const AcDbIntArray&, const AcGeVector3d&)
Reimplemented from AcDbEntity.
◆ subMoveStretchPointsAt()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbPolyline::subMoveStretchPointsAt  |  ( |  const AcDbIntArray &  |  indexArray,
|  const AcGeVector3d &  |  translationVector
)
protectedvirtual
See also
AcDbCurve::subMoveStretchPointsAt(const AcDbIntArray&, const AcGeVector3d&)
Reimplemented from AcDbEntity.
◆ subSubentPtr()
 UX_EXPORT_FUNCTION AcDbEntity * AcDbPolyline::subSubentPtr  |  ( |  const AcDbFullSubentPath &  |  pathId | ) |   const
protectedvirtual
See also
AcDbCurve::subentPtr(const AcDbFullSubentPath&)
Reimplemented from AcDbEntity.
◆ subTransformBy()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbPolyline::subTransformBy  |  ( |  const AcGeMatrix3d &  |  matrix | )
protectedvirtual
Applies given transformation (matrix) to the entity.
Parameters
[in] | matrix | transformation matrix to be applied
Returns
Acad::eOk, if successful
 Acad::eCannotScaleNonUniformly, if the entity does not accept non uniform scaling
Remarks
Contrary to other CAD applications, no fit vertices may be generated while transforming polylines on BricsCAD.
Reimplemented from AcDbEntity.
◆ subViewportDraw()
 UX_EXPORT_FUNCTION void AcDbPolyline::subViewportDraw  |  ( |  AcGiViewportDraw *  |  pVd | )
protectedvirtual
Creates a viewport-dependent graphical representation of this object.
This function is called for every viewport, if the object's worldDraw returns false.
Parameters
[in] | pVd | pointer to initialized AcGiViewportDraw interface
Reimplemented from AcDbEntity.
◆ subWorldDraw()
 UX_EXPORT_FUNCTION Adesk::Boolean AcDbPolyline::subWorldDraw  |  ( |  AcGiWorldDraw *  |  pWd | )
protectedvirtual
Creates a viewport-independent graphical representation of the object.
Parameters
[in] | pWd | Pointer to initialized AcGiWorldDraw interface
Returns
if false, viewportDraw() must be called,
 if true, the graphical representation is viewport-independent
Reimplemented from AcDbEntity.
◆ thickness()
 UX_EXPORT_FUNCTION double AcDbPolyline::thickness  |  ( |   | ) |   const
Gets the thickness from a polyline,.
Date
2009-04-27 arturs added support for closed objects
 2007-07-02 laurentiuv CREATED
Member Data Documentation
◆ AcDbPolyline
 UX_EXPORT_FUNCTION AcDbPolyline::AcDbPolyline
Default constructor.
Constructor with parameter.
param[in] vertextNumber number of vertices, for which memory should be allocated