Public Member Functions | Static Public Member Functions | List of all members
AcDbAssocAction Class Reference
 Public Member Functions
 AcDbAssocAction  | AcDbAssocAction ()
Default constructor.
AcDbObjectId  | actionBody () const
Returns an object ID of the owned action instance. More...
 Acad::ErrorStatus  | addDependency (AcRxClass *, AcRxClass *, bool, bool, int, AcDbObjectId &)
Acad::ErrorStatus  | addDependency (const AcDbObjectId &, bool=true)
Adds a dependency for this action. More...
Acad::ErrorStatus  | addMoreObjectsToDeepClone (AcDbIdMapping &, AcDbObjectIdArray &) const
Tells to action being cloned to specify related objects that should be cloned because this action is cloned. More...
Acad::ErrorStatus  | addParam (const AcDbObjectId &, int &)
Creates and adds a new action parameter. More...
Acad::ErrorStatus  | addParam (const AcString &, AcRxClass *, AcDbObjectId &, int &)
Creates and adds a new action parameter. More...
 bool  | areDependenciesEqual (const AcDbAssocDependency *, const AcDbAssocDependency *) const
 bool  | areDependenciesOnTheSameThing (const AcDbAssocDependency *, const AcDbAssocDependency *) const
AcDbAssocEvaluationCallback *  | currentEvaluationCallback () const
Returns the current association evaluation callback set instance, or NULL if no action evaluation is in progress. More...
void  | dependentObjectCloned (const AcDbAssocDependency *, const AcDbObject *, const AcDbObject *)
Dependency notifies the owning action when dependent-on object has been cloned. More...
 void  | dragStatus (const AcDb::DragStat)
void  | evaluate (AcDbAssocEvaluationCallback *)
Evaluates this action. More...
Acad::ErrorStatus  | evaluateDependencies ()
This should be called from the client code evaluateOverride() method, after the dependecies were inspected from the client code. More...
void  | evaluateDependency (AcDbAssocDependency *)
Allows the owning action, instead of the dependency itself, to be performed. More...
AcDbAssocEvaluationPriority  | evaluationPriority () const
Returns the evaluation priority of this action. More...
Acad::ErrorStatus  | getDependencies (bool, bool, AcDbObjectIdArray &) const
Gets the dependencies of this action. More...
void  | getDependentActionsToEvaluate (AcDbActionsToEvaluateCallback *) const
Allows the action report on all other actions that need to be evaluated. More...
Acad::ErrorStatus  | getDependentObjects (bool, bool, AcDbObjectIdArray &) const
Gets an array of objects which this action depends on or modifies. More...
Acad::ErrorStatus  | getValueParam (const AcString &, AcDbEvalVariant &, AcString &, AcString &, int=0) const
Gets a value, expression and evaluatorIds of a given value action parameter. More...
 Acad::ErrorStatus  | getValueParamArray (const AcString &, AcArray< AcDbEvalVariant > &, AcArray< AcString > &, AcArray< AcString > &) const
 bool  | hasDependencyCachedValue (const AcDbAssocDependency *) const
bool  | isActionBodyAProxy () const
Returns true if action body is loaded as a proxy object. More...
bool  | isActionEvaluationInProgress () const
Checks whether the system is evaluating an action or a network of actions. More...
bool  | isEqualTo (const AcDbAssocAction *) const
Compares this action with the given action. More...
 bool  | isExternalDependency (const AcDbAssocDependency *) const
 bool  | isOwnedDependency (const AcDbAssocDependency *) const
 bool  | isRelevantDependencyChange (const AcDbAssocDependency *) const
 Acad::ErrorStatus  | notification (AcDbAssocNotificationData *)
AcDbObjectId  | objectThatOwnsNetworkInstance () const
Returns an ID of the object that owns the network that owns this action. More...
 Acad::ErrorStatus  | ownedDependencyStatusChanged (AcDbAssocDependency *, AcDbAssocStatus)
const AcDbObjectIdArray &  | ownedParams () const
Returns an array of the owned action parameters. More...
void  | ownedValueParamNames (AcArray< AcString > &) const
Returns all the names of all value action parameters. More...
AcDbObjectId  | owningNetwork () const
Returns the logically owning association network, or kNull if it is the topmost. More...
AcDbObjectId  | paramAtIndex (int) const
Gets the action parameter by location possition. More...
AcDbObjectId  | paramAtName (const AcString &, int=0) const
Gets the action parameter by name. More...
const AcDbObjectIdArray &  | paramsAtName (const AcString &) const
Returns an array of object IDs of the owned action parameters with specified name. More...
Acad::ErrorStatus  | postProcessAfterDeepClone (AcDbIdMapping &)
Informs the source actions of the cloning object so that they can update the clones or do other action if it is necessary. More...
Acad::ErrorStatus  | postProcessAfterDeepCloneCancel (AcDbIdMapping &)
Informs the source actions so that it can obtain its clone. More...
Acad::ErrorStatus  | removeAllDependencies (bool)
Clears all dependencies from this action. More...
Acad::ErrorStatus  | removeAllParams (bool)
This function removes and optionally erases all child action parameters. More...
Acad::ErrorStatus  | removeDependency (const AcDbObjectId &, bool)
Removes a dependency from this action. More...
Acad::ErrorStatus  | removeParam (const AcDbObjectId &, bool)
This function removes and optionally erases an action parameter. More...
Acad::ErrorStatus  | removeValueParam (const AcString &)
Removes the action parameter. More...
Acad::ErrorStatus  | scaleAllDistanceValueParams (double)
Scales all action parameters whose units represent distances. More...
Acad::ErrorStatus  | setActionBody (const AcDbObjectId &)
Sets the owned action instance using an object ID. More...
Acad::ErrorStatus  | setOwningNetwork (const AcDbObjectId &, bool)
Sets the logically owning association network. More...
Acad::ErrorStatus  | setStatus (AcDbAssocStatus, bool=true, bool=false)
Sets the status for this action. More...
Acad::ErrorStatus  | setValueParam (const AcString &, const AcDbEvalVariant &, const AcString &, const AcString &, AcString &, bool, int=0)
Sets a value, expression and evaluatorIds for a given value action parameter. More...
 Acad::ErrorStatus  | setValueParamArray (const AcString &, const AcArray< AcDbEvalVariant > &, const AcArray< AcString > &, const AcArray< AcString > &, AcArray< AcString > &, bool)
Acad::ErrorStatus  | setValueParamControlledObjectDep (const AcString &, const AcDbObjectId &)
Sets a value parameter control object. More...
Acad::ErrorStatus  | setValueParamUnitType (const AcString &, AcValue::UnitType)
Sets the action parameter unit type. More...
AcDbAssocStatus  | status () const
Returns the current status of this action. More...
Acad::ErrorStatus  | transformActionBy (const AcGeMatrix3d &)
Notifies the action that its owner is transformed. More...
Acad::ErrorStatus  | transformAllConstantGeometryParams (const AcGeMatrix3d &)
Applies the transformation matrix to all constant geometries in all owned associated parameters. More...
Acad::ErrorStatus  | updateAllObjectsControlledByValueParams () const
Updates all action parameters. More...
Acad::ErrorStatus  | updateValueParamControlledObject (const AcString &) const
Updates the associated value action parameter. More...
Acad::ErrorStatus  | updateValueParamFromControlledObject (const AcString &)
Updates the action parameter value from a given object name. More...
Acad::ErrorStatus  | valueParamInputVariables (const AcString &, AcDbObjectIdArray &) const
Gets the input variables associated with a specific value parameter. More...
AcValue::UnitType  | valueParamUnitType (const AcString &) const
Gets the action parameter unit type. More...
 Public Member Functions inherited from AcDbObject
virtual Acad::ErrorStatus  | addPersistentReactor (AcDbObjectId)
Adds a persistent reactor to this object reactor list. More...
Acad::ErrorStatus  | addReactor (AcDbObjectReactor *) const
Adds a transient reactor to this object. More...
virtual Acad::ErrorStatus  | applyPartialUndo (AcDbDwgFiler *, AcRxClass *)
This function is called during Undo operations on objects, that use the 'Partial Undo meachanism'; this is, this object is opened with assertWriteEnabled(Adesk::kFalse) to indicate that custom Undo filing is used rather than the default Undo filing. More...
 void  | assertNotifyEnabled () const
 void  | assertReadEnabled () const
 void  | assertWriteEnabled (Adesk::Boolean=Adesk::kTrue, Adesk::Boolean=Adesk::kTrue)
virtual Acad::ErrorStatus  | audit (AcDbAuditInfo *)
Performs the audit operation for this object. More...
Acad::ErrorStatus  | cancel ()
Reverts all changes since the object had been opened and closes the object. More...
virtual void  | cancelled (const AcDbObject *)
A handler function for persistent reactors. More...
virtual AcRxObject *  | clone () const
Creates a shallow clone of this object. More...
Acad::ErrorStatus  | close ()
Closes the object. More...
Acad::ErrorStatus  | closeAndPage (Adesk::Boolean=Adesk::kTrue)
Closes the object. More...
virtual Acad::ErrorStatus  | composeForLoad (AcDb::OdaSaveType, AcDb::AcDbDwgVersion)
This function is intended for future MT file loading support. More...
virtual void  | copied (const AcDbObject *, const AcDbObject *)
A handler function for persistent reactors. More...
virtual Acad::ErrorStatus  | copyFrom (const AcRxObject *)
Copies the pSrc object information in this object. More...
Acad::ErrorStatus  | createExtensionDictionary ()
Creates a dictionary as extension dictionary for this object. More...
AcDbDatabase *  | database () const
Returns the database that contains this object. More...
virtual Acad::ErrorStatus  | decomposeForSave (AcDb::AcDbDwgVersion, AcDbObject *&, AcDbObjectId &, Adesk::Boolean &)
This function is called during dwg and dxf output, to allow a custom object to decompose itself, due to provided dwg/dxf target file version. More...
virtual Acad::ErrorStatus  | deepClone (AcDbObject *, AcDbObject *&, AcDbIdMapping &, Adesk::Boolean=Adesk::kTrue) const final
Clones this object, appends it to the owner pOwner and adds an AcDbIdPair record to the idMap. More...
void  | disableUndoRecording (Adesk::Boolean)
Disables or enables the undo recording for the object. More...
Acad::ErrorStatus  | downgradeOpen ()
Sets the open mode for an object opened for write to be opened for read. More...
Acad::ErrorStatus  | downgradeToNotify (Adesk::Boolean)
Sets the open mode for an object opened for write to be opened for notify. More...
virtual AcGiDrawable *  | drawable ()
Retrieves the AcGiDrawable instance of this object. More...
Acad::ErrorStatus  | dwgIn (AcDbDwgFiler *)
Calls the object's dwgInFields function, and reads any XData if present. More...
virtual Acad::ErrorStatus  | dwgInFields (AcDbDwgFiler *)
Reads the object from the DWG filer. More...
Acad::ErrorStatus  | dwgOut (AcDbDwgFiler *) const
Calls the object's dwgOutFields function, and writes any XData if present. More...
virtual Acad::ErrorStatus  | dwgOutFields (AcDbDwgFiler *) const
Writes the object to the DWG filer. More...
Acad::ErrorStatus  | dxfIn (AcDbDxfFiler *)
Calls the object's dxfInFields function, and reads any XData if present. More...
virtual Acad::ErrorStatus  | dxfInFields (AcDbDxfFiler *)
Reads the object from the DXF filer. More...
Acad::ErrorStatus  | dxfOut (AcDbDxfFiler *, Adesk::Boolean, Adesk::uchar *) const
Calls the object's dxfOutFields function, and writes any XData if present. More...
virtual Acad::ErrorStatus  | dxfOutFields (AcDbDxfFiler *) const
Writes the object to the DXF filer. More...
Acad::ErrorStatus  | erase (Adesk::Boolean=Adesk::kTrue)
Sets the bit that indicates that the object is erased. More...
virtual void  | erased (const AcDbObject *, Adesk::Boolean)
A handler function for persistent reactors. More...
AcDbObjectId  | extensionDictionary () const
Returns the object id of the extension dictionary for this object. More...
void  | getAcDbHandle (AcDbHandle &) const
Returns handle of this object. More...
Acad::ErrorStatus  | getBinaryData (const ACHAR *, Adesk::Int32 &, char *&) const
Creates a copy of the binary data stored as chunks of maximum 127 bytes in the resbuf chain of this object's extension dictionary xrecord entry given by entryName. More...
int  | getBrxOpenCount () const
This function returns the number of open BRX instances for this object. More...
int  | getBrxOpenState () const
This function returns the BRX object open state flags as bitfields, for diagnostic purpose. More...
virtual Acad::ErrorStatus  | getClassID (CLSID *) const final
Gets the COM wrapper Class ID for this entity. More...
int  | getCustomObjectState () const
This function returns the custom object status : 1=isCustomObject 2=DifferentialUndoDisabled. More...
Acad::ErrorStatus  | getField (const ACHAR *, AcDbField *&, AcDb::OpenMode) const
Retrieves the specified Field from this object, and opens it in mode. More...
Acad::ErrorStatus  | getField (const ACHAR *, AcDbObjectId &) const
Gets the pszPropName field object from field dictionary of this AcDbObject object, using pszPropName as key. More...
AcDbObjectId  | getFieldDictionary () const
Returns the Field dictionary associated with this object,. More...
Acad::ErrorStatus  | getFieldDictionary (AcDbDictionary *&, AcDb::OpenMode) const
Gets and opens the field dictionary for this. More...
Acad::ErrorStatus  | getObjectBirthVersion (AcDb::AcDbDwgVersion &, AcDb::MaintenanceReleaseVersion &)
This function is currently not supported by the CAD engine, always returns Acad::eOk, and 'kDHL_CURRENT' + 'kMReleaseCurrent' results. More...
virtual Acad::ErrorStatus  | getObjectSaveVersion (const AcDbDwgFiler *, AcDb::AcDbDwgVersion &, AcDb::MaintenanceReleaseVersion &)
Returns the DWG version for saving the object. More...
virtual Acad::ErrorStatus  | getObjectSaveVersion (const AcDbDxfFiler *, AcDb::AcDbDwgVersion &, AcDb::MaintenanceReleaseVersion &)
Returns the DWG version for saving the object. More...
int  | getOdaOpenCount () const
This function returns the number of open ODA instances for this object. More...
int  | getOdaOpenState () const
This function returns the ODA object open state flags as bitfields, for diagnostic purpose. More...
virtual void  | goodbye (const AcDbObject *)
A handler function for persistent reactors. More...
Acad::ErrorStatus  | handOverTo (AcDbObject *, Adesk::Boolean=Adesk::kTrue, Adesk::Boolean=Adesk::kTrue)
Hands over objects identity to another object. More...
bool  | hasFields () const
Return true if this object has single or multiple fields associated with him. More...
bool  | hasPersistentReactor (AcDbObjectId) const
Checks the input objectId in this object reactor list. More...
bool  | hasSaveVersionOverride ()
This function indicates whether this object overrides the filer's save version. More...
virtual AcDbObjectId  | id () const
Returns the database id of this object. More...
Adesk::Boolean  | isAcDbObjectIdsInFlux () const
Checks whether a deep clone operation was completed. More...
Adesk::Boolean  | isAProxy () const
Adesk::Boolean  | isCancelling () const
Adesk::Boolean  | isErased () const
Returns whether this object is erased. More...
Adesk::Boolean  | isEraseStatusToggled () const
Checks whether the object erase status has been toggled. More...
Adesk::Boolean  | isModified () const
Returns whether this object's assertWriteEnabled() has been called since it was opened. More...
Adesk::Boolean  | isModifiedGraphics () const
Checks whether this object graphics will be updated when the object is closed. More...
Adesk::Boolean  | isModifiedXData () const
Checks whether this object's xData was modified. More...
Adesk::Boolean  | isNewObject () const
Returns true if and only if this object has not been closed since it was created. More...
Adesk::Boolean  | isNotifyEnabled () const
Returns whether this object is opened for notify. More...
Adesk::Boolean  | isNotifying () const
virtual Adesk::Boolean  | isPersistent () const
Returns the 'persistent' status of a database object. More...
Adesk::Boolean  | isReadEnabled () const
Returns whether this object is opened for read. More...
 Adesk::Boolean  | isReallyClosing () const
Checks whether the next close call will completely close this object return true if on the next call the object will be completely closed false otherwise.
Adesk::Boolean  | isTransactionResident () const
Gets the object transaction status. More...
Adesk::Boolean  | isUndoing () const
bool  | isUndoRecordingDisabled () const
Returns whether the undo recording for the object is enabled or not. More...
Adesk::Boolean  | isWriteEnabled () const
Returns whether this object is opened for write. More...
virtual AcDb::DuplicateRecordCloning  | mergeStyle () const
Returns the object's merge behavior during cloning. More...
virtual void  | modified (const AcDbObject *)
A handler function for persistent reactors. More...
virtual void  | modifiedGraphics (const AcDbEntity *)
A handler function for persistent reactors. More...
virtual void  | modifiedXData (const AcDbObject *)
A handler function for persistent reactors. More...
virtual void  | modifyUndone (const AcDbObject *)
A handler function for persistent reactors. More...
virtual void  | objectClosed (const AcDbObjectId)
A handler function for persistent reactors. More...
AcDbObjectId  | objectId () const
Returns object id. More...
virtual void  | openedForModify (const AcDbObject *)
A handler function for persistent reactors. More...
AcDbObjectId  | ownerId () const
Returns object id of the owner. More...
AcDbVoidPtrArray *  | reactors ()
Gets the object pointers to reactors. More...
const AcDbVoidPtrArray *  | reactors () const
Gets the object pointers to reactors. More...
virtual void  | reappended (const AcDbObject *)
A handler function for persistent reactors. More...
 virtual void  | recvPropagateModify (const AcDbObject *)
Not implemented yet.
Acad::ErrorStatus  | releaseExtensionDictionary ()
Removes the extension dictionary associated with this object. More...
virtual Acad::ErrorStatus  | removeField (AcDbObjectId)
Removes the Field specified by acFieldId from this object. More...
virtual Acad::ErrorStatus  | removeField (const ACHAR *)
Removes the Field specified by szKeyString from this object. More...
virtual Acad::ErrorStatus  | removeField (const ACHAR *, AcDbObjectId &)
Removes the Field specified by acPszKeyString from this object, and returns its ObjectId value. More...
virtual Acad::ErrorStatus  | removePersistentReactor (AcDbObjectId)
Removes a persistent reactor from this object reactor list. More...
Acad::ErrorStatus  | removeReactor (AcDbObjectReactor *) const
Removes a transient reactor to this object. More...
void  | setAcDbObjectIdsInFlux ()
Call this function to indicate that the object IDs of this object and its sub-objects (if any) are not yet valid. More...
Acad::ErrorStatus  | setBinaryData (const ACHAR *, Adesk::Int32, const char *)
Creates a copy of the binary data, divides it in up to 127 bytes binary chunks and
 sets them as resbufs in the resbuf chain of this object's extension dictionary xrecord entry given by entryName. More...
virtual Acad::ErrorStatus  | setField (const ACHAR *, AcDbField *, AcDbObjectId &)
Adds the pAcField field object to field dictionary of this AcDbObject object, using pKey as key. More...
void  | setHasSaveVersionOverride (bool)
This function can be called to specify that the object has a "save version override". More...
virtual Acad::ErrorStatus  | setOwnerId (AcDbObjectId)
Sets the ownerId data member of the object to be objId. More...
virtual Acad::ErrorStatus  | setXData (const resbuf *)
Sets/removes xData associated with this object. More...
virtual Acad::ErrorStatus  | subCancel ()
Possibility to veto a cancel operation from within custom entities. More...
virtual Acad::ErrorStatus  | subClose ()
virtual Acad::ErrorStatus  | subErase (Adesk::Boolean)
This hook is called during an AcDbObject::erase call, before any actual erase operation is performed. More...
 virtual Acad::ErrorStatus  | subHandOverTo (AcDbObject *)
virtual void  | subObjModified (const AcDbObject *, const AcDbObject *)
A handler function for persistent reactors. More...
 virtual Acad::ErrorStatus  | subOpen (AcDb::OpenMode)
virtual Acad::ErrorStatus  | subSwapIdWith (AcDbObjectId, Adesk::Boolean=Adesk::kFalse, Adesk::Boolean=Adesk::kFalse)
This hook is called during an AcDbObject::swapIdWith() call, before any actual swap operation is performed. More...
Acad::ErrorStatus  | swapIdWith (AcDbObjectId, Adesk::Boolean=Adesk::kFalse, Adesk::Boolean=Adesk::kFalse)
Swaps the object id's between the object identified by param swapId and this object. More...
virtual Acad::ErrorStatus  | swapReferences (const AcDbIdMapping &)
Not implemented yet. More...
virtual void  | unappended (const AcDbObject *)
A handler function for persistent reactors. More...
AcDbDwgFiler *  | undoFiler ()
Gets the undo filer for this object. More...
Acad::ErrorStatus  | upgradeFromNotify (Adesk::Boolean &)
Upgrades the open status of this object to AcDb::kForWrite, if this object is already open (either in AcDb::kForRead, AcDb::kForNotify or AcDb::kForWrite) More...
Acad::ErrorStatus  | upgradeOpen ()
Changes the objects open mode to AcDb::kForWrite and sends notifications. More...
virtual Acad::ErrorStatus  | wblockClone (AcRxObject *, AcDbObject *&, AcDbIdMapping &, Adesk::Boolean=Adesk::kTrue) const final
Clones this object, appends it to the owner pOwner and adds an AcDbIdPair record to the idMap. More...
virtual resbuf *  | xData (const ACHAR *=NULL) const
Returns the xData associated with this object. More...
Acad::ErrorStatus  | xDataTransformBy (const AcGeMatrix3d &)
Transforms the extended data according to parameter transformation matrix. More...
 virtual void  | xmitPropagateModify () const
Not implemented yet.
 virtual  | ~AcDbObject ()
Destructor.
 Public Member Functions inherited from AcGiDrawable
virtual bool  | bounds (AcDbExtents &) const
virtual DrawableType  | drawableType () const
 virtual AcGiDrawStream *  | drawStream () const
 AcGsNode *  | gsNode () const
virtual AcDbObjectId  | id () const =0
virtual Adesk::Boolean  | isPersistent () const =0
virtual Adesk::UInt32  | regenSupportFlags () const final
Returns whether and to which level this object supports MultiThreading. More...
 virtual Adesk::Boolean  | RolloverHit (Adesk::ULongPtr, Adesk::ULongPtr, Adesk::Boolean)
 virtual Adesk::UInt32  | setAttributes (AcGiDrawableTraits *) final
 virtual void  | setDrawStream (AcGiDrawStream *)
 void  | setGsNode (AcGsNode *)
 virtual void  | viewportDraw (AcGiViewportDraw *) final
 virtual Adesk::UInt32  | viewportDrawLogicalFlags (AcGiViewportDraw *) final
 virtual Adesk::Boolean  | worldDraw (AcGiWorldDraw *) final
 Public Member Functions inherited from AcRxObject
virtual AcRxObject *  | clone () const
Exported and implemented. More...
 virtual AcRx::Ordering  | comparedTo (const AcRxObject *) const
Exported and implemented.
virtual Acad::ErrorStatus  | copyFrom (const AcRxObject *)
Exported and implemented. More...
 virtual AcRxClass *  | isA () const
Exported and implemented.
virtual Adesk::Boolean  | isEqualTo (const AcRxObject *) const
Exported and implemented. More...
bool  | isKindOf (const AcRxClass *) const
Checks the object class. More...
AcRxObject *  | queryX (const AcRxClass *) const
returns the protocol extension object assigned to this class or a parent class. More...
AcRxObject *  | x (const AcRxClass *) const
returns the protocol extension object assigned to this class or a parent class. More...
 virtual  | ~AcRxObject ()
Destructor.
 Static Public Member Functions
static AcDbObjectId  | actionBody (const AcDbObjectId &)
Returns an object ID of a given object id owned action instance. More...
 static bool  | doesObjectHaveActiveActions (const AcDbObject *)
static Acad::ErrorStatus  | getActionsDependentOnObject (const AcDbObject *, bool, bool, AcDbObjectIdArray &)
Gets all actions depending on the given object. More...
 static Acad::ErrorStatus  | markDependentActionsToEvaluate (const AcDbObjectId &)
 static Acad::ErrorStatus  | removeActionsControllingObject (const AcDbObjectId &, int=0, const AcDbObjectId &=AcDbObjectId::kNull)
 Static Public Member Functions inherited from AcRxObject
 static AcRxObject *  | cast (const AcRxObject *)
 static AcRxClass *  | desc ()
Exported and implemented.
 Static Public Member Functions inherited from AcHeapOperators
 static void  | operator delete (void *)
_
 static void  | operator delete (void *, const char *, int)
 static void  | operator delete (void *, void *)
 static void  | operator delete[] (void *)
_
 static void  | operator delete[] (void *, const char *, int)
 static void *  | operator new (size_t)
_
 static void *  | operator new (size_t, const char *, int)
 static void *  | operator new (size_t, void *p)
 static void *  | operator new[] (size_t)
_
 static void *  | operator new[] (size_t, const char *, int)
 Additional Inherited Members
 Public Types inherited from AcGiDrawable
enum  | DrawableType {
 kGeometry = 0 , kDistantLight , kPointLight , kSpotLight ,
 kAmbientLight , kSolidBackground , kGradientBackground , kImageBackground ,
 kGroundPlaneBackground , kViewport
 }
enum  | SetAttributesFlags {
 kDrawableNone = 0 , kDrawableIsAnEntity = 1 , kDrawableUsesNesting = 2 , kDrawableIsCompoundObject = 4 ,
 kDrawableViewIndependentViewportDraw = 8 , kDrawableIsInvisible = 16 , kDrawableHasAttributes = 32 , kDrawableRegenTypeDependentGeometry = 64 ,
 kDrawableIsDimension = 133 , kDrawableRegenDraw = 256 , kDrawableStandardDisplaySingleLOD = 512 , kDrawableShadedDisplaySingleLOD = 1024 ,
 kDrawableViewDependentViewportDraw = 2048 , kDrawableBlockDependentViewportDraw = 4096 , kDrawableIsExternalReference = 8192 , kDrawableNotPlottable = 16384 ,
 kDrawableNotAllowLCS = 32768 , kDrawableMergeControlOff = 65536 , kThreadedWorldDrawViewportDraw = 131072
 }
 Protected Member Functions inherited from AcDbObject
virtual Acad::ErrorStatus  | subDeepClone (AcDbObject *, AcDbObject *&, AcDbIdMapping &, Adesk::Boolean=true) const
virtual Acad::ErrorStatus  | subGetClassID (CLSID *) const
virtual Adesk::UInt32  | subSetAttributes (AcGiDrawableTraits *)
Sets the values of this object's subentity traits and returns with the calling object's subentity traits. More...
virtual void  | subViewportDraw (AcGiViewportDraw *)
virtual Adesk::UInt32  | subViewportDrawLogicalFlags (AcGiViewportDraw *)
virtual Acad::ErrorStatus  | subWblockClone (AcRxObject *, AcDbObject *&, AcDbIdMapping &, Adesk::Boolean=true) const
virtual Adesk::Boolean  | subWorldDraw (AcGiWorldDraw *)
 Protected Member Functions inherited from AcGiDrawable
virtual Adesk::UInt32  | subRegenSupportFlags () const
Returns whether and to which level this object supports MultiThreading. More...
virtual Adesk::UInt32  | subSetAttributes (AcGiDrawableTraits *)=0
virtual void  | subViewportDraw (AcGiViewportDraw *)=0
 virtual Adesk::UInt32  | subViewportDrawLogicalFlags (AcGiViewportDraw *)
virtual Adesk::Boolean  | subWorldDraw (AcGiWorldDraw *)=0
 Protected Member Functions inherited from AcRxObject
AcRxObject ()
Exported and implemented.
Member Function Documentation
◆ actionBody() [1/2]
 UX_EXPORT_FUNCTION AcDbObjectId AcDbAssocAction::actionBody  |  ( |   | ) |   const
Returns an object ID of the owned action instance.
Returns
parameters object Id, NULL otherwise
◆ actionBody() [2/2]
 UX_EXPORT_FUNCTION AcDbObjectId AcDbAssocAction::actionBody  |  ( |  const AcDbObjectId &  |  idActionBody | )
static
Returns an object ID of a given object id owned action instance.
Parameters
[in] | idActionBody | - object id to evaluate
Returns
parameters object Id, NULL otherwise
◆ addDependency()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbAssocAction::addDependency  |  ( |  const AcDbObjectId &  |  idAssocDependency,
|  bool  |  setAsOwningAction = true
)
Adds a dependency for this action.
Parameters
[in] | idAssocDependency | - object id of the dependency to add.
[in] | setAsOwningAction | - tells to set this action as owning action of the dependency.
Returns
Acad::eOk for success, error status otherwise
◆ addMoreObjectsToDeepClone()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbAssocAction::addMoreObjectsToDeepClone  |  ( |  AcDbIdMapping &  |  mapId,
|  AcDbObjectIdArray &  |  idClonedObjects
) |   |  const
Tells to action being cloned to specify related objects that should be cloned because this action is cloned.
Parameters
[in] | mapId | - id mapping object of current cloning operation.
[out] | idClonedObjects | - array to return additional objects if any.
Returns
Acad::eOk for success, error status otherwise
◆ addParam() [1/2]
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbAssocAction::addParam  |  ( |  const AcDbObjectId &  |  idObject,
|  int &  |  objectIndex
)
Creates and adds a new action parameter.
param[in] idObject - object id of parameter object to add to action. param[out] objectIndex - returned index of added parameter.
Returns
Acad::eOk for success, error status otherwise
◆ addParam() [2/2]
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbAssocAction::addParam  |  ( |  const AcString &  |  nameParameter,
|  AcRxClass *  |  pClassParameter,
|  AcDbObjectId &  |  idObject,
|  int &  |  objectIndex
)
Creates and adds a new action parameter.
param[in] nameParameter - name for new parameter object. param[in] pClassParameter - RX class of new parameter object to create. param[out] idObject - returned object ID of created and added parameter. param[out] objectIndex - returned index of added parameter.
Returns
Acad::eOk for success, error status otherwise
◆ currentEvaluationCallback()
 UX_EXPORT_FUNCTION AcDbAssocEvaluationCallback * AcDbAssocAction::currentEvaluationCallback  |  ( |   | ) |   const
Returns the current association evaluation callback set instance, or NULL if no action evaluation is in progress.
Returns
AcDbAssocEvaluationCallback
◆ dependentObjectCloned()
 UX_EXPORT_FUNCTION void AcDbAssocAction::dependentObjectCloned  |  ( |  const AcDbAssocDependency *  |  pAssocDepend,
|  const AcDbObject *  |  pOriginal,
|  const AcDbObject *  |  pClone
)
Dependency notifies the owning action when dependent-on object has been cloned.
Class overriding this callback must call this base implementation in its implementation for proper working of deep clone operations. param[in] pAssocDepend - dependency attached to original object. param[in] pOriginal - original object. param[in] pClone - clone object.
Returns
void
◆ evaluate()
 UX_EXPORT_FUNCTION void AcDbAssocAction::evaluate  |  ( |  AcDbAssocEvaluationCallback *  |  pAssocEvaluate | )
Evaluates this action.
This method is called from client code to evaluate an action or an associative network. param[in] pAssocEvaluate - evaluation callback.
Returns
void
◆ evaluateDependencies()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbAssocAction::evaluateDependencies  |  ( |   | )
This should be called from the client code evaluateOverride() method, after the dependecies were inspected from the client code.
It gets all the dependencies of the action and evaluates those need to be evaluated ( isEvaluationRequest(pDep->status()) == true )
Returns
Acad::eOk for success, error status otherwise
◆ evaluateDependency()
 UX_EXPORT_FUNCTION void AcDbAssocAction::evaluateDependency  |  ( |  AcDbAssocDependency *  |  pAssocDepend | )
Allows the owning action, instead of the dependency itself, to be performed.
param[in] pAssocDepend - dependency to evaluate.
Returns
void
◆ evaluationPriority()
 UX_EXPORT_FUNCTION AcDbAssocEvaluationPriority AcDbAssocAction::evaluationPriority  |  ( |   | ) |   const
Returns the evaluation priority of this action.
Returns
if priority > 0 can be evaluated, no otherwise.
◆ getActionsDependentOnObject()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbAssocAction::getActionsDependentOnObject  |  ( |  const AcDbObject *  |  pIdObject,
|  bool  |  readWantedDependencies,
|  bool  |  setWantedDependencies,
|  AcDbObjectIdArray &  |  idDependencies
)
static
Gets all actions depending on the given object.
param[in] pIdObject - the querying object. param[in] readWantedDependencies - read dependencies wanted. param[in] setWantedDependencies - write dependencies wanted. param[out] idDependencies - array returned dependent objects.
Returns
Acad::eOk for success, error status otherwise
◆ getDependencies()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbAssocAction::getDependencies  |  ( |  bool  |  readWantedDependencies,
|  bool  |  setWantedDependencies,
|  AcDbObjectIdArray &  |  idDependencies
) |   |  const
Gets the dependencies of this action.
Parameters
[in] | readWantedDependencies | - read dependencies wanted.
[in] | setWantedDependencies | - write dependencies wanted.
[out] | idDependencies | - returned dependencies
Returns
Acad::eOk for success, error status otherwise
◆ getDependentActionsToEvaluate()
 UX_EXPORT_FUNCTION void AcDbAssocAction::getDependentActionsToEvaluate  |  ( |  AcDbActionsToEvaluateCallback *  |  pActionCallback | ) |   const
Allows the action report on all other actions that need to be evaluated.
param[in] pActionCallback - this action should specify other actions (and/or objects) that need to be evaluated.
Returns
void
◆ getDependentObjects()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbAssocAction::getDependentObjects  |  ( |  bool  |  readWantedDependencies,
|  bool  |  setWantedDependencies,
|  AcDbObjectIdArray &  |  idDependencies
) |   |  const
Gets an array of objects which this action depends on or modifies.
Parameters
[in] | readWantedDependencies | - read dependencies wanted.
[in] | setWantedDependencies | - write dependencies wanted.
[in] | idDependencies | - returned dependent objects.
Returns
Acad::eOk for success, error status otherwise
◆ getValueParam()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbAssocAction::getValueParam  |  ( |  const AcString &  |  nameParameter,
|  AcDbEvalVariant &  |  evalValue,
|  AcString &  |  nameExpresion,
|  AcString &  |  nameEvaluatorId,
|  int  |  evalIndex = 0
) |   |  const
Gets a value, expression and evaluatorIds of a given value action parameter.
param[in] nameParameter - name of the evaluated parameter. param[out] evalValue - will be filled with returning value. param[out] nameExpresion - will be filled with returning expressions. param[out] nameEvaluatorId - will be filled with evaluator id. param[in] evalIndex - value index
Returns
Acad::eOk for success, error status otherwise
◆ isActionBodyAProxy()
 UX_EXPORT_FUNCTION bool AcDbAssocAction::isActionBodyAProxy  |  ( |   | ) |   const
Returns true if action body is loaded as a proxy object.
Returns
true if is not evaluated, false otherwise
◆ isActionEvaluationInProgress()
 UX_EXPORT_FUNCTION bool AcDbAssocAction::isActionEvaluationInProgress  |  ( |   | ) |   const
Checks whether the system is evaluating an action or a network of actions.
Returns
true if succeded, false otherwise
◆ isEqualTo()
 UX_EXPORT_FUNCTION bool AcDbAssocAction::isEqualTo  |  ( |  const AcDbAssocAction *  |  pAssoc | ) |   const
Compares this action with the given action.
Returns
true if and only if they are equal.
◆ objectThatOwnsNetworkInstance()
 UX_EXPORT_FUNCTION AcDbObjectId AcDbAssocAction::objectThatOwnsNetworkInstance  |  ( |   | ) |   const
Returns an ID of the object that owns the network that owns this action.
Returns
parameters object Id, NULL otherwise
◆ ownedParams()
 UX_EXPORT_FUNCTION const AcDbObjectIdArray & AcDbAssocAction::ownedParams  |  ( |   | ) |   const
Returns an array of the owned action parameters.
Returns
array of parameters object Ids, NULL otherwise
◆ ownedValueParamNames()
 UX_EXPORT_FUNCTION void AcDbAssocAction::ownedValueParamNames  |  ( |  AcArray< AcString > &  |  nameParameters | ) |   const
Returns all the names of all value action parameters.
param[out] nameParameters - string array to fill with names.
Returns
Acad::eOk for success, error status otherwise
◆ owningNetwork()
 UX_EXPORT_FUNCTION AcDbObjectId AcDbAssocAction::owningNetwork  |  ( |   | ) |   const
Returns the logically owning association network, or kNull if it is the topmost.
Returns
parameters object Id, NULL otherwise
◆ paramAtIndex()
 UX_EXPORT_FUNCTION AcDbObjectId AcDbAssocAction::paramAtIndex  |  ( |  int  |  location | ) |   const
Gets the action parameter by location possition.
Parameters
[in] | location | - index of parameter object to return.
Returns
parameters object Id, NULL otherwise
◆ paramAtName()
 UX_EXPORT_FUNCTION AcDbObjectId AcDbAssocAction::paramAtName  |  ( |  const AcString &  |  nameParameter,
|  int  |  location = 0
) |   |  const
Gets the action parameter by name.
Parameters
[in] | nameParameter | - name of parameter object to return.
[in] | location | - index of parameter object to return.
Returns
parameters object Id, NULL otherwise
◆ paramsAtName()
 UX_EXPORT_FUNCTION const AcDbObjectIdArray & AcDbAssocAction::paramsAtName  |  ( |  const AcString &  |  nameParameter | ) |   const
Returns an array of object IDs of the owned action parameters with specified name.
Parameters
[in] | nameParameter | - name of parameters to return
Returns
array of parameters object Ids, NULL otherwise
◆ postProcessAfterDeepClone()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbAssocAction::postProcessAfterDeepClone  |  ( |  AcDbIdMapping &  |  mapId | )
Informs the source actions of the cloning object so that they can update the clones or do other action if it is necessary.
This method is called at the end of database cloning operation.
Parameters
[in] | mapId | - id mapping object of current cloning operation.
Returns
Acad::eOk for success, error status otherwise
◆ postProcessAfterDeepCloneCancel()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbAssocAction::postProcessAfterDeepCloneCancel  |  ( |  AcDbIdMapping &  |  mapId | )
Informs the source actions so that it can obtain its clone.
This method is called at the end of database cloning operation.
Parameters
[in] | mapId | - id mapping object of current cloning operation.
Returns
Acad::eOk for success, error status otherwise
◆ removeAllDependencies()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbAssocAction::removeAllDependencies  |  ( |  bool  |  eraseAll | )
Clears all dependencies from this action.
Parameters
[in] | eraseAll | - tells to erase/removed dependencies from database.
Returns
Acad::eOk for success, error status otherwise
◆ removeAllParams()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbAssocAction::removeAllParams  |  ( |  bool  |  eraseAll | )
This function removes and optionally erases all child action parameters.
param[in] eraseAll - tells to erase removed parameters.
Returns
Acad::eOk for success, error status otherwise
◆ removeDependency()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbAssocAction::removeDependency  |  ( |  const AcDbObjectId &  |  idAssocDependency,
|  bool  |  eraseParent
)
Removes a dependency from this action.
Parameters
[in] | idAssocDependency | - object id of the dependency to remove.
[in] | eraseParent | - tells to erase the dependency from database.
Returns
Acad::eOk for success, error status otherwise
◆ removeParam()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbAssocAction::removeParam  |  ( |  const AcDbObjectId &  |  idObject,
|  bool  |  eraseAll
)
This function removes and optionally erases an action parameter.
param[in] idObject - object id of parameter to remove. param[in] eraseAll - tells to erase removed parameter.
Returns
Acad::eOk for success, error status otherwise
◆ removeValueParam()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbAssocAction::removeValueParam  |  ( |  const AcString &  |  nameParameter | )
Removes the action parameter.
param[in] nameParameter - name of parameter object to remove.
Returns
Acad::eOk for success, error status otherwise
◆ scaleAllDistanceValueParams()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbAssocAction::scaleAllDistanceValueParams  |  ( |  double  |  scale | )
Scales all action parameters whose units represent distances.
param[in] scale - to apply.
Returns
Acad::eOk for success, error status otherwise
◆ setActionBody()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbAssocAction::setActionBody  |  ( |  const AcDbObjectId &  |  pAssocObj | )
Sets the owned action instance using an object ID.
Parameters
[in] | pAssocObj | - object id to set
Returns
Acad::eOk for success, error status otherwise
◆ setOwningNetwork()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbAssocAction::setOwningNetwork  |  ( |  const AcDbObjectId &  |  pAssocObj,
|  bool  |  setDatabaseOwner
)
Sets the logically owning association network.
Parameters
[in] | pAssocObj | - object id to set as logical owner of the action.
[in] | setDatabaseOwner | - if true then networkId will be set also as database owner of the action.
Returns
Acad::eOk for success, error status otherwise
◆ setStatus()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbAssocAction::setStatus  |  ( |  AcDbAssocStatus  |  assocStats,
|  bool  |  notifyOwner = true,
|  bool  |  setOwner = false
)
Sets the status for this action.
Parameters
[in] | assocStats | - status to set.
[in] | notifyOwner | - tels to call owning network's ownedActionStatusChanged.
[in] | setOwner | - tels to set the same status to owned actions.
Returns
Acad::eOk for success, error status otherwise
◆ setValueParam()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbAssocAction::setValueParam  |  ( |  const AcString &  |  nameParameter,
|  const AcDbEvalVariant &  |  evalValue,
|  const AcString &  |  nameExpresion,
|  const AcString &  |  nameEvaluatorId,
|  AcString &  |  error,
|  bool  |  silent,
|  int  |  evalIndex = 0
)
Sets a value, expression and evaluatorIds for a given value action parameter.
param[in] nameParameter - name of parameter object to return. param[in] evalValue - to set. param[in] nameExpresion - to set. param[in] nameEvaluatorId - to set. param[out] error - returned in case of error. param[in] silent - true/false to display error message in case of error param[in] evalIndex - value index.
Returns
Acad::eOk for success, error status otherwise
◆ setValueParamControlledObjectDep()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbAssocAction::setValueParamControlledObjectDep  |  ( |  const AcString &  |  nameParameter,
|  const AcDbObjectId &  |  idObject
)
Sets a value parameter control object.
param[in] nameParameter - name of action parameter object. param[out] idObject - dependency object ids to set.
Returns
Acad::eOk for success, error status otherwise
◆ setValueParamUnitType()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbAssocAction::setValueParamUnitType  |  ( |  const AcString &  |  nameParameter,
|  AcValue::UnitType  |  valueType
)
Sets the action parameter unit type.
param[in] nameParameter - name of parameter object to return. param[in] valueType - to set.
Returns
Acad::eOk for success, error status otherwise
◆ status()
 UX_EXPORT_FUNCTION AcDbAssocStatus AcDbAssocAction::status  |  ( |   | ) |   const
Returns the current status of this action.
Returns
AcDbAssocStatus
◆ transformActionBy()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbAssocAction::transformActionBy  |  ( |  const AcGeMatrix3d &  |  transformMatrix | )
Notifies the action that its owner is transformed.
For example, all entities in the block owning the network that owns the action are transformed. param[in] transformMatrix - matrix that was used to transform
Returns
Acad::eOk for success, error status otherwise
◆ transformAllConstantGeometryParams()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbAssocAction::transformAllConstantGeometryParams  |  ( |  const AcGeMatrix3d &  |  changeGeometrics | )
Applies the transformation matrix to all constant geometries in all owned associated parameters.
param[in] changeGeometrics - the transformation matrix to apply.
Returns
Acad::eOk for success, error status otherwise
◆ updateAllObjectsControlledByValueParams()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbAssocAction::updateAllObjectsControlledByValueParams  |  ( |   | ) |   const
Updates all action parameters.
Returns
Acad::eOk for success, error status otherwise
◆ updateValueParamControlledObject()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbAssocAction::updateValueParamControlledObject  |  ( |  const AcString &  |  nameParameter | ) |   const
Updates the associated value action parameter.
param[in] nameParameter - name of action parameter object.
Returns
Acad::eOk for success, error status otherwise
◆ updateValueParamFromControlledObject()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbAssocAction::updateValueParamFromControlledObject  |  ( |  const AcString &  |  nameParameter | )
Updates the action parameter value from a given object name.
param[in] nameParameter - name of action parameter object.
Returns
Acad::eOk for success, error status otherwise
◆ valueParamInputVariables()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbAssocAction::valueParamInputVariables  |  ( |  const AcString &  |  nameParameter,
|  AcDbObjectIdArray &  |  idParameters
) |   |  const
Gets the input variables associated with a specific value parameter.
param[in] nameParameter - name of action parameter object. param[out] idParameters - array of returned variable object ids.
Returns
Acad::eOk for success, error status otherwise
◆ valueParamUnitType()
 UX_EXPORT_FUNCTION AcValue::UnitType AcDbAssocAction::valueParamUnitType  |  ( |  const AcString &  |  nameParameter | ) |   const
Gets the action parameter unit type.
Parameters
[in] | nameParameter | - name of parameter object to return.
Returns
parameters UnitType value