Public Types | Public Member Functions | Public Attributes | Protected Member Functions | List of all members
AcDbLeader Class Reference
_ More...
#include <AcDbLeader.h>
 Public Types
enum  | AnnoType { kMText = 0 , kFcf , kBlockRef , kNoAnno }
 Public Types inherited from AcDbEntity
enum  | VisualStyleType { kFullVisualStyle = 0 , kFaceVisualStyle = 1 , kEdgeVisualStyle = 2 }
 Public Types inherited from AcGiDrawable
enum  | DrawableType {
 kGeometry = 0 , kDistantLight , kPointLight , kSpotLight ,
 kAmbientLight , kSolidBackground , kGradientBackground , kImageBackground ,
 kGroundPlaneBackground , kViewport
 }
enum  | SetAttributesFlags {
 kDrawableNone = 0 , kDrawableIsAnEntity = 1 , kDrawableUsesNesting = 2 , kDrawableIsCompoundObject = 4 ,
 kDrawableViewIndependentViewportDraw = 8 , kDrawableIsInvisible = 16 , kDrawableHasAttributes = 32 , kDrawableRegenTypeDependentGeometry = 64 ,
 kDrawableIsDimension = 133 , kDrawableRegenDraw = 256 , kDrawableStandardDisplaySingleLOD = 512 , kDrawableShadedDisplaySingleLOD = 1024 ,
 kDrawableViewDependentViewportDraw = 2048 , kDrawableBlockDependentViewportDraw = 4096 , kDrawableIsExternalReference = 8192 , kDrawableNotPlottable = 16384 ,
 kDrawableNotAllowLCS = 32768 , kDrawableMergeControlOff = 65536 , kThreadedWorldDrawViewportDraw = 131072
 }
 Public Member Functions
double  | annoHeight () const
Returns the height of the actual annotation object, attached to this AcDbLeader. More...
virtual AcDbObjectId  | annotationObjId () const
Returns the object id of the annotation object associated with this AcDbLeader entity. More...
virtual AcGeVector3d  | annotationOffset () const
Returns the annotation offset of the current AcDbLeader entity. More...
AnnoType  | annoType () const
Gets this object's annotation type. More...
double  | annoWidth () const
Returns the width of the actual annotation object, attached to this AcDbLeader. More...
virtual Adesk::Boolean  | appendVertex (const AcGePoint3d &)
Appends the vertex point to the end of vertex list of this leader. More...
virtual DBCURVE_METHODS Acad::ErrorStatus  | attachAnnotation (const AcDbObjectId &)
Sets the annotation object for the current AcDbLeader entity. More...
virtual void  | copied (const AcDbObject *, const AcDbObject *)
virtual Acad::ErrorStatus  | detachAnnotation ()
Removes this entity from the persistent reactor list and sets the annotation object id to NULL. More...
virtual double  | dimasz () const
Returns the value of DIMASZ for the current leader. More...
virtual AcCmColor  | dimclrd () const
Gets the DIMCLRD dimension variable for this. More...
virtual AcDbHardPointerId  | dimensionStyle () const
Returns the object id of the dimension style object associated with this entity. More...
virtual double  | dimgap () const
Gets the DIMGAP dimension variable for this. More...
virtual AcDbObjectId  | dimldrblk () const
Gets the DIMLDRBLK dimension variable for this. More...
virtual AcDb::LineWeight  | dimlwd () const
Gets the DIMLWD dimension variable for this. More...
virtual bool  | dimsah () const
Gets the DIMSAH dimension variable for this. More...
virtual double  | dimscale () const
Gets the DIMSCALE dimension variable for this. More...
virtual int  | dimtad () const
Returns the value of DIMTAD for the current leader. More...
virtual AcDbObjectId  | dimtxsty () const
Gets the DIMTXSTY dimension variable for this. More...
virtual double  | dimtxt () const
Gets the DIMTXT dimension variable for this. More...
 virtual void  | disableArrowHead ()
Disable the leader arrowhead.
 virtual void  | enableArrowHead ()
Enable the leader arrowhead.
virtual void  | erased (const AcDbObject *, Adesk::Boolean)
virtual Acad::ErrorStatus  | evaluateLeader ()
Evaluate the leader in regard to the associated annotation. More...
virtual AcGePoint3d  | firstVertex () const
Get the first vertex of the leader. More...
Acad::ErrorStatus  | getDimstyleData (AcDbDimStyleTableRecord *&) const
Fetches the dimension style information of this entity. More...
virtual void  | goodbye (const AcDbObject *)
virtual Adesk::Boolean  | hasArrowHead () const
Check if the arrowhead is enabled for the leader object. More...
virtual Adesk::Boolean  | hasHookLine () const
Check whether the leader uses hook line. More...
virtual Adesk::Boolean  | isSplined () const
Check if the leader uses splined lines. More...
virtual AcGePoint3d  | lastVertex () const
Get the last vertex of the leader object. More...
virtual void  | modified (const AcDbObject *)
UX_EXPORT_FUNCTION. More...
virtual AcGeVector3d  | normal () const
Get the normal vector of the leader object. More...
virtual int  | numVertices () const
Returns the number of vertices for this leader. More...
 virtual void  | removeLastVertex ()
Removes leader's last vertex.
virtual Acad::ErrorStatus  | setAnnotationOffset (const AcGeVector3d &)
Sets the annotation offset. More...
virtual Acad::ErrorStatus  | setColorIndex (Adesk::UInt16, Adesk::Boolean=Adesk::kTrue)
virtual Acad::ErrorStatus  | setDimasz (double)
Overrides the value of DIMASZ for the current leader to value. More...
virtual Acad::ErrorStatus  | setDimclrd (AcCmColor &)
Sets the DIMCLRD dimension variable. More...
virtual void  | setDimensionStyle (const AcDbHardPointerId &)
Sets the current leader to use the DimensionStyle represented by id and all the dimension variables overrides associated with it. More...
virtual Acad::ErrorStatus  | setDimgap (double)
Sets the DIMGAP dimension variable. More...
virtual Acad::ErrorStatus  | setDimldrblk (AcDbObjectId)
Sets the DIMLDRBLK dimension variable. More...
virtual Acad::ErrorStatus  | setDimldrblk (const ACHAR *)
Sets the DIMLDRBLK dimension variable. More...
virtual Acad::ErrorStatus  | setDimlwd (AcDb::LineWeight)
Sets the DIMLWD dimension variable. More...
virtual Acad::ErrorStatus  | setDimsah (bool)
Sets the DIMSAH dimension variable. More...
virtual Acad::ErrorStatus  | setDimscale (double)
Sets the DIMSCALE dimension variable. More...
Acad::ErrorStatus  | setDimstyleData (AcDbDimStyleTableRecord *)
Sets the dimension style information for this entity. More...
Acad::ErrorStatus  | setDimstyleData (AcDbObjectId)
Sets the dimension style information for this entity. More...
virtual Acad::ErrorStatus  | setDimtad (int)
Overrides the value of DIMTAD for the current leader to value. More...
virtual Acad::ErrorStatus  | setDimtxsty (AcDbObjectId)
Sets the DIMTXSTY dimension variable. More...
virtual Acad::ErrorStatus  | setDimtxt (double)
Sets the DIMTXT dimension variable. More...
 virtual void  | setDimVars ()
Sets the dimension variables to the database default.
virtual void  | setPlane (const AcGePlane &)
Sets the plane. More...
 virtual void  | setToSplineLeader ()
Sets the leader lines to be splined.
 virtual void  | setToStraightLeader ()
Sets the leader segments to be straight.
virtual Adesk::Boolean  | setVertexAt (int, const AcGePoint3d &)
Sets the vertex point at given index. More...
virtual AcGePoint3d  | vertexAt (int) const
Returns the vertex point at given index. More...
~AcDbLeader ()
Default destructor.
 Public Member Functions inherited from AcDbCurve
virtual Acad::ErrorStatus  | extend (Adesk::Boolean, const AcGePoint3d &)
virtual Acad::ErrorStatus  | extend (double)
 virtual Acad::ErrorStatus  | getAcGeCurve (AcGeCurve3d *&, const AcGeTol &=AcGeContext::gTol) const
virtual Acad::ErrorStatus  | getArea (double &) const
virtual Acad::ErrorStatus  | getClosestPointTo (const AcGePoint3d &, AcGePoint3d &, Adesk::Boolean=Adesk::kFalse) const
virtual Acad::ErrorStatus  | getClosestPointTo (const AcGePoint3d &, const AcGeVector3d &, AcGePoint3d &, Adesk::Boolean=Adesk::kFalse) const
virtual Acad::ErrorStatus  | getDistAtParam (double, double &) const
Gets the length of the curve from its start point to the one given by value. More...
virtual Acad::ErrorStatus  | getDistAtPoint (const AcGePoint3d &, double &) const
Gets the lenght of the curve measured from the start point of the curve to the param ptOnCurve. More...
virtual Acad::ErrorStatus  | getEndParam (double &) const
Gets this curve end parameter. More...
virtual Acad::ErrorStatus  | getEndPoint (AcGePoint3d &) const
Set the passed point to end point of the curve, if successful. More...
virtual Acad::ErrorStatus  | getFirstDeriv (const AcGePoint3d &, AcGeVector3d &) const
Gets the first derivative of the curve at the specified point. More...
virtual Acad::ErrorStatus  | getFirstDeriv (double, AcGeVector3d &) const
Gets the first derivative of the curve at the point with curve parameter of value. More...
virtual Acad::ErrorStatus  | getOffsetCurves (double, AcDbVoidPtrArray &) const
virtual Acad::ErrorStatus  | getOffsetCurvesGivenPlaneNormal (const AcGeVector3d &, double, AcDbVoidPtrArray &) const
virtual Acad::ErrorStatus  | getOrthoProjectedCurve (const AcGePlane &, AcDbCurve *&) const
virtual Acad::ErrorStatus  | getParamAtDist (double, double &) const
Gets the parameter of the curve at a point located along the curve at a distance of length from its start point. More...
virtual Acad::ErrorStatus  | getParamAtPoint (const AcGePoint3d &, double &) const
Gets the parameter of the specified point. More...
virtual Acad::ErrorStatus  | getPointAtDist (double, AcGePoint3d &) const
Gets the point on this curve at the distance lenght measured from the start point. More...
virtual Acad::ErrorStatus  | getPointAtParam (double, AcGePoint3d &) const
Gets the point on the curve specified by the passed in param. More...
virtual Acad::ErrorStatus  | getProjectedCurve (const AcGePlane &, const AcGeVector3d &, AcDbCurve *&) const
virtual Acad::ErrorStatus  | getSecondDeriv (const AcGePoint3d &, AcGeVector3d &) const
virtual Acad::ErrorStatus  | getSecondDeriv (double, AcGeVector3d &) const
 virtual Acad::ErrorStatus  | getSpline (AcDbSpline *&) const
virtual Acad::ErrorStatus  | getSplitCurves (const AcGeDoubleArray &, AcDbVoidPtrArray &) const
virtual Acad::ErrorStatus  | getSplitCurves (const AcGePoint3dArray &, AcDbVoidPtrArray &) const
virtual Acad::ErrorStatus  | getStartParam (double &) const
Gets this curve start parameter. More...
virtual Acad::ErrorStatus  | getStartPoint (AcGePoint3d &) const
Set the passed point to start point of the curve, if successful. More...
virtual Adesk::Boolean  | isClosed () const
Returns whether this curve entity is closed. More...
virtual Adesk::Boolean  | isPeriodic () const
Returns whether this curve entity is periodic. More...
virtual Acad::ErrorStatus  | reverseCurve ()
 virtual Acad::ErrorStatus  | setFromAcGeCurve (const AcGeCurve3d &, AcGeVector3d *=NULL, const AcGeTol &=AcGeContext::gTol)
 virtual  | ~AcDbCurve ()
Destructor.
 Public Member Functions inherited from AcDbEntity
 virtual Acad::ErrorStatus  | addSubentPaths (const AcDbFullSubentPathArray &) final
virtual Acad::ErrorStatus  | applyPartialUndo (AcDbDwgFiler *, AcRxClass *)
virtual Acad::ErrorStatus  | audit (AcDbAuditInfo *)
AcDbObjectId  | blockId () const
Returns the Object ID of the BlockTableRecord that owns this entity. More...
Acad::ErrorStatus  | boundingBoxIntersectWith (const AcDbEntity *, AcDb::Intersect, AcGePoint3dArray &, Adesk::GsMarker, Adesk::GsMarker) const
Finds the intersection between the edges of the bounding box for this entity and the pOhter entity. More...
Acad::ErrorStatus  | boundingBoxIntersectWith (const AcDbEntity *, AcDb::Intersect, const AcGePlane &, AcGePoint3dArray &, Adesk::GsMarker, Adesk::GsMarker) const
First, the function projects the other entity and the bounding box of this entity on plane specified by plane. More...
virtual bool  | bounds (AcDbExtents &) const
Returns the extents of this entity as AcDbExtents. More...
virtual bool  | castShadows () const
Checks if this entity is able to cast shadows. More...
virtual Adesk::Boolean  | cloneMeForDragging () final
Checks if a clone will be created for this entity in case of a drag operation. More...
 virtual AcDb::CollisionType  | collisionType () const
AcCmColor  | color () const
Returns the true color information of the entity. More...
Adesk::UInt16  | colorIndex () const
Returns the color number in a range from 0 to 256. More...
 virtual Acad::ErrorStatus  | deleteSubentPaths (const AcDbFullSubentPathArray &) final
virtual void  | dragStatus (const AcDb::DragStat)
Acad::ErrorStatus  | draw ()
Draws or redraws the entity on screen. More...
virtual AcGiDrawable *  | drawable ()
virtual Acad::ErrorStatus  | dwgInFields (AcDbDwgFiler *)
virtual Acad::ErrorStatus  | dwgOutFields (AcDbDwgFiler *) const
virtual Acad::ErrorStatus  | dxfInFields (AcDbDxfFiler *)
virtual Acad::ErrorStatus  | dxfOutFields (AcDbDxfFiler *) const
AcCmEntityColor  | entityColor () const
Returns the lightweight color information of the entity. More...
virtual Acad::ErrorStatus  | explode (AcDbVoidPtrArray &) const final
virtual Acad::ErrorStatus  | getCompoundObjectTransform (AcGeMatrix3d &) const final
It is used for object without geometry like AcDbMleader. More...
virtual void  | getEcs (AcGeMatrix3d &) const
Returns the transformation matrix from OCS (Object Coordinate System) to WCS (World Coordinate System). More...
virtual Acad::ErrorStatus  | getGeomExtents (AcDbExtents &) const final
Returns extents of this entity. More...
 virtual Acad::ErrorStatus  | getGripEntityUCS (const void *, AcGeVector3d &, AcGePoint3d &, AcGeVector3d &) const final
 virtual Acad::ErrorStatus  | getGripPoints (AcDbGripDataPtrArray &, const double, const int, const AcGeVector3d &, const int) const final
virtual Acad::ErrorStatus  | getGripPoints (AcGePoint3dArray &, AcDbIntArray &, AcDbIntArray &) const final
Append grip points to the specified array. More...
 virtual Acad::ErrorStatus  | getGripPointsAtSubentPath (const AcDbFullSubentPath &, AcDbGripDataPtrArray &, const double, const int, const AcGeVector3d &, const int) const final
virtual Acad::ErrorStatus  | getGsMarkersAtSubentPath (const AcDbFullSubentPath &, AcArray< Adesk::GsMarker > &) const final
virtual Acad::ErrorStatus  | getMaterialMapper (AcGiMapper &) const
virtual Acad::ErrorStatus  | getOsnapPoints (AcDb::OsnapMode, Adesk::GsMarker, const AcGePoint3d &, const AcGePoint3d &, const AcGeMatrix3d &, AcGePoint3dArray &, AcDbIntArray &) const final
Gets the entity osnap points. More...
virtual Acad::ErrorStatus  | getOsnapPoints (AcDb::OsnapMode, Adesk::GsMarker, const AcGePoint3d &, const AcGePoint3d &, const AcGeMatrix3d &, AcGePoint3dArray &, AcDbIntArray &, const AcGeMatrix3d &) const final
Gets the entity osnap points. More...
virtual Acad::ErrorStatus  | getPlane (AcGePlane &, AcDb::Planarity &) const
Returns the plane that contains this entity. More...
AcDb::PlotStyleNameType  | getPlotStyleNameId (AcDbObjectId &) const
Returns the plot style name type and its associated id. More...
virtual Acad::ErrorStatus  | getStretchPoints (AcGePoint3dArray &) const final
Append stretch points to the specified array. More...
 virtual Acad::ErrorStatus  | getSubentClassId (const AcDbFullSubentPath &, CLSID *) const final
 virtual Acad::ErrorStatus  | getSubentPathGeomExtents (const AcDbFullSubentPath &, AcDbExtents &) const final
virtual Acad::ErrorStatus  | getSubentPathsAtGsMarker (AcDb::SubentType, Adesk::GsMarker, const AcGePoint3d &, const AcGeMatrix3d &, int &, AcDbFullSubentPath *&, int=0, AcDbObjectId *=NULL) const final
Gets the subentity paths appropriate for the passed in gs marker. More...
virtual Acad::ErrorStatus  | getTransformedCopy (const AcGeMatrix3d &, AcDbEntity *&) const final
Creates a copy of the current entity applying the transformation matrix. More...
 virtual void  | gripStatus (const AcDb::GripStat) final
 virtual bool  | hideMeForDragging () const final
virtual Acad::ErrorStatus  | highlight (const AcDbFullSubentPath &=kNullSubent, const Adesk::Boolean=Adesk::kFalse) const final
Highlights part of, or entire entity. More...
virtual Acad::ErrorStatus  | intersectWith (const AcDbEntity *, AcDb::Intersect, AcGePoint3dArray &, Adesk::GsMarker=0, Adesk::GsMarker=0) const final
Finds the intersection between this entity and the pOhter entity. More...
virtual Acad::ErrorStatus  | intersectWith (const AcDbEntity *, AcDb::Intersect, const AcGePlane &, AcGePoint3dArray &, Adesk::GsMarker=0, Adesk::GsMarker=0) const final
Projects this entity and the pOhter entity on plane, finds the intersection points between these projections and then projects back the points onto the caller entity. More...
 virtual bool  | isContentSnappable () const final
virtual Adesk::Boolean  | isPlanar () const
ACHAR *  | layer () const
Returns the layername. More...
AcDbObjectId  | layerId () const
Returns the Object ID of the LayerTableRecord referenced by this entity. More...
ACHAR *  | linetype () const
Gets the linetype value. More...
AcDbObjectId  | linetypeId () const
Gets the linetypeId value. More...
 double  | linetypeScale () const
returns the linetype scale factor for the entity
AcDb::LineWeight  | lineWeight () const
Gets the entity line weight. More...
virtual void  | list () const final
Prints the properties in drawing window. More...
ACHAR *  | material () const
Gets the material assigned to this entity. More...
AcDbObjectId  | materialId () const
Gets the AcDbObjectId of the material assigned to this entity. More...
virtual Acad::ErrorStatus  | moveGripPointsAt (const AcDbIntArray &, const AcGeVector3d &) final
Move the grip points pointed by the indexes specified in indexArray using the translationVector param direction and length Override this method in custom entities to define your own behaviour. More...
 virtual Acad::ErrorStatus  | moveGripPointsAt (const AcDbVoidPtrArray &, const AcGeVector3d &, const int) final
 virtual Acad::ErrorStatus  | moveGripPointsAtSubentPaths (const AcDbFullSubentPathArray &, const AcDbVoidPtrArray &, const AcGeVector3d &, const int) final
virtual Acad::ErrorStatus  | moveStretchPointsAt (const AcDbIntArray &, const AcGeVector3d &) final
Move the stretch points pointed by the indexes specified in indexArray with the offest specified by translationVector Override this method in custom entities to define your own behaviour. More...
ACHAR *  | plotStyleName () const
Returns the name of the plotStyleName string associated with this entity (DXF 390). More...
virtual bool  | receiveShadows () const
Checks if this entity is able to receive shadows. More...
void  | recordGraphicsModified (Adesk::Boolean=Adesk::kTrue)
Controls the entity display update when closing it Entities not updated when closed are updated at the first regen. More...
virtual void  | saveAs (AcGiWorldDraw *, AcDb::SaveType)
Generates the graphics primitives when a DWG save requiring proxy graphics to be saved is made. More...
virtual void  | setCastShadows (bool)
Sets this entity's flag regarding casting shadows. More...
virtual Acad::ErrorStatus  | setColor (const AcCmColor &, Adesk::Boolean=Adesk::kTrue)
Sets the color information of this entity from an AcCmColor instance. More...
virtual Acad::ErrorStatus  | setColor (const AcCmColor &, bool, AcDbDatabase *)
Sets the color property of this entity from an AcCmColor instance. More...
virtual Acad::ErrorStatus  | setColorIndex (Adesk::UInt16, Adesk::Boolean=Adesk::kTrue)
Sets the color index of this entity (DXF 62). More...
void  | setDatabaseDefaults ()
Applies the default properties of the entities database to this entity. More...
void  | setDatabaseDefaults (AcDbDatabase *)
Applies the default properties of the specified database to this entity. More...
virtual Acad::ErrorStatus  | setLayer (AcDbObjectId, Adesk::Boolean=Adesk::kTrue, bool=false)
Sets the layer to be referenced by this entity (DXF 8). More...
virtual Acad::ErrorStatus  | setLayer (const ACHAR *, Adesk::Boolean=Adesk::kTrue, bool=false)
Sets the layer to be referenced by this entity (DXF 8). More...
virtual Acad::ErrorStatus  | setLinetype (AcDbObjectId, Adesk::Boolean=Adesk::kTrue)
Sets the entities linetype to ltypeObjectId. More...
virtual Acad::ErrorStatus  | setLinetype (const ACHAR *, Adesk::Boolean=Adesk::kTrue)
Sets the entities linetype to the linetpye referenced by layerName. More...
virtual Acad::ErrorStatus  | setLinetypeScale (double, Adesk::Boolean=Adesk::kTrue)
sets value as entity linetype scale factor More...
virtual Acad::ErrorStatus  | setLineWeight (AcDb::LineWeight, Adesk::Boolean=Adesk::kTrue)
Sets the entity line weight. More...
virtual Acad::ErrorStatus  | setMaterial (AcDbObjectId, Adesk::Boolean=Adesk::kTrue)
Not implemented yet. More...
virtual Acad::ErrorStatus  | setMaterial (const ACHAR *, Adesk::Boolean=Adesk::kTrue)
Assigns the material to the entity. More...
virtual Acad::ErrorStatus  | setMaterialMapper (const AcGiMapper &, Adesk::Boolean=Adesk::kTrue)
It is used for apply material (scale, rotation, projection, mode overrides) to an identity.If it is used AcGiMapper::kIdentity it will apply for entity a default mapper. More...
virtual Acad::ErrorStatus  | setPlotStyleName (AcDb::PlotStyleNameType, AcDbObjectId=AcDbObjectId::kNull, Adesk::Boolean=Adesk::kTrue)
Sets the plot style of this entity. More...
virtual Acad::ErrorStatus  | setPlotStyleName (const ACHAR *, Adesk::Boolean=Adesk::kTrue)
Sets the plot style of this entity. More...
Acad::ErrorStatus  | setPropertiesFrom (const AcDbEntity *, Adesk::Boolean=Adesk::kTrue)
Copies the properties color, layer, linetype, linetypescale and visibility from the source entity pEntity to this entity. More...
virtual void  | setReceiveShadows (bool)
Sets this entity's flag regarding receiving shadows. More...
virtual Acad::ErrorStatus  | setTransparency (const AcCmTransparency &, Adesk::Boolean=Adesk::kTrue)
Sets the transparency setting of this entity, and returns eOk if successful. More...
virtual Acad::ErrorStatus  | setVisibility (AcDb::Visibility, Adesk::Boolean=Adesk::kTrue) final
notyetdocumented. More...
 virtual Acad::ErrorStatus  | setVisualStyle (AcDbObjectId, VisualStyleType=kFullVisualStyle, Adesk::Boolean=true)
 virtual void  | subentGripStatus (const AcDb::GripStat, const AcDbFullSubentPath &) final
virtual AcDbEntity *  | subentPtr (const AcDbFullSubentPath &) const final
Creates an entity as a copy of the subentity given by acSubentPath. More...
virtual void  | subSetDatabaseDefaults (AcDbDatabase *)
This function is called by AcDbEntity::setDatabaseDefaults(), to allow custom entities to set their related sub entities, if any; default implementation does nothing. More...
virtual Acad::ErrorStatus  | transformBy (const AcGeMatrix3d &) final
Applies given transformation (matrix) to the entity. More...
 virtual Acad::ErrorStatus  | transformSubentPathsBy (const AcDbFullSubentPathArray &, const AcGeMatrix3d &) final
 AcCmTransparency  | transparency () const
Returns the transparency setting of this entity.
virtual Acad::ErrorStatus  | unhighlight (const AcDbFullSubentPath &=kNullSubent, const Adesk::Boolean=Adesk::kFalse) const final
Unhighlights previously highlighted part of entity, or entire entity. More...
AcDb::Visibility  | visibility () const
Gets the visibility state. More...
 AcDbObjectId  | visualStyleId (VisualStyleType=kFullVisualStyle) const
 Public Member Functions inherited from AcDbObject
virtual Acad::ErrorStatus  | addPersistentReactor (AcDbObjectId)
Adds a persistent reactor to this object reactor list. More...
Acad::ErrorStatus  | addReactor (AcDbObjectReactor *) const
Adds a transient reactor to this object. More...
virtual Acad::ErrorStatus  | applyPartialUndo (AcDbDwgFiler *, AcRxClass *)
This function is called during Undo operations on objects, that use the 'Partial Undo meachanism'; this is, this object is opened with assertWriteEnabled(Adesk::kFalse) to indicate that custom Undo filing is used rather than the default Undo filing. More...
 void  | assertNotifyEnabled () const
 void  | assertReadEnabled () const
 void  | assertWriteEnabled (Adesk::Boolean=Adesk::kTrue, Adesk::Boolean=Adesk::kTrue)
virtual Acad::ErrorStatus  | audit (AcDbAuditInfo *)
Performs the audit operation for this object. More...
Acad::ErrorStatus  | cancel ()
Reverts all changes since the object had been opened and closes the object. More...
virtual void  | cancelled (const AcDbObject *)
A handler function for persistent reactors. More...
virtual AcRxObject *  | clone () const
Creates a shallow clone of this object. More...
Acad::ErrorStatus  | close ()
Closes the object. More...
Acad::ErrorStatus  | closeAndPage (Adesk::Boolean=Adesk::kTrue)
Closes the object. More...
virtual Acad::ErrorStatus  | composeForLoad (AcDb::OdaSaveType, AcDb::AcDbDwgVersion)
This function is intended for future MT file loading support. More...
virtual void  | copied (const AcDbObject *, const AcDbObject *)
A handler function for persistent reactors. More...
virtual Acad::ErrorStatus  | copyFrom (const AcRxObject *)
Copies the pSrc object information in this object. More...
Acad::ErrorStatus  | createExtensionDictionary ()
Creates a dictionary as extension dictionary for this object. More...
AcDbDatabase *  | database () const
Returns the database that contains this object. More...
virtual Acad::ErrorStatus  | decomposeForSave (AcDb::AcDbDwgVersion, AcDbObject *&, AcDbObjectId &, Adesk::Boolean &)
This function is called during dwg and dxf output, to allow a custom object to decompose itself, due to provided dwg/dxf target file version. More...
virtual Acad::ErrorStatus  | deepClone (AcDbObject *, AcDbObject *&, AcDbIdMapping &, Adesk::Boolean=Adesk::kTrue) const final
Clones this object, appends it to the owner pOwner and adds an AcDbIdPair record to the idMap. More...
void  | disableUndoRecording (Adesk::Boolean)
Disables or enables the undo recording for the object. More...
Acad::ErrorStatus  | downgradeOpen ()
Sets the open mode for an object opened for write to be opened for read. More...
Acad::ErrorStatus  | downgradeToNotify (Adesk::Boolean)
Sets the open mode for an object opened for write to be opened for notify. More...
virtual AcGiDrawable *  | drawable ()
Retrieves the AcGiDrawable instance of this object. More...
Acad::ErrorStatus  | dwgIn (AcDbDwgFiler *)
Calls the object's dwgInFields function, and reads any XData if present. More...
virtual Acad::ErrorStatus  | dwgInFields (AcDbDwgFiler *)
Reads the object from the DWG filer. More...
Acad::ErrorStatus  | dwgOut (AcDbDwgFiler *) const
Calls the object's dwgOutFields function, and writes any XData if present. More...
virtual Acad::ErrorStatus  | dwgOutFields (AcDbDwgFiler *) const
Writes the object to the DWG filer. More...
Acad::ErrorStatus  | dxfIn (AcDbDxfFiler *)
Calls the object's dxfInFields function, and reads any XData if present. More...
virtual Acad::ErrorStatus  | dxfInFields (AcDbDxfFiler *)
Reads the object from the DXF filer. More...
Acad::ErrorStatus  | dxfOut (AcDbDxfFiler *, Adesk::Boolean, Adesk::uchar *) const
Calls the object's dxfOutFields function, and writes any XData if present. More...
virtual Acad::ErrorStatus  | dxfOutFields (AcDbDxfFiler *) const
Writes the object to the DXF filer. More...
Acad::ErrorStatus  | erase (Adesk::Boolean=Adesk::kTrue)
Sets the bit that indicates that the object is erased. More...
virtual void  | erased (const AcDbObject *, Adesk::Boolean)
A handler function for persistent reactors. More...
AcDbObjectId  | extensionDictionary () const
Returns the object id of the extension dictionary for this object. More...
void  | getAcDbHandle (AcDbHandle &) const
Returns handle of this object. More...
Acad::ErrorStatus  | getBinaryData (const ACHAR *, Adesk::Int32 &, char *&) const
Creates a copy of the binary data stored as chunks of maximum 127 bytes in the resbuf chain of this object's extension dictionary xrecord entry given by entryName. More...
int  | getBrxOpenCount () const
This function returns the number of open BRX instances for this object. More...
int  | getBrxOpenState () const
This function returns the BRX object open state flags as bitfields, for diagnostic purpose. More...
virtual Acad::ErrorStatus  | getClassID (CLSID *) const final
Gets the COM wrapper Class ID for this entity. More...
int  | getCustomObjectState () const
This function returns the custom object status : 1=isCustomObject 2=DifferentialUndoDisabled. More...
Acad::ErrorStatus  | getField (const ACHAR *, AcDbField *&, AcDb::OpenMode) const
Retrieves the specified Field from this object, and opens it in mode. More...
Acad::ErrorStatus  | getField (const ACHAR *, AcDbObjectId &) const
Gets the pszPropName field object from field dictionary of this AcDbObject object, using pszPropName as key. More...
AcDbObjectId  | getFieldDictionary () const
Returns the Field dictionary associated with this object,. More...
Acad::ErrorStatus  | getFieldDictionary (AcDbDictionary *&, AcDb::OpenMode) const
Gets and opens the field dictionary for this. More...
Acad::ErrorStatus  | getObjectBirthVersion (AcDb::AcDbDwgVersion &, AcDb::MaintenanceReleaseVersion &)
This function is currently not supported by the CAD engine, always returns Acad::eOk, and 'kDHL_CURRENT' + 'kMReleaseCurrent' results. More...
virtual Acad::ErrorStatus  | getObjectSaveVersion (const AcDbDwgFiler *, AcDb::AcDbDwgVersion &, AcDb::MaintenanceReleaseVersion &)
Returns the DWG version for saving the object. More...
virtual Acad::ErrorStatus  | getObjectSaveVersion (const AcDbDxfFiler *, AcDb::AcDbDwgVersion &, AcDb::MaintenanceReleaseVersion &)
Returns the DWG version for saving the object. More...
int  | getOdaOpenCount () const
This function returns the number of open ODA instances for this object. More...
int  | getOdaOpenState () const
This function returns the ODA object open state flags as bitfields, for diagnostic purpose. More...
virtual void  | goodbye (const AcDbObject *)
A handler function for persistent reactors. More...
Acad::ErrorStatus  | handOverTo (AcDbObject *, Adesk::Boolean=Adesk::kTrue, Adesk::Boolean=Adesk::kTrue)
Hands over objects identity to another object. More...
bool  | hasFields () const
Return true if this object has single or multiple fields associated with him. More...
bool  | hasPersistentReactor (AcDbObjectId) const
Checks the input objectId in this object reactor list. More...
bool  | hasSaveVersionOverride ()
This function indicates whether this object overrides the filer's save version. More...
virtual AcDbObjectId  | id () const
Returns the database id of this object. More...
Adesk::Boolean  | isAcDbObjectIdsInFlux () const
Checks whether a deep clone operation was completed. More...
Adesk::Boolean  | isAProxy () const
Adesk::Boolean  | isCancelling () const
Adesk::Boolean  | isErased () const
Returns whether this object is erased. More...
Adesk::Boolean  | isEraseStatusToggled () const
Checks whether the object erase status has been toggled. More...
Adesk::Boolean  | isModified () const
Returns whether this object's assertWriteEnabled() has been called since it was opened. More...
Adesk::Boolean  | isModifiedGraphics () const
Checks whether this object graphics will be updated when the object is closed. More...
Adesk::Boolean  | isModifiedXData () const
Checks whether this object's xData was modified. More...
Adesk::Boolean  | isNewObject () const
Returns true if and only if this object has not been closed since it was created. More...
Adesk::Boolean  | isNotifyEnabled () const
Returns whether this object is opened for notify. More...
Adesk::Boolean  | isNotifying () const
virtual Adesk::Boolean  | isPersistent () const
Returns the 'persistent' status of a database object. More...
Adesk::Boolean  | isReadEnabled () const
Returns whether this object is opened for read. More...
 Adesk::Boolean  | isReallyClosing () const
Checks whether the next close call will completely close this object return true if on the next call the object will be completely closed false otherwise.
Adesk::Boolean  | isTransactionResident () const
Gets the object transaction status. More...
Adesk::Boolean  | isUndoing () const
bool  | isUndoRecordingDisabled () const
Returns whether the undo recording for the object is enabled or not. More...
Adesk::Boolean  | isWriteEnabled () const
Returns whether this object is opened for write. More...
virtual AcDb::DuplicateRecordCloning  | mergeStyle () const
Returns the object's merge behavior during cloning. More...
virtual void  | modified (const AcDbObject *)
A handler function for persistent reactors. More...
virtual void  | modifiedGraphics (const AcDbEntity *)
A handler function for persistent reactors. More...
virtual void  | modifiedXData (const AcDbObject *)
A handler function for persistent reactors. More...
virtual void  | modifyUndone (const AcDbObject *)
A handler function for persistent reactors. More...
virtual void  | objectClosed (const AcDbObjectId)
A handler function for persistent reactors. More...
AcDbObjectId  | objectId () const
Returns object id. More...
virtual void  | openedForModify (const AcDbObject *)
A handler function for persistent reactors. More...
AcDbObjectId  | ownerId () const
Returns object id of the owner. More...
AcDbVoidPtrArray *  | reactors ()
Gets the object pointers to reactors. More...
const AcDbVoidPtrArray *  | reactors () const
Gets the object pointers to reactors. More...
virtual void  | reappended (const AcDbObject *)
A handler function for persistent reactors. More...
 virtual void  | recvPropagateModify (const AcDbObject *)
Not implemented yet.
Acad::ErrorStatus  | releaseExtensionDictionary ()
Removes the extension dictionary associated with this object. More...
virtual Acad::ErrorStatus  | removeField (AcDbObjectId)
Removes the Field specified by acFieldId from this object. More...
virtual Acad::ErrorStatus  | removeField (const ACHAR *)
Removes the Field specified by szKeyString from this object. More...
virtual Acad::ErrorStatus  | removeField (const ACHAR *, AcDbObjectId &)
Removes the Field specified by acPszKeyString from this object, and returns its ObjectId value. More...
virtual Acad::ErrorStatus  | removePersistentReactor (AcDbObjectId)
Removes a persistent reactor from this object reactor list. More...
Acad::ErrorStatus  | removeReactor (AcDbObjectReactor *) const
Removes a transient reactor to this object. More...
void  | setAcDbObjectIdsInFlux ()
Call this function to indicate that the object IDs of this object and its sub-objects (if any) are not yet valid. More...
Acad::ErrorStatus  | setBinaryData (const ACHAR *, Adesk::Int32, const char *)
Creates a copy of the binary data, divides it in up to 127 bytes binary chunks and
 sets them as resbufs in the resbuf chain of this object's extension dictionary xrecord entry given by entryName. More...
virtual Acad::ErrorStatus  | setField (const ACHAR *, AcDbField *, AcDbObjectId &)
Adds the pAcField field object to field dictionary of this AcDbObject object, using pKey as key. More...
void  | setHasSaveVersionOverride (bool)
This function can be called to specify that the object has a "save version override". More...
virtual Acad::ErrorStatus  | setOwnerId (AcDbObjectId)
Sets the ownerId data member of the object to be objId. More...
virtual Acad::ErrorStatus  | setXData (const resbuf *)
Sets/removes xData associated with this object. More...
virtual Acad::ErrorStatus  | subCancel ()
Possibility to veto a cancel operation from within custom entities. More...
virtual Acad::ErrorStatus  | subClose ()
virtual Acad::ErrorStatus  | subErase (Adesk::Boolean)
This hook is called during an AcDbObject::erase call, before any actual erase operation is performed. More...
 virtual Acad::ErrorStatus  | subHandOverTo (AcDbObject *)
virtual void  | subObjModified (const AcDbObject *, const AcDbObject *)
A handler function for persistent reactors. More...
 virtual Acad::ErrorStatus  | subOpen (AcDb::OpenMode)
virtual Acad::ErrorStatus  | subSwapIdWith (AcDbObjectId, Adesk::Boolean=Adesk::kFalse, Adesk::Boolean=Adesk::kFalse)
This hook is called during an AcDbObject::swapIdWith() call, before any actual swap operation is performed. More...
Acad::ErrorStatus  | swapIdWith (AcDbObjectId, Adesk::Boolean=Adesk::kFalse, Adesk::Boolean=Adesk::kFalse)
Swaps the object id's between the object identified by param swapId and this object. More...
virtual Acad::ErrorStatus  | swapReferences (const AcDbIdMapping &)
Not implemented yet. More...
virtual void  | unappended (const AcDbObject *)
A handler function for persistent reactors. More...
AcDbDwgFiler *  | undoFiler ()
Gets the undo filer for this object. More...
Acad::ErrorStatus  | upgradeFromNotify (Adesk::Boolean &)
Upgrades the open status of this object to AcDb::kForWrite, if this object is already open (either in AcDb::kForRead, AcDb::kForNotify or AcDb::kForWrite) More...
Acad::ErrorStatus  | upgradeOpen ()
Changes the objects open mode to AcDb::kForWrite and sends notifications. More...
virtual Acad::ErrorStatus  | wblockClone (AcRxObject *, AcDbObject *&, AcDbIdMapping &, Adesk::Boolean=Adesk::kTrue) const final
Clones this object, appends it to the owner pOwner and adds an AcDbIdPair record to the idMap. More...
virtual resbuf *  | xData (const ACHAR *=NULL) const
Returns the xData associated with this object. More...
Acad::ErrorStatus  | xDataTransformBy (const AcGeMatrix3d &)
Transforms the extended data according to parameter transformation matrix. More...
 virtual void  | xmitPropagateModify () const
Not implemented yet.
 virtual  | ~AcDbObject ()
Destructor.
 Public Member Functions inherited from AcGiDrawable
virtual bool  | bounds (AcDbExtents &) const
virtual DrawableType  | drawableType () const
 virtual AcGiDrawStream *  | drawStream () const
 AcGsNode *  | gsNode () const
virtual AcDbObjectId  | id () const =0
virtual Adesk::Boolean  | isPersistent () const =0
virtual Adesk::UInt32  | regenSupportFlags () const final
Returns whether and to which level this object supports MultiThreading. More...
 virtual Adesk::Boolean  | RolloverHit (Adesk::ULongPtr, Adesk::ULongPtr, Adesk::Boolean)
 virtual Adesk::UInt32  | setAttributes (AcGiDrawableTraits *) final
 virtual void  | setDrawStream (AcGiDrawStream *)
 void  | setGsNode (AcGsNode *)
 virtual void  | viewportDraw (AcGiViewportDraw *) final
 virtual Adesk::UInt32  | viewportDrawLogicalFlags (AcGiViewportDraw *) final
 virtual Adesk::Boolean  | worldDraw (AcGiWorldDraw *) final
 Public Member Functions inherited from AcRxObject
virtual AcRxObject *  | clone () const
Exported and implemented. More...
 virtual AcRx::Ordering  | comparedTo (const AcRxObject *) const
Exported and implemented.
virtual Acad::ErrorStatus  | copyFrom (const AcRxObject *)
Exported and implemented. More...
 virtual AcRxClass *  | isA () const
Exported and implemented.
virtual Adesk::Boolean  | isEqualTo (const AcRxObject *) const
Exported and implemented. More...
bool  | isKindOf (const AcRxClass *) const
Checks the object class. More...
AcRxObject *  | queryX (const AcRxClass *) const
returns the protocol extension object assigned to this class or a parent class. More...
AcRxObject *  | x (const AcRxClass *) const
returns the protocol extension object assigned to this class or a parent class. More...
 virtual  | ~AcRxObject ()
Destructor.
 Public Attributes
AcDbLeader
Default constructor.
 Public Attributes inherited from AcDbCurve
AcDbCurve
Default constructor.
 Public Attributes inherited from AcDbEntity
AcDbEntity
This protected constructor sets the initial value for color to 257, and for the objectids for layer and linetype to AcDbObjectId::kNull. More...
 Protected Member Functions
virtual Acad::ErrorStatus  | subExplode (AcDbVoidPtrArray &) const
virtual Acad::ErrorStatus  | subIntersectWith (const AcDbEntity *, AcDb::Intersect, AcGePoint3dArray &, Adesk::GsMarker=0, Adesk::GsMarker=0) const
virtual Acad::ErrorStatus  | subIntersectWith (const AcDbEntity *, AcDb::Intersect, const AcGePlane &, AcGePoint3dArray &, Adesk::GsMarker=0, Adesk::GsMarker=0) const
 Protected Member Functions inherited from AcDbEntity
 virtual Acad::ErrorStatus  | subAddSubentPaths (const AcDbFullSubentPathArray &)
 virtual Adesk::Boolean  | subCloneMeForDragging ()
 virtual Acad::ErrorStatus  | subDeleteSubentPaths (const AcDbFullSubentPathArray &)
virtual Acad::ErrorStatus  | subExplode (AcDbVoidPtrArray &) const
 virtual Acad::ErrorStatus  | subGetCompoundObjectTransform (AcGeMatrix3d &) const
virtual Acad::ErrorStatus  | subGetGeomExtents (AcDbExtents &) const
virtual Acad::ErrorStatus  | subGetGripEntityUCS (const void *, AcGeVector3d &, AcGePoint3d &, AcGeVector3d &) const
virtual Acad::ErrorStatus  | subGetGripPoints (AcDbGripDataPtrArray &, const double, const int, const AcGeVector3d &, const int) const
virtual Acad::ErrorStatus  | subGetGripPoints (AcGePoint3dArray &, AcDbIntArray &, AcDbIntArray &) const
 virtual Acad::ErrorStatus  | subGetGripPointsAtSubentPath (const AcDbFullSubentPath &, AcDbGripDataPtrArray &, const double, const int, const AcGeVector3d &, const int) const
virtual Acad::ErrorStatus  | subGetGsMarkersAtSubentPath (const AcDbFullSubentPath &, AcArray< Adesk::GsMarker > &) const
virtual Acad::ErrorStatus  | subGetOsnapPoints (AcDb::OsnapMode, Adesk::GsMarker, const AcGePoint3d &, const AcGePoint3d &, const AcGeMatrix3d &, AcGePoint3dArray &, AcDbIntArray &) const
 virtual Acad::ErrorStatus  | subGetOsnapPoints (AcDb::OsnapMode, Adesk::GsMarker, const AcGePoint3d &, const AcGePoint3d &, const AcGeMatrix3d &, AcGePoint3dArray &, AcDbIntArray &, const AcGeMatrix3d &) const
virtual Acad::ErrorStatus  | subGetStretchPoints (AcGePoint3dArray &) const
 virtual Acad::ErrorStatus  | subGetSubentClassId (const AcDbFullSubentPath &, CLSID *) const
 virtual Acad::ErrorStatus  | subGetSubentPathGeomExtents (const AcDbFullSubentPath &, AcDbExtents &) const
virtual Acad::ErrorStatus  | subGetSubentPathsAtGsMarker (AcDb::SubentType, Adesk::GsMarker, const AcGePoint3d &, const AcGeMatrix3d &, int &, AcDbFullSubentPath *&, int=0, AcDbObjectId *=nullptr) const
virtual Acad::ErrorStatus  | subGetTransformedCopy (const AcGeMatrix3d &, AcDbEntity *&) const
virtual void  | subGripStatus (const AcDb::GripStat)
 virtual bool  | subHideMeForDragging () const
virtual Acad::ErrorStatus  | subHighlight (const AcDbFullSubentPath &=kNullSubent, const Adesk::Boolean=false) const
virtual Acad::ErrorStatus  | subIntersectWith (const AcDbEntity *, AcDb::Intersect, AcGePoint3dArray &, Adesk::GsMarker=0, Adesk::GsMarker=0) const
virtual Acad::ErrorStatus  | subIntersectWith (const AcDbEntity *, AcDb::Intersect, const AcGePlane &, AcGePoint3dArray &, Adesk::GsMarker=0, Adesk::GsMarker=0) const
virtual bool  | subIsContentSnappable () const
virtual void  | subList () const
virtual Acad::ErrorStatus  | subMoveGripPointsAt (const AcDbIntArray &, const AcGeVector3d &)
virtual Acad::ErrorStatus  | subMoveGripPointsAt (const AcDbVoidPtrArray &, const AcGeVector3d &, const int)
 virtual Acad::ErrorStatus  | subMoveGripPointsAtSubentPaths (const AcDbFullSubentPathArray &, const AcDbVoidPtrArray &, const AcGeVector3d &, const int)
virtual Acad::ErrorStatus  | subMoveStretchPointsAt (const AcDbIntArray &, const AcGeVector3d &)
virtual Adesk::UInt32  | subSetAttributes (AcGiDrawableTraits *)
Sets the values of this object's subentity traits and returns with the calling object's subentity traits. More...
virtual Acad::ErrorStatus  | subSetVisibility (AcDb::Visibility, Adesk::Boolean=true)
 virtual void  | subSubentGripStatus (const AcDb::GripStat, const AcDbFullSubentPath &)
virtual AcDbEntity *  | subSubentPtr (const AcDbFullSubentPath &) const
virtual Acad::ErrorStatus  | subTransformBy (const AcGeMatrix3d &)
 virtual Acad::ErrorStatus  | subTransformSubentPathsBy (const AcDbFullSubentPathArray &, const AcGeMatrix3d &)
virtual Acad::ErrorStatus  | subUnhighlight (const AcDbFullSubentPath &=kNullSubent, const Adesk::Boolean=false) const
virtual void  | subViewportDraw (AcGiViewportDraw *)
 virtual AcDb::Visibility  | subVisibility () const
virtual Adesk::Boolean  | subWorldDraw (AcGiWorldDraw *)
 Protected Member Functions inherited from AcDbObject
virtual Acad::ErrorStatus  | subDeepClone (AcDbObject *, AcDbObject *&, AcDbIdMapping &, Adesk::Boolean=true) const
virtual Acad::ErrorStatus  | subGetClassID (CLSID *) const
virtual Adesk::UInt32  | subSetAttributes (AcGiDrawableTraits *)
Sets the values of this object's subentity traits and returns with the calling object's subentity traits. More...
virtual void  | subViewportDraw (AcGiViewportDraw *)
virtual Adesk::UInt32  | subViewportDrawLogicalFlags (AcGiViewportDraw *)
virtual Acad::ErrorStatus  | subWblockClone (AcRxObject *, AcDbObject *&, AcDbIdMapping &, Adesk::Boolean=true) const
virtual Adesk::Boolean  | subWorldDraw (AcGiWorldDraw *)
 Protected Member Functions inherited from AcGiDrawable
virtual Adesk::UInt32  | subRegenSupportFlags () const
Returns whether and to which level this object supports MultiThreading. More...
virtual Adesk::UInt32  | subSetAttributes (AcGiDrawableTraits *)=0
virtual void  | subViewportDraw (AcGiViewportDraw *)=0
 virtual Adesk::UInt32  | subViewportDrawLogicalFlags (AcGiViewportDraw *)
virtual Adesk::Boolean  | subWorldDraw (AcGiWorldDraw *)=0
 Protected Member Functions inherited from AcRxObject
AcRxObject ()
Exported and implemented.
 Additional Inherited Members
 Static Public Member Functions inherited from AcDbCurve
 static Acad::ErrorStatus  | createFromAcGeCurve (const AcGeCurve3d &, AcDbCurve *&, AcGeVector3d *=NULL, const AcGeTol &=AcGeContext::gTol)
 Static Public Member Functions inherited from AcRxObject
 static AcRxObject *  | cast (const AcRxObject *)
 static AcRxClass *  | desc ()
Exported and implemented.
 Static Public Member Functions inherited from AcHeapOperators
 static void  | operator delete (void *)
_
 static void  | operator delete (void *, const char *, int)
 static void  | operator delete (void *, void *)
 static void  | operator delete[] (void *)
_
 static void  | operator delete[] (void *, const char *, int)
 static void *  | operator new (size_t)
_
 static void *  | operator new (size_t, const char *, int)
 static void *  | operator new (size_t, void *p)
 static void *  | operator new[] (size_t)
_
 static void *  | operator new[] (size_t, const char *, int)
Detailed Description
_
Member Function Documentation
◆ annoHeight()
 UX_EXPORT_FUNCTION double AcDbLeader::annoHeight  |  ( |   | ) |   const
Returns the height of the actual annotation object, attached to this AcDbLeader.
Returns
double - the height of the annotation object (MText, Field)
◆ annotationObjId()
 UX_EXPORT_FUNCTION AcDbObjectId AcDbLeader::annotationObjId  |  ( |   | ) |   const
virtual
Returns the object id of the annotation object associated with this AcDbLeader entity.
Returns
annotation object id
◆ annotationOffset()
 UX_EXPORT_FUNCTION AcGeVector3d AcDbLeader::annotationOffset  |  ( |   | ) |   const
virtual
Returns the annotation offset of the current AcDbLeader entity.
Returns
the annotation offset
◆ annoType()
 UX_EXPORT_FUNCTION AcDbLeader::AnnoType AcDbLeader::annoType  |  ( |   | ) |   const
Gets this object's annotation type.
Returns
annotation type
◆ annoWidth()
 UX_EXPORT_FUNCTION double AcDbLeader::annoWidth  |  ( |   | ) |   const
Returns the width of the actual annotation object, attached to this AcDbLeader.
Returns
double - the width of the annotation object (MText, Field)
◆ appendVertex()
 UX_EXPORT_FUNCTION Adesk::Boolean AcDbLeader::appendVertex  |  ( |  const AcGePoint3d &  |  vertex | )
virtual
Appends the vertex point to the end of vertex list of this leader.
Parameters
[in] | vertex | vertex to append
Returns
Adesk::kTrue if vertex is successfully appended @ Adesk::kFalse else
◆ attachAnnotation()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbLeader::attachAnnotation  |  ( |  const AcDbObjectId &  |  annotationId | )
virtual
Sets the annotation object for the current AcDbLeader entity.
Parameters
[in] | annotationId | object id of the annotation entity used
Returns
Acad::eOk, if successful Acad::eNotInDatabase if the current AcDbLeader entity is not database resident Acad::eNotApplicable if the input id is not valid Acad::eInvalidInput if the input id is NULL
◆ copied()
 UX_EXPORT_FUNCTION void AcDbLeader::copied  |  ( |  const AcDbObject *  |  objToCopy,
|  const AcDbObject *  |  copiedObj
)
virtual
See also
AcDbCurve::copied(const AcDbObject*, const AcDbObject*)
Reimplemented from AcDbObject.
◆ detachAnnotation()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbLeader::detachAnnotation  |  ( |   | )
virtual
Removes this entity from the persistent reactor list and sets the annotation object id to NULL.
Returns
Acad::eOk, if successful Acad::eNotApplicable if the annotation object id is NULL
◆ dimasz()
 UX_EXPORT_FUNCTION double AcDbLeader::dimasz  |  ( |   | ) |   const
virtual
Returns the value of DIMASZ for the current leader.
Returns
value of DIMASZ
◆ dimclrd()
 UX_EXPORT_FUNCTION AcCmColor AcDbLeader::dimclrd  |  ( |   | ) |   const
virtual
Gets the DIMCLRD dimension variable for this.
Returns
the value of the queried dimension variable
◆ dimensionStyle()
 UX_EXPORT_FUNCTION AcDbHardPointerId AcDbLeader::dimensionStyle  |  ( |   | ) |   const
virtual
Returns the object id of the dimension style object associated with this entity.
Returns
Object id of the dimension style object
◆ dimgap()
 UX_EXPORT_FUNCTION double AcDbLeader::dimgap  |  ( |   | ) |   const
virtual
Gets the DIMGAP dimension variable for this.
Returns
the value of the queried dimension variable
◆ dimldrblk()
 UX_EXPORT_FUNCTION AcDbObjectId AcDbLeader::dimldrblk  |  ( |   | ) |   const
virtual
Gets the DIMLDRBLK dimension variable for this.
Returns
the value of the queried dimension variable
◆ dimlwd()
 UX_EXPORT_FUNCTION AcDb::LineWeight AcDbLeader::dimlwd  |  ( |   | ) |   const
virtual
Gets the DIMLWD dimension variable for this.
Returns
the value of the queried dimension variable
◆ dimsah()
 UX_EXPORT_FUNCTION bool AcDbLeader::dimsah  |  ( |   | ) |   const
virtual
Gets the DIMSAH dimension variable for this.
Returns
the value of the queried dimension variable
◆ dimscale()
 UX_EXPORT_FUNCTION double AcDbLeader::dimscale  |  ( |   | ) |   const
virtual
Gets the DIMSCALE dimension variable for this.
Returns
the value of the queried dimension variable
◆ dimtad()
 UX_EXPORT_FUNCTION int AcDbLeader::dimtad  |  ( |   | ) |   const
virtual
Returns the value of DIMTAD for the current leader.
Returns
value of DIMTAD
◆ dimtxsty()
 UX_EXPORT_FUNCTION AcDbObjectId AcDbLeader::dimtxsty  |  ( |   | ) |   const
virtual
Gets the DIMTXSTY dimension variable for this.
Returns
the value of the queried dimension variable
◆ dimtxt()
 UX_EXPORT_FUNCTION double AcDbLeader::dimtxt  |  ( |   | ) |   const
virtual
Gets the DIMTXT dimension variable for this.
Returns
the value of the queried dimension variable
◆ erased()
 UX_EXPORT_FUNCTION void AcDbLeader::erased  |  ( |  const AcDbObject *  |  erasedObj,
|  Adesk::Boolean  |  bIsErased
)
virtual
See also
AcDbCurve::erased(const AcDbObject*, Adesk::Boolean)
Date
2008-12-06 lucd implemented
Reimplemented from AcDbObject.
◆ evaluateLeader()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbLeader::evaluateLeader  |  ( |   | )
virtual
Evaluate the leader in regard to the associated annotation.
Returns
Acad::eOk if successful Acad::eNotApplicable if no object associated as annotation
◆ firstVertex()
 UX_EXPORT_FUNCTION AcGePoint3d AcDbLeader::firstVertex  |  ( |   | ) |   const
virtual
Get the first vertex of the leader.
Returns
the first vertex in WCS coordinates
◆ getDimstyleData()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbLeader::getDimstyleData  |  ( |  AcDbDimStyleTableRecord *&  |  pDSTRecord | ) |   const
Fetches the dimension style information of this entity.
Parameters
[in] | pDSTRecord | dimension style data
Returns
Acad::eOk, if successful Acad::eInvalidInput if pDSTRecord is NULL Acad::eInvalidDimStyle if invalid dimension style
◆ goodbye()
 UX_EXPORT_FUNCTION void AcDbLeader::goodbye  |  ( |  const AcDbObject *  |  pObj | )
virtual
See also
AcDbCurve::goodbye(const AcDbObject*)
Reimplemented from AcDbObject.
◆ hasArrowHead()
 UX_EXPORT_FUNCTION Adesk::Boolean AcDbLeader::hasArrowHead  |  ( |   | ) |   const
virtual
Check if the arrowhead is enabled for the leader object.
Returns
Adesk::kTrue if arrowhead is enabled Adesk::kFalse otherwise
◆ hasHookLine()
 UX_EXPORT_FUNCTION Adesk::Boolean AcDbLeader::hasHookLine  |  ( |   | ) |   const
virtual
Check whether the leader uses hook line.
Returns
Adesk::kTrue if hook lines are used Adesk::kFalse otherwise
◆ isSplined()
 UX_EXPORT_FUNCTION Adesk::Boolean AcDbLeader::isSplined  |  ( |   | ) |   const
virtual
Check if the leader uses splined lines.
Returns
Adesk::kTrue if the lines are splined Adesk::kFalse otherwise
◆ lastVertex()
 UX_EXPORT_FUNCTION AcGePoint3d AcDbLeader::lastVertex  |  ( |   | ) |   const
virtual
Get the last vertex of the leader object.
Returns
the last vertex in WCS coordinates
◆ modified()
 UX_EXPORT_FUNCTION void AcDbLeader::modified  |  ( |  const AcDbObject *  |  pObject | )
virtual
UX_EXPORT_FUNCTION.
See also
AcDbCurve::modified(const AcDbObject*)
Reimplemented from AcDbObject.
◆ normal()
 UX_EXPORT_FUNCTION AcGeVector3d AcDbLeader::normal  |  ( |   | ) |   const
virtual
Get the normal vector of the leader object.
Returns
the normal vector
◆ numVertices()
 UX_EXPORT_FUNCTION int AcDbLeader::numVertices  |  ( |   | ) |   const
virtual
Returns the number of vertices for this leader.
Returns
number of vertices
◆ setAnnotationOffset()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbLeader::setAnnotationOffset  |  ( |  const AcGeVector3d &  |  annotationOffset | )
virtual
Sets the annotation offset.
Parameters
[in] | annotationOffset | annotation offset
Returns
Acad::eOk, if successful
◆ setColorIndex()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbLeader::setColorIndex  |  ( |  Adesk::UInt16  |  colorIndex,
|  Adesk::Boolean  |  bSubEntities = Adesk::kTrue
)
virtual
See also
AcDbCurve::setColorIndex(Adesk::UInt16, Adesk::Boolean)
Reimplemented from AcDbEntity.
◆ setDimasz()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbLeader::setDimasz  |  ( |  double  |  value | )
virtual
Overrides the value of DIMASZ for the current leader to value.
Parameters
[in] | value | value to set DIMASZ
Returns
Acad::eOk if successful
 Acad::eMustBeNonNegative if value < 0
◆ setDimclrd()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbLeader::setDimclrd  |  ( |  AcCmColor &  |  value | )
virtual
Sets the DIMCLRD dimension variable.
Parameters
[in] | value | new value to set
Returns
Acad::eOk if successful
◆ setDimensionStyle()
 UX_EXPORT_FUNCTION void AcDbLeader::setDimensionStyle  |  ( |  const AcDbHardPointerId &  |  id | )
virtual
Sets the current leader to use the DimensionStyle represented by id and all the dimension variables overrides associated with it.
Parameters
[in] | id | object ID associated with the respective DimensionStyle
◆ setDimgap()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbLeader::setDimgap  |  ( |  double  |  value | )
virtual
Sets the DIMGAP dimension variable.
Parameters
[in] | value | new value to set
Returns
Acad::eOk if successful
◆ setDimldrblk() [1/2]
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbLeader::setDimldrblk  |  ( |  AcDbObjectId  |  value | )
virtual
Sets the DIMLDRBLK dimension variable.
Parameters
[in] | value | new value to set
Returns
Acad::eOk if successful
◆ setDimldrblk() [2/2]
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbLeader::setDimldrblk  |  ( |  const ACHAR *  |  value | )
virtual
Sets the DIMLDRBLK dimension variable.
Parameters
[in] | value | new value to set
Returns
Acad::eOk if successful
◆ setDimlwd()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbLeader::setDimlwd  |  ( |  AcDb::LineWeight  |  value | )
virtual
Sets the DIMLWD dimension variable.
Parameters
[in] | value | new value to set
Returns
Acad::eOk if successful
◆ setDimsah()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbLeader::setDimsah  |  ( |  bool  |  value | )
virtual
Sets the DIMSAH dimension variable.
Parameters
[in] | value | new value to set
Returns
Acad::eOk if successful
◆ setDimscale()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbLeader::setDimscale  |  ( |  double  |  value | )
virtual
Sets the DIMSCALE dimension variable.
Parameters
[in] | value | new value to set (must be >= 0)
Returns
Acad::eOk if successful Acad::eMustBeNonNegative otherwise
◆ setDimstyleData() [1/2]
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbLeader::setDimstyleData  |  ( |  AcDbDimStyleTableRecord *  |  pDSTRecord | )
Sets the dimension style information for this entity.
Parameters
[in] | pDSTRecord | dimension style data
Returns
Acad::eOk if successful Acad::eInvalidInput if pDSTRecord is not a valid AcDbDimStyleTableRecord Acad::eInvalidDimStyle if invalid dimension style
◆ setDimstyleData() [2/2]
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbLeader::setDimstyleData  |  ( |  AcDbObjectId  |  dimStyleId | )
Sets the dimension style information for this entity.
Parameters
[in] | dimStyleId | dimension style
Returns
Acad::eOk if successful Acad::eInvalidInput if dimStyleId is not a valid AcDbDimStyleTableRecord Acad::eInvalidDimStyle if invalid dimension style
◆ setDimtad()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbLeader::setDimtad  |  ( |  int  |  value | )
virtual
Overrides the value of DIMTAD for the current leader to value.
Parameters
[in] | value | value to set DIMTAD
Returns
Acad::eOk if successful
 Acad::eMustBe0to3 if value < 0 or value > 3
◆ setDimtxsty()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbLeader::setDimtxsty  |  ( |  AcDbObjectId  |  value | )
virtual
Sets the DIMTXSTY dimension variable.
Parameters
[in] | value | new value to set
Returns
Acad::eOk if successful
◆ setDimtxt()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbLeader::setDimtxt  |  ( |  double  |  value | )
virtual
Sets the DIMTXT dimension variable.
Parameters
[in] | value | new value to set (must be > 0)
Returns
Acad::eOk if successful Acad::eMustBePositive
◆ setPlane()
 UX_EXPORT_FUNCTION void AcDbLeader::setPlane  |  ( |  const AcGePlane &  |  plane | )
virtual
Sets the plane.
Parameters
[in] | plane | Plane to set
◆ setVertexAt()
 UX_EXPORT_FUNCTION Adesk::Boolean AcDbLeader::setVertexAt  |  ( |  int  |  index,
|  const AcGePoint3d &  |  vertex
)
virtual
Sets the vertex point at given index.
Parameters
[in] | index | index of the vertex to get
[in] | vertex | vertex to set at index position index
Returns
Adesk::kTrue if vertex is successfully set @ Adesk::kFalse else
◆ subExplode()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbLeader::subExplode  |  ( |  AcDbVoidPtrArray &  |  pointerArray | ) |   const
protectedvirtual
Parameters
[in,out] | pointerArray | Array of pointers to existing and new entities
Returns
Acad::eOk if successful
Reimplemented from AcDbEntity.
◆ subIntersectWith() [1/2]
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbLeader::subIntersectWith  |  ( |  const AcDbEntity *  |  pEntity,
|  AcDb::Intersect  |  type,
|  AcGePoint3dArray &  |  pointArray,
|  Adesk::GsMarker  |  thisSubEntId = 0,
|  Adesk::GsMarker  |  inputSubEntId = 0
) |   |  const
protectedvirtual
See also
AcDbCurve::intersectWith(const AcDbEntity*, AcDb::Intersect, AcGePoint3dArray&, int, int)
Reimplemented from AcDbEntity.
◆ subIntersectWith() [2/2]
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbLeader::subIntersectWith  |  ( |  const AcDbEntity *  |  pEntity,
|  AcDb::Intersect  |  type,
|  const AcGePlane &  |  plane,
|  AcGePoint3dArray &  |  pointArray,
|  Adesk::GsMarker  |  thisSubEntId = 0,
|  Adesk::GsMarker  |  inputSubEntId = 0
) |   |  const
protectedvirtual
See also
AcDbCurve::intersectWith(const AcDbEntity*, AcDb::Intersect, const AcGePlane&, AcGePoint3dArray&, int, int)
Reimplemented from AcDbEntity.
◆ vertexAt()
 UX_EXPORT_FUNCTION AcGePoint3d AcDbLeader::vertexAt  |  ( |  int  |  index | ) |   const
virtual
Returns the vertex point at given index.
Parameters
[in] | index | index of the vertex to return
Returns
the vertex point