Public Types | Public Member Functions | Public Attributes | Protected Member Functions | List of all members
AcDbEntity Class Reference
_ More...
#include <AcDbEntity.h>
 Public Types
enum  | VisualStyleType { kFullVisualStyle = 0 , kFaceVisualStyle = 1 , kEdgeVisualStyle = 2 }
 Public Types inherited from AcGiDrawable
enum  | DrawableType {
 kGeometry = 0 , kDistantLight , kPointLight , kSpotLight ,
 kAmbientLight , kSolidBackground , kGradientBackground , kImageBackground ,
 kGroundPlaneBackground , kViewport
 }
enum  | SetAttributesFlags {
 kDrawableNone = 0 , kDrawableIsAnEntity = 1 , kDrawableUsesNesting = 2 , kDrawableIsCompoundObject = 4 ,
 kDrawableViewIndependentViewportDraw = 8 , kDrawableIsInvisible = 16 , kDrawableHasAttributes = 32 , kDrawableRegenTypeDependentGeometry = 64 ,
 kDrawableIsDimension = 133 , kDrawableRegenDraw = 256 , kDrawableStandardDisplaySingleLOD = 512 , kDrawableShadedDisplaySingleLOD = 1024 ,
 kDrawableViewDependentViewportDraw = 2048 , kDrawableBlockDependentViewportDraw = 4096 , kDrawableIsExternalReference = 8192 , kDrawableNotPlottable = 16384 ,
 kDrawableNotAllowLCS = 32768 , kDrawableMergeControlOff = 65536 , kThreadedWorldDrawViewportDraw = 131072
 }
 Public Member Functions
 virtual Acad::ErrorStatus  | addSubentPaths (const AcDbFullSubentPathArray &) final
virtual Acad::ErrorStatus  | applyPartialUndo (AcDbDwgFiler *, AcRxClass *)
virtual Acad::ErrorStatus  | audit (AcDbAuditInfo *)
AcDbObjectId  | blockId () const
Returns the Object ID of the BlockTableRecord that owns this entity. More...
Acad::ErrorStatus  | boundingBoxIntersectWith (const AcDbEntity *, AcDb::Intersect, AcGePoint3dArray &, Adesk::GsMarker, Adesk::GsMarker) const
Finds the intersection between the edges of the bounding box for this entity and the pOhter entity. More...
Acad::ErrorStatus  | boundingBoxIntersectWith (const AcDbEntity *, AcDb::Intersect, const AcGePlane &, AcGePoint3dArray &, Adesk::GsMarker, Adesk::GsMarker) const
First, the function projects the other entity and the bounding box of this entity on plane specified by plane. More...
virtual bool  | bounds (AcDbExtents &) const
Returns the extents of this entity as AcDbExtents. More...
virtual bool  | castShadows () const
Checks if this entity is able to cast shadows. More...
virtual Adesk::Boolean  | cloneMeForDragging () final
Checks if a clone will be created for this entity in case of a drag operation. More...
 virtual AcDb::CollisionType  | collisionType () const
AcCmColor  | color () const
Returns the true color information of the entity. More...
Adesk::UInt16  | colorIndex () const
Returns the color number in a range from 0 to 256. More...
 virtual Acad::ErrorStatus  | deleteSubentPaths (const AcDbFullSubentPathArray &) final
virtual void  | dragStatus (const AcDb::DragStat)
Acad::ErrorStatus  | draw ()
Draws or redraws the entity on screen. More...
virtual AcGiDrawable *  | drawable ()
virtual Acad::ErrorStatus  | dwgInFields (AcDbDwgFiler *)
virtual Acad::ErrorStatus  | dwgOutFields (AcDbDwgFiler *) const
virtual Acad::ErrorStatus  | dxfInFields (AcDbDxfFiler *)
virtual Acad::ErrorStatus  | dxfOutFields (AcDbDxfFiler *) const
AcCmEntityColor  | entityColor () const
Returns the lightweight color information of the entity. More...
virtual Acad::ErrorStatus  | explode (AcDbVoidPtrArray &) const final
virtual Acad::ErrorStatus  | getCompoundObjectTransform (AcGeMatrix3d &) const final
It is used for object without geometry like AcDbMleader. More...
virtual void  | getEcs (AcGeMatrix3d &) const
Returns the transformation matrix from OCS (Object Coordinate System) to WCS (World Coordinate System). More...
virtual Acad::ErrorStatus  | getGeomExtents (AcDbExtents &) const final
Returns extents of this entity. More...
 virtual Acad::ErrorStatus  | getGripEntityUCS (const void *, AcGeVector3d &, AcGePoint3d &, AcGeVector3d &) const final
 virtual Acad::ErrorStatus  | getGripPoints (AcDbGripDataPtrArray &, const double, const int, const AcGeVector3d &, const int) const final
virtual Acad::ErrorStatus  | getGripPoints (AcGePoint3dArray &, AcDbIntArray &, AcDbIntArray &) const final
Append grip points to the specified array. More...
 virtual Acad::ErrorStatus  | getGripPointsAtSubentPath (const AcDbFullSubentPath &, AcDbGripDataPtrArray &, const double, const int, const AcGeVector3d &, const int) const final
virtual Acad::ErrorStatus  | getGsMarkersAtSubentPath (const AcDbFullSubentPath &, AcArray< Adesk::GsMarker > &) const final
virtual Acad::ErrorStatus  | getMaterialMapper (AcGiMapper &) const
virtual Acad::ErrorStatus  | getOsnapPoints (AcDb::OsnapMode, Adesk::GsMarker, const AcGePoint3d &, const AcGePoint3d &, const AcGeMatrix3d &, AcGePoint3dArray &, AcDbIntArray &) const final
Gets the entity osnap points. More...
virtual Acad::ErrorStatus  | getOsnapPoints (AcDb::OsnapMode, Adesk::GsMarker, const AcGePoint3d &, const AcGePoint3d &, const AcGeMatrix3d &, AcGePoint3dArray &, AcDbIntArray &, const AcGeMatrix3d &) const final
Gets the entity osnap points. More...
virtual Acad::ErrorStatus  | getPlane (AcGePlane &, AcDb::Planarity &) const
Returns the plane that contains this entity. More...
AcDb::PlotStyleNameType  | getPlotStyleNameId (AcDbObjectId &) const
Returns the plot style name type and its associated id. More...
virtual Acad::ErrorStatus  | getStretchPoints (AcGePoint3dArray &) const final
Append stretch points to the specified array. More...
 virtual Acad::ErrorStatus  | getSubentClassId (const AcDbFullSubentPath &, CLSID *) const final
 virtual Acad::ErrorStatus  | getSubentPathGeomExtents (const AcDbFullSubentPath &, AcDbExtents &) const final
virtual Acad::ErrorStatus  | getSubentPathsAtGsMarker (AcDb::SubentType, Adesk::GsMarker, const AcGePoint3d &, const AcGeMatrix3d &, int &, AcDbFullSubentPath *&, int=0, AcDbObjectId *=NULL) const final
Gets the subentity paths appropriate for the passed in gs marker. More...
virtual Acad::ErrorStatus  | getTransformedCopy (const AcGeMatrix3d &, AcDbEntity *&) const final
Creates a copy of the current entity applying the transformation matrix. More...
 virtual void  | gripStatus (const AcDb::GripStat) final
 virtual bool  | hideMeForDragging () const final
virtual Acad::ErrorStatus  | highlight (const AcDbFullSubentPath &=kNullSubent, const Adesk::Boolean=Adesk::kFalse) const final
Highlights part of, or entire entity. More...
virtual Acad::ErrorStatus  | intersectWith (const AcDbEntity *, AcDb::Intersect, AcGePoint3dArray &, Adesk::GsMarker=0, Adesk::GsMarker=0) const final
Finds the intersection between this entity and the pOhter entity. More...
virtual Acad::ErrorStatus  | intersectWith (const AcDbEntity *, AcDb::Intersect, const AcGePlane &, AcGePoint3dArray &, Adesk::GsMarker=0, Adesk::GsMarker=0) const final
Projects this entity and the pOhter entity on plane, finds the intersection points between these projections and then projects back the points onto the caller entity. More...
 virtual bool  | isContentSnappable () const final
virtual Adesk::Boolean  | isPlanar () const
ACHAR *  | layer () const
Returns the layername. More...
AcDbObjectId  | layerId () const
Returns the Object ID of the LayerTableRecord referenced by this entity. More...
ACHAR *  | linetype () const
Gets the linetype value. More...
AcDbObjectId  | linetypeId () const
Gets the linetypeId value. More...
 double  | linetypeScale () const
returns the linetype scale factor for the entity
AcDb::LineWeight  | lineWeight () const
Gets the entity line weight. More...
virtual void  | list () const final
Prints the properties in drawing window. More...
ACHAR *  | material () const
Gets the material assigned to this entity. More...
AcDbObjectId  | materialId () const
Gets the AcDbObjectId of the material assigned to this entity. More...
virtual Acad::ErrorStatus  | moveGripPointsAt (const AcDbIntArray &, const AcGeVector3d &) final
Move the grip points pointed by the indexes specified in indexArray using the translationVector param direction and length Override this method in custom entities to define your own behaviour. More...
 virtual Acad::ErrorStatus  | moveGripPointsAt (const AcDbVoidPtrArray &, const AcGeVector3d &, const int) final
 virtual Acad::ErrorStatus  | moveGripPointsAtSubentPaths (const AcDbFullSubentPathArray &, const AcDbVoidPtrArray &, const AcGeVector3d &, const int) final
virtual Acad::ErrorStatus  | moveStretchPointsAt (const AcDbIntArray &, const AcGeVector3d &) final
Move the stretch points pointed by the indexes specified in indexArray with the offest specified by translationVector Override this method in custom entities to define your own behaviour. More...
ACHAR *  | plotStyleName () const
Returns the name of the plotStyleName string associated with this entity (DXF 390). More...
virtual bool  | receiveShadows () const
Checks if this entity is able to receive shadows. More...
void  | recordGraphicsModified (Adesk::Boolean=Adesk::kTrue)
Controls the entity display update when closing it Entities not updated when closed are updated at the first regen. More...
virtual void  | saveAs (AcGiWorldDraw *, AcDb::SaveType)
Generates the graphics primitives when a DWG save requiring proxy graphics to be saved is made. More...
virtual void  | setCastShadows (bool)
Sets this entity's flag regarding casting shadows. More...
virtual Acad::ErrorStatus  | setColor (const AcCmColor &, Adesk::Boolean=Adesk::kTrue)
Sets the color information of this entity from an AcCmColor instance. More...
virtual Acad::ErrorStatus  | setColor (const AcCmColor &, bool, AcDbDatabase *)
Sets the color property of this entity from an AcCmColor instance. More...
virtual Acad::ErrorStatus  | setColorIndex (Adesk::UInt16, Adesk::Boolean=Adesk::kTrue)
Sets the color index of this entity (DXF 62). More...
void  | setDatabaseDefaults ()
Applies the default properties of the entities database to this entity. More...
void  | setDatabaseDefaults (AcDbDatabase *)
Applies the default properties of the specified database to this entity. More...
virtual Acad::ErrorStatus  | setLayer (AcDbObjectId, Adesk::Boolean=Adesk::kTrue, bool=false)
Sets the layer to be referenced by this entity (DXF 8). More...
virtual Acad::ErrorStatus  | setLayer (const ACHAR *, Adesk::Boolean=Adesk::kTrue, bool=false)
Sets the layer to be referenced by this entity (DXF 8). More...
virtual Acad::ErrorStatus  | setLinetype (AcDbObjectId, Adesk::Boolean=Adesk::kTrue)
Sets the entities linetype to ltypeObjectId. More...
virtual Acad::ErrorStatus  | setLinetype (const ACHAR *, Adesk::Boolean=Adesk::kTrue)
Sets the entities linetype to the linetpye referenced by layerName. More...
virtual Acad::ErrorStatus  | setLinetypeScale (double, Adesk::Boolean=Adesk::kTrue)
sets value as entity linetype scale factor More...
virtual Acad::ErrorStatus  | setLineWeight (AcDb::LineWeight, Adesk::Boolean=Adesk::kTrue)
Sets the entity line weight. More...
virtual Acad::ErrorStatus  | setMaterial (AcDbObjectId, Adesk::Boolean=Adesk::kTrue)
Not implemented yet. More...
virtual Acad::ErrorStatus  | setMaterial (const ACHAR *, Adesk::Boolean=Adesk::kTrue)
Assigns the material to the entity. More...
virtual Acad::ErrorStatus  | setMaterialMapper (const AcGiMapper &, Adesk::Boolean=Adesk::kTrue)
It is used for apply material (scale, rotation, projection, mode overrides) to an identity.If it is used AcGiMapper::kIdentity it will apply for entity a default mapper. More...
virtual Acad::ErrorStatus  | setPlotStyleName (AcDb::PlotStyleNameType, AcDbObjectId=AcDbObjectId::kNull, Adesk::Boolean=Adesk::kTrue)
Sets the plot style of this entity. More...
virtual Acad::ErrorStatus  | setPlotStyleName (const ACHAR *, Adesk::Boolean=Adesk::kTrue)
Sets the plot style of this entity. More...
Acad::ErrorStatus  | setPropertiesFrom (const AcDbEntity *, Adesk::Boolean=Adesk::kTrue)
Copies the properties color, layer, linetype, linetypescale and visibility from the source entity pEntity to this entity. More...
virtual void  | setReceiveShadows (bool)
Sets this entity's flag regarding receiving shadows. More...
virtual Acad::ErrorStatus  | setTransparency (const AcCmTransparency &, Adesk::Boolean=Adesk::kTrue)
Sets the transparency setting of this entity, and returns eOk if successful. More...
virtual Acad::ErrorStatus  | setVisibility (AcDb::Visibility, Adesk::Boolean=Adesk::kTrue) final
notyetdocumented. More...
 virtual Acad::ErrorStatus  | setVisualStyle (AcDbObjectId, VisualStyleType=kFullVisualStyle, Adesk::Boolean=true)
 virtual void  | subentGripStatus (const AcDb::GripStat, const AcDbFullSubentPath &) final
virtual AcDbEntity *  | subentPtr (const AcDbFullSubentPath &) const final
Creates an entity as a copy of the subentity given by acSubentPath. More...
virtual void  | subSetDatabaseDefaults (AcDbDatabase *)
This function is called by AcDbEntity::setDatabaseDefaults(), to allow custom entities to set their related sub entities, if any; default implementation does nothing. More...
virtual Acad::ErrorStatus  | transformBy (const AcGeMatrix3d &) final
Applies given transformation (matrix) to the entity. More...
 virtual Acad::ErrorStatus  | transformSubentPathsBy (const AcDbFullSubentPathArray &, const AcGeMatrix3d &) final
 AcCmTransparency  | transparency () const
Returns the transparency setting of this entity.
virtual Acad::ErrorStatus  | unhighlight (const AcDbFullSubentPath &=kNullSubent, const Adesk::Boolean=Adesk::kFalse) const final
Unhighlights previously highlighted part of entity, or entire entity. More...
AcDb::Visibility  | visibility () const
Gets the visibility state. More...
 AcDbObjectId  | visualStyleId (VisualStyleType=kFullVisualStyle) const
 Public Member Functions inherited from AcDbObject
virtual Acad::ErrorStatus  | addPersistentReactor (AcDbObjectId)
Adds a persistent reactor to this object reactor list. More...
Acad::ErrorStatus  | addReactor (AcDbObjectReactor *) const
Adds a transient reactor to this object. More...
virtual Acad::ErrorStatus  | applyPartialUndo (AcDbDwgFiler *, AcRxClass *)
This function is called during Undo operations on objects, that use the 'Partial Undo meachanism'; this is, this object is opened with assertWriteEnabled(Adesk::kFalse) to indicate that custom Undo filing is used rather than the default Undo filing. More...
 void  | assertNotifyEnabled () const
 void  | assertReadEnabled () const
 void  | assertWriteEnabled (Adesk::Boolean=Adesk::kTrue, Adesk::Boolean=Adesk::kTrue)
virtual Acad::ErrorStatus  | audit (AcDbAuditInfo *)
Performs the audit operation for this object. More...
Acad::ErrorStatus  | cancel ()
Reverts all changes since the object had been opened and closes the object. More...
virtual void  | cancelled (const AcDbObject *)
A handler function for persistent reactors. More...
virtual AcRxObject *  | clone () const
Creates a shallow clone of this object. More...
Acad::ErrorStatus  | close ()
Closes the object. More...
Acad::ErrorStatus  | closeAndPage (Adesk::Boolean=Adesk::kTrue)
Closes the object. More...
virtual Acad::ErrorStatus  | composeForLoad (AcDb::OdaSaveType, AcDb::AcDbDwgVersion)
This function is intended for future MT file loading support. More...
virtual void  | copied (const AcDbObject *, const AcDbObject *)
A handler function for persistent reactors. More...
virtual Acad::ErrorStatus  | copyFrom (const AcRxObject *)
Copies the pSrc object information in this object. More...
Acad::ErrorStatus  | createExtensionDictionary ()
Creates a dictionary as extension dictionary for this object. More...
AcDbDatabase *  | database () const
Returns the database that contains this object. More...
virtual Acad::ErrorStatus  | decomposeForSave (AcDb::AcDbDwgVersion, AcDbObject *&, AcDbObjectId &, Adesk::Boolean &)
This function is called during dwg and dxf output, to allow a custom object to decompose itself, due to provided dwg/dxf target file version. More...
virtual Acad::ErrorStatus  | deepClone (AcDbObject *, AcDbObject *&, AcDbIdMapping &, Adesk::Boolean=Adesk::kTrue) const final
Clones this object, appends it to the owner pOwner and adds an AcDbIdPair record to the idMap. More...
void  | disableUndoRecording (Adesk::Boolean)
Disables or enables the undo recording for the object. More...
Acad::ErrorStatus  | downgradeOpen ()
Sets the open mode for an object opened for write to be opened for read. More...
Acad::ErrorStatus  | downgradeToNotify (Adesk::Boolean)
Sets the open mode for an object opened for write to be opened for notify. More...
virtual AcGiDrawable *  | drawable ()
Retrieves the AcGiDrawable instance of this object. More...
Acad::ErrorStatus  | dwgIn (AcDbDwgFiler *)
Calls the object's dwgInFields function, and reads any XData if present. More...
virtual Acad::ErrorStatus  | dwgInFields (AcDbDwgFiler *)
Reads the object from the DWG filer. More...
Acad::ErrorStatus  | dwgOut (AcDbDwgFiler *) const
Calls the object's dwgOutFields function, and writes any XData if present. More...
virtual Acad::ErrorStatus  | dwgOutFields (AcDbDwgFiler *) const
Writes the object to the DWG filer. More...
Acad::ErrorStatus  | dxfIn (AcDbDxfFiler *)
Calls the object's dxfInFields function, and reads any XData if present. More...
virtual Acad::ErrorStatus  | dxfInFields (AcDbDxfFiler *)
Reads the object from the DXF filer. More...
Acad::ErrorStatus  | dxfOut (AcDbDxfFiler *, Adesk::Boolean, Adesk::uchar *) const
Calls the object's dxfOutFields function, and writes any XData if present. More...
virtual Acad::ErrorStatus  | dxfOutFields (AcDbDxfFiler *) const
Writes the object to the DXF filer. More...
Acad::ErrorStatus  | erase (Adesk::Boolean=Adesk::kTrue)
Sets the bit that indicates that the object is erased. More...
virtual void  | erased (const AcDbObject *, Adesk::Boolean)
A handler function for persistent reactors. More...
AcDbObjectId  | extensionDictionary () const
Returns the object id of the extension dictionary for this object. More...
void  | getAcDbHandle (AcDbHandle &) const
Returns handle of this object. More...
Acad::ErrorStatus  | getBinaryData (const ACHAR *, Adesk::Int32 &, char *&) const
Creates a copy of the binary data stored as chunks of maximum 127 bytes in the resbuf chain of this object's extension dictionary xrecord entry given by entryName. More...
int  | getBrxOpenCount () const
This function returns the number of open BRX instances for this object. More...
int  | getBrxOpenState () const
This function returns the BRX object open state flags as bitfields, for diagnostic purpose. More...
virtual Acad::ErrorStatus  | getClassID (CLSID *) const final
Gets the COM wrapper Class ID for this entity. More...
int  | getCustomObjectState () const
This function returns the custom object status : 1=isCustomObject 2=DifferentialUndoDisabled. More...
Acad::ErrorStatus  | getField (const ACHAR *, AcDbField *&, AcDb::OpenMode) const
Retrieves the specified Field from this object, and opens it in mode. More...
Acad::ErrorStatus  | getField (const ACHAR *, AcDbObjectId &) const
Gets the pszPropName field object from field dictionary of this AcDbObject object, using pszPropName as key. More...
AcDbObjectId  | getFieldDictionary () const
Returns the Field dictionary associated with this object,. More...
Acad::ErrorStatus  | getFieldDictionary (AcDbDictionary *&, AcDb::OpenMode) const
Gets and opens the field dictionary for this. More...
Acad::ErrorStatus  | getObjectBirthVersion (AcDb::AcDbDwgVersion &, AcDb::MaintenanceReleaseVersion &)
This function is currently not supported by the CAD engine, always returns Acad::eOk, and 'kDHL_CURRENT' + 'kMReleaseCurrent' results. More...
virtual Acad::ErrorStatus  | getObjectSaveVersion (const AcDbDwgFiler *, AcDb::AcDbDwgVersion &, AcDb::MaintenanceReleaseVersion &)
Returns the DWG version for saving the object. More...
virtual Acad::ErrorStatus  | getObjectSaveVersion (const AcDbDxfFiler *, AcDb::AcDbDwgVersion &, AcDb::MaintenanceReleaseVersion &)
Returns the DWG version for saving the object. More...
int  | getOdaOpenCount () const
This function returns the number of open ODA instances for this object. More...
int  | getOdaOpenState () const
This function returns the ODA object open state flags as bitfields, for diagnostic purpose. More...
virtual void  | goodbye (const AcDbObject *)
A handler function for persistent reactors. More...
Acad::ErrorStatus  | handOverTo (AcDbObject *, Adesk::Boolean=Adesk::kTrue, Adesk::Boolean=Adesk::kTrue)
Hands over objects identity to another object. More...
bool  | hasFields () const
Return true if this object has single or multiple fields associated with him. More...
bool  | hasPersistentReactor (AcDbObjectId) const
Checks the input objectId in this object reactor list. More...
bool  | hasSaveVersionOverride ()
This function indicates whether this object overrides the filer's save version. More...
virtual AcDbObjectId  | id () const
Returns the database id of this object. More...
Adesk::Boolean  | isAcDbObjectIdsInFlux () const
Checks whether a deep clone operation was completed. More...
Adesk::Boolean  | isAProxy () const
Adesk::Boolean  | isCancelling () const
Adesk::Boolean  | isErased () const
Returns whether this object is erased. More...
Adesk::Boolean  | isEraseStatusToggled () const
Checks whether the object erase status has been toggled. More...
Adesk::Boolean  | isModified () const
Returns whether this object's assertWriteEnabled() has been called since it was opened. More...
Adesk::Boolean  | isModifiedGraphics () const
Checks whether this object graphics will be updated when the object is closed. More...
Adesk::Boolean  | isModifiedXData () const
Checks whether this object's xData was modified. More...
Adesk::Boolean  | isNewObject () const
Returns true if and only if this object has not been closed since it was created. More...
Adesk::Boolean  | isNotifyEnabled () const
Returns whether this object is opened for notify. More...
Adesk::Boolean  | isNotifying () const
virtual Adesk::Boolean  | isPersistent () const
Returns the 'persistent' status of a database object. More...
Adesk::Boolean  | isReadEnabled () const
Returns whether this object is opened for read. More...
 Adesk::Boolean  | isReallyClosing () const
Checks whether the next close call will completely close this object return true if on the next call the object will be completely closed false otherwise.
Adesk::Boolean  | isTransactionResident () const
Gets the object transaction status. More...
Adesk::Boolean  | isUndoing () const
bool  | isUndoRecordingDisabled () const
Returns whether the undo recording for the object is enabled or not. More...
Adesk::Boolean  | isWriteEnabled () const
Returns whether this object is opened for write. More...
virtual AcDb::DuplicateRecordCloning  | mergeStyle () const
Returns the object's merge behavior during cloning. More...
virtual void  | modified (const AcDbObject *)
A handler function for persistent reactors. More...
virtual void  | modifiedGraphics (const AcDbEntity *)
A handler function for persistent reactors. More...
virtual void  | modifiedXData (const AcDbObject *)
A handler function for persistent reactors. More...
virtual void  | modifyUndone (const AcDbObject *)
A handler function for persistent reactors. More...
virtual void  | objectClosed (const AcDbObjectId)
A handler function for persistent reactors. More...
AcDbObjectId  | objectId () const
Returns object id. More...
virtual void  | openedForModify (const AcDbObject *)
A handler function for persistent reactors. More...
AcDbObjectId  | ownerId () const
Returns object id of the owner. More...
AcDbVoidPtrArray *  | reactors ()
Gets the object pointers to reactors. More...
const AcDbVoidPtrArray *  | reactors () const
Gets the object pointers to reactors. More...
virtual void  | reappended (const AcDbObject *)
A handler function for persistent reactors. More...
 virtual void  | recvPropagateModify (const AcDbObject *)
Not implemented yet.
Acad::ErrorStatus  | releaseExtensionDictionary ()
Removes the extension dictionary associated with this object. More...
virtual Acad::ErrorStatus  | removeField (AcDbObjectId)
Removes the Field specified by acFieldId from this object. More...
virtual Acad::ErrorStatus  | removeField (const ACHAR *)
Removes the Field specified by szKeyString from this object. More...
virtual Acad::ErrorStatus  | removeField (const ACHAR *, AcDbObjectId &)
Removes the Field specified by acPszKeyString from this object, and returns its ObjectId value. More...
virtual Acad::ErrorStatus  | removePersistentReactor (AcDbObjectId)
Removes a persistent reactor from this object reactor list. More...
Acad::ErrorStatus  | removeReactor (AcDbObjectReactor *) const
Removes a transient reactor to this object. More...
void  | setAcDbObjectIdsInFlux ()
Call this function to indicate that the object IDs of this object and its sub-objects (if any) are not yet valid. More...
Acad::ErrorStatus  | setBinaryData (const ACHAR *, Adesk::Int32, const char *)
Creates a copy of the binary data, divides it in up to 127 bytes binary chunks and
 sets them as resbufs in the resbuf chain of this object's extension dictionary xrecord entry given by entryName. More...
virtual Acad::ErrorStatus  | setField (const ACHAR *, AcDbField *, AcDbObjectId &)
Adds the pAcField field object to field dictionary of this AcDbObject object, using pKey as key. More...
void  | setHasSaveVersionOverride (bool)
This function can be called to specify that the object has a "save version override". More...
virtual Acad::ErrorStatus  | setOwnerId (AcDbObjectId)
Sets the ownerId data member of the object to be objId. More...
virtual Acad::ErrorStatus  | setXData (const resbuf *)
Sets/removes xData associated with this object. More...
virtual Acad::ErrorStatus  | subCancel ()
Possibility to veto a cancel operation from within custom entities. More...
virtual Acad::ErrorStatus  | subClose ()
virtual Acad::ErrorStatus  | subErase (Adesk::Boolean)
This hook is called during an AcDbObject::erase call, before any actual erase operation is performed. More...
 virtual Acad::ErrorStatus  | subHandOverTo (AcDbObject *)
virtual void  | subObjModified (const AcDbObject *, const AcDbObject *)
A handler function for persistent reactors. More...
 virtual Acad::ErrorStatus  | subOpen (AcDb::OpenMode)
virtual Acad::ErrorStatus  | subSwapIdWith (AcDbObjectId, Adesk::Boolean=Adesk::kFalse, Adesk::Boolean=Adesk::kFalse)
This hook is called during an AcDbObject::swapIdWith() call, before any actual swap operation is performed. More...
Acad::ErrorStatus  | swapIdWith (AcDbObjectId, Adesk::Boolean=Adesk::kFalse, Adesk::Boolean=Adesk::kFalse)
Swaps the object id's between the object identified by param swapId and this object. More...
virtual Acad::ErrorStatus  | swapReferences (const AcDbIdMapping &)
Not implemented yet. More...
virtual void  | unappended (const AcDbObject *)
A handler function for persistent reactors. More...
AcDbDwgFiler *  | undoFiler ()
Gets the undo filer for this object. More...
Acad::ErrorStatus  | upgradeFromNotify (Adesk::Boolean &)
Upgrades the open status of this object to AcDb::kForWrite, if this object is already open (either in AcDb::kForRead, AcDb::kForNotify or AcDb::kForWrite) More...
Acad::ErrorStatus  | upgradeOpen ()
Changes the objects open mode to AcDb::kForWrite and sends notifications. More...
virtual Acad::ErrorStatus  | wblockClone (AcRxObject *, AcDbObject *&, AcDbIdMapping &, Adesk::Boolean=Adesk::kTrue) const final
Clones this object, appends it to the owner pOwner and adds an AcDbIdPair record to the idMap. More...
virtual resbuf *  | xData (const ACHAR *=NULL) const
Returns the xData associated with this object. More...
Acad::ErrorStatus  | xDataTransformBy (const AcGeMatrix3d &)
Transforms the extended data according to parameter transformation matrix. More...
 virtual void  | xmitPropagateModify () const
Not implemented yet.
 virtual  | ~AcDbObject ()
Destructor.
 Public Member Functions inherited from AcGiDrawable
virtual bool  | bounds (AcDbExtents &) const
virtual DrawableType  | drawableType () const
 virtual AcGiDrawStream *  | drawStream () const
 AcGsNode *  | gsNode () const
virtual AcDbObjectId  | id () const =0
virtual Adesk::Boolean  | isPersistent () const =0
virtual Adesk::UInt32  | regenSupportFlags () const final
Returns whether and to which level this object supports MultiThreading. More...
 virtual Adesk::Boolean  | RolloverHit (Adesk::ULongPtr, Adesk::ULongPtr, Adesk::Boolean)
 virtual Adesk::UInt32  | setAttributes (AcGiDrawableTraits *) final
 virtual void  | setDrawStream (AcGiDrawStream *)
 void  | setGsNode (AcGsNode *)
 virtual void  | viewportDraw (AcGiViewportDraw *) final
 virtual Adesk::UInt32  | viewportDrawLogicalFlags (AcGiViewportDraw *) final
 virtual Adesk::Boolean  | worldDraw (AcGiWorldDraw *) final
 Public Member Functions inherited from AcRxObject
virtual AcRxObject *  | clone () const
Exported and implemented. More...
 virtual AcRx::Ordering  | comparedTo (const AcRxObject *) const
Exported and implemented.
virtual Acad::ErrorStatus  | copyFrom (const AcRxObject *)
Exported and implemented. More...
 virtual AcRxClass *  | isA () const
Exported and implemented.
virtual Adesk::Boolean  | isEqualTo (const AcRxObject *) const
Exported and implemented. More...
bool  | isKindOf (const AcRxClass *) const
Checks the object class. More...
AcRxObject *  | queryX (const AcRxClass *) const
returns the protocol extension object assigned to this class or a parent class. More...
AcRxObject *  | x (const AcRxClass *) const
returns the protocol extension object assigned to this class or a parent class. More...
 virtual  | ~AcRxObject ()
Destructor.
 Public Attributes
AcDbEntity
This protected constructor sets the initial value for color to 257, and for the objectids for layer and linetype to AcDbObjectId::kNull. More...
 Protected Member Functions
 virtual Acad::ErrorStatus  | subAddSubentPaths (const AcDbFullSubentPathArray &)
 virtual Adesk::Boolean  | subCloneMeForDragging ()
 virtual Acad::ErrorStatus  | subDeleteSubentPaths (const AcDbFullSubentPathArray &)
virtual Acad::ErrorStatus  | subExplode (AcDbVoidPtrArray &) const
 virtual Acad::ErrorStatus  | subGetCompoundObjectTransform (AcGeMatrix3d &) const
virtual Acad::ErrorStatus  | subGetGeomExtents (AcDbExtents &) const
virtual Acad::ErrorStatus  | subGetGripEntityUCS (const void *, AcGeVector3d &, AcGePoint3d &, AcGeVector3d &) const
virtual Acad::ErrorStatus  | subGetGripPoints (AcDbGripDataPtrArray &, const double, const int, const AcGeVector3d &, const int) const
virtual Acad::ErrorStatus  | subGetGripPoints (AcGePoint3dArray &, AcDbIntArray &, AcDbIntArray &) const
 virtual Acad::ErrorStatus  | subGetGripPointsAtSubentPath (const AcDbFullSubentPath &, AcDbGripDataPtrArray &, const double, const int, const AcGeVector3d &, const int) const
virtual Acad::ErrorStatus  | subGetGsMarkersAtSubentPath (const AcDbFullSubentPath &, AcArray< Adesk::GsMarker > &) const
virtual Acad::ErrorStatus  | subGetOsnapPoints (AcDb::OsnapMode, Adesk::GsMarker, const AcGePoint3d &, const AcGePoint3d &, const AcGeMatrix3d &, AcGePoint3dArray &, AcDbIntArray &) const
 virtual Acad::ErrorStatus  | subGetOsnapPoints (AcDb::OsnapMode, Adesk::GsMarker, const AcGePoint3d &, const AcGePoint3d &, const AcGeMatrix3d &, AcGePoint3dArray &, AcDbIntArray &, const AcGeMatrix3d &) const
virtual Acad::ErrorStatus  | subGetStretchPoints (AcGePoint3dArray &) const
 virtual Acad::ErrorStatus  | subGetSubentClassId (const AcDbFullSubentPath &, CLSID *) const
 virtual Acad::ErrorStatus  | subGetSubentPathGeomExtents (const AcDbFullSubentPath &, AcDbExtents &) const
virtual Acad::ErrorStatus  | subGetSubentPathsAtGsMarker (AcDb::SubentType, Adesk::GsMarker, const AcGePoint3d &, const AcGeMatrix3d &, int &, AcDbFullSubentPath *&, int=0, AcDbObjectId *=nullptr) const
virtual Acad::ErrorStatus  | subGetTransformedCopy (const AcGeMatrix3d &, AcDbEntity *&) const
virtual void  | subGripStatus (const AcDb::GripStat)
 virtual bool  | subHideMeForDragging () const
virtual Acad::ErrorStatus  | subHighlight (const AcDbFullSubentPath &=kNullSubent, const Adesk::Boolean=false) const
virtual Acad::ErrorStatus  | subIntersectWith (const AcDbEntity *, AcDb::Intersect, AcGePoint3dArray &, Adesk::GsMarker=0, Adesk::GsMarker=0) const
virtual Acad::ErrorStatus  | subIntersectWith (const AcDbEntity *, AcDb::Intersect, const AcGePlane &, AcGePoint3dArray &, Adesk::GsMarker=0, Adesk::GsMarker=0) const
virtual bool  | subIsContentSnappable () const
virtual void  | subList () const
virtual Acad::ErrorStatus  | subMoveGripPointsAt (const AcDbIntArray &, const AcGeVector3d &)
virtual Acad::ErrorStatus  | subMoveGripPointsAt (const AcDbVoidPtrArray &, const AcGeVector3d &, const int)
 virtual Acad::ErrorStatus  | subMoveGripPointsAtSubentPaths (const AcDbFullSubentPathArray &, const AcDbVoidPtrArray &, const AcGeVector3d &, const int)
virtual Acad::ErrorStatus  | subMoveStretchPointsAt (const AcDbIntArray &, const AcGeVector3d &)
virtual Adesk::UInt32  | subSetAttributes (AcGiDrawableTraits *)
Sets the values of this object's subentity traits and returns with the calling object's subentity traits. More...
virtual Acad::ErrorStatus  | subSetVisibility (AcDb::Visibility, Adesk::Boolean=true)
 virtual void  | subSubentGripStatus (const AcDb::GripStat, const AcDbFullSubentPath &)
virtual AcDbEntity *  | subSubentPtr (const AcDbFullSubentPath &) const
virtual Acad::ErrorStatus  | subTransformBy (const AcGeMatrix3d &)
 virtual Acad::ErrorStatus  | subTransformSubentPathsBy (const AcDbFullSubentPathArray &, const AcGeMatrix3d &)
virtual Acad::ErrorStatus  | subUnhighlight (const AcDbFullSubentPath &=kNullSubent, const Adesk::Boolean=false) const
virtual void  | subViewportDraw (AcGiViewportDraw *)
 virtual AcDb::Visibility  | subVisibility () const
virtual Adesk::Boolean  | subWorldDraw (AcGiWorldDraw *)
 Protected Member Functions inherited from AcDbObject
virtual Acad::ErrorStatus  | subDeepClone (AcDbObject *, AcDbObject *&, AcDbIdMapping &, Adesk::Boolean=true) const
virtual Acad::ErrorStatus  | subGetClassID (CLSID *) const
virtual Adesk::UInt32  | subSetAttributes (AcGiDrawableTraits *)
Sets the values of this object's subentity traits and returns with the calling object's subentity traits. More...
virtual void  | subViewportDraw (AcGiViewportDraw *)
virtual Adesk::UInt32  | subViewportDrawLogicalFlags (AcGiViewportDraw *)
virtual Acad::ErrorStatus  | subWblockClone (AcRxObject *, AcDbObject *&, AcDbIdMapping &, Adesk::Boolean=true) const
virtual Adesk::Boolean  | subWorldDraw (AcGiWorldDraw *)
 Protected Member Functions inherited from AcGiDrawable
virtual Adesk::UInt32  | subRegenSupportFlags () const
Returns whether and to which level this object supports MultiThreading. More...
virtual Adesk::UInt32  | subSetAttributes (AcGiDrawableTraits *)=0
virtual void  | subViewportDraw (AcGiViewportDraw *)=0
 virtual Adesk::UInt32  | subViewportDrawLogicalFlags (AcGiViewportDraw *)
virtual Adesk::Boolean  | subWorldDraw (AcGiWorldDraw *)=0
 Protected Member Functions inherited from AcRxObject
AcRxObject ()
Exported and implemented.
 Additional Inherited Members
 Static Public Member Functions inherited from AcRxObject
 static AcRxObject *  | cast (const AcRxObject *)
 static AcRxClass *  | desc ()
Exported and implemented.
 Static Public Member Functions inherited from AcHeapOperators
 static void  | operator delete (void *)
_
 static void  | operator delete (void *, const char *, int)
 static void  | operator delete (void *, void *)
 static void  | operator delete[] (void *)
_
 static void  | operator delete[] (void *, const char *, int)
 static void *  | operator new (size_t)
_
 static void *  | operator new (size_t, const char *, int)
 static void *  | operator new (size_t, void *p)
 static void *  | operator new[] (size_t)
_
 static void *  | operator new[] (size_t, const char *, int)
Detailed Description
_
Member Function Documentation
◆ applyPartialUndo()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbEntity::applyPartialUndo  |  ( |  AcDbDwgFiler *  |  container,
|  AcRxClass *  |  pClassObject
)
virtual
See also
AcDbObject::applyPartialUndo(AcDbDwgFiler*, AcRxClass*)
Reimplemented from AcDbObject.
Reimplemented in AcDbPolyline.
◆ audit()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbEntity::audit  |  ( |  AcDbAuditInfo *  |  info | )
virtual
See also
AcDbObject::audit(AcDbAuditInfo*)
Reimplemented from AcDbObject.
Reimplemented in AcDbMPolygon, and AcDbTable.
◆ blockId()
 UX_EXPORT_FUNCTION AcDbObjectId AcDbEntity::blockId  |  ( |   | ) |   const
Returns the Object ID of the BlockTableRecord that owns this entity.
Returns
owners objectId, if Entity is part of a block,
 modelspace and paperspace are special blocks
AcDbObjectId::kNull otherwise
◆ boundingBoxIntersectWith() [1/2]
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbEntity::boundingBoxIntersectWith  |  ( |  const AcDbEntity *  |  pOther,
|  AcDb::Intersect  |  intersType,
|  AcGePoint3dArray &  |  acPoints,
|  Adesk::GsMarker  |  gsMarkerThis,
|  Adesk::GsMarker  |  gsMarkerOther
) |   |  const
Finds the intersection between the edges of the bounding box for this entity and the pOhter entity.
The bounding box for this entity is calculated by calling the method getGeomExtents() of this entity.
Parameters
[in] | pOther | entity to be checked for intersection with the current's bounding box
[in] | intersType | used to determine if this or the other entity will be extended
[out] | acPoints | intersection points
[in] | gsMarkerThis | only the subentity of "this" entity that has the specified GS marker will be checked for intersection. Input 0 for entire entity.
[in] | gsMarkerOther | only the subentity of other entity that has the specified GS marker will be checked for intersection. Input 0 for entire entity.
Returns
Acad::eOk if successful
◆ boundingBoxIntersectWith() [2/2]
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbEntity::boundingBoxIntersectWith  |  ( |  const AcDbEntity *  |  pOther,
|  AcDb::Intersect  |  intersType,
|  const AcGePlane &  |  plane,
|  AcGePoint3dArray &  |  acPoints,
|  Adesk::GsMarker  |  gsMarkerThis,
|  Adesk::GsMarker  |  gsMarkerOther
) |   |  const
First, the function projects the other entity and the bounding box of this entity on plane specified by plane.
Next it finds the intersection between the edges of the projected bounding box for this entity and the projection of pOhter entity and then projects the intersection points back in the original plane of the bounding box. The bounding box for this entity is calculated by calling its method getGeomExtents().
Parameters
[in] | pOther | entity to be checked for intersection with the current's bounding box
[in] | intersType | used to determine if this or the other entity will be extended
[in] | plane | projection plane used for intersection
[out] | acPoints | intersection points
[in] | gsMarkerThis | only the subentity of "this" entity that has the specified GS marker will be checked for intersection. Input 0 for entire entity.
[in] | gsMarkerOther | only the subentity of other entity that has the specified GS marker will be checked for intersection. Input 0 for entire entity.
Returns
Acad::eOk if successful
◆ bounds()
 UX_EXPORT_FUNCTION bool AcDbEntity::bounds  |  ( |  AcDbExtents &  |  bounds | ) |   const
virtual
Returns the extents of this entity as AcDbExtents.
Parameters
[out] | bounds | receives the extents of this entity
Returns
true, if extents have been set, false otherwise
Reimplemented from AcGiDrawable.
Reimplemented in AcDbSubDMesh.
◆ castShadows()
 UX_EXPORT_FUNCTION bool AcDbEntity::castShadows  |  ( |   | ) |   const
virtual
Checks if this entity is able to cast shadows.
Returns
true if entity casts shadows, false otherwise
Reimplemented in AcDbArc, AcDbBlockBegin, AcDbBlockEnd, AcDbCircle, AcDbDimension, AcDbEllipse, AcDbFcf, AcDbHatch, AcDbLight, AcDbLine, AcDbOle2Frame, AcDbPoint, AcDbPolyline, AcDbRasterImage, AcDbSequenceEnd, AcDbSpline, AcDbTable, AcDbText, and AcDbTrace.
◆ cloneMeForDragging()
 UX_EXPORT_FUNCTION Adesk::Boolean AcDbEntity::cloneMeForDragging  |  ( |   | )
finalvirtual
Checks if a clone will be created for this entity in case of a drag operation.
Returns
Adesk::kTrue if the cloneMeForDragging flag is set, Adesk::kFalse otherwise
◆ color()
 UX_EXPORT_FUNCTION AcCmColor AcDbEntity::color  |  ( |   | ) |   const
Returns the true color information of the entity.
If applicable bookname and colorname information are also contained in the resulting AcCmColor instance. As designed, the returned AcCmColor instance has no connection to the entity.
Returns
color of the entity as AcCmColor
◆ colorIndex()
 UX_EXPORT_FUNCTION Adesk::UInt16 AcDbEntity::colorIndex  |  ( |   | ) |   const
Returns the color number in a range from 0 to 256.
0 means entity color BYBLOCK, 256 means entity color BYLAYER.
Returns
color index
◆ dragStatus()
 UX_EXPORT_FUNCTION void AcDbEntity::dragStatus  |  ( |  const AcDb::DragStat  |  value | )
virtual
Reimplemented in AcDbNurbSurface, and AcDbSubDMesh.
◆ draw()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbEntity::draw  |  ( |   | )
Draws or redraws the entity on screen.
Returns
Acad::eOk if done
 Acad::eNotInDatabase, if entity is not database resident
 Acad::eNotCurrentDatabase, if the entity is not in the current database
◆ drawable()
 UX_EXPORT_FUNCTION AcGiDrawable * AcDbEntity::drawable  |  ( |   | )
virtual
Reimplemented from AcDbObject.
◆ dwgInFields()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbEntity::dwgInFields  |  ( |  AcDbDwgFiler *  |  dwgFiler | )
virtual
See also
AcDbObject::dwgInFields(AcDbDwgFiler*)
Reimplemented from AcDbObject.
Reimplemented in AcDbExtrudedSurface, AcDbLight, AcDbLoftedSurface, AcDbMLeader, AcDbMPolygon, AcDbOle2Frame, AcDbOleFrame, AcDbPlaneSurface, AcDbPolyline, AcDbRasterImage, AcDbRevolvedSurface, AcDbSection, AcDbSurface, AcDbSweptSurface, and AcDbTable.
◆ dwgOutFields()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbEntity::dwgOutFields  |  ( |  AcDbDwgFiler *  |  dwgFiler | ) |   const
virtual
See also
AcDbObject::dwgOutFields(AcDbDwgFiler*)
Reimplemented from AcDbObject.
Reimplemented in AcDbExtrudedSurface, AcDbLight, AcDbLoftedSurface, AcDbMLeader, AcDbMPolygon, AcDbOle2Frame, AcDbOleFrame, AcDbPlaneSurface, AcDbPolyline, AcDbRasterImage, AcDbRevolvedSurface, AcDbSection, AcDbSurface, AcDbSweptSurface, and AcDbTable.
◆ dxfInFields()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbEntity::dxfInFields  |  ( |  AcDbDxfFiler *  |  dxfFiler | )
virtual
See also
AcDbObject::dxfInFields(AcDbDxfFiler*)
Reimplemented from AcDbObject.
Reimplemented in AcDbExtrudedSurface, AcDbLight, AcDbLoftedSurface, AcDbMLeader, AcDbMPolygon, AcDbOle2Frame, AcDbOleFrame, AcDbPlaneSurface, AcDbPolyline, AcDbRasterImage, AcDbRevolvedSurface, AcDbSection, AcDbSurface, AcDbSweptSurface, and AcDbTable.
◆ dxfOutFields()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbEntity::dxfOutFields  |  ( |  AcDbDxfFiler *  |  dxfFiler | ) |   const
virtual
See also
AcDbObject::dxfOutFields(AcDbDxfFiler*)
Reimplemented from AcDbObject.
Reimplemented in AcDbExtrudedSurface, AcDbLight, AcDbLoftedSurface, AcDbMLeader, AcDbMPolygon, AcDbOle2Frame, AcDbOleFrame, AcDbPlaneSurface, AcDbPolyline, AcDbRasterImage, AcDbRevolvedSurface, AcDbSection, AcDbSurface, AcDbSweptSurface, and AcDbTable.
◆ entityColor()
 UX_EXPORT_FUNCTION AcCmEntityColor AcDbEntity::entityColor  |  ( |   | ) |   const
Returns the lightweight color information of the entity.
Returns
color of the entity as AcCmColor
◆ explode()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbEntity::explode  |  ( |  AcDbVoidPtrArray &  |  pointerArray | ) |   const
finalvirtual
Parameters
[in,out] | pointerArray | Array of pointers to existing and new entities
Returns
Acad::eOk if successful
◆ getCompoundObjectTransform()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbEntity::getCompoundObjectTransform  |  ( |  AcGeMatrix3d &  |  matrix | ) |   const
finalvirtual
It is used for object without geometry like AcDbMleader.
Parameters
[out] | matrix | It is used for nested object
Returns
Acad::eOk if successful or Acad::eNotApplicable if you don't override function in derived class
◆ getEcs()
 UX_EXPORT_FUNCTION void AcDbEntity::getEcs  |  ( |  AcGeMatrix3d &  |  resultMatrix | ) |   const
virtual
Returns the transformation matrix from OCS (Object Coordinate System) to WCS (World Coordinate System).
Intended to be overridden in custom entities that need to use this this feature. Default implementation returns identity matrix.
Parameters
[out] | resultMatrix | transformation matrix from OCS to WCS
Reimplemented in AcDbMText, and AcDbPolyline.
◆ getGeomExtents()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbEntity::getGeomExtents  |  ( |  AcDbExtents &  |  resultBox | ) |   const
finalvirtual
Returns extents of this entity.
Parameters
[out] | resultBox | 3D extents box of the entity
Returns
Acad::eOk if successful.
◆ getGripPoints()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbEntity::getGripPoints  |  ( |  AcGePoint3dArray &  |  pointArray,
|  AcDbIntArray &  |  snapSettingsArray,
|  AcDbIntArray &  |  idArray
) |   |  const
finalvirtual
Append grip points to the specified array.
Override this method in custom entities to define your own grip points.
Parameters
[in,out] | pointArray | the array of grip points
snapSettingsArray | not used
idArray | not used
Returns
Acad::eOk if successful
◆ getGsMarkersAtSubentPath()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbEntity::getGsMarkersAtSubentPath  |  ( |  const AcDbFullSubentPath &  |  subentId,
|  AcArray< Adesk::GsMarker > &  |  markerArray
) |   |  const
finalvirtual
Parameters
[in] | subentId | the full entity path with filled AcDbSubentId, for which the GS markers are requested
[out] | markerArray | the array of GS markers for specified entity path
Date
2011-08-04 torstenm implemented
◆ getMaterialMapper()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbEntity::getMaterialMapper  |  ( |  AcGiMapper &  |  result | ) |   const
virtual
Parameters
[out] | Get | an pointer for object AcGiMapper. The object is used at entity to map a material.
Returns
Acad::eOk if successful, error code otherwise
◆ getOsnapPoints() [1/2]
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbEntity::getOsnapPoints  |  ( |  AcDb::OsnapMode  |  mode,
|  Adesk::GsMarker  |  subEntSelectMarker,
|  const AcGePoint3d &  |  pickedPnt,
|  const AcGePoint3d &  |  lastSelectedPnt,
|  const AcGeMatrix3d &  |  matrix,
|  AcGePoint3dArray &  |  snapIOArray,
|  AcDbIntArray &  |  idArray
) |   |  const
finalvirtual
Gets the entity osnap points.
Parameters
[in] | mode | osnap mode to search for
[in] | subEntSelectMarker | subentity identifier
[in] | pickedPnt | point provided by user
[in] | lastSelectedPnt | point provided by user before pickedPnt
[in] | matrix | WCD to DCS transform matrix
[in] | snapIOArray | input point array used to append the identified osnap points
[in] | idArray | unused
Returns
Acad::eOk if successful Acad::eNotApplicable if usedfor dimensions
◆ getOsnapPoints() [2/2]
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbEntity::getOsnapPoints  |  ( |  AcDb::OsnapMode  |  mode,
|  Adesk::GsMarker  |  subEntSelectMarker,
|  const AcGePoint3d &  |  pickedPnt,
|  const AcGePoint3d &  |  lastSelectedPnt,
|  const AcGeMatrix3d &  |  matrix,
|  AcGePoint3dArray &  |  snapIOArray,
|  AcDbIntArray &  |  idArray,
|  const AcGeMatrix3d &  |  blockMatrix
) |   |  const
finalvirtual
Gets the entity osnap points.
Parameters
[in] | mode | osnap mode to search for
[in] | subEntSelectMarker | subentity identifier
[in] | pickedPnt | point provided by user
[in] | lastSelectedPnt | point provided by user before pickedPnt
[in] | matrix | WCD to DCS transform matrix
[in] | snapIOArray | input point array used to append the identified osnap points
[in] | idArray | unused
[in] | blockMatrix | block transformation matrix
Returns
Acad::eOk if successful Acad::eNotApplicable if usedfor dimensions
◆ getPlane()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbEntity::getPlane  |  ( |  AcGePlane &  |  plane,
|  AcDb::Planarity &  |  planarity
) |   |  const
virtual
Returns the plane that contains this entity.
Parameters
[out] | plane | Receives the plane that contains this entity
[out] | planarity | Receives the planarity of this entity
Returns
Acad::eOk if successful
Remarks
may show different results comparing with other CAD platforms when caller entity is an AcDbSpline, AcDb3dPolyline or AcDbDimension object
Reimplemented in AcDbBlockReference, AcDbDimension, AcDbHatch, AcDbPoint, AcDbShape, AcDbSurface, and AcDbTrace.
◆ getPlotStyleNameId()
 UX_EXPORT_FUNCTION AcDb::PlotStyleNameType AcDbEntity::getPlotStyleNameId  |  ( |  AcDbObjectId &  |  placeHolderId | ) |   const
Returns the plot style name type and its associated id.
Parameters
[out] | placeHolderId | Receives the Object ID of the Plot Style Name of this entity.
Returns
the type of the plot style name. Can be one of: kPlotStyleNameByLayer, kPlotStyleNameByBlock, kPlotStyleNameIsDictDefault, kPlotStyleNameById
◆ getStretchPoints()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbEntity::getStretchPoints  |  ( |  AcGePoint3dArray &  |  pointArray | ) |   const
finalvirtual
Append stretch points to the specified array.
Override this method in custom entities to define your own stretch points.
Parameters
[in,out] | pointArray | the array of stretch points
Returns
Acad::eOk if successful
◆ getSubentPathsAtGsMarker()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbEntity::getSubentPathsAtGsMarker  |  ( |  AcDb::SubentType  |  acSubentType,
|  Adesk::GsMarker  |  gsMarker,
|  const AcGePoint3d &  |  acPickPoint,
|  const AcGeMatrix3d &  |  acViewMatrix,
|  int &  |  pathCount,
|  AcDbFullSubentPath *&  |  pAcSubentPaths,
|  int  |  insertCount = 0,
|  AcDbObjectId *  |  pAcInsertIds = NULL
) |   |  const
finalvirtual
Gets the subentity paths appropriate for the passed in gs marker.
Parameters
[in] | acSubentType | subentity type
[in] | gsMarker | gs marker corresponding to the retrieved subentity
[in] | acPickPoint | point used for selecting the entity
[in] | acViewMatrix | WCS to DCS transformation matrix
[out] | pathCount | number of AcDbFullSubentPath objects in the pAcSubentPaths array
[out] | pAcSubentPaths | pointer to an array of AcDbFullSubentPath objects
[in] | insertCount | number of AcDbBlockReference objects in the pAcInsertIds array
[in] | pAcInsertIds | pointer to an array of AcDbObjectId objects (the insert stack)
Returns
Acad::eOk if successful,
 Acad::eWrongSubentityType in case of not suitable subentity type specified
◆ getTransformedCopy()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbEntity::getTransformedCopy  |  ( |  const AcGeMatrix3d &  |  matrix,
|  AcDbEntity *&  |  resultEntity
) |   |  const
finalvirtual
Creates a copy of the current entity applying the transformation matrix.
Parameters
[in] | matrix | transformation matrix
[out] | resultEntity | reference to the transformed entity
Returns
Acad::eOk if successful
◆ highlight()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbEntity::highlight  |  ( |  const AcDbFullSubentPath &  |  subEntPath = kNullSubent,
|  const Adesk::Boolean  |  allVPorts = Adesk::kFalse
) |   |  const
finalvirtual
Highlights part of, or entire entity.
The entity will not be highlighted if it is queued for regeneration on the screen. Therefore draw() method, or flushGraphics() should be called first. Do not call this function on an entity opened for write.
Parameters
[in] | subEntPath | identifying the subentity to highlight, if kNullSubent passed then entire entity will be highlighted.
[in] | allVPorts | highlights entity in all viewports
Returns
Acad::eOk if successful,
◆ intersectWith() [1/2]
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbEntity::intersectWith  |  ( |  const AcDbEntity *  |  pOther,
|  AcDb::Intersect  |  intersType,
|  AcGePoint3dArray &  |  acPoints,
|  Adesk::GsMarker  |  gsMarkerThis = 0,
|  Adesk::GsMarker  |  gsMarkerOther = 0
) |   |  const
finalvirtual
Finds the intersection between this entity and the pOhter entity.
Parameters
[in] | pOther | entity to be checked for intersection with the current entity
[in] | intersType | used to determine if this or the other entity will be extended
[out] | acPoints | intersection points
[in] | gsMarkerThis | only the subentity of "this" entity that has the specified GS marker will be checked for intersection. Input 0 for entire entity.
[in] | gsMarkerOther | only the subentity of other entity that has the specified GS marker will be checked for intersection. Input 0 for entire entity.
Returns
Acad::eOk if successful
◆ intersectWith() [2/2]
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbEntity::intersectWith  |  ( |  const AcDbEntity *  |  pOther,
|  AcDb::Intersect  |  intersType,
|  const AcGePlane &  |  plane,
|  AcGePoint3dArray &  |  acPoints,
|  Adesk::GsMarker  |  gsMarkerThis = 0,
|  Adesk::GsMarker  |  gsMarkerOther = 0
) |   |  const
finalvirtual
Projects this entity and the pOhter entity on plane, finds the intersection points between these projections and then projects back the points onto the caller entity.
Parameters
[in] | pOther | entity to be checked for intersection with the current entity
[in] | intersType | used to determine if this or the other entity will be extended
[in] | plane | projection plane used to find apparent intersection
[out] | acPoints | intersection points
[in] | gsMarkerThis | only the subentity of "this" entity that has the specified GS marker will be checked for intersection. Input 0 for entire entity.
[in] | gsMarkerOther | only the subentity of other entity that has the specified GS marker will be checked for intersection. Input 0 for entire entity.
Returns
Acad::eOk if successful
◆ isPlanar()
 UX_EXPORT_FUNCTION Adesk::Boolean AcDbEntity::isPlanar  |  ( |   | ) |   const
virtual
Reimplemented in AcDbTrace.
◆ layer()
 UX_EXPORT_FUNCTION ACHAR * AcDbEntity::layer  |  ( |   | ) |   const
Returns the layername.
The entity already has to be added to the database. The caller has to free the result, e.g. with acutDelString() . Other CAD libraries may crash, if this function is called on an entity not yet added to database. The BRX function will not crash. It will return an empty string, which has to be deleted by caller.
Returns
layer name
◆ layerId()
 UX_EXPORT_FUNCTION AcDbObjectId AcDbEntity::layerId  |  ( |   | ) |   const
Returns the Object ID of the LayerTableRecord referenced by this entity.
If the entity has no layer yet, AcDbObjectId::kNull is returned. This is only possible if the entity is not databaseresident.
Returns
ObjectId of the entities layer.
 AcDbObjectId::kNull, if entity has no layer set.
◆ linetype()
 UX_EXPORT_FUNCTION ACHAR * AcDbEntity::linetype  |  ( |   | ) |   const
Gets the linetype value.
Returns
linetype
◆ linetypeId()
 UX_EXPORT_FUNCTION AcDbObjectId AcDbEntity::linetypeId  |  ( |   | ) |   const
Gets the linetypeId value.
Returns
linetypeId
◆ lineWeight()
 UX_EXPORT_FUNCTION AcDb::LineWeight AcDbEntity::lineWeight  |  ( |   | ) |   const
Gets the entity line weight.
Returns
AcDb::LineWeight value
◆ list()
 UX_EXPORT_FUNCTION void AcDbEntity::list  |  ( |   | ) |   const
finalvirtual
Prints the properties in drawing window.
These are DXFName, layer, Model/Paperspace and handle.
◆ material()
 UX_EXPORT_FUNCTION ACHAR * AcDbEntity::material  |  ( |   | ) |   const
Gets the material assigned to this entity.
Returns
ACHAR * material, assigned to this entity; caller must deallocate the string using acutDelString()
◆ materialId()
 UX_EXPORT_FUNCTION AcDbObjectId AcDbEntity::materialId  |  ( |   | ) |   const
Gets the AcDbObjectId of the material assigned to this entity.
Returns
AcDbObjectId object id of the material, assigned to this entity
◆ moveGripPointsAt()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbEntity::moveGripPointsAt  |  ( |  const AcDbIntArray &  |  indexArray,
|  const AcGeVector3d &  |  translationVector
)
finalvirtual
Move the grip points pointed by the indexes specified in indexArray using the translationVector param direction and length Override this method in custom entities to define your own behaviour.
Parameters
[in] | indexArray | the array of indexes of grip points to be moved
[in] | translationVector | vector to the new position
Returns
Acad::eOk if successful
◆ moveStretchPointsAt()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbEntity::moveStretchPointsAt  |  ( |  const AcDbIntArray &  |  indexArray,
|  const AcGeVector3d &  |  translationVector
)
finalvirtual
Move the stretch points pointed by the indexes specified in indexArray with the offest specified by translationVector Override this method in custom entities to define your own behaviour.
Parameters
[in] | indexArray | the array of indexes of stretch points to be moved (stretched)
Returns
Acad::eOk if successful
◆ plotStyleName()
 UX_EXPORT_FUNCTION ACHAR * AcDbEntity::plotStyleName  |  ( |   | ) |   const
Returns the name of the plotStyleName string associated with this entity (DXF 390).
Returns
a string containing the name of the plot style. Caller has to deallocate the resulting string.
 NULL, if entity is not already added to a database.
◆ receiveShadows()
 UX_EXPORT_FUNCTION bool AcDbEntity::receiveShadows  |  ( |   | ) |   const
virtual
Checks if this entity is able to receive shadows.
Returns
true if entity receives shadows, false otherwise
Reimplemented in AcDbArc, AcDbBlockBegin, AcDbBlockEnd, AcDbCircle, AcDbDimension, AcDbEllipse, AcDbFcf, AcDbHatch, AcDbLight, AcDbLine, AcDbOle2Frame, AcDbPoint, AcDbPolyline, AcDbRasterImage, AcDbSequenceEnd, AcDbSpline, AcDbTable, AcDbText, and AcDbTrace.
◆ recordGraphicsModified()
 UX_EXPORT_FUNCTION void AcDbEntity::recordGraphicsModified  |  ( |  Adesk::Boolean  |  value = Adesk::kTrue | )
Controls the entity display update when closing it Entities not updated when closed are updated at the first regen.
Parameters
[in] | value | if false the entity is not updated on close if true the entity wiil be updated
◆ saveAs()
 UX_EXPORT_FUNCTION void AcDbEntity::saveAs  |  ( |  AcGiWorldDraw *  |  wd,
|  AcDb::SaveType  |  type
)
virtual
Generates the graphics primitives when a DWG save requiring proxy graphics to be saved is made.
Parameters
[in] | wd | pointer to a AcGiWorldDraw (or derived from) object
[in] | type | the context in which saveAs() is called
Reimplemented in AcDbMPolygon, AcDbOle2Frame, AcDbPolyline, and AcDbRasterImage.
◆ setCastShadows()
 UX_EXPORT_FUNCTION void AcDbEntity::setCastShadows  |  ( |  bool  |  value | )
virtual
Sets this entity's flag regarding casting shadows.
Parameters
[in] | value | flag value
Reimplemented in AcDbBlockBegin, AcDbBlockEnd, AcDbDimension, AcDbEllipse, AcDbFcf, AcDbHatch, AcDbLight, AcDbOle2Frame, AcDbRasterImage, AcDbSequenceEnd, AcDbSpline, and AcDbTable.
◆ setColor() [1/2]
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbEntity::setColor  |  ( |  const AcCmColor &  |  inputColor,
|  Adesk::Boolean  |  bSubEntities = Adesk::kTrue
)
virtual
Sets the color information of this entity from an AcCmColor instance.
Parameters
[in] | inputColor | color the entity should get
[in] | bSubEntities | If and only if true, applies the change to all sub-entities owned by this entity. Has only an effect on AcDb2dPolyline, AcDb3dPolyline, AcDbPolyFaceMesh, and AcDbPolygonMesh.
Returns
Returns eOk if successful, or an appropriate error code if not
◆ setColor() [2/2]
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbEntity::setColor  |  ( |  const AcCmColor &  |  inputColor,
|  bool  |  bSubEntities,
|  AcDbDatabase *  |  pDb
)
virtual
Sets the color property of this entity from an AcCmColor instance.
Parameters
[in] | inputColor | color the entity should get
[in] | bSubEntities | If and only if true, applies the change to all sub-entities owned by this entity. Has only an effect on AcDb2dPolyline, AcDb3dPolyline, AcDbPolyFaceMesh, and AcDbPolygonMesh.
[in] | pDb | reference database, used if this entity is not database-resident
Returns
returns eOk if successful, or an appropriate error code if not
◆ setColorIndex()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbEntity::setColorIndex  |  ( |  Adesk::UInt16  |  colorIndex,
|  Adesk::Boolean  |  bSubEntities = Adesk::kTrue
)
virtual
Sets the color index of this entity (DXF 62).
entity color BYBLOCK, 256 means entity color BYLAYER.
Parameters
[in] | colorIndex | color index the entity should get colorIndex will be in the range [0 .. 256]. 0 indicates a color of BYBLOCK. o 256 indicates a color of BYLAYER.
[in] | bSubEntities | If and only if true, applies the change to all sub-entities owned by this entity. Has only an effect on AcDb2dPolyline, AcDb3dPolyline, AcDbPolyFaceMesh, and AcDbPolygonMesh.
Returns
Returns eOk if successful, or an appropriate error code if not
Reimplemented in AcDbLeader.
◆ setDatabaseDefaults() [1/2]
 UX_EXPORT_FUNCTION void AcDbEntity::setDatabaseDefaults  |  ( |   | )
Applies the default properties of the entities database to this entity.
If the entity is not database resistent, the default properties of the current database are used. The following properties are set: color, layer, linetype, linetype scale, lineweight, plotstyle, visibility.
◆ setDatabaseDefaults() [2/2]
 UX_EXPORT_FUNCTION void AcDbEntity::setDatabaseDefaults  |  ( |  AcDbDatabase *  |  inputDb | )
Applies the default properties of the specified database to this entity.
The following properties are set: color, layer, linetype, linetype scale, lineweight, plotstyle, visibility
Parameters
[in] | db | database, to get the default values from.
◆ setLayer() [1/2]
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbEntity::setLayer  |  ( |  AcDbObjectId  |  layerObjId,
|  Adesk::Boolean  |  bSubEntities = Adesk::kTrue,
|  bool  |  bHidden = false
)
virtual
Sets the layer to be referenced by this entity (DXF 8).
If bHidden is false and layerObjId is a hidden layer, the function does nothing.
Parameters
[in] | layerObjId | objectId of the layer.
[in] | bSubEntities | If and only if true, applies the change to all sub-entities owned by this entity. Has only an effect on AcDb2dPolyline, AcDb3dPolyline, AcDbPolyFaceMesh, and AcDbPolygonMesh.
[in] | bHidden | may layerObjId be a hidden layer
Returns
Acad::eWrongObjectType, if layerObjId is no AcDbLayerTableRecord
 error codes from acdbOpenObject, if newId can not be opend for read.
 Acad::eOk, else - even if bHidden is false and layerObjId is a hidden layer
Remarks
In other CAD platforms the AcDbSequenceEnd of a blockreference may get the layer set for the blockreference. This behaviour does not depend on the value of bSubEntities. In DwgDirect the AcDbSequenceEnd layer is not affected by setting the blockreference layer. As the AcDbSequenceEnd is no visual entity, this special behaviour of DwgDirect is not conformed in BRX.
 nbHidden only has effect on platforms, that support hidden layers. Bricscad does not support hidden layers.
◆ setLayer() [2/2]
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbEntity::setLayer  |  ( |  const ACHAR *  |  layerName,
|  Adesk::Boolean  |  bSubEntities = Adesk::kTrue,
|  bool  |  bHidden = false
)
virtual
Sets the layer to be referenced by this entity (DXF 8).
If bHidden is false and layerName is a hidden layer, the function does nothing.
Parameters
[in] | layerName | Name of the layer.
[in] | bSubEntities | If and only if true, applies the change to all sub-entities owned by this entity. Has only an effect on AcDb2dPolyline, AcDb3dPolyline, AcDbPolyFaceMesh, and AcDbPolygonMesh.
[in] | bHidden | may layerName be a hidden layer
Returns
Acad::eKeyNotFound, if layerName is not found in the layertable
 Acad::eDeletedEntry,if layerName is a deleted layer
 Acad::eNoDatabase, if the entity is not in a database and there is no database.
 Acad::eOk, else - even if bHidden is false and layerName is a hidden layer
Remarks
bHidden only has effect on platforms, that support hidden layers. Bricscad does not support hidden layers.
◆ setLinetype() [1/2]
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbEntity::setLinetype  |  ( |  AcDbObjectId  |  ltypeObjectId,
|  Adesk::Boolean  |  bSubEntities = Adesk::kTrue
)
virtual
Sets the entities linetype to ltypeObjectId.
Parameters
[in] | ltypeObjectId | id of the linetype
[in] | bSubEntities | If and only if true, applies the change to all sub-entities
Returns
◆ setLinetype() [2/2]
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbEntity::setLinetype  |  ( |  const ACHAR *  |  linetypeName,
|  Adesk::Boolean  |  bSubEntities = Adesk::kTrue
)
virtual
Sets the entities linetype to the linetpye referenced by layerName.
The linetype is searched for in the entities database. If the entity is not database resident, the linetype is searched for in the current database.
Parameters
[in] | linetypeName | Name of the new linetype to set.
[in] | bSubEntities | If and only if true, applies the change to all sub-entities
Returns
Acad::eOk if successful Acad::eKeyNotFound, if the linetype linetypeName is not found in the database searched Acad::eKeyNotFound, if the linetype linetypeName is found, but has been erased (not Acad::eDeletedEntry, as stated by other CAD libraries) Acad::eNoDatabase, if the entity is not database resident and there is no current database
◆ setLinetypeScale()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbEntity::setLinetypeScale  |  ( |  double  |  value,
|  Adesk::Boolean  |  bSubEntities = Adesk::kTrue
)
virtual
sets value as entity linetype scale factor
Parameters
[in] | value | linetype scale factor for the entity. Must be non negativ.
[in] | bSubEntities | If and only if true, applies the change to all sub-entities
Returns
◆ setLineWeight()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbEntity::setLineWeight  |  ( |  AcDb::LineWeight  |  value,
|  Adesk::Boolean  |  bSubEntities = Adesk::kTrue
)
virtual
Sets the entity line weight.
Parameters
[in] | value | new line weight
[in] | bSubEntities | if true, then the value will be applied to subentities
Returns
Acad::eOk if successful
Acad::eInvalidInput if layerName is not acceptable
◆ setMaterial() [1/2]
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbEntity::setMaterial  |  ( |  AcDbObjectId  |  id,
|  Adesk::Boolean  |  bSubEntities = Adesk::kTrue
)
virtual
Not implemented yet.
Parameters
[in] | id | notyetdocumented
[in] | bSubEntities | If and only if true, applies the change to all sub-entities
Returns
◆ setMaterial() [2/2]
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbEntity::setMaterial  |  ( |  const ACHAR *  |  materialName,
|  Adesk::Boolean  |  bSubEntities = Adesk::kTrue
)
virtual
Assigns the material to the entity.
Parameters
[in] | materialName | name of material to set for the entity
[in] | bSubEntities | If and only if true, applies the change to all sub-entities
Returns
◆ setMaterialMapper()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbEntity::setMaterialMapper  |  ( |  const AcGiMapper &  |  inputMap,
|  Adesk::Boolean  |  bSubEntities = Adesk::kTrue
)
virtual
It is used for apply material (scale, rotation, projection, mode overrides) to an identity.If it is used AcGiMapper::kIdentity it will apply for entity a default mapper.
Parameters
[in] | bSubEntities | If and only if true, applies the change to all sub-entities
Returns
◆ setPlotStyleName() [1/2]
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbEntity::setPlotStyleName  |  ( |  AcDb::PlotStyleNameType  |  type,
|  AcDbObjectId  |  inputObjectId = AcDbObjectId::kNull,
|  Adesk::Boolean  |  bSubEntities = Adesk::kTrue
)
virtual
Sets the plot style of this entity.
If the entity is not database resident, nothing happens, but the function returns Acad::eOk.
Parameters
[in] | type | which plot style to set, has to be one of AcDb::kPlotStyleNameByLayer, AcDb::kPlotStyleNameByBlock, AcDb::kPlotStyleNameIsDictDefault, AcDb::kPlotStyleNameById
[in] | inputObjectId | id of the newly to set plot style, has to be the id of an AcDbPlaceHolder object. This argument is only considered if type is AcDb::kPlotStyleNameById if id is AcDbObjectId::kNull and type is AcDb::kPlotStyleNameById the function succeedes, but the entity is set to plotstyletype AcDb::kPlotStyleNameByLayer
[in] | bSubEntities | If and only if true, applies the change to all sub-entities owned by this entity. For builtin entities this flag has no effect in this function.
Returns
Acad::eOk, if succesfull,
 Acad::eWrongObjectType, if inputObjectId is no AcDbPlaceHolder
 error codes from acdbOpenObject, if inputObjectId can not be opend for read.
 Acad::ePlotStyleInColorDependentMode, if PSTYLEMODE is 1 (and entity database resident)
 additional errorcodes are possible
◆ setPlotStyleName() [2/2]
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbEntity::setPlotStyleName  |  ( |  const ACHAR *  |  name,
|  Adesk::Boolean  |  bSubEntities = Adesk::kTrue
)
virtual
Sets the plot style of this entity.
The entity must be database resident.
Parameters
[in] | name | Name of the plot style. This is searched for in the plot style name dictionary.
[in] | bSubEntities | If and only if true, applies the change to all sub-entities owned by this entity. This does not apply to block references.
Returns
Acad::eOk, if succesful
 Acad::eNoDatabase, if the entity is not database resident
 Acad::ePlotStyleInColorDependentMode, if PSTYLEMODE is 1 (and entity database resident)
 Acad::eKeyNotFound , if there is no plot style name
Remarks
setPlotStyleName("NOTTHERE") with a plot style not in the plot style name dictionary behaves different in other CAD libraries and in BRX. Other CAD libraries may set the (unknown) plot style name and returns Acad::eOk
◆ setPropertiesFrom()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbEntity::setPropertiesFrom  |  ( |  const AcDbEntity *  |  inputEntity,
|  Adesk::Boolean  |  bSubEntities = Adesk::kTrue
)
Copies the properties color, layer, linetype, linetypescale and visibility from the source entity pEntity to this entity.
If and only if bSubEntities is true, the changes are applied to all subentities owned by this entity
Parameters
[in] | inputEntity | source Entity
[in] | bSubEntities | apply changes to subentities of this entity. Default: true
Returns
Acad::eOk
◆ setReceiveShadows()
 UX_EXPORT_FUNCTION void AcDbEntity::setReceiveShadows  |  ( |  bool  |  value | )
virtual
Sets this entity's flag regarding receiving shadows.
Parameters
[in] | value | flag value
Reimplemented in AcDbBlockBegin, AcDbBlockEnd, AcDbDimension, AcDbEllipse, AcDbFcf, AcDbHatch, AcDbLight, AcDbOle2Frame, AcDbRasterImage, AcDbSequenceEnd, AcDbSpline, and AcDbTable.
◆ setTransparency()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbEntity::setTransparency  |  ( |  const AcCmTransparency &  |  settings,
|  Adesk::Boolean  |  bSubEntities = Adesk::kTrue
)
virtual
Sets the transparency setting of this entity, and returns eOk if successful.
Parameters
[in] | settings | the transparency settings to be assigned
[in] | bSubEntities | If and only if true, applies the change to all sub-entities owned by this entity. Has only an effect on AcDb2dPolyline, AcDb3dPolyline, AcDbPolyFaceMesh, and AcDbPolygonMesh.
Returns
Acad::eOk, if successful,
 error code, if not (the error code depends on the implementation of the overwritten function
Reimplemented in AcDbOle2Frame.
◆ setVisibility()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbEntity::setVisibility  |  ( |  AcDb::Visibility  |  value,
|  Adesk::Boolean  |  bSubEntities = Adesk::kTrue
)
finalvirtual
notyetdocumented.
Parameters
[in] | value | notyetdocumented
[in] | bSubEntities | If and only if true, applies the change to all sub-entities
Returns
◆ subentPtr()
 UX_EXPORT_FUNCTION AcDbEntity * AcDbEntity::subentPtr  |  ( |  const AcDbFullSubentPath &  |  acSubentPath | ) |   const
finalvirtual
Creates an entity as a copy of the subentity given by acSubentPath.
Parameters
[in] | acSubentPath | object which specifies the subentity to be copied
Returns
pointer to a dynamically allocated entity, which is the copy of the subentity
◆ subExplode()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbEntity::subExplode  |  ( |  AcDbVoidPtrArray &  |  pointerArray | ) |   const
protectedvirtual
Reimplemented in AcDbLeader, AcDbMPolygon, AcDbOle2Frame, AcDbPolyline, AcDbProxyEntity, AcDbRasterImage, and AcDbTable.
◆ subGetGeomExtents()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbEntity::subGetGeomExtents  |  ( |  AcDbExtents &  |  resultBox | ) |   const
protectedvirtual
Reimplemented in AcDbLight, AcDbMline, AcDbMPolygon, AcDbOle2Frame, AcDbOleFrame, AcDbPolyline, AcDbRasterImage, AcDbSection, and AcDbTable.
◆ subGetGripEntityUCS()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbEntity::subGetGripEntityUCS  |  ( |  const void *  |  pGripAppData,
|  AcGeVector3d &  |  normalVec,
|  AcGePoint3d &  |  origin,
|  AcGeVector3d &  |  xAxis
) |   |  const
protectedvirtual
Reimplemented in AcDbExtrudedSurface, AcDbLoftedSurface, AcDbRevolvedSurface, and AcDbSweptSurface.
◆ subGetGripPoints() [1/2]
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbEntity::subGetGripPoints  |  ( |  AcDbGripDataPtrArray &  |  gripArray,
|  const double  |  sizeOfDrawingUnit,
|  const int  |  sizeOfGrip,
|  const AcGeVector3d &  |  directionVector,
|  const int  |  gripBitMask
) |   |  const
protectedvirtual
Reimplemented in AcDbExtrudedSurface, AcDbLight, AcDbLoftedSurface, AcDbPlaneSurface, AcDbPolyline, AcDbRevolvedSurface, AcDbSection, and AcDbSweptSurface.
◆ subGetGripPoints() [2/2]
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbEntity::subGetGripPoints  |  ( |  AcGePoint3dArray &  |  pointArray,
|  AcDbIntArray &  |  snapSettingsArray,
|  AcDbIntArray &  |  idArray
) |   |  const
protectedvirtual
Reimplemented in AcDbExtrudedSurface, AcDbFcf, AcDbLoftedSurface, AcDbMPolygon, AcDbPlaneSurface, AcDbRasterImage, AcDbRevolvedSurface, AcDbSweptSurface, and AcDbTable.
◆ subGetGsMarkersAtSubentPath()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbEntity::subGetGsMarkersAtSubentPath  |  ( |  const AcDbFullSubentPath &  |  subentId,
|  AcArray< Adesk::GsMarker > &  |  markerArray
) |   |  const
protectedvirtual
Reimplemented in AcDb3dSolid, AcDbBlockReference, AcDbBody, AcDbMline, AcDbMPolygon, AcDbOle2Frame, AcDbRasterImage, and AcDbRegion.
◆ subGetOsnapPoints()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbEntity::subGetOsnapPoints  |  ( |  AcDb::OsnapMode  |  mode,
|  Adesk::GsMarker  |  subEntSelectMarker,
|  const AcGePoint3d &  |  pickedPnt,
|  const AcGePoint3d &  |  lastSelectedPnt,
|  const AcGeMatrix3d &  |  matrix,
|  AcGePoint3dArray &  |  snapIOArray,
|  AcDbIntArray &  |  idArray
) |   |  const
protectedvirtual
Reimplemented in AcDbDimension, AcDbMPolygon, AcDbOle2Frame, AcDbPolyline, AcDbRasterImage, AcDbSection, and AcDbTable.
◆ subGetStretchPoints()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbEntity::subGetStretchPoints  |  ( |  AcGePoint3dArray &  |  pointArray | ) |   const
protectedvirtual
Reimplemented in AcDbMPolygon, AcDbOle2Frame, AcDbPolyline, AcDbRasterImage, and AcDbTable.
◆ subGetSubentPathsAtGsMarker()
 Acad::ErrorStatus AcDbEntity::subGetSubentPathsAtGsMarker  |  ( |  AcDb::SubentType  |  acSubentType,
|  Adesk::GsMarker  |  gsMarker,
|  const AcGePoint3d &  |  acPickPoint,
|  const AcGeMatrix3d &  |  acViewMatrix,
|  int &  |  pathCount,
|  AcDbFullSubentPath *&  |  pAcSubentPaths,
|  int  |  insertCount = 0,
|  AcDbObjectId *  |  pAcInsertIds = nullptr
) |   |  const
protectedvirtual
Reimplemented in AcDbPolyline, AcDb3dSolid, AcDbBlockReference, AcDbBody, AcDbMline, AcDbMPolygon, AcDbOle2Frame, AcDbRasterImage, and AcDbRegion.
◆ subGetTransformedCopy()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbEntity::subGetTransformedCopy  |  ( |  const AcGeMatrix3d &  |  matrix,
|  AcDbEntity *&  |  resultEntity
) |   |  const
protectedvirtual
Reimplemented in AcDbOle2Frame, AcDbPolyline, AcDbRasterImage, AcDbTable, and AcDbWipeout.
◆ subGripStatus()
 UX_EXPORT_FUNCTION void AcDbEntity::subGripStatus  |  ( |  const AcDb::GripStat  |  value | )
protectedvirtual
Reimplemented in AcDbBlockReference, AcDbHelix, and AcDbPolyline.
◆ subHighlight()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbEntity::subHighlight  |  ( |  const AcDbFullSubentPath &  |  subEntPath = kNullSubent,
|  const Adesk::Boolean  |  allVPorts = false
) |   |  const
protectedvirtual
Reimplemented in AcDbLight, and AcDbBlockReference.
◆ subIntersectWith() [1/2]
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbEntity::subIntersectWith  |  ( |  const AcDbEntity *  |  pOther,
|  AcDb::Intersect  |  intersType,
|  AcGePoint3dArray &  |  acPoints,
|  Adesk::GsMarker  |  gsMarkerThis = 0,
|  Adesk::GsMarker  |  gsMarkerOther = 0
) |   |  const
protectedvirtual
Reimplemented in AcDbRegion, AcDbLeader, AcDbMPolygon, AcDbOle2Frame, AcDbPolyline, and AcDbRasterImage.
◆ subIntersectWith() [2/2]
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbEntity::subIntersectWith  |  ( |  const AcDbEntity *  |  pOther,
|  AcDb::Intersect  |  intersType,
|  const AcGePlane &  |  plane,
|  AcGePoint3dArray &  |  acPoints,
|  Adesk::GsMarker  |  gsMarkerThis = 0,
|  Adesk::GsMarker  |  gsMarkerOther = 0
) |   |  const
protectedvirtual
Reimplemented in AcDbRegion, AcDbLeader, AcDbMPolygon, AcDbOle2Frame, AcDbPolyline, and AcDbRasterImage.
◆ subIsContentSnappable()
 UX_EXPORT_FUNCTION bool AcDbEntity::subIsContentSnappable  |  ( |   | ) |   const
protectedvirtual
Reimplemented in AcDbUnderlayReference.
◆ subList()
 UX_EXPORT_FUNCTION void AcDbEntity::subList  |  ( |   | ) |   const
protectedvirtual
Reimplemented in AcDb3dSolid, AcDbBody, AcDbExtrudedSurface, AcDbFcf, AcDbLight, AcDbLoftedSurface, AcDbMline, AcDbMPolygon, AcDbOle2Frame, AcDbPlaneSurface, AcDbRasterImage, AcDbRevolvedSurface, AcDbSection, AcDbSurface, AcDbSweptSurface, AcDbTable, and AcDbWipeout.
◆ subMoveGripPointsAt() [1/2]
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbEntity::subMoveGripPointsAt  |  ( |  const AcDbIntArray &  |  indexArray,
|  const AcGeVector3d &  |  translationVector
)
protectedvirtual
Reimplemented in AcDbExtrudedSurface, AcDbFcf, AcDbLoftedSurface, AcDbMPolygon, AcDbOle2Frame, AcDbPlaneSurface, AcDbPolyline, AcDbRasterImage, AcDbRevolvedSurface, AcDbSweptSurface, AcDbTable, and AcDbWipeout.
◆ subMoveGripPointsAt() [2/2]
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbEntity::subMoveGripPointsAt  |  ( |  const AcDbVoidPtrArray &  |  gripAppData,
|  const AcGeVector3d &  |  translationVector,
|  const int  |  bitmask
)
protectedvirtual
Reimplemented in AcDbLight, AcDbSection, and AcDbWipeout.
◆ subMoveStretchPointsAt()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbEntity::subMoveStretchPointsAt  |  ( |  const AcDbIntArray &  |  indexArray,
|  const AcGeVector3d &  |  translationVector
)
protectedvirtual
Reimplemented in AcDbExtrudedSurface, AcDbLoftedSurface, AcDbMPolygon, AcDbOle2Frame, AcDbPlaneSurface, AcDbPolyline, AcDbRasterImage, AcDbRevolvedSurface, AcDbSweptSurface, and AcDbTable.
◆ subSetAttributes()
 UX_EXPORT_FUNCTION Adesk::UInt32 AcDbEntity::subSetAttributes  |  ( |  AcGiDrawableTraits *  |  pIOTraitsObj | )
protectedvirtual
Sets the values of this object's subentity traits and returns with the calling object's subentity traits.
Parameters
[in] | pIOTraitsObj | pointer to the AcGiDrawableTraits object to be set
Returns
flags to be used by the vectorization framework
Reimplemented from AcDbObject.
Reimplemented in AcDbLight, AcDbPoint, AcDbText, and AcDbViewport.
◆ subSetDatabaseDefaults()
 UX_EXPORT_FUNCTION void AcDbEntity::subSetDatabaseDefaults  |  ( |  AcDbDatabase *  |  pDb | )
virtual
This function is called by AcDbEntity::setDatabaseDefaults(), to allow custom entities to set their related sub entities, if any; default implementation does nothing.
Parameters
[in] | pDb | database to set defaults values from
◆ subSetVisibility()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbEntity::subSetVisibility  |  ( |  AcDb::Visibility  |  value,
|  Adesk::Boolean  |  bSubEntities = true
)
protectedvirtual
Reimplemented in AcDbOle2Frame.
◆ subSubentPtr()
 UX_EXPORT_FUNCTION AcDbEntity * AcDbEntity::subSubentPtr  |  ( |  const AcDbFullSubentPath &  |  acSubentPath | ) |   const
protectedvirtual
Reimplemented in AcDb3dSolid, AcDbBlockReference, AcDbBody, AcDbMline, AcDbMPolygon, AcDbOle2Frame, AcDbPolyline, AcDbRasterImage, and AcDbRegion.
◆ subTransformBy()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbEntity::subTransformBy  |  ( |  const AcGeMatrix3d &  |  matrix | )
protectedvirtual
Reimplemented in AcDbLight, AcDbMPolygon, AcDbOle2Frame, AcDbPolyline, AcDbRasterImage, AcDbSection, AcDbTable, and AcDbWipeout.
◆ subUnhighlight()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbEntity::subUnhighlight  |  ( |  const AcDbFullSubentPath &  |  subEntPath = kNullSubent,
|  const Adesk::Boolean  |  allVPorts = false
) |   |  const
protectedvirtual
Reimplemented in AcDbLight, and AcDbBlockReference.
◆ subViewportDraw()
 UX_EXPORT_FUNCTION void AcDbEntity::subViewportDraw  |  ( |  AcGiViewportDraw *  |  vp | )
protectedvirtual
Reimplemented from AcDbObject.
Reimplemented in AcDb3dSolid, AcDbLight, AcDbOle2Frame, AcDbOleFrame, AcDbPoint, AcDbPolyline, AcDbRasterImage, and AcDbWipeout.
◆ subWorldDraw()
 UX_EXPORT_FUNCTION Adesk::Boolean AcDbEntity::subWorldDraw  |  ( |  AcGiWorldDraw *  |  wd | )
protectedvirtual
Reimplemented from AcDbObject.
Reimplemented in AcDb3dSolid, AcDbBlockReference, AcDbLight, AcDbMPolygon, AcDbOle2Frame, AcDbOleFrame, AcDbPoint, AcDbPolyline, AcDbRasterImage, AcDbSection, AcDbTable, and AcDbWipeout.
◆ transformBy()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbEntity::transformBy  |  ( |  const AcGeMatrix3d &  |  matrix | )
finalvirtual
Applies given transformation (matrix) to the entity.
Parameters
[in] | matrix | transformation matrix to be applied
Returns
Acad::eOk, if successful
 Acad::eCannotScaleNonUniformly, if the entity does not accept non uniform scaling
 Acad::eInvalidInput, if passed zeroed matrix.
Remarks
Contrary to some other CAD applications, no fit vertices may be generated while transforming polylines on BricsCAD.
◆ unhighlight()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbEntity::unhighlight  |  ( |  const AcDbFullSubentPath &  |  subEntPath = kNullSubent,
|  const Adesk::Boolean  |  allVPorts = Adesk::kFalse
) |   |  const
finalvirtual
Unhighlights previously highlighted part of entity, or entire entity.
Parameters
[in] | subEntPath | identifying the subentity to unhighlight, if kNullSubent passed then entire entity will be unhighlighted.
[in] | allVPorts | unhighlights entity in all viewports
Returns
Acad::eOk if successful,
◆ visibility()
 UX_EXPORT_FUNCTION AcDb::Visibility AcDbEntity::visibility  |  ( |   | ) |   const
Gets the visibility state.
Returns
AcDb::kVisible or AcDb::kInvisible
Member Data Documentation
◆ AcDbEntity
 UX_EXPORT_FUNCTION AcDbEntity::AcDbEntity
This protected constructor sets the initial value for color to 257, and for the objectids for layer and linetype to AcDbObjectId::kNull.
The visibility is set to true.