Public Member Functions | Public Attributes | List of all members
AcDbDataLinkManager Class Reference
_ More...
#include <AcDbDataLinkManager.h>
 Public Member Functions
Acad::ErrorStatus  | addDataLink (AcDbDataLink *)
Add the data link. More...
Acad::ErrorStatus  | addDataLink (AcDbDataLink *, AcDbObjectId &)
Add the data link. More...
Acad::ErrorStatus  | createDataLink (const ACHAR *, const ACHAR *, const ACHAR *, const ACHAR *, AcDbObjectId &)
Create a new data link. More...
int  | dataLinkCount (void) const
Get count of data links in the dictionary. More...
int  | getDataLink (AcDbObjectIdArray &) const
Get all data links. More...
Acad::ErrorStatus  | getDataLink (const ACHAR *, AcDbDataLink *&, AcDb::OpenMode) const
Get a data link. More...
Acad::ErrorStatus  | getDataLink (const ACHAR *, AcDbObjectId &) const
Get a data link. More...
Acad::ErrorStatus  | removeDataLink (const AcDbObjectId &)
Remove a data link. More...
Acad::ErrorStatus  | removeDataLink (const ACHAR *, AcDbObjectId &)
Remove a data link. More...
Acad::ErrorStatus  | update (AcDb::UpdateDirection, AcDb::UpdateOption)
Update all data links. More...
Acad::ErrorStatus  | update (const AcDbObjectIdArray &, AcDb::UpdateDirection, AcDb::UpdateOption)
Update data links. More...
 virtual  | ~AcDbDataLinkManager ()
Destructor.
 Public Member Functions inherited from AcRxObject
virtual AcRxObject *  | clone () const
Exported and implemented. More...
 virtual AcRx::Ordering  | comparedTo (const AcRxObject *) const
Exported and implemented.
virtual Acad::ErrorStatus  | copyFrom (const AcRxObject *)
Exported and implemented. More...
 virtual AcRxClass *  | isA () const
Exported and implemented.
virtual Adesk::Boolean  | isEqualTo (const AcRxObject *) const
Exported and implemented. More...
bool  | isKindOf (const AcRxClass *) const
Checks the object class. More...
AcRxObject *  | queryX (const AcRxClass *) const
returns the protocol extension object assigned to this class or a parent class. More...
AcRxObject *  | x (const AcRxClass *) const
returns the protocol extension object assigned to this class or a parent class. More...
 virtual  | ~AcRxObject ()
Destructor.
 Public Attributes
AcDbDataLinkManager
Default constructor.
 Additional Inherited Members
 Static Public Member Functions inherited from AcRxObject
 static AcRxObject *  | cast (const AcRxObject *)
 static AcRxClass *  | desc ()
Exported and implemented.
 Protected Member Functions inherited from AcRxObject
AcRxObject ()
Exported and implemented.
Detailed Description
_
Member Function Documentation
◆ addDataLink() [1/2]
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbDataLinkManager::addDataLink  |  ( |  AcDbDataLink *  |  pDataLink | )
Add the data link.
Parameters
[in] | pDataLink | data link
Returns
Acad::eOk if successful, error status otherwise
◆ addDataLink() [2/2]
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbDataLinkManager::addDataLink  |  ( |  AcDbDataLink *  |  pDataLink,
|  AcDbObjectId &  |  idDataLink
)
Add the data link.
Parameters
[in] | pDataLink | data link
[out] | id | id of the added data link
Returns
Acad::eOk if successful, error status otherwise
◆ createDataLink()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbDataLinkManager::createDataLink  |  ( |  const ACHAR *  |  pszAdapterId,
|  const ACHAR *  |  pszName,
|  const ACHAR *  |  pszDescription,
|  const ACHAR *  |  pszConnectionString,
|  AcDbObjectId &  |  idDataLink
)
Create a new data link.
Parameters
[in] | adapter | adapter id
[in] | name | link name
[in] | desc | description
[in] | conn | connection string
[out] | id | id of the new data link
Returns
Acad::eOk if successful, error status otherwise
◆ dataLinkCount()
 UX_EXPORT_FUNCTION int AcDbDataLinkManager::dataLinkCount  |  ( |  void  |   | ) |   const
Get count of data links in the dictionary.
Returns
count
◆ getDataLink() [1/3]
 UX_EXPORT_FUNCTION int AcDbDataLinkManager::getDataLink  |  ( |  AcDbObjectIdArray &  |  dataLinks | ) |   const
Get all data links.
Parameters
[out] | dataLinks | data link collection
Returns
count of returned data links
◆ getDataLink() [2/3]
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbDataLinkManager::getDataLink  |  ( |  const ACHAR *  |  pszName,
|  AcDbDataLink *&  |  pDataLink,
|  AcDb::OpenMode  |  mode
) |   |  const
Get a data link.
Parameters
[in] | name | link name
[out] | pDataLink | pointer to the open data link
[in] | mode | open mode
Returns
Acad::eOk if successful, error status otherwise
◆ getDataLink() [3/3]
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbDataLinkManager::getDataLink  |  ( |  const ACHAR *  |  pszName,
|  AcDbObjectId &  |  idDataLink
) |   |  const
Get a data link.
Parameters
[in] | name | link name
[out] | id | id of the data link
Returns
Acad::eOk if successful, error status otherwise
◆ removeDataLink() [1/2]
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbDataLinkManager::removeDataLink  |  ( |  const AcDbObjectId &  |  idDataLink | )
Remove a data link.
Parameters
[in] | id | id of the data link
Returns
Acad::eOk if successful, error status otherwise
◆ removeDataLink() [2/2]
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbDataLinkManager::removeDataLink  |  ( |  const ACHAR *  |  pszKey,
|  AcDbObjectId &  |  idDataLink
)
Remove a data link.
Parameters
[in] | name | link name
[out] | id | id of the data link
Returns
Acad::eOk if successful, error status otherwise
◆ update() [1/2]
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbDataLinkManager::update  |  ( |  AcDb::UpdateDirection  |  nDir,
|  AcDb::UpdateOption  |  nOption
)
Update all data links.
Parameters
[in] | dir | update direction
[in] | opt | update option
Returns
Acad::eOk if successful, error status otherwise
◆ update() [2/2]
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbDataLinkManager::update  |  ( |  const AcDbObjectIdArray &  |  dataIds,
|  AcDb::UpdateDirection  |  nDir,
|  AcDb::UpdateOption  |  nOption
)
Update data links.
Parameters
[in] | ids | ids of the data links to update
[in] | dir | update direction
[in] | opt | update option
Returns
Acad::eOk if successful, error status otherwise