Public Types | Public Member Functions | Public Attributes | Protected Member Functions | List of all members
AcDbLight Class Reference
_ More...
#include <AcDbLight.h>
 Public Types
enum  | GlyphDisplayType { kGlyphDisplayAuto = 0 , kGlyphDisplayOn = 1 , kGlyphDisplayOff = 2 }
enum  | LampColorPreset {
 kD65White = 0 , kFluorescent = 1 , kCoolWhite = 2 , kWhiteFluorescent = 3 ,
 kDaylightFluorescent = 4 , kIncandescent = 5 , kXenon = 6 , kHalogen = 7 ,
 kQuartz = 8 , kMetalHalide = 9 , kMercury = 10 , kPhosphorMercury = 11 ,
 kHighPressureSodium = 12 , kLowPressureSodium = 13 , kCustom = 14
 }
enum  | LampColorType { kKelvin = 0 , kPreset = 1 }
enum  | PhysicalIntensityMethod { kPeakIntensity = 0 , kFlux = 1 , kIlluminance = 2 }
 Public Types inherited from AcDbEntity
enum  | VisualStyleType { kFullVisualStyle = 0 , kFaceVisualStyle = 1 , kEdgeVisualStyle = 2 }
 Public Types inherited from AcGiDrawable
enum  | DrawableType {
 kGeometry = 0 , kDistantLight , kPointLight , kSpotLight ,
 kAmbientLight , kSolidBackground , kGradientBackground , kImageBackground ,
 kGroundPlaneBackground , kViewport
 }
enum  | SetAttributesFlags {
 kDrawableNone = 0 , kDrawableIsAnEntity = 1 , kDrawableUsesNesting = 2 , kDrawableIsCompoundObject = 4 ,
 kDrawableViewIndependentViewportDraw = 8 , kDrawableIsInvisible = 16 , kDrawableHasAttributes = 32 , kDrawableRegenTypeDependentGeometry = 64 ,
 kDrawableIsDimension = 133 , kDrawableRegenDraw = 256 , kDrawableStandardDisplaySingleLOD = 512 , kDrawableShadedDisplaySingleLOD = 1024 ,
 kDrawableViewDependentViewportDraw = 2048 , kDrawableBlockDependentViewportDraw = 4096 , kDrawableIsExternalReference = 8192 , kDrawableNotPlottable = 16384 ,
 kDrawableNotAllowLCS = 32768 , kDrawableMergeControlOff = 65536 , kThreadedWorldDrawViewportDraw = 131072
 }
 Public Member Functions
virtual bool  | castShadows () const
See AcDbEntity::castShadows() . More...
virtual Acad::ErrorStatus  | decomposeForSave (AcDb::AcDbDwgVersion, AcDbObject *&, AcDbObjectId &, Adesk::Boolean &)
virtual DrawableType  | drawableType () const
Not implemented yet. More...
virtual Acad::ErrorStatus  | dwgInFields (AcDbDwgFiler *)
virtual Acad::ErrorStatus  | dwgOutFields (AcDbDwgFiler *) const
virtual Acad::ErrorStatus  | dxfInFields (AcDbDxfFiler *)
virtual Acad::ErrorStatus  | dxfOutFields (AcDbDxfFiler *) const
virtual double  | falloffAngle () const
Gets entity's falloff angle. More...
virtual GlyphDisplayType  | glyphDisplay () const
Returns the glyph display type for this AcDbLigh entity. More...
virtual bool  | hasTarget () const
Returns whether this light entity uses a grip for the light target orientation. More...
virtual double  | hotspotAngle () const
Gets entity's hotspot angle. More...
virtual double  | illuminanceDistance () const
Returns the illumination distance for this AcDbLigh entity. More...
virtual double  | intensity () const
Returns the intesity value of the light object. More...
virtual bool  | isOn () const
Returns the light status. More...
 virtual bool  | isPlottable () const
Not implemented yet.
virtual LampColorPreset  | lampColorPreset () const
Returns the lamp color preset for this AcDbLigh entity. More...
virtual double  | lampColorTemp () const
Returns the lamp color temperature for this AcDbLigh entity. More...
virtual LampColorType  | lampColorType () const
Returns the color type for this AcDbLigh entity. More...
virtual const AcGiLightAttenuation &  | lightAttenuation () const
Returns the ligth attenuation type as a AcGiLightAttenuation object. More...
virtual const AcCmColor &  | lightColor () const
Returns the color of the light. More...
virtual const AcGeVector3d &  | lightDirection () const
Returns the light direction as a AcGeVector3d object. More...
virtual DrawableType  | lightType () const
Gets this object's light type. More...
virtual const AcString &  | name () const
Gets this object its name. More...
virtual double  | physicalIntensity () const
Returns the physical intensity for this AcDbLigh entity. More...
virtual PhysicalIntensityMethod  | physicalIntensityMethod () const
Returns the physical intensity method for this AcDbLigh entity. More...
virtual const AcGePoint3d &  | position () const
Returns the light source position as a AcGePoint3d object. More...
virtual bool  | receiveShadows () const
See AcDbEntity::receiveShadows() . More...
virtual Acad::ErrorStatus  | resultingColor (AcCmColor &rgbColor) const
Returns the resulting color for this AcDbLigh entity. More...
virtual void  | setCastShadows (bool)
See AcDbEntity::setCastShadows(bool) . More...
virtual Acad::ErrorStatus  | setGlyphDisplay (GlyphDisplayType type)
Assigns the glyph display type to this AcDbLigh entity. More...
virtual Acad::ErrorStatus  | setHasTarget (bool hasTarget)
Defines whether this light entity uses a grip for the light target orientation. More...
virtual Acad::ErrorStatus  | setHotspotAndFalloff (double, double)
Sets the hotspot and falloff angles of the light object. More...
virtual Acad::ErrorStatus  | setIlluminanceDistance (double distance)
Assigns the illumination distance to this AcDbLigh entity. More...
virtual Acad::ErrorStatus  | setIntensity (double)
Sets the intensity value of the light object. More...
 virtual Acad::ErrorStatus  | setIsPlottable (bool)
Not implemented yet.
virtual Acad::ErrorStatus  | setLampColorPreset (LampColorPreset colorPreset)
Assigns the lamp color preset to this AcDbLigh entity. More...
virtual Acad::ErrorStatus  | setLampColorTemp (double colorTemp)
Assigns the lamp color temperature to this AcDbLigh entity. More...
virtual Acad::ErrorStatus  | setLampColorType (LampColorType colorType)
Assigns the color type to this AcDbLigh entity. More...
virtual void  | setLightAttenuation (const AcGiLightAttenuation &)
Sets this object's attenuation type. More...
virtual Acad::ErrorStatus  | setLightColor (const AcCmColor &)
Sets the light color. More...
virtual Acad::ErrorStatus  | setLightDirection (const AcGeVector3d &)
Sets the light direction. More...
virtual Acad::ErrorStatus  | setLightType (DrawableType)
Sets this object's light type. More...
virtual Acad::ErrorStatus  | setName (const AcString &)
Sets the light's name. More...
virtual Acad::ErrorStatus  | setOn (bool)
Turns this object's light on or off. More...
virtual Acad::ErrorStatus  | setPhysicalIntensity (double physicalIntensity)
Assigns the physical intensity to this AcDbLigh entity. More...
virtual Acad::ErrorStatus  | setPhysicalIntensityMethod (PhysicalIntensityMethod method)
Assigns the physical intensity method to this AcDbLigh entity. More...
virtual Acad::ErrorStatus  | setPosition (const AcGePoint3d &)
Moves the light source to a new position. More...
virtual void  | setReceiveShadows (bool)
See AcDbEntity::setReceiveShadows(bool) . More...
virtual void  | setShadowParameters (const AcGiShadowParameters &)
Sets this object's shadow parameters. More...
virtual Acad::ErrorStatus  | setTargetLocation (const AcGePoint3d &)
Moves the light target location to a new position. More...
virtual Acad::ErrorStatus  | setWebFile (const ACHAR *webFile)
Assigns the light definition file (IES standard) to this AcDbLigh entity. More...
virtual Acad::ErrorStatus  | setWebRotation (const AcGeVector3d &rotation)
Defines the orientation of goniometric data relative to light orientation for the light entity. More...
virtual const AcGiShadowParameters &  | shadowParameters () const
Returns the shadow parameters as a AcGiShadowParameters object. More...
virtual Acad::ErrorStatus  | subClose ()
virtual void  | subList () const
virtual const AcGePoint3d &  | targetLocation () const
Returns the light target location as a AcGePoint3d object. More...
virtual Acad::ErrorStatus  | webFile (AcString &webFile) const
Returns the assigned light definition file (IES standard). More...
virtual Acad::ErrorStatus  | webRotation (AcGeVector3d &rotation) const
Returns the assigned offset vector (orientation of goniometric data relative to light orientation) for this AcDbLigh entity. More...
 virtual  | ~AcDbLight ()
Destructor.
 Public Member Functions inherited from AcDbEntity
 virtual Acad::ErrorStatus  | addSubentPaths (const AcDbFullSubentPathArray &) final
virtual Acad::ErrorStatus  | applyPartialUndo (AcDbDwgFiler *, AcRxClass *)
virtual Acad::ErrorStatus  | audit (AcDbAuditInfo *)
AcDbObjectId  | blockId () const
Returns the Object ID of the BlockTableRecord that owns this entity. More...
Acad::ErrorStatus  | boundingBoxIntersectWith (const AcDbEntity *, AcDb::Intersect, AcGePoint3dArray &, Adesk::GsMarker, Adesk::GsMarker) const
Finds the intersection between the edges of the bounding box for this entity and the pOhter entity. More...
Acad::ErrorStatus  | boundingBoxIntersectWith (const AcDbEntity *, AcDb::Intersect, const AcGePlane &, AcGePoint3dArray &, Adesk::GsMarker, Adesk::GsMarker) const
First, the function projects the other entity and the bounding box of this entity on plane specified by plane. More...
virtual bool  | bounds (AcDbExtents &) const
Returns the extents of this entity as AcDbExtents. More...
virtual bool  | castShadows () const
Checks if this entity is able to cast shadows. More...
virtual Adesk::Boolean  | cloneMeForDragging () final
Checks if a clone will be created for this entity in case of a drag operation. More...
 virtual AcDb::CollisionType  | collisionType () const
AcCmColor  | color () const
Returns the true color information of the entity. More...
Adesk::UInt16  | colorIndex () const
Returns the color number in a range from 0 to 256. More...
 virtual Acad::ErrorStatus  | deleteSubentPaths (const AcDbFullSubentPathArray &) final
virtual void  | dragStatus (const AcDb::DragStat)
Acad::ErrorStatus  | draw ()
Draws or redraws the entity on screen. More...
virtual AcGiDrawable *  | drawable ()
virtual Acad::ErrorStatus  | dwgInFields (AcDbDwgFiler *)
virtual Acad::ErrorStatus  | dwgOutFields (AcDbDwgFiler *) const
virtual Acad::ErrorStatus  | dxfInFields (AcDbDxfFiler *)
virtual Acad::ErrorStatus  | dxfOutFields (AcDbDxfFiler *) const
AcCmEntityColor  | entityColor () const
Returns the lightweight color information of the entity. More...
virtual Acad::ErrorStatus  | explode (AcDbVoidPtrArray &) const final
virtual Acad::ErrorStatus  | getCompoundObjectTransform (AcGeMatrix3d &) const final
It is used for object without geometry like AcDbMleader. More...
virtual void  | getEcs (AcGeMatrix3d &) const
Returns the transformation matrix from OCS (Object Coordinate System) to WCS (World Coordinate System). More...
virtual Acad::ErrorStatus  | getGeomExtents (AcDbExtents &) const final
Returns extents of this entity. More...
 virtual Acad::ErrorStatus  | getGripEntityUCS (const void *, AcGeVector3d &, AcGePoint3d &, AcGeVector3d &) const final
 virtual Acad::ErrorStatus  | getGripPoints (AcDbGripDataPtrArray &, const double, const int, const AcGeVector3d &, const int) const final
virtual Acad::ErrorStatus  | getGripPoints (AcGePoint3dArray &, AcDbIntArray &, AcDbIntArray &) const final
Append grip points to the specified array. More...
 virtual Acad::ErrorStatus  | getGripPointsAtSubentPath (const AcDbFullSubentPath &, AcDbGripDataPtrArray &, const double, const int, const AcGeVector3d &, const int) const final
virtual Acad::ErrorStatus  | getGsMarkersAtSubentPath (const AcDbFullSubentPath &, AcArray< Adesk::GsMarker > &) const final
virtual Acad::ErrorStatus  | getMaterialMapper (AcGiMapper &) const
virtual Acad::ErrorStatus  | getOsnapPoints (AcDb::OsnapMode, Adesk::GsMarker, const AcGePoint3d &, const AcGePoint3d &, const AcGeMatrix3d &, AcGePoint3dArray &, AcDbIntArray &) const final
Gets the entity osnap points. More...
virtual Acad::ErrorStatus  | getOsnapPoints (AcDb::OsnapMode, Adesk::GsMarker, const AcGePoint3d &, const AcGePoint3d &, const AcGeMatrix3d &, AcGePoint3dArray &, AcDbIntArray &, const AcGeMatrix3d &) const final
Gets the entity osnap points. More...
virtual Acad::ErrorStatus  | getPlane (AcGePlane &, AcDb::Planarity &) const
Returns the plane that contains this entity. More...
AcDb::PlotStyleNameType  | getPlotStyleNameId (AcDbObjectId &) const
Returns the plot style name type and its associated id. More...
virtual Acad::ErrorStatus  | getStretchPoints (AcGePoint3dArray &) const final
Append stretch points to the specified array. More...
 virtual Acad::ErrorStatus  | getSubentClassId (const AcDbFullSubentPath &, CLSID *) const final
 virtual Acad::ErrorStatus  | getSubentPathGeomExtents (const AcDbFullSubentPath &, AcDbExtents &) const final
virtual Acad::ErrorStatus  | getSubentPathsAtGsMarker (AcDb::SubentType, Adesk::GsMarker, const AcGePoint3d &, const AcGeMatrix3d &, int &, AcDbFullSubentPath *&, int=0, AcDbObjectId *=NULL) const final
Gets the subentity paths appropriate for the passed in gs marker. More...
virtual Acad::ErrorStatus  | getTransformedCopy (const AcGeMatrix3d &, AcDbEntity *&) const final
Creates a copy of the current entity applying the transformation matrix. More...
 virtual void  | gripStatus (const AcDb::GripStat) final
 virtual bool  | hideMeForDragging () const final
virtual Acad::ErrorStatus  | highlight (const AcDbFullSubentPath &=kNullSubent, const Adesk::Boolean=Adesk::kFalse) const final
Highlights part of, or entire entity. More...
virtual Acad::ErrorStatus  | intersectWith (const AcDbEntity *, AcDb::Intersect, AcGePoint3dArray &, Adesk::GsMarker=0, Adesk::GsMarker=0) const final
Finds the intersection between this entity and the pOhter entity. More...
virtual Acad::ErrorStatus  | intersectWith (const AcDbEntity *, AcDb::Intersect, const AcGePlane &, AcGePoint3dArray &, Adesk::GsMarker=0, Adesk::GsMarker=0) const final
Projects this entity and the pOhter entity on plane, finds the intersection points between these projections and then projects back the points onto the caller entity. More...
 virtual bool  | isContentSnappable () const final
virtual Adesk::Boolean  | isPlanar () const
ACHAR *  | layer () const
Returns the layername. More...
AcDbObjectId  | layerId () const
Returns the Object ID of the LayerTableRecord referenced by this entity. More...
ACHAR *  | linetype () const
Gets the linetype value. More...
AcDbObjectId  | linetypeId () const
Gets the linetypeId value. More...
 double  | linetypeScale () const
returns the linetype scale factor for the entity
AcDb::LineWeight  | lineWeight () const
Gets the entity line weight. More...
virtual void  | list () const final
Prints the properties in drawing window. More...
ACHAR *  | material () const
Gets the material assigned to this entity. More...
AcDbObjectId  | materialId () const
Gets the AcDbObjectId of the material assigned to this entity. More...
virtual Acad::ErrorStatus  | moveGripPointsAt (const AcDbIntArray &, const AcGeVector3d &) final
Move the grip points pointed by the indexes specified in indexArray using the translationVector param direction and length Override this method in custom entities to define your own behaviour. More...
 virtual Acad::ErrorStatus  | moveGripPointsAt (const AcDbVoidPtrArray &, const AcGeVector3d &, const int) final
 virtual Acad::ErrorStatus  | moveGripPointsAtSubentPaths (const AcDbFullSubentPathArray &, const AcDbVoidPtrArray &, const AcGeVector3d &, const int) final
virtual Acad::ErrorStatus  | moveStretchPointsAt (const AcDbIntArray &, const AcGeVector3d &) final
Move the stretch points pointed by the indexes specified in indexArray with the offest specified by translationVector Override this method in custom entities to define your own behaviour. More...
ACHAR *  | plotStyleName () const
Returns the name of the plotStyleName string associated with this entity (DXF 390). More...
virtual bool  | receiveShadows () const
Checks if this entity is able to receive shadows. More...
void  | recordGraphicsModified (Adesk::Boolean=Adesk::kTrue)
Controls the entity display update when closing it Entities not updated when closed are updated at the first regen. More...
virtual void  | saveAs (AcGiWorldDraw *, AcDb::SaveType)
Generates the graphics primitives when a DWG save requiring proxy graphics to be saved is made. More...
virtual void  | setCastShadows (bool)
Sets this entity's flag regarding casting shadows. More...
virtual Acad::ErrorStatus  | setColor (const AcCmColor &, Adesk::Boolean=Adesk::kTrue)
Sets the color information of this entity from an AcCmColor instance. More...
virtual Acad::ErrorStatus  | setColor (const AcCmColor &, bool, AcDbDatabase *)
Sets the color property of this entity from an AcCmColor instance. More...
virtual Acad::ErrorStatus  | setColorIndex (Adesk::UInt16, Adesk::Boolean=Adesk::kTrue)
Sets the color index of this entity (DXF 62). More...
void  | setDatabaseDefaults ()
Applies the default properties of the entities database to this entity. More...
void  | setDatabaseDefaults (AcDbDatabase *)
Applies the default properties of the specified database to this entity. More...
virtual Acad::ErrorStatus  | setLayer (AcDbObjectId, Adesk::Boolean=Adesk::kTrue, bool=false)
Sets the layer to be referenced by this entity (DXF 8). More...
virtual Acad::ErrorStatus  | setLayer (const ACHAR *, Adesk::Boolean=Adesk::kTrue, bool=false)
Sets the layer to be referenced by this entity (DXF 8). More...
virtual Acad::ErrorStatus  | setLinetype (AcDbObjectId, Adesk::Boolean=Adesk::kTrue)
Sets the entities linetype to ltypeObjectId. More...
virtual Acad::ErrorStatus  | setLinetype (const ACHAR *, Adesk::Boolean=Adesk::kTrue)
Sets the entities linetype to the linetpye referenced by layerName. More...
virtual Acad::ErrorStatus  | setLinetypeScale (double, Adesk::Boolean=Adesk::kTrue)
sets value as entity linetype scale factor More...
virtual Acad::ErrorStatus  | setLineWeight (AcDb::LineWeight, Adesk::Boolean=Adesk::kTrue)
Sets the entity line weight. More...
virtual Acad::ErrorStatus  | setMaterial (AcDbObjectId, Adesk::Boolean=Adesk::kTrue)
Not implemented yet. More...
virtual Acad::ErrorStatus  | setMaterial (const ACHAR *, Adesk::Boolean=Adesk::kTrue)
Assigns the material to the entity. More...
virtual Acad::ErrorStatus  | setMaterialMapper (const AcGiMapper &, Adesk::Boolean=Adesk::kTrue)
It is used for apply material (scale, rotation, projection, mode overrides) to an identity.If it is used AcGiMapper::kIdentity it will apply for entity a default mapper. More...
virtual Acad::ErrorStatus  | setPlotStyleName (AcDb::PlotStyleNameType, AcDbObjectId=AcDbObjectId::kNull, Adesk::Boolean=Adesk::kTrue)
Sets the plot style of this entity. More...
virtual Acad::ErrorStatus  | setPlotStyleName (const ACHAR *, Adesk::Boolean=Adesk::kTrue)
Sets the plot style of this entity. More...
Acad::ErrorStatus  | setPropertiesFrom (const AcDbEntity *, Adesk::Boolean=Adesk::kTrue)
Copies the properties color, layer, linetype, linetypescale and visibility from the source entity pEntity to this entity. More...
virtual void  | setReceiveShadows (bool)
Sets this entity's flag regarding receiving shadows. More...
virtual Acad::ErrorStatus  | setTransparency (const AcCmTransparency &, Adesk::Boolean=Adesk::kTrue)
Sets the transparency setting of this entity, and returns eOk if successful. More...
virtual Acad::ErrorStatus  | setVisibility (AcDb::Visibility, Adesk::Boolean=Adesk::kTrue) final
notyetdocumented. More...
 virtual Acad::ErrorStatus  | setVisualStyle (AcDbObjectId, VisualStyleType=kFullVisualStyle, Adesk::Boolean=true)
 virtual void  | subentGripStatus (const AcDb::GripStat, const AcDbFullSubentPath &) final
virtual AcDbEntity *  | subentPtr (const AcDbFullSubentPath &) const final
Creates an entity as a copy of the subentity given by acSubentPath. More...
virtual void  | subSetDatabaseDefaults (AcDbDatabase *)
This function is called by AcDbEntity::setDatabaseDefaults(), to allow custom entities to set their related sub entities, if any; default implementation does nothing. More...
virtual Acad::ErrorStatus  | transformBy (const AcGeMatrix3d &) final
Applies given transformation (matrix) to the entity. More...
 virtual Acad::ErrorStatus  | transformSubentPathsBy (const AcDbFullSubentPathArray &, const AcGeMatrix3d &) final
 AcCmTransparency  | transparency () const
Returns the transparency setting of this entity.
virtual Acad::ErrorStatus  | unhighlight (const AcDbFullSubentPath &=kNullSubent, const Adesk::Boolean=Adesk::kFalse) const final
Unhighlights previously highlighted part of entity, or entire entity. More...
AcDb::Visibility  | visibility () const
Gets the visibility state. More...
 AcDbObjectId  | visualStyleId (VisualStyleType=kFullVisualStyle) const
 Public Member Functions inherited from AcDbObject
virtual Acad::ErrorStatus  | addPersistentReactor (AcDbObjectId)
Adds a persistent reactor to this object reactor list. More...
Acad::ErrorStatus  | addReactor (AcDbObjectReactor *) const
Adds a transient reactor to this object. More...
virtual Acad::ErrorStatus  | applyPartialUndo (AcDbDwgFiler *, AcRxClass *)
This function is called during Undo operations on objects, that use the 'Partial Undo meachanism'; this is, this object is opened with assertWriteEnabled(Adesk::kFalse) to indicate that custom Undo filing is used rather than the default Undo filing. More...
 void  | assertNotifyEnabled () const
 void  | assertReadEnabled () const
 void  | assertWriteEnabled (Adesk::Boolean=Adesk::kTrue, Adesk::Boolean=Adesk::kTrue)
virtual Acad::ErrorStatus  | audit (AcDbAuditInfo *)
Performs the audit operation for this object. More...
Acad::ErrorStatus  | cancel ()
Reverts all changes since the object had been opened and closes the object. More...
virtual void  | cancelled (const AcDbObject *)
A handler function for persistent reactors. More...
virtual AcRxObject *  | clone () const
Creates a shallow clone of this object. More...
Acad::ErrorStatus  | close ()
Closes the object. More...
Acad::ErrorStatus  | closeAndPage (Adesk::Boolean=Adesk::kTrue)
Closes the object. More...
virtual Acad::ErrorStatus  | composeForLoad (AcDb::OdaSaveType, AcDb::AcDbDwgVersion)
This function is intended for future MT file loading support. More...
virtual void  | copied (const AcDbObject *, const AcDbObject *)
A handler function for persistent reactors. More...
virtual Acad::ErrorStatus  | copyFrom (const AcRxObject *)
Copies the pSrc object information in this object. More...
Acad::ErrorStatus  | createExtensionDictionary ()
Creates a dictionary as extension dictionary for this object. More...
AcDbDatabase *  | database () const
Returns the database that contains this object. More...
virtual Acad::ErrorStatus  | decomposeForSave (AcDb::AcDbDwgVersion, AcDbObject *&, AcDbObjectId &, Adesk::Boolean &)
This function is called during dwg and dxf output, to allow a custom object to decompose itself, due to provided dwg/dxf target file version. More...
virtual Acad::ErrorStatus  | deepClone (AcDbObject *, AcDbObject *&, AcDbIdMapping &, Adesk::Boolean=Adesk::kTrue) const final
Clones this object, appends it to the owner pOwner and adds an AcDbIdPair record to the idMap. More...
void  | disableUndoRecording (Adesk::Boolean)
Disables or enables the undo recording for the object. More...
Acad::ErrorStatus  | downgradeOpen ()
Sets the open mode for an object opened for write to be opened for read. More...
Acad::ErrorStatus  | downgradeToNotify (Adesk::Boolean)
Sets the open mode for an object opened for write to be opened for notify. More...
virtual AcGiDrawable *  | drawable ()
Retrieves the AcGiDrawable instance of this object. More...
Acad::ErrorStatus  | dwgIn (AcDbDwgFiler *)
Calls the object's dwgInFields function, and reads any XData if present. More...
virtual Acad::ErrorStatus  | dwgInFields (AcDbDwgFiler *)
Reads the object from the DWG filer. More...
Acad::ErrorStatus  | dwgOut (AcDbDwgFiler *) const
Calls the object's dwgOutFields function, and writes any XData if present. More...
virtual Acad::ErrorStatus  | dwgOutFields (AcDbDwgFiler *) const
Writes the object to the DWG filer. More...
Acad::ErrorStatus  | dxfIn (AcDbDxfFiler *)
Calls the object's dxfInFields function, and reads any XData if present. More...
virtual Acad::ErrorStatus  | dxfInFields (AcDbDxfFiler *)
Reads the object from the DXF filer. More...
Acad::ErrorStatus  | dxfOut (AcDbDxfFiler *, Adesk::Boolean, Adesk::uchar *) const
Calls the object's dxfOutFields function, and writes any XData if present. More...
virtual Acad::ErrorStatus  | dxfOutFields (AcDbDxfFiler *) const
Writes the object to the DXF filer. More...
Acad::ErrorStatus  | erase (Adesk::Boolean=Adesk::kTrue)
Sets the bit that indicates that the object is erased. More...
virtual void  | erased (const AcDbObject *, Adesk::Boolean)
A handler function for persistent reactors. More...
AcDbObjectId  | extensionDictionary () const
Returns the object id of the extension dictionary for this object. More...
void  | getAcDbHandle (AcDbHandle &) const
Returns handle of this object. More...
Acad::ErrorStatus  | getBinaryData (const ACHAR *, Adesk::Int32 &, char *&) const
Creates a copy of the binary data stored as chunks of maximum 127 bytes in the resbuf chain of this object's extension dictionary xrecord entry given by entryName. More...
int  | getBrxOpenCount () const
This function returns the number of open BRX instances for this object. More...
int  | getBrxOpenState () const
This function returns the BRX object open state flags as bitfields, for diagnostic purpose. More...
virtual Acad::ErrorStatus  | getClassID (CLSID *) const final
Gets the COM wrapper Class ID for this entity. More...
int  | getCustomObjectState () const
This function returns the custom object status : 1=isCustomObject 2=DifferentialUndoDisabled. More...
Acad::ErrorStatus  | getField (const ACHAR *, AcDbField *&, AcDb::OpenMode) const
Retrieves the specified Field from this object, and opens it in mode. More...
Acad::ErrorStatus  | getField (const ACHAR *, AcDbObjectId &) const
Gets the pszPropName field object from field dictionary of this AcDbObject object, using pszPropName as key. More...
AcDbObjectId  | getFieldDictionary () const
Returns the Field dictionary associated with this object,. More...
Acad::ErrorStatus  | getFieldDictionary (AcDbDictionary *&, AcDb::OpenMode) const
Gets and opens the field dictionary for this. More...
Acad::ErrorStatus  | getObjectBirthVersion (AcDb::AcDbDwgVersion &, AcDb::MaintenanceReleaseVersion &)
This function is currently not supported by the CAD engine, always returns Acad::eOk, and 'kDHL_CURRENT' + 'kMReleaseCurrent' results. More...
virtual Acad::ErrorStatus  | getObjectSaveVersion (const AcDbDwgFiler *, AcDb::AcDbDwgVersion &, AcDb::MaintenanceReleaseVersion &)
Returns the DWG version for saving the object. More...
virtual Acad::ErrorStatus  | getObjectSaveVersion (const AcDbDxfFiler *, AcDb::AcDbDwgVersion &, AcDb::MaintenanceReleaseVersion &)
Returns the DWG version for saving the object. More...
int  | getOdaOpenCount () const
This function returns the number of open ODA instances for this object. More...
int  | getOdaOpenState () const
This function returns the ODA object open state flags as bitfields, for diagnostic purpose. More...
virtual void  | goodbye (const AcDbObject *)
A handler function for persistent reactors. More...
Acad::ErrorStatus  | handOverTo (AcDbObject *, Adesk::Boolean=Adesk::kTrue, Adesk::Boolean=Adesk::kTrue)
Hands over objects identity to another object. More...
bool  | hasFields () const
Return true if this object has single or multiple fields associated with him. More...
bool  | hasPersistentReactor (AcDbObjectId) const
Checks the input objectId in this object reactor list. More...
bool  | hasSaveVersionOverride ()
This function indicates whether this object overrides the filer's save version. More...
virtual AcDbObjectId  | id () const
Returns the database id of this object. More...
Adesk::Boolean  | isAcDbObjectIdsInFlux () const
Checks whether a deep clone operation was completed. More...
Adesk::Boolean  | isAProxy () const
Adesk::Boolean  | isCancelling () const
Adesk::Boolean  | isErased () const
Returns whether this object is erased. More...
Adesk::Boolean  | isEraseStatusToggled () const
Checks whether the object erase status has been toggled. More...
Adesk::Boolean  | isModified () const
Returns whether this object's assertWriteEnabled() has been called since it was opened. More...
Adesk::Boolean  | isModifiedGraphics () const
Checks whether this object graphics will be updated when the object is closed. More...
Adesk::Boolean  | isModifiedXData () const
Checks whether this object's xData was modified. More...
Adesk::Boolean  | isNewObject () const
Returns true if and only if this object has not been closed since it was created. More...
Adesk::Boolean  | isNotifyEnabled () const
Returns whether this object is opened for notify. More...
Adesk::Boolean  | isNotifying () const
virtual Adesk::Boolean  | isPersistent () const
Returns the 'persistent' status of a database object. More...
Adesk::Boolean  | isReadEnabled () const
Returns whether this object is opened for read. More...
 Adesk::Boolean  | isReallyClosing () const
Checks whether the next close call will completely close this object return true if on the next call the object will be completely closed false otherwise.
Adesk::Boolean  | isTransactionResident () const
Gets the object transaction status. More...
Adesk::Boolean  | isUndoing () const
bool  | isUndoRecordingDisabled () const
Returns whether the undo recording for the object is enabled or not. More...
Adesk::Boolean  | isWriteEnabled () const
Returns whether this object is opened for write. More...
virtual AcDb::DuplicateRecordCloning  | mergeStyle () const
Returns the object's merge behavior during cloning. More...
virtual void  | modified (const AcDbObject *)
A handler function for persistent reactors. More...
virtual void  | modifiedGraphics (const AcDbEntity *)
A handler function for persistent reactors. More...
virtual void  | modifiedXData (const AcDbObject *)
A handler function for persistent reactors. More...
virtual void  | modifyUndone (const AcDbObject *)
A handler function for persistent reactors. More...
virtual void  | objectClosed (const AcDbObjectId)
A handler function for persistent reactors. More...
AcDbObjectId  | objectId () const
Returns object id. More...
virtual void  | openedForModify (const AcDbObject *)
A handler function for persistent reactors. More...
AcDbObjectId  | ownerId () const
Returns object id of the owner. More...
AcDbVoidPtrArray *  | reactors ()
Gets the object pointers to reactors. More...
const AcDbVoidPtrArray *  | reactors () const
Gets the object pointers to reactors. More...
virtual void  | reappended (const AcDbObject *)
A handler function for persistent reactors. More...
 virtual void  | recvPropagateModify (const AcDbObject *)
Not implemented yet.
Acad::ErrorStatus  | releaseExtensionDictionary ()
Removes the extension dictionary associated with this object. More...
virtual Acad::ErrorStatus  | removeField (AcDbObjectId)
Removes the Field specified by acFieldId from this object. More...
virtual Acad::ErrorStatus  | removeField (const ACHAR *)
Removes the Field specified by szKeyString from this object. More...
virtual Acad::ErrorStatus  | removeField (const ACHAR *, AcDbObjectId &)
Removes the Field specified by acPszKeyString from this object, and returns its ObjectId value. More...
virtual Acad::ErrorStatus  | removePersistentReactor (AcDbObjectId)
Removes a persistent reactor from this object reactor list. More...
Acad::ErrorStatus  | removeReactor (AcDbObjectReactor *) const
Removes a transient reactor to this object. More...
void  | setAcDbObjectIdsInFlux ()
Call this function to indicate that the object IDs of this object and its sub-objects (if any) are not yet valid. More...
Acad::ErrorStatus  | setBinaryData (const ACHAR *, Adesk::Int32, const char *)
Creates a copy of the binary data, divides it in up to 127 bytes binary chunks and
 sets them as resbufs in the resbuf chain of this object's extension dictionary xrecord entry given by entryName. More...
virtual Acad::ErrorStatus  | setField (const ACHAR *, AcDbField *, AcDbObjectId &)
Adds the pAcField field object to field dictionary of this AcDbObject object, using pKey as key. More...
void  | setHasSaveVersionOverride (bool)
This function can be called to specify that the object has a "save version override". More...
virtual Acad::ErrorStatus  | setOwnerId (AcDbObjectId)
Sets the ownerId data member of the object to be objId. More...
virtual Acad::ErrorStatus  | setXData (const resbuf *)
Sets/removes xData associated with this object. More...
virtual Acad::ErrorStatus  | subCancel ()
Possibility to veto a cancel operation from within custom entities. More...
virtual Acad::ErrorStatus  | subClose ()
virtual Acad::ErrorStatus  | subErase (Adesk::Boolean)
This hook is called during an AcDbObject::erase call, before any actual erase operation is performed. More...
 virtual Acad::ErrorStatus  | subHandOverTo (AcDbObject *)
virtual void  | subObjModified (const AcDbObject *, const AcDbObject *)
A handler function for persistent reactors. More...
 virtual Acad::ErrorStatus  | subOpen (AcDb::OpenMode)
virtual Acad::ErrorStatus  | subSwapIdWith (AcDbObjectId, Adesk::Boolean=Adesk::kFalse, Adesk::Boolean=Adesk::kFalse)
This hook is called during an AcDbObject::swapIdWith() call, before any actual swap operation is performed. More...
Acad::ErrorStatus  | swapIdWith (AcDbObjectId, Adesk::Boolean=Adesk::kFalse, Adesk::Boolean=Adesk::kFalse)
Swaps the object id's between the object identified by param swapId and this object. More...
virtual Acad::ErrorStatus  | swapReferences (const AcDbIdMapping &)
Not implemented yet. More...
virtual void  | unappended (const AcDbObject *)
A handler function for persistent reactors. More...
AcDbDwgFiler *  | undoFiler ()
Gets the undo filer for this object. More...
Acad::ErrorStatus  | upgradeFromNotify (Adesk::Boolean &)
Upgrades the open status of this object to AcDb::kForWrite, if this object is already open (either in AcDb::kForRead, AcDb::kForNotify or AcDb::kForWrite) More...
Acad::ErrorStatus  | upgradeOpen ()
Changes the objects open mode to AcDb::kForWrite and sends notifications. More...
virtual Acad::ErrorStatus  | wblockClone (AcRxObject *, AcDbObject *&, AcDbIdMapping &, Adesk::Boolean=Adesk::kTrue) const final
Clones this object, appends it to the owner pOwner and adds an AcDbIdPair record to the idMap. More...
virtual resbuf *  | xData (const ACHAR *=NULL) const
Returns the xData associated with this object. More...
Acad::ErrorStatus  | xDataTransformBy (const AcGeMatrix3d &)
Transforms the extended data according to parameter transformation matrix. More...
 virtual void  | xmitPropagateModify () const
Not implemented yet.
 virtual  | ~AcDbObject ()
Destructor.
 Public Member Functions inherited from AcGiDrawable
virtual bool  | bounds (AcDbExtents &) const
virtual DrawableType  | drawableType () const
 virtual AcGiDrawStream *  | drawStream () const
 AcGsNode *  | gsNode () const
virtual AcDbObjectId  | id () const =0
virtual Adesk::Boolean  | isPersistent () const =0
virtual Adesk::UInt32  | regenSupportFlags () const final
Returns whether and to which level this object supports MultiThreading. More...
 virtual Adesk::Boolean  | RolloverHit (Adesk::ULongPtr, Adesk::ULongPtr, Adesk::Boolean)
 virtual Adesk::UInt32  | setAttributes (AcGiDrawableTraits *) final
 virtual void  | setDrawStream (AcGiDrawStream *)
 void  | setGsNode (AcGsNode *)
 virtual void  | viewportDraw (AcGiViewportDraw *) final
 virtual Adesk::UInt32  | viewportDrawLogicalFlags (AcGiViewportDraw *) final
 virtual Adesk::Boolean  | worldDraw (AcGiWorldDraw *) final
 Public Member Functions inherited from AcRxObject
virtual AcRxObject *  | clone () const
Exported and implemented. More...
 virtual AcRx::Ordering  | comparedTo (const AcRxObject *) const
Exported and implemented.
virtual Acad::ErrorStatus  | copyFrom (const AcRxObject *)
Exported and implemented. More...
 virtual AcRxClass *  | isA () const
Exported and implemented.
virtual Adesk::Boolean  | isEqualTo (const AcRxObject *) const
Exported and implemented. More...
bool  | isKindOf (const AcRxClass *) const
Checks the object class. More...
AcRxObject *  | queryX (const AcRxClass *) const
returns the protocol extension object assigned to this class or a parent class. More...
AcRxObject *  | x (const AcRxClass *) const
returns the protocol extension object assigned to this class or a parent class. More...
 virtual  | ~AcRxObject ()
Destructor.
 Public Attributes
AcDbLight
Default constructor.
 Public Attributes inherited from AcDbEntity
AcDbEntity
This protected constructor sets the initial value for color to 257, and for the objectids for layer and linetype to AcDbObjectId::kNull. More...
 Protected Member Functions
virtual Acad::ErrorStatus  | subDeepClone (AcDbObject *, AcDbObject *&, AcDbIdMapping &, Adesk::Boolean=Adesk::kTrue) const
virtual Acad::ErrorStatus  | subGetGeomExtents (AcDbExtents &) const
virtual Acad::ErrorStatus  | subGetGripPoints (AcDbGripDataPtrArray &, const double, const int, const AcGeVector3d &, const int) const
virtual Acad::ErrorStatus  | subGetTransformedCopy (const AcGeMatrix3d &, AcDbEntity *&) const
virtual Acad::ErrorStatus  | subHighlight (const AcDbFullSubentPath &, const Adesk::Boolean) const
virtual Acad::ErrorStatus  | subMoveGripPointsAt (const AcDbVoidPtrArray &, const AcGeVector3d &, const int)
virtual Adesk::UInt32  | subSetAttributes (AcGiDrawableTraits *)
virtual Acad::ErrorStatus  | subTransformBy (const AcGeMatrix3d &)
virtual Acad::ErrorStatus  | subUnhighlight (const AcDbFullSubentPath &, const Adesk::Boolean) const
virtual void  | subViewportDraw (AcGiViewportDraw *)
virtual Acad::ErrorStatus  | subWblockClone (AcRxObject *, AcDbObject *&, AcDbIdMapping &, Adesk::Boolean) const
virtual Adesk::Boolean  | subWorldDraw (AcGiWorldDraw *)
 Protected Member Functions inherited from AcDbEntity
 virtual Acad::ErrorStatus  | subAddSubentPaths (const AcDbFullSubentPathArray &)
 virtual Adesk::Boolean  | subCloneMeForDragging ()
 virtual Acad::ErrorStatus  | subDeleteSubentPaths (const AcDbFullSubentPathArray &)
virtual Acad::ErrorStatus  | subExplode (AcDbVoidPtrArray &) const
 virtual Acad::ErrorStatus  | subGetCompoundObjectTransform (AcGeMatrix3d &) const
virtual Acad::ErrorStatus  | subGetGeomExtents (AcDbExtents &) const
virtual Acad::ErrorStatus  | subGetGripEntityUCS (const void *, AcGeVector3d &, AcGePoint3d &, AcGeVector3d &) const
virtual Acad::ErrorStatus  | subGetGripPoints (AcDbGripDataPtrArray &, const double, const int, const AcGeVector3d &, const int) const
virtual Acad::ErrorStatus  | subGetGripPoints (AcGePoint3dArray &, AcDbIntArray &, AcDbIntArray &) const
 virtual Acad::ErrorStatus  | subGetGripPointsAtSubentPath (const AcDbFullSubentPath &, AcDbGripDataPtrArray &, const double, const int, const AcGeVector3d &, const int) const
virtual Acad::ErrorStatus  | subGetGsMarkersAtSubentPath (const AcDbFullSubentPath &, AcArray< Adesk::GsMarker > &) const
virtual Acad::ErrorStatus  | subGetOsnapPoints (AcDb::OsnapMode, Adesk::GsMarker, const AcGePoint3d &, const AcGePoint3d &, const AcGeMatrix3d &, AcGePoint3dArray &, AcDbIntArray &) const
 virtual Acad::ErrorStatus  | subGetOsnapPoints (AcDb::OsnapMode, Adesk::GsMarker, const AcGePoint3d &, const AcGePoint3d &, const AcGeMatrix3d &, AcGePoint3dArray &, AcDbIntArray &, const AcGeMatrix3d &) const
virtual Acad::ErrorStatus  | subGetStretchPoints (AcGePoint3dArray &) const
 virtual Acad::ErrorStatus  | subGetSubentClassId (const AcDbFullSubentPath &, CLSID *) const
 virtual Acad::ErrorStatus  | subGetSubentPathGeomExtents (const AcDbFullSubentPath &, AcDbExtents &) const
virtual Acad::ErrorStatus  | subGetSubentPathsAtGsMarker (AcDb::SubentType, Adesk::GsMarker, const AcGePoint3d &, const AcGeMatrix3d &, int &, AcDbFullSubentPath *&, int=0, AcDbObjectId *=nullptr) const
virtual Acad::ErrorStatus  | subGetTransformedCopy (const AcGeMatrix3d &, AcDbEntity *&) const
virtual void  | subGripStatus (const AcDb::GripStat)
 virtual bool  | subHideMeForDragging () const
virtual Acad::ErrorStatus  | subHighlight (const AcDbFullSubentPath &=kNullSubent, const Adesk::Boolean=false) const
virtual Acad::ErrorStatus  | subIntersectWith (const AcDbEntity *, AcDb::Intersect, AcGePoint3dArray &, Adesk::GsMarker=0, Adesk::GsMarker=0) const
virtual Acad::ErrorStatus  | subIntersectWith (const AcDbEntity *, AcDb::Intersect, const AcGePlane &, AcGePoint3dArray &, Adesk::GsMarker=0, Adesk::GsMarker=0) const
virtual bool  | subIsContentSnappable () const
virtual void  | subList () const
virtual Acad::ErrorStatus  | subMoveGripPointsAt (const AcDbIntArray &, const AcGeVector3d &)
virtual Acad::ErrorStatus  | subMoveGripPointsAt (const AcDbVoidPtrArray &, const AcGeVector3d &, const int)
 virtual Acad::ErrorStatus  | subMoveGripPointsAtSubentPaths (const AcDbFullSubentPathArray &, const AcDbVoidPtrArray &, const AcGeVector3d &, const int)
virtual Acad::ErrorStatus  | subMoveStretchPointsAt (const AcDbIntArray &, const AcGeVector3d &)
virtual Adesk::UInt32  | subSetAttributes (AcGiDrawableTraits *)
Sets the values of this object's subentity traits and returns with the calling object's subentity traits. More...
virtual Acad::ErrorStatus  | subSetVisibility (AcDb::Visibility, Adesk::Boolean=true)
 virtual void  | subSubentGripStatus (const AcDb::GripStat, const AcDbFullSubentPath &)
virtual AcDbEntity *  | subSubentPtr (const AcDbFullSubentPath &) const
virtual Acad::ErrorStatus  | subTransformBy (const AcGeMatrix3d &)
 virtual Acad::ErrorStatus  | subTransformSubentPathsBy (const AcDbFullSubentPathArray &, const AcGeMatrix3d &)
virtual Acad::ErrorStatus  | subUnhighlight (const AcDbFullSubentPath &=kNullSubent, const Adesk::Boolean=false) const
virtual void  | subViewportDraw (AcGiViewportDraw *)
 virtual AcDb::Visibility  | subVisibility () const
virtual Adesk::Boolean  | subWorldDraw (AcGiWorldDraw *)
 Protected Member Functions inherited from AcDbObject
virtual Acad::ErrorStatus  | subDeepClone (AcDbObject *, AcDbObject *&, AcDbIdMapping &, Adesk::Boolean=true) const
virtual Acad::ErrorStatus  | subGetClassID (CLSID *) const
virtual Adesk::UInt32  | subSetAttributes (AcGiDrawableTraits *)
Sets the values of this object's subentity traits and returns with the calling object's subentity traits. More...
virtual void  | subViewportDraw (AcGiViewportDraw *)
virtual Adesk::UInt32  | subViewportDrawLogicalFlags (AcGiViewportDraw *)
virtual Acad::ErrorStatus  | subWblockClone (AcRxObject *, AcDbObject *&, AcDbIdMapping &, Adesk::Boolean=true) const
virtual Adesk::Boolean  | subWorldDraw (AcGiWorldDraw *)
 Protected Member Functions inherited from AcGiDrawable
virtual Adesk::UInt32  | subRegenSupportFlags () const
Returns whether and to which level this object supports MultiThreading. More...
virtual Adesk::UInt32  | subSetAttributes (AcGiDrawableTraits *)=0
virtual void  | subViewportDraw (AcGiViewportDraw *)=0
 virtual Adesk::UInt32  | subViewportDrawLogicalFlags (AcGiViewportDraw *)
virtual Adesk::Boolean  | subWorldDraw (AcGiWorldDraw *)=0
 Protected Member Functions inherited from AcRxObject
AcRxObject ()
Exported and implemented.
 Additional Inherited Members
 Static Public Member Functions inherited from AcRxObject
 static AcRxObject *  | cast (const AcRxObject *)
 static AcRxClass *  | desc ()
Exported and implemented.
 Static Public Member Functions inherited from AcHeapOperators
 static void  | operator delete (void *)
_
 static void  | operator delete (void *, const char *, int)
 static void  | operator delete (void *, void *)
 static void  | operator delete[] (void *)
_
 static void  | operator delete[] (void *, const char *, int)
 static void *  | operator new (size_t)
_
 static void *  | operator new (size_t, const char *, int)
 static void *  | operator new (size_t, void *p)
 static void *  | operator new[] (size_t)
_
 static void *  | operator new[] (size_t, const char *, int)
Detailed Description
_
Member Function Documentation
◆ castShadows()
 UX_EXPORT_FUNCTION bool AcDbLight::castShadows  |  ( |   | ) |   const
virtual
See AcDbEntity::castShadows() .
Returns
always false for this type
Reimplemented from AcDbEntity.
◆ decomposeForSave()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbLight::decomposeForSave  |  ( |  AcDb::AcDbDwgVersion  |  version,
|  AcDbObject *&  |  replacingObject,
|  AcDbObjectId &  |  replacingId,
|  Adesk::Boolean &  |  replaceXData
)
virtual
See also
AcDbEntity::decomposeForSave(AcDb::AcDbDwgVersion, AcDbObject*&, AcDbObjectId&, Adesk::Boolean&)
Reimplemented from AcDbObject.
◆ drawableType()
 AcGiDrawable::DrawableType AcDbLight::drawableType  |  ( |   | ) |   const
virtual
Not implemented yet.
Reimplemented from AcGiDrawable.
◆ dwgInFields()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbLight::dwgInFields  |  ( |  AcDbDwgFiler *  |  dwgFiler | )
virtual
See also
AcDbEntity::dwgInFields(AcDbDwgFiler*)
Reimplemented from AcDbEntity.
◆ dwgOutFields()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbLight::dwgOutFields  |  ( |  AcDbDwgFiler *  |  dwgFiler | ) |   const
virtual
See also
AcDbEntity::dwgOutFields(AcDbDwgFiler*)
Reimplemented from AcDbEntity.
◆ dxfInFields()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbLight::dxfInFields  |  ( |  AcDbDxfFiler *  |  dxfFiler | )
virtual
See also
AcDbEntity::dxfInFields(AcDbDxfFiler*)
Reimplemented from AcDbEntity.
◆ dxfOutFields()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbLight::dxfOutFields  |  ( |  AcDbDxfFiler *  |  dxfFiler | ) |   const
virtual
See also
AcDbEntity::dxfOutFields(AcDbDxfFiler*)
Reimplemented from AcDbEntity.
◆ falloffAngle()
 UX_EXPORT_FUNCTION double AcDbLight::falloffAngle  |  ( |   | ) |   const
virtual
Gets entity's falloff angle.
Returns
the falloff angle
◆ glyphDisplay()
 UX_EXPORT_FUNCTION AcDbLight::GlyphDisplayType AcDbLight::glyphDisplay  |  ( |   | ) |   const
virtual
Returns the glyph display type for this AcDbLigh entity.
Returns
AcDbLight::GlyphDisplayType - the glyph display type for this light entity
◆ hasTarget()
 UX_EXPORT_FUNCTION bool AcDbLight::hasTarget  |  ( |   | ) |   const
virtual
Returns whether this light entity uses a grip for the light target orientation.
Returns
bool - true it a target is assigned, false otherwise
◆ hotspotAngle()
 UX_EXPORT_FUNCTION double AcDbLight::hotspotAngle  |  ( |   | ) |   const
virtual
Gets entity's hotspot angle.
Returns
the hotspot angle
◆ illuminanceDistance()
 UX_EXPORT_FUNCTION double AcDbLight::illuminanceDistance  |  ( |   | ) |   const
virtual
Returns the illumination distance for this AcDbLigh entity.
Returns
double - the illumination distance for this light entity
◆ intensity()
 UX_EXPORT_FUNCTION double AcDbLight::intensity  |  ( |   | ) |   const
virtual
Returns the intesity value of the light object.
Returns
the intensity value, if it is 0.0 then the light is off
◆ isOn()
 UX_EXPORT_FUNCTION bool AcDbLight::isOn  |  ( |   | ) |   const
virtual
Returns the light status.
Returns
true if the light is on, otherwise returns false
◆ lampColorPreset()
 UX_EXPORT_FUNCTION AcDbLight::LampColorPreset AcDbLight::lampColorPreset  |  ( |   | ) |   const
virtual
Returns the lamp color preset for this AcDbLigh entity.
Returns
AcDbLight::LampColorPreset - the lamp color preset value
◆ lampColorTemp()
 UX_EXPORT_FUNCTION double AcDbLight::lampColorTemp  |  ( |   | ) |   const
virtual
Returns the lamp color temperature for this AcDbLigh entity.
Returns
double - the lamp color temperature for this light entity
◆ lampColorType()
 UX_EXPORT_FUNCTION AcDbLight::LampColorType AcDbLight::lampColorType  |  ( |   | ) |   const
virtual
Returns the color type for this AcDbLigh entity.
Returns
AcDbLight::LampColorType - the color type for this light entity
◆ lightAttenuation()
 UX_EXPORT_FUNCTION const AcGiLightAttenuation & AcDbLight::lightAttenuation  |  ( |   | ) |   const
virtual
Returns the ligth attenuation type as a AcGiLightAttenuation object.
Returns
AcGiLightAttenuation reference
◆ lightColor()
 UX_EXPORT_FUNCTION const AcCmColor & AcDbLight::lightColor  |  ( |   | ) |   const
virtual
Returns the color of the light.
Returns
light's color as a AcCmColor object
◆ lightDirection()
 UX_EXPORT_FUNCTION const AcGeVector3d & AcDbLight::lightDirection  |  ( |   | ) |   const
virtual
Returns the light direction as a AcGeVector3d object.
Returns
light direction as a AcGeVector3d reference
◆ lightType()
 UX_EXPORT_FUNCTION AcGiDrawable::DrawableType AcDbLight::lightType  |  ( |   | ) |   const
virtual
Gets this object's light type.
Returns
light's type as a AcGiDrawable::DrawableType
◆ name()
 UX_EXPORT_FUNCTION const AcString & AcDbLight::name  |  ( |   | ) |   const
virtual
Gets this object its name.
Returns
the light's name as a AcString reference
◆ physicalIntensity()
 UX_EXPORT_FUNCTION double AcDbLight::physicalIntensity  |  ( |   | ) |   const
virtual
Returns the physical intensity for this AcDbLigh entity.
Returns
double - the physical intensity value
◆ physicalIntensityMethod()
 UX_EXPORT_FUNCTION AcDbLight::PhysicalIntensityMethod AcDbLight::physicalIntensityMethod  |  ( |   | ) |   const
virtual
Returns the physical intensity method for this AcDbLigh entity.
Returns
AcDbLight::PhysicalIntensityMethod - the physical intensity method
◆ position()
 UX_EXPORT_FUNCTION const AcGePoint3d & AcDbLight::position  |  ( |   | ) |   const
virtual
Returns the light source position as a AcGePoint3d object.
Returns
AcGePoint3d reference
◆ receiveShadows()
 UX_EXPORT_FUNCTION bool AcDbLight::receiveShadows  |  ( |   | ) |   const
virtual
See AcDbEntity::receiveShadows() .
Returns
always false for this type
Reimplemented from AcDbEntity.
◆ resultingColor()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbLight::resultingColor  |  ( |  AcCmColor &  |  rgbColor | ) |   const
virtual
Returns the resulting color for this AcDbLigh entity.
Parameters
[out] | rgbColor | - the resulting AcCmColor color value
Returns
Acad::eOk, if successful, error status otherwise
◆ setCastShadows()
 UX_EXPORT_FUNCTION void AcDbLight::setCastShadows  |  ( |  bool  |  value | )
virtual
See AcDbEntity::setCastShadows(bool) .
Parameters
[in] | value | ignored
Reimplemented from AcDbEntity.
◆ setGlyphDisplay()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbLight::setGlyphDisplay  |  ( |  AcDbLight::GlyphDisplayType  |  glyphType | )
virtual
Assigns the glyph display type to this AcDbLigh entity.
Parameters
[in] | glyphType | - AcDbLight::GlyphDisplayType to be assigned
Returns
Acad::eOk, if successfull, error status otherwise
◆ setHasTarget()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbLight::setHasTarget  |  ( |  bool  |  hasTarget | )
virtual
Defines whether this light entity uses a grip for the light target orientation.
Parameters
[in] | bool | - true to have this light entity using a grip for target orientation, false otherwise
Returns
◆ setHotspotAndFalloff()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbLight::setHotspotAndFalloff  |  ( |  double  |  hotspotAng,
|  double  |  falloffAng
)
virtual
Sets the hotspot and falloff angles of the light object.
Parameters
[in] | hotspotAng | hotspot angle
[in] | falloffAng | falloff angle
Returns
Acad::eOk, if successful
◆ setIlluminanceDistance()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbLight::setIlluminanceDistance  |  ( |  double  |  distance | )
virtual
Assigns the illumination distance to this AcDbLigh entity.
Parameters
[in] | double | - the illumination distance
Returns
Acad::eOk, if successfull, error status otherwise
◆ setIntensity()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbLight::setIntensity  |  ( |  double  |  intensityVal | )
virtual
Sets the intensity value of the light object.
Parameters
[in] | intensityVal | input intensity value of the light object, if it is 0.0 the light is off
Returns
Acad::eOk, if successful
◆ setLampColorPreset()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbLight::setLampColorPreset  |  ( |  AcDbLight::LampColorPreset  |  preset | )
virtual
Assigns the lamp color preset to this AcDbLigh entity.
Parameters
[in] | preset | - AcDbLight::LampColorPreset, the lamp color preset value
Returns
Acad::eOk, if successfull, error status otherwise
◆ setLampColorTemp()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbLight::setLampColorTemp  |  ( |  double  |  temperature | )
virtual
Assigns the lamp color temperature to this AcDbLigh entity.
Parameters
[in] | double | - temperature, the lamp color temperature to be assigned
Returns
Acad::eOk, if successfull, error status otherwise
◆ setLampColorType()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbLight::setLampColorType  |  ( |  AcDbLight::LampColorType  |  colorType | )
virtual
Assigns the color type to this AcDbLigh entity.
Parameters
[in] | colorType | - AcDbLight::LampColorType to be assigned
Returns
Acad::eOk, if successfull, error status otherwise
◆ setLightAttenuation()
 UX_EXPORT_FUNCTION void AcDbLight::setLightAttenuation  |  ( |  const AcGiLightAttenuation &  |  acLightAtt | )
virtual
Sets this object's attenuation type.
Parameters
[in] | acLightAtt | attenuation type as a AcGiLightAttenuation object
◆ setLightColor()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbLight::setLightColor  |  ( |  const AcCmColor &  |  acColor | )
virtual
Sets the light color.
Parameters
[in] | acColor | color for setting
Returns
Acad::eOk is successful
◆ setLightDirection()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbLight::setLightDirection  |  ( |  const AcGeVector3d &  |  lightDir | )
virtual
Sets the light direction.
Parameters
[in] | lightDir | direction of the light
Returns
Acad::eOk, if successful
◆ setLightType()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbLight::setLightType  |  ( |  AcGiDrawable::DrawableType  |  lightType | )
virtual
Sets this object's light type.
Parameters
[in] | lightType | input light type of the object
Returns
Acad::eOk, if successful
◆ setName()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbLight::setName  |  ( |  const AcString &  |  lightName | )
virtual
Sets the light's name.
Parameters
[in] | lightName | input name of the light as a AcString
Returns
Acad::eOk, if successful
◆ setOn()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbLight::setOn  |  ( |  bool  |  lightValue | )
virtual
Turns this object's light on or off.
Parameters
[in] | lightValue | input value of the light, if it is true, the light in on .*
Returns
Acad::eOk, if the operation is successful
◆ setPhysicalIntensity()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbLight::setPhysicalIntensity  |  ( |  double  |  intensity | )
virtual
Assigns the physical intensity to this AcDbLigh entity.
Parameters
[in] | intensity | - the physical intensity value to be assigned
Returns
Acad::eOk, if successfull, error status otherwise
◆ setPhysicalIntensityMethod()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbLight::setPhysicalIntensityMethod  |  ( |  AcDbLight::PhysicalIntensityMethod  |  method | )
virtual
Assigns the physical intensity method to this AcDbLigh entity.
Parameters
[in] | method | - the AcDbLight::PhysicalIntensityMethod value to be assigned
Returns
Acad::eOk, if successfull, error status otherwise
◆ setPosition()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbLight::setPosition  |  ( |  const AcGePoint3d &  |  position | )
virtual
Moves the light source to a new position.
Parameters
[in] | position | input position of the light
Returns
Acad::eOk, if successful
◆ setReceiveShadows()
 UX_EXPORT_FUNCTION void AcDbLight::setReceiveShadows  |  ( |  bool  |  value | )
virtual
See AcDbEntity::setReceiveShadows(bool) .
Parameters
[in] | value | ignored
Reimplemented from AcDbEntity.
◆ setShadowParameters()
 UX_EXPORT_FUNCTION void AcDbLight::setShadowParameters  |  ( |  const AcGiShadowParameters &  |  acShadowParam | )
virtual
Sets this object's shadow parameters.
Parameters
[in] | acShadowParam | shadow parameters as a AcGiShadowParameters object
◆ setTargetLocation()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbLight::setTargetLocation  |  ( |  const AcGePoint3d &  |  location | )
virtual
Moves the light target location to a new position.
Parameters
[in] | location | light target location
Returns
Acad::eOk, if successful
◆ setWebFile()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbLight::setWebFile  |  ( |  const ACHAR *  |  webFile | )
virtual
Assigns the light definition file (IES standard) to this AcDbLigh entity.
Parameters
[in] | webFile | - the name of light definition file (IES) to be assigned
Returns
Acad::eOk, if successfull, error status otherwise
◆ setWebRotation()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbLight::setWebRotation  |  ( |  const AcGeVector3d &  |  rotation | )
virtual
Defines the orientation of goniometric data relative to light orientation for the light entity.
Parameters
[in] | rotation | - AcGeVector3d orientation offset vector
Returns
Acad::eOk, if successfull, error status otherwise
◆ shadowParameters()
 UX_EXPORT_FUNCTION const AcGiShadowParameters & AcDbLight::shadowParameters  |  ( |   | ) |   const
virtual
Returns the shadow parameters as a AcGiShadowParameters object.
Returns
AcGiShadowParameters reference
◆ subClose()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbLight::subClose  |  ( |   | )
virtual
See also
AcDbEntity::subClose()
Reimplemented from AcDbObject.
◆ subDeepClone()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbLight::subDeepClone  |  ( |  AcDbObject *  |  pOwner,
|  AcDbObject *&  |  pClone,
|  AcDbIdMapping &  |  idMap,
|  Adesk::Boolean  |  bIsPrimary = Adesk::kTrue
) |   |  const
protectedvirtual
See also
AcDbEntity::deepClone(deepClone(AcDbObject*, AcDbObject*&, AcDbIdMapping&, Adesk::Boolean)
Reimplemented from AcDbObject.
◆ subGetGeomExtents()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbLight::subGetGeomExtents  |  ( |  AcDbExtents &  |  resultBox | ) |   const
protectedvirtual
See also
AcDbEntity::getGeomExtents(AcDbExtents&)
Reimplemented from AcDbEntity.
◆ subGetGripPoints()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbLight::subGetGripPoints  |  ( |  AcDbGripDataPtrArray &  |  gripArray,
|  const double  |  sizeOfDrawingUnit,
|  const int  |  pixelSize,
|  const AcGeVector3d &  |  DirectionVector,
|  const int  |  gripBitmap
) |   |  const
protectedvirtual
See also
AcDbEntity::subGetGripPoints(AcDbGripDataPtrArray&, const double, const int, const AcGeVector3d&, const int)
Reimplemented from AcDbEntity.
◆ subGetTransformedCopy()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbLight::subGetTransformedCopy  |  ( |  const AcGeMatrix3d &  |  matrix,
|  AcDbEntity *&  |  resultEntity
) |   |  const
protectedvirtual
Reimplemented from AcDbEntity.
◆ subHighlight()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbLight::subHighlight  |  ( |  const AcDbFullSubentPath &  |  subEntPath,
|  const Adesk::Boolean  |  bHighlight
) |   |  const
protectedvirtual
See also
AcDbEntity::highlight(const AcDbFullSubentPath&, const Adesk::Boolean)
Reimplemented from AcDbEntity.
◆ subList()
 UX_EXPORT_FUNCTION void AcDbLight::subList  |  ( |   | ) |   const
virtual
See also
AcDbEntity::list()
Reimplemented from AcDbEntity.
◆ subMoveGripPointsAt()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbLight::subMoveGripPointsAt  |  ( |  const AcDbVoidPtrArray &  |  gripPonterArray,
|  const AcGeVector3d &  |  translationVector,
|  const int  |  bitmap
)
protectedvirtual
See also
AcDbEntity::subMoveGripPointsAt(const AcDbVoidPtrArray&, const AcGeVector3d&, const int)
Reimplemented from AcDbEntity.
◆ subSetAttributes()
 UX_EXPORT_FUNCTION Adesk::UInt32 AcDbLight::subSetAttributes  |  ( |  AcGiDrawableTraits *  |  pTraits | )
protectedvirtual
See also
AcDbEntity::setAttributes(AcGiDrawableTraits*)
Reimplemented from AcDbEntity.
◆ subTransformBy()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbLight::subTransformBy  |  ( |  const AcGeMatrix3d &  |  matrix | )
protectedvirtual
See also
AcDbEntity::transformBy(const AcGeMatrix3d&)
Reimplemented from AcDbEntity.
◆ subUnhighlight()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbLight::subUnhighlight  |  ( |  const AcDbFullSubentPath &  |  subEntPath,
|  const Adesk::Boolean  |  bHighlight
) |   |  const
protectedvirtual
See also
AcDbEntity::unhighlight(const AcDbFullSubentPath&, const Adesk::Boolean)
Reimplemented from AcDbEntity.
◆ subViewportDraw()
 UX_EXPORT_FUNCTION void AcDbLight::subViewportDraw  |  ( |  AcGiViewportDraw *  |  pAcVd | )
protectedvirtual
See also
AcDbEntity::viewportDraw(AcGiViewportDraw* pAcVd)
Reimplemented from AcDbEntity.
◆ subWblockClone()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbLight::subWblockClone  |  ( |  AcRxObject *  |  pInputObject,
|  AcDbObject *&  |  pClonedObject,
|  AcDbIdMapping &  |  idMap,
|  Adesk::Boolean  |  bIsPrimary
) |   |  const
protectedvirtual
See also
AcDbEntity::wblockClone(AcRxObject*, AcDbObject*&, AcDbIdMapping&, Adesk::Boolean)
Reimplemented from AcDbObject.
◆ subWorldDraw()
 UX_EXPORT_FUNCTION Adesk::Boolean AcDbLight::subWorldDraw  |  ( |  AcGiWorldDraw *  |  pAcWd | )
protectedvirtual
See also
AcDbEntity::worldDraw(AcGiWorldDraw*)
Reimplemented from AcDbEntity.
◆ targetLocation()
 UX_EXPORT_FUNCTION const AcGePoint3d & AcDbLight::targetLocation  |  ( |   | ) |   const
virtual
Returns the light target location as a AcGePoint3d object.
Returns
AcGePoint3d reference
◆ webFile()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbLight::webFile  |  ( |  AcString &  |  webFile | ) |   const
virtual
Returns the assigned light definition file (IES standard).
Returns
AcString - the assigned web light file (can be empty)
◆ webRotation()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbLight::webRotation  |  ( |  AcGeVector3d &  |  rotation | ) |   const
virtual
Returns the assigned offset vector (orientation of goniometric data relative to light orientation) for this AcDbLigh entity.
Parameters
[out] | rotation | - AcGeVector3d orientation offset vector
Returns
Acad::eOk, if successfull, error status otherwise