Public Member Functions | List of all members
AcDbMlineStyle Class Reference
_ More...
#include <AcDbMlineStyle.h>
 Public Member Functions
Acad::ErrorStatus  | addElement (int &, double, const AcCmColor &, AcDbObjectId, bool=true)
Adds a new element to the AcDbMlineStyle. More...
virtual Acad::ErrorStatus  | copyFrom (const AcRxObject *)
const ACHAR *  | description () const
Gets the description string. More...
virtual Acad::ErrorStatus  | dwgInFields (AcDbDwgFiler *)
virtual Acad::ErrorStatus  | dwgOutFields (AcDbDwgFiler *) const
virtual Acad::ErrorStatus  | dxfInFields (AcDbDxfFiler *)
virtual Acad::ErrorStatus  | dxfOutFields (AcDbDxfFiler *) const
double  | endAngle () const
Gets the end angle cut value. More...
bool  | endInnerArcs () const
Gets the display status of the mline end inner arcs. More...
bool  | endRoundCap () const
Gets the display status of the mline end round caps. More...
bool  | endSquareCap () const
Gets the display status of the mline end square caps. More...
const AcCmColor &  | fillColor () const
Gets the MlineStyle's "fill color" value. More...
bool  | filled () const
Gets the filling status of the mlines related to this style. More...
Acad::ErrorStatus  | getElementAt (int, double &, AcCmColor &, AcDbObjectId &) const
Gets the MlineStyle properties = offset, color, linetype. More...
 void  | initMlineStyle ()
Initializes or re-initializes the MlineStyle object.
const ACHAR *  | name () const
Returns a pointer to the name string in the MlineStyle. More...
int  | numElements () const
Returns the number of elements in the MlineStyle. More...
Acad::ErrorStatus  | removeElementAt (int)
Removes the specified entry from the MLineStyle definition. More...
void  | set (const AcDbMlineStyle &, bool=true)
Copies the information from src into this. More...
Acad::ErrorStatus  | setDescription (const ACHAR *)
Sets the description string. More...
Acad::ErrorStatus  | setElement (int &, double, const AcCmColor &, AcDbObjectId)
Sets the MlineStyle properties = offset, color, linetype. More...
Acad::ErrorStatus  | setEndAngle (double)
Sets the end angle cut. More...
void  | setEndInnerArcs (bool)
Controls the display of the mline end inner arcs. More...
void  | setEndRoundCap (bool)
Controls the display of the mline end round caps. More...
void  | setEndSquareCap (bool)
Controls the display of the mline end square caps. More...
Acad::ErrorStatus  | setFillColor (const AcCmColor &)
Sets the MlineStyle's "fill color" value. More...
void  | setFilled (bool)
Controls the filling of the mlines related to this style. More...
Acad::ErrorStatus  | setName (const ACHAR *)
Sets the MlineStyle name. More...
void  | setShowMiters (bool)
Controls the display of the mline miterlines at the joints. More...
Acad::ErrorStatus  | setStartAngle (double)
Sets the start angle cut. More...
void  | setStartInnerArcs (bool)
Controls the display of the mline start inner arcs. More...
void  | setStartRoundCap (bool)
Controls the display of the mline start round caps. More...
void  | setStartSquareCap (bool)
Controls the display of the mline start square caps. More...
bool  | showMiters () const
Gets the display status of the mline miterlines at the joints. More...
double  | startAngle () const
Gets the start angle cut value. More...
bool  | startInnerArcs () const
Gets the display status of the mline start inner arcs. More...
bool  | startRoundCap () const
Gets the display status of the mline start round caps. More...
bool  | startSquareCap () const
Gets the display status of the mline start square caps. More...
virtual Acad::ErrorStatus  | subErase (Adesk::Boolean=Adesk::kTrue)
 Public Member Functions inherited from AcDbObject
virtual Acad::ErrorStatus  | addPersistentReactor (AcDbObjectId)
Adds a persistent reactor to this object reactor list. More...
Acad::ErrorStatus  | addReactor (AcDbObjectReactor *) const
Adds a transient reactor to this object. More...
virtual Acad::ErrorStatus  | applyPartialUndo (AcDbDwgFiler *, AcRxClass *)
This function is called during Undo operations on objects, that use the 'Partial Undo meachanism'; this is, this object is opened with assertWriteEnabled(Adesk::kFalse) to indicate that custom Undo filing is used rather than the default Undo filing. More...
 void  | assertNotifyEnabled () const
 void  | assertReadEnabled () const
 void  | assertWriteEnabled (Adesk::Boolean=Adesk::kTrue, Adesk::Boolean=Adesk::kTrue)
virtual Acad::ErrorStatus  | audit (AcDbAuditInfo *)
Performs the audit operation for this object. More...
Acad::ErrorStatus  | cancel ()
Reverts all changes since the object had been opened and closes the object. More...
virtual void  | cancelled (const AcDbObject *)
A handler function for persistent reactors. More...
virtual AcRxObject *  | clone () const
Creates a shallow clone of this object. More...
Acad::ErrorStatus  | close ()
Closes the object. More...
Acad::ErrorStatus  | closeAndPage (Adesk::Boolean=Adesk::kTrue)
Closes the object. More...
virtual Acad::ErrorStatus  | composeForLoad (AcDb::OdaSaveType, AcDb::AcDbDwgVersion)
This function is intended for future MT file loading support. More...
virtual void  | copied (const AcDbObject *, const AcDbObject *)
A handler function for persistent reactors. More...
virtual Acad::ErrorStatus  | copyFrom (const AcRxObject *)
Copies the pSrc object information in this object. More...
Acad::ErrorStatus  | createExtensionDictionary ()
Creates a dictionary as extension dictionary for this object. More...
AcDbDatabase *  | database () const
Returns the database that contains this object. More...
virtual Acad::ErrorStatus  | decomposeForSave (AcDb::AcDbDwgVersion, AcDbObject *&, AcDbObjectId &, Adesk::Boolean &)
This function is called during dwg and dxf output, to allow a custom object to decompose itself, due to provided dwg/dxf target file version. More...
virtual Acad::ErrorStatus  | deepClone (AcDbObject *, AcDbObject *&, AcDbIdMapping &, Adesk::Boolean=Adesk::kTrue) const final
Clones this object, appends it to the owner pOwner and adds an AcDbIdPair record to the idMap. More...
void  | disableUndoRecording (Adesk::Boolean)
Disables or enables the undo recording for the object. More...
Acad::ErrorStatus  | downgradeOpen ()
Sets the open mode for an object opened for write to be opened for read. More...
Acad::ErrorStatus  | downgradeToNotify (Adesk::Boolean)
Sets the open mode for an object opened for write to be opened for notify. More...
virtual AcGiDrawable *  | drawable ()
Retrieves the AcGiDrawable instance of this object. More...
Acad::ErrorStatus  | dwgIn (AcDbDwgFiler *)
Calls the object's dwgInFields function, and reads any XData if present. More...
virtual Acad::ErrorStatus  | dwgInFields (AcDbDwgFiler *)
Reads the object from the DWG filer. More...
Acad::ErrorStatus  | dwgOut (AcDbDwgFiler *) const
Calls the object's dwgOutFields function, and writes any XData if present. More...
virtual Acad::ErrorStatus  | dwgOutFields (AcDbDwgFiler *) const
Writes the object to the DWG filer. More...
Acad::ErrorStatus  | dxfIn (AcDbDxfFiler *)
Calls the object's dxfInFields function, and reads any XData if present. More...
virtual Acad::ErrorStatus  | dxfInFields (AcDbDxfFiler *)
Reads the object from the DXF filer. More...
Acad::ErrorStatus  | dxfOut (AcDbDxfFiler *, Adesk::Boolean, Adesk::uchar *) const
Calls the object's dxfOutFields function, and writes any XData if present. More...
virtual Acad::ErrorStatus  | dxfOutFields (AcDbDxfFiler *) const
Writes the object to the DXF filer. More...
Acad::ErrorStatus  | erase (Adesk::Boolean=Adesk::kTrue)
Sets the bit that indicates that the object is erased. More...
virtual void  | erased (const AcDbObject *, Adesk::Boolean)
A handler function for persistent reactors. More...
AcDbObjectId  | extensionDictionary () const
Returns the object id of the extension dictionary for this object. More...
void  | getAcDbHandle (AcDbHandle &) const
Returns handle of this object. More...
Acad::ErrorStatus  | getBinaryData (const ACHAR *, Adesk::Int32 &, char *&) const
Creates a copy of the binary data stored as chunks of maximum 127 bytes in the resbuf chain of this object's extension dictionary xrecord entry given by entryName. More...
int  | getBrxOpenCount () const
This function returns the number of open BRX instances for this object. More...
int  | getBrxOpenState () const
This function returns the BRX object open state flags as bitfields, for diagnostic purpose. More...
virtual Acad::ErrorStatus  | getClassID (CLSID *) const final
Gets the COM wrapper Class ID for this entity. More...
int  | getCustomObjectState () const
This function returns the custom object status : 1=isCustomObject 2=DifferentialUndoDisabled. More...
Acad::ErrorStatus  | getField (const ACHAR *, AcDbField *&, AcDb::OpenMode) const
Retrieves the specified Field from this object, and opens it in mode. More...
Acad::ErrorStatus  | getField (const ACHAR *, AcDbObjectId &) const
Gets the pszPropName field object from field dictionary of this AcDbObject object, using pszPropName as key. More...
AcDbObjectId  | getFieldDictionary () const
Returns the Field dictionary associated with this object,. More...
Acad::ErrorStatus  | getFieldDictionary (AcDbDictionary *&, AcDb::OpenMode) const
Gets and opens the field dictionary for this. More...
Acad::ErrorStatus  | getObjectBirthVersion (AcDb::AcDbDwgVersion &, AcDb::MaintenanceReleaseVersion &)
This function is currently not supported by the CAD engine, always returns Acad::eOk, and 'kDHL_CURRENT' + 'kMReleaseCurrent' results. More...
virtual Acad::ErrorStatus  | getObjectSaveVersion (const AcDbDwgFiler *, AcDb::AcDbDwgVersion &, AcDb::MaintenanceReleaseVersion &)
Returns the DWG version for saving the object. More...
virtual Acad::ErrorStatus  | getObjectSaveVersion (const AcDbDxfFiler *, AcDb::AcDbDwgVersion &, AcDb::MaintenanceReleaseVersion &)
Returns the DWG version for saving the object. More...
int  | getOdaOpenCount () const
This function returns the number of open ODA instances for this object. More...
int  | getOdaOpenState () const
This function returns the ODA object open state flags as bitfields, for diagnostic purpose. More...
virtual void  | goodbye (const AcDbObject *)
A handler function for persistent reactors. More...
Acad::ErrorStatus  | handOverTo (AcDbObject *, Adesk::Boolean=Adesk::kTrue, Adesk::Boolean=Adesk::kTrue)
Hands over objects identity to another object. More...
bool  | hasFields () const
Return true if this object has single or multiple fields associated with him. More...
bool  | hasPersistentReactor (AcDbObjectId) const
Checks the input objectId in this object reactor list. More...
bool  | hasSaveVersionOverride ()
This function indicates whether this object overrides the filer's save version. More...
virtual AcDbObjectId  | id () const
Returns the database id of this object. More...
Adesk::Boolean  | isAcDbObjectIdsInFlux () const
Checks whether a deep clone operation was completed. More...
Adesk::Boolean  | isAProxy () const
Adesk::Boolean  | isCancelling () const
Adesk::Boolean  | isErased () const
Returns whether this object is erased. More...
Adesk::Boolean  | isEraseStatusToggled () const
Checks whether the object erase status has been toggled. More...
Adesk::Boolean  | isModified () const
Returns whether this object's assertWriteEnabled() has been called since it was opened. More...
Adesk::Boolean  | isModifiedGraphics () const
Checks whether this object graphics will be updated when the object is closed. More...
Adesk::Boolean  | isModifiedXData () const
Checks whether this object's xData was modified. More...
Adesk::Boolean  | isNewObject () const
Returns true if and only if this object has not been closed since it was created. More...
Adesk::Boolean  | isNotifyEnabled () const
Returns whether this object is opened for notify. More...
Adesk::Boolean  | isNotifying () const
virtual Adesk::Boolean  | isPersistent () const
Returns the 'persistent' status of a database object. More...
Adesk::Boolean  | isReadEnabled () const
Returns whether this object is opened for read. More...
 Adesk::Boolean  | isReallyClosing () const
Checks whether the next close call will completely close this object return true if on the next call the object will be completely closed false otherwise.
Adesk::Boolean  | isTransactionResident () const
Gets the object transaction status. More...
Adesk::Boolean  | isUndoing () const
bool  | isUndoRecordingDisabled () const
Returns whether the undo recording for the object is enabled or not. More...
Adesk::Boolean  | isWriteEnabled () const
Returns whether this object is opened for write. More...
virtual AcDb::DuplicateRecordCloning  | mergeStyle () const
Returns the object's merge behavior during cloning. More...
virtual void  | modified (const AcDbObject *)
A handler function for persistent reactors. More...
virtual void  | modifiedGraphics (const AcDbEntity *)
A handler function for persistent reactors. More...
virtual void  | modifiedXData (const AcDbObject *)
A handler function for persistent reactors. More...
virtual void  | modifyUndone (const AcDbObject *)
A handler function for persistent reactors. More...
virtual void  | objectClosed (const AcDbObjectId)
A handler function for persistent reactors. More...
AcDbObjectId  | objectId () const
Returns object id. More...
virtual void  | openedForModify (const AcDbObject *)
A handler function for persistent reactors. More...
AcDbObjectId  | ownerId () const
Returns object id of the owner. More...
AcDbVoidPtrArray *  | reactors ()
Gets the object pointers to reactors. More...
const AcDbVoidPtrArray *  | reactors () const
Gets the object pointers to reactors. More...
virtual void  | reappended (const AcDbObject *)
A handler function for persistent reactors. More...
 virtual void  | recvPropagateModify (const AcDbObject *)
Not implemented yet.
Acad::ErrorStatus  | releaseExtensionDictionary ()
Removes the extension dictionary associated with this object. More...
virtual Acad::ErrorStatus  | removeField (AcDbObjectId)
Removes the Field specified by acFieldId from this object. More...
virtual Acad::ErrorStatus  | removeField (const ACHAR *)
Removes the Field specified by szKeyString from this object. More...
virtual Acad::ErrorStatus  | removeField (const ACHAR *, AcDbObjectId &)
Removes the Field specified by acPszKeyString from this object, and returns its ObjectId value. More...
virtual Acad::ErrorStatus  | removePersistentReactor (AcDbObjectId)
Removes a persistent reactor from this object reactor list. More...
Acad::ErrorStatus  | removeReactor (AcDbObjectReactor *) const
Removes a transient reactor to this object. More...
void  | setAcDbObjectIdsInFlux ()
Call this function to indicate that the object IDs of this object and its sub-objects (if any) are not yet valid. More...
Acad::ErrorStatus  | setBinaryData (const ACHAR *, Adesk::Int32, const char *)
Creates a copy of the binary data, divides it in up to 127 bytes binary chunks and
 sets them as resbufs in the resbuf chain of this object's extension dictionary xrecord entry given by entryName. More...
virtual Acad::ErrorStatus  | setField (const ACHAR *, AcDbField *, AcDbObjectId &)
Adds the pAcField field object to field dictionary of this AcDbObject object, using pKey as key. More...
void  | setHasSaveVersionOverride (bool)
This function can be called to specify that the object has a "save version override". More...
virtual Acad::ErrorStatus  | setOwnerId (AcDbObjectId)
Sets the ownerId data member of the object to be objId. More...
virtual Acad::ErrorStatus  | setXData (const resbuf *)
Sets/removes xData associated with this object. More...
virtual Acad::ErrorStatus  | subCancel ()
Possibility to veto a cancel operation from within custom entities. More...
virtual Acad::ErrorStatus  | subClose ()
virtual Acad::ErrorStatus  | subErase (Adesk::Boolean)
This hook is called during an AcDbObject::erase call, before any actual erase operation is performed. More...
 virtual Acad::ErrorStatus  | subHandOverTo (AcDbObject *)
virtual void  | subObjModified (const AcDbObject *, const AcDbObject *)
A handler function for persistent reactors. More...
 virtual Acad::ErrorStatus  | subOpen (AcDb::OpenMode)
virtual Acad::ErrorStatus  | subSwapIdWith (AcDbObjectId, Adesk::Boolean=Adesk::kFalse, Adesk::Boolean=Adesk::kFalse)
This hook is called during an AcDbObject::swapIdWith() call, before any actual swap operation is performed. More...
Acad::ErrorStatus  | swapIdWith (AcDbObjectId, Adesk::Boolean=Adesk::kFalse, Adesk::Boolean=Adesk::kFalse)
Swaps the object id's between the object identified by param swapId and this object. More...
virtual Acad::ErrorStatus  | swapReferences (const AcDbIdMapping &)
Not implemented yet. More...
virtual void  | unappended (const AcDbObject *)
A handler function for persistent reactors. More...
AcDbDwgFiler *  | undoFiler ()
Gets the undo filer for this object. More...
Acad::ErrorStatus  | upgradeFromNotify (Adesk::Boolean &)
Upgrades the open status of this object to AcDb::kForWrite, if this object is already open (either in AcDb::kForRead, AcDb::kForNotify or AcDb::kForWrite) More...
Acad::ErrorStatus  | upgradeOpen ()
Changes the objects open mode to AcDb::kForWrite and sends notifications. More...
virtual Acad::ErrorStatus  | wblockClone (AcRxObject *, AcDbObject *&, AcDbIdMapping &, Adesk::Boolean=Adesk::kTrue) const final
Clones this object, appends it to the owner pOwner and adds an AcDbIdPair record to the idMap. More...
virtual resbuf *  | xData (const ACHAR *=NULL) const
Returns the xData associated with this object. More...
Acad::ErrorStatus  | xDataTransformBy (const AcGeMatrix3d &)
Transforms the extended data according to parameter transformation matrix. More...
 virtual void  | xmitPropagateModify () const
Not implemented yet.
 virtual  | ~AcDbObject ()
Destructor.
 Public Member Functions inherited from AcGiDrawable
virtual bool  | bounds (AcDbExtents &) const
virtual DrawableType  | drawableType () const
 virtual AcGiDrawStream *  | drawStream () const
 AcGsNode *  | gsNode () const
virtual AcDbObjectId  | id () const =0
virtual Adesk::Boolean  | isPersistent () const =0
virtual Adesk::UInt32  | regenSupportFlags () const final
Returns whether and to which level this object supports MultiThreading. More...
 virtual Adesk::Boolean  | RolloverHit (Adesk::ULongPtr, Adesk::ULongPtr, Adesk::Boolean)
 virtual Adesk::UInt32  | setAttributes (AcGiDrawableTraits *) final
 virtual void  | setDrawStream (AcGiDrawStream *)
 void  | setGsNode (AcGsNode *)
 virtual void  | viewportDraw (AcGiViewportDraw *) final
 virtual Adesk::UInt32  | viewportDrawLogicalFlags (AcGiViewportDraw *) final
 virtual Adesk::Boolean  | worldDraw (AcGiWorldDraw *) final
 Public Member Functions inherited from AcRxObject
virtual AcRxObject *  | clone () const
Exported and implemented. More...
 virtual AcRx::Ordering  | comparedTo (const AcRxObject *) const
Exported and implemented.
virtual Acad::ErrorStatus  | copyFrom (const AcRxObject *)
Exported and implemented. More...
 virtual AcRxClass *  | isA () const
Exported and implemented.
virtual Adesk::Boolean  | isEqualTo (const AcRxObject *) const
Exported and implemented. More...
bool  | isKindOf (const AcRxClass *) const
Checks the object class. More...
AcRxObject *  | queryX (const AcRxClass *) const
returns the protocol extension object assigned to this class or a parent class. More...
AcRxObject *  | x (const AcRxClass *) const
returns the protocol extension object assigned to this class or a parent class. More...
 virtual  | ~AcRxObject ()
Destructor.
 Additional Inherited Members
 Public Types inherited from AcGiDrawable
enum  | DrawableType {
 kGeometry = 0 , kDistantLight , kPointLight , kSpotLight ,
 kAmbientLight , kSolidBackground , kGradientBackground , kImageBackground ,
 kGroundPlaneBackground , kViewport
 }
enum  | SetAttributesFlags {
 kDrawableNone = 0 , kDrawableIsAnEntity = 1 , kDrawableUsesNesting = 2 , kDrawableIsCompoundObject = 4 ,
 kDrawableViewIndependentViewportDraw = 8 , kDrawableIsInvisible = 16 , kDrawableHasAttributes = 32 , kDrawableRegenTypeDependentGeometry = 64 ,
 kDrawableIsDimension = 133 , kDrawableRegenDraw = 256 , kDrawableStandardDisplaySingleLOD = 512 , kDrawableShadedDisplaySingleLOD = 1024 ,
 kDrawableViewDependentViewportDraw = 2048 , kDrawableBlockDependentViewportDraw = 4096 , kDrawableIsExternalReference = 8192 , kDrawableNotPlottable = 16384 ,
 kDrawableNotAllowLCS = 32768 , kDrawableMergeControlOff = 65536 , kThreadedWorldDrawViewportDraw = 131072
 }
 Static Public Member Functions inherited from AcRxObject
 static AcRxObject *  | cast (const AcRxObject *)
 static AcRxClass *  | desc ()
Exported and implemented.
 Static Public Member Functions inherited from AcHeapOperators
 static void  | operator delete (void *)
_
 static void  | operator delete (void *, const char *, int)
 static void  | operator delete (void *, void *)
 static void  | operator delete[] (void *)
_
 static void  | operator delete[] (void *, const char *, int)
 static void *  | operator new (size_t)
_
 static void *  | operator new (size_t, const char *, int)
 static void *  | operator new (size_t, void *p)
 static void *  | operator new[] (size_t)
_
 static void *  | operator new[] (size_t, const char *, int)
 Protected Member Functions inherited from AcDbObject
virtual Acad::ErrorStatus  | subDeepClone (AcDbObject *, AcDbObject *&, AcDbIdMapping &, Adesk::Boolean=true) const
virtual Acad::ErrorStatus  | subGetClassID (CLSID *) const
virtual Adesk::UInt32  | subSetAttributes (AcGiDrawableTraits *)
Sets the values of this object's subentity traits and returns with the calling object's subentity traits. More...
virtual void  | subViewportDraw (AcGiViewportDraw *)
virtual Adesk::UInt32  | subViewportDrawLogicalFlags (AcGiViewportDraw *)
virtual Acad::ErrorStatus  | subWblockClone (AcRxObject *, AcDbObject *&, AcDbIdMapping &, Adesk::Boolean=true) const
virtual Adesk::Boolean  | subWorldDraw (AcGiWorldDraw *)
 Protected Member Functions inherited from AcGiDrawable
virtual Adesk::UInt32  | subRegenSupportFlags () const
Returns whether and to which level this object supports MultiThreading. More...
virtual Adesk::UInt32  | subSetAttributes (AcGiDrawableTraits *)=0
virtual void  | subViewportDraw (AcGiViewportDraw *)=0
 virtual Adesk::UInt32  | subViewportDrawLogicalFlags (AcGiViewportDraw *)
virtual Adesk::Boolean  | subWorldDraw (AcGiWorldDraw *)=0
 Protected Member Functions inherited from AcRxObject
AcRxObject ()
Exported and implemented.
Detailed Description
_
Member Function Documentation
◆ addElement()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbMlineStyle::addElement  |  ( |  int &  |  cardinal,
|  double  |  offset,
|  const AcCmColor &  |  clr,
|  AcDbObjectId  |  linetypeId,
|  bool  |  bIsReferenced = true
)
Adds a new element to the AcDbMlineStyle.
Parameters
[out] | cardinal | element index returned. The other CAD returns always 0 adding the elements stack like, BRX DWGDirect implementation adds them queue like, index beeing the last entry one i.e. the max. number of entries
[in] | offset
[in] | clr
[in] | linetypeId
[in] | bIsReferenced | true if the mline style object is referenced
Returns
Acad::eOk if successful
◆ copyFrom()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbMlineStyle::copyFrom  |  ( |  const AcRxObject *  |  pSrc | )
virtual
See also
AcDbObject::copyFrom(const AcRxObject*)
Reimplemented from AcDbObject.
◆ description()
 UX_EXPORT_FUNCTION const ACHAR * AcDbMlineStyle::description  |  ( |   | ) |   const
Gets the description string.
Returns
description string
◆ dwgInFields()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbMlineStyle::dwgInFields  |  ( |  AcDbDwgFiler *  |  dwgFiler | )
virtual
See also
AcDbObject::dwgInFields(AcDbDwgFiler*)
Reimplemented from AcDbObject.
◆ dwgOutFields()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbMlineStyle::dwgOutFields  |  ( |  AcDbDwgFiler *  |  dwgFiler | ) |   const
virtual
See also
AcDbObject::dwgOutFields(AcDbDwgFiler*)
Reimplemented from AcDbObject.
◆ dxfInFields()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbMlineStyle::dxfInFields  |  ( |  AcDbDxfFiler *  |  dxfFiler | )
virtual
See also
AcDbObject::dxfInFields(AcDbDxfFiler*)
Reimplemented from AcDbObject.
◆ dxfOutFields()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbMlineStyle::dxfOutFields  |  ( |  AcDbDxfFiler *  |  dxfFiler | ) |   const
virtual
See also
AcDbObject::dxfOutFields(AcDbDxfFiler*)
Reimplemented from AcDbObject.
◆ endAngle()
 UX_EXPORT_FUNCTION double AcDbMlineStyle::endAngle  |  ( |   | ) |   const
Gets the end angle cut value.
Returns
angle value
◆ endInnerArcs()
 UX_EXPORT_FUNCTION bool AcDbMlineStyle::endInnerArcs  |  ( |   | ) |   const
Gets the display status of the mline end inner arcs.
Returns
toggleValue is
true if the Mline objects related will have the end inner arcs displayed
false if the Mline objects related will not have the end inner arcs displayed
◆ endRoundCap()
 UX_EXPORT_FUNCTION bool AcDbMlineStyle::endRoundCap  |  ( |   | ) |   const
Gets the display status of the mline end round caps.
Returns
toggleValue is
true if the Mline objects related will have the end round caps displayed
false if the Mline objects related will not have the end round caps displayed
◆ endSquareCap()
 UX_EXPORT_FUNCTION bool AcDbMlineStyle::endSquareCap  |  ( |   | ) |   const
Gets the display status of the mline end square caps.
Returns
toggleValue is
true if the Mline objects related will have the end square caps displayed
false if the Mline objects related will not have the end square caps displayed
◆ fillColor()
 UX_EXPORT_FUNCTION const AcCmColor & AcDbMlineStyle::fillColor  |  ( |   | ) |   const
Gets the MlineStyle's "fill color" value.
Returns
AcCmColor value defined as "fill color"
◆ filled()
 UX_EXPORT_FUNCTION bool AcDbMlineStyle::filled  |  ( |   | ) |   const
Gets the filling status of the mlines related to this style.
Returns
toggleValue is
true if the Mline objects related to this style are to be filled
false if the Mline objects related to this style are not to be filled
◆ getElementAt()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbMlineStyle::getElementAt  |  ( |  int  |  cardinal,
|  double &  |  offset,
|  AcCmColor &  |  clr,
|  AcDbObjectId &  |  linetypeId
) |   |  const
Gets the MlineStyle properties = offset, color, linetype.
Parameters
[in] | cardinal | element index
[out] | offset
[out] | clr
[out] | linetypeId
Returns
Acad::eOk if successful
◆ name()
 UX_EXPORT_FUNCTION const ACHAR * AcDbMlineStyle::name  |  ( |  void  |   | ) |   const
Returns a pointer to the name string in the MlineStyle.
Returns
string containing the MlineStyle name
◆ numElements()
 UX_EXPORT_FUNCTION int AcDbMlineStyle::numElements  |  ( |  void  |   | ) |   const
Returns the number of elements in the MlineStyle.
Returns
number if elements
◆ removeElementAt()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbMlineStyle::removeElementAt  |  ( |  int  |  index | )
Removes the specified entry from the MLineStyle definition.
Parameters
[in] | index | index of the entry to be removed (index is 0-based)
Returns
Acad::eOk if successful
◆ set()
 UX_EXPORT_FUNCTION void AcDbMlineStyle::set  |  ( |  const AcDbMlineStyle &  |  copyFrom,
|  bool  |  checkForReferences = true
)
Copies the information from src into this.
Parameters
[in] | copyFrom | the source object
[in] | checkForReferences | whether to check if the style is referenced
◆ setDescription()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbMlineStyle::setDescription  |  ( |  const ACHAR *  |  text | )
Sets the description string.
Parameters
[in] | description | text
Returns
Acad::eOk if successful
◆ setElement()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbMlineStyle::setElement  |  ( |  int &  |  index,
|  double  |  offset,
|  const AcCmColor &  |  color,
|  AcDbObjectId  |  ltypeId
)
Sets the MlineStyle properties = offset, color, linetype.
Parameters
[in] | elemIndex | element index, starting from 0
[in] | elemOffset | offset
[in] | elemColor | element color descriptor
[in] | linetypeId | AcDbLinetypeTableRecord objectId to be used for the element
Returns
Acad::eOk if successful
◆ setEndAngle()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbMlineStyle::setEndAngle  |  ( |  double  |  endAngle | )
Sets the end angle cut.
Parameters
[in] | endAngle | radians
◆ setEndInnerArcs()
 UX_EXPORT_FUNCTION void AcDbMlineStyle::setEndInnerArcs  |  ( |  bool  |  bEndInnerIsDisplayed | )
Controls the display of the mline end inner arcs.
Parameters
[in] | bEndInnerIsDisplayed
if true the end inner arcs of the Mline objects related to this style are displayed
if false the end inner arcs of the Mline objects related to this style are not displayed
◆ setEndRoundCap()
 UX_EXPORT_FUNCTION void AcDbMlineStyle::setEndRoundCap  |  ( |  bool  |  bEndRoundCapIsDisplayed | )
Controls the display of the mline end round caps.
Parameters
[in] | bEndRoundCapIsDisplayed
if true the end round caps of the Mline objects related to this style are displayed
if false the end round caps of the Mline objects related to this style are not displayed
◆ setEndSquareCap()
 UX_EXPORT_FUNCTION void AcDbMlineStyle::setEndSquareCap  |  ( |  bool  |  bEndSquareCapIsDisplayed | )
Controls the display of the mline end square caps.
Parameters
[in] | bEndSquareCapIsDisplayed
if true the end square caps of the Mline objects related to this style are displayed
if false the end square caps of the Mline objects related to this style are not displayed
◆ setFillColor()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbMlineStyle::setFillColor  |  ( |  const AcCmColor &  |  fillColor | )
Sets the MlineStyle's "fill color" value.
Parameters
[in] | fillColor | color object
Returns
Acad::eOk if successful
◆ setFilled()
 UX_EXPORT_FUNCTION void AcDbMlineStyle::setFilled  |  ( |  bool  |  bIsFilled | )
Controls the filling of the mlines related to this style.
Parameters
[in] | bIsFilled
if true the Mline objects related to this style are filled
if false the Mline objects related to this style are not filled
◆ setName()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbMlineStyle::setName  |  ( |  const ACHAR *  |  mlineStyleName | )
Sets the MlineStyle name.
Parameters
[in] | mlineStyleName | string
Returns
Acad::eOk if successful
◆ setShowMiters()
 UX_EXPORT_FUNCTION void AcDbMlineStyle::setShowMiters  |  ( |  bool  |  bShowMitters | )
Controls the display of the mline miterlines at the joints.
Parameters
[in] | bShowMitters
if true the miterlines of the Mline objects related to this style are displayed
if false the miterlines of the Mline objects related to this style are not displayed
◆ setStartAngle()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbMlineStyle::setStartAngle  |  ( |  double  |  startAngle | )
Sets the start angle cut.
Parameters
[in] | startAngle | radians
◆ setStartInnerArcs()
 UX_EXPORT_FUNCTION void AcDbMlineStyle::setStartInnerArcs  |  ( |  bool  |  bStartInnerIsDisplayed | )
Controls the display of the mline start inner arcs.
Parameters
[in] | bStartInnerIsDisplayed
if true the start inner arcs of the Mline objects related to this style are displayed
if false the start inner arcs of the Mline objects related to this style are not displayed
◆ setStartRoundCap()
 UX_EXPORT_FUNCTION void AcDbMlineStyle::setStartRoundCap  |  ( |  bool  |  bStartRoundCapIsDisplayed | )
Controls the display of the mline start round caps.
Parameters
[in] | bStartRoundCapIsDisplayed
if true the start round caps of the Mline objects related to this style are displayed
if false the start round caps of the Mline objects related to this style are not displayed
◆ setStartSquareCap()
 UX_EXPORT_FUNCTION void AcDbMlineStyle::setStartSquareCap  |  ( |  bool  |  bStartSquareCapIsDisplayed | )
Controls the display of the mline start square caps.
Parameters
[in] | bStartSquareCapIsDisplayed
if true the start square caps of the Mline objects related to this style are displayed
if false the start square caps of the Mline objects related to this style are not displayed
◆ showMiters()
 UX_EXPORT_FUNCTION bool AcDbMlineStyle::showMiters  |  ( |   | ) |   const
Gets the display status of the mline miterlines at the joints.
Returns
toggleValue is
true if the Mline objects related will have the miterlines displayed
false if the Mline objects related will not have the miterlines displayed
◆ startAngle()
 UX_EXPORT_FUNCTION double AcDbMlineStyle::startAngle  |  ( |   | ) |   const
Gets the start angle cut value.
Returns
angle value
◆ startInnerArcs()
 UX_EXPORT_FUNCTION bool AcDbMlineStyle::startInnerArcs  |  ( |   | ) |   const
Gets the display status of the mline start inner arcs.
Returns
toggleValue is
true if the Mline objects related will have the start inner arcs displayed
false if the Mline objects related will not have the start inner arcs displayed
◆ startRoundCap()
 UX_EXPORT_FUNCTION bool AcDbMlineStyle::startRoundCap  |  ( |   | ) |   const
Gets the display status of the mline start round caps.
Returns
toggleValue is
true if the Mline objects related will have the start round caps displayed
false if the Mline objects related will not have the start round caps displayed
◆ startSquareCap()
 UX_EXPORT_FUNCTION bool AcDbMlineStyle::startSquareCap  |  ( |   | ) |   const
Gets the display status of the mline start square caps.
Returns
toggleValue is
true if the Mline objects related will have the start square caps displayed
false if the Mline objects related will not have the start square caps displayed
◆ subErase()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbMlineStyle::subErase  |  ( |  Adesk::Boolean  |  bErase = Adesk::kTrue | )
virtual
See also
AcDbObject::subErase(Adesk::Boolean bErase)
Reimplemented from AcDbObject.