Public Member Functions | Public Attributes | List of all members
AcDbObjectContext Class Referenceabstract
_ More...
#include <AcDbObjectContext.h>
 Public Member Functions
virtual AcString  | collectionName () const =0
virtual Acad::ErrorStatus  | getName (AcString &) const =0
virtual Acad::ErrorStatus  | setName (const AcString &)=0
virtual Adesk::LongPtr  | uniqueIdentifier () const =0
 virtual  | ~AcDbObjectContext ()
Destructor.
 Public Member Functions inherited from AcRxObject
virtual AcRxObject *  | clone () const
Exported and implemented. More...
 virtual AcRx::Ordering  | comparedTo (const AcRxObject *) const
Exported and implemented.
virtual Acad::ErrorStatus  | copyFrom (const AcRxObject *)
Exported and implemented. More...
 virtual AcRxClass *  | isA () const
Exported and implemented.
virtual Adesk::Boolean  | isEqualTo (const AcRxObject *) const
Exported and implemented. More...
bool  | isKindOf (const AcRxClass *) const
Checks the object class. More...
AcRxObject *  | queryX (const AcRxClass *) const
returns the protocol extension object assigned to this class or a parent class. More...
AcRxObject *  | x (const AcRxClass *) const
returns the protocol extension object assigned to this class or a parent class. More...
 virtual  | ~AcRxObject ()
Destructor.
 Public Attributes
AcDbObjectContext
Standard Contructor.
 Additional Inherited Members
 Static Public Member Functions inherited from AcRxObject
 static AcRxObject *  | cast (const AcRxObject *)
 static AcRxClass *  | desc ()
Exported and implemented.
 Protected Member Functions inherited from AcRxObject
AcRxObject ()
Exported and implemented.
Detailed Description
_
Member Function Documentation
◆ collectionName()
 virtual AcString AcDbObjectContext::collectionName  |  ( |   | ) |   const
pure virtual
Implemented in AcDbAnnotationScale.
◆ getName()
 virtual Acad::ErrorStatus AcDbObjectContext::getName  |  ( |  AcString &  |   | ) |   const
pure virtual
Implemented in AcDbAnnotationScale.
◆ setName()
 virtual Acad::ErrorStatus AcDbObjectContext::setName  |  ( |  const AcString &  |   | )
pure virtual
Implemented in AcDbAnnotationScale.
◆ uniqueIdentifier()
 virtual Adesk::LongPtr AcDbObjectContext::uniqueIdentifier  |  ( |   | ) |   const
pure virtual
Implemented in AcDbAnnotationScale.