Public Member Functions | List of all members
AcDbGeomRef Class Referenceabstract
_ More...
#include <AcDbGeomRef.h>
 Public Member Functions
virtual AcDbEntity *  | createEntity () const =0
virtual Acad::ErrorStatus  | evaluateAndCacheGeometry ()=0
virtual bool  | isEmpty () const =0
virtual bool  | isValid () const =0
virtual void  | reset ()=0
 Public Member Functions inherited from AcRxObject
virtual AcRxObject *  | clone () const
Exported and implemented. More...
 virtual AcRx::Ordering  | comparedTo (const AcRxObject *) const
Exported and implemented.
virtual Acad::ErrorStatus  | copyFrom (const AcRxObject *)
Exported and implemented. More...
 virtual AcRxClass *  | isA () const
Exported and implemented.
virtual Adesk::Boolean  | isEqualTo (const AcRxObject *) const
Exported and implemented. More...
bool  | isKindOf (const AcRxClass *) const
Checks the object class. More...
AcRxObject *  | queryX (const AcRxClass *) const
returns the protocol extension object assigned to this class or a parent class. More...
AcRxObject *  | x (const AcRxClass *) const
returns the protocol extension object assigned to this class or a parent class. More...
 virtual  | ~AcRxObject ()
Destructor.
 Additional Inherited Members
 Static Public Member Functions inherited from AcRxObject
 static AcRxObject *  | cast (const AcRxObject *)
 static AcRxClass *  | desc ()
Exported and implemented.
 Protected Member Functions inherited from AcRxObject
AcRxObject ()
Exported and implemented.
Detailed Description
_
Member Function Documentation
◆ createEntity()
 virtual AcDbEntity * AcDbGeomRef::createEntity  |  ( |   | ) |   const
pure virtual
Implemented in AcDbEdgeRef, and AcDbSubentRef.
◆ evaluateAndCacheGeometry()
 virtual Acad::ErrorStatus AcDbGeomRef::evaluateAndCacheGeometry  |  ( |   | )
pure virtual
Implemented in AcDbEdgeRef, and AcDbSubentRef.
◆ isEmpty()
 virtual bool AcDbGeomRef::isEmpty  |  ( |   | ) |   const
pure virtual
Implemented in AcDbEdgeRef, and AcDbSubentRef.
◆ isValid()
 virtual bool AcDbGeomRef::isValid  |  ( |   | ) |   const
pure virtual
Implemented in AcDbEdgeRef, and AcDbSubentRef.
◆ reset()
 virtual void AcDbGeomRef::reset  |  ( |   | )
pure virtual
Implemented in AcDbEdgeRef, and AcDbSubentRef.