Public Types | Public Member Functions | Public Attributes | Protected Member Functions | List of all members
AcDbHelix Class Reference
_ More...
#include <AcDbHelix.h>
 Public Types
enum  | ConstrainType { kTurnHeight = 0 , kTurns , kHeight }
 Public Types inherited from AcDbEntity
enum  | VisualStyleType { kFullVisualStyle = 0 , kFaceVisualStyle = 1 , kEdgeVisualStyle = 2 }
 Public Types inherited from AcGiDrawable
enum  | DrawableType {
 kGeometry = 0 , kDistantLight , kPointLight , kSpotLight ,
 kAmbientLight , kSolidBackground , kGradientBackground , kImageBackground ,
 kGroundPlaneBackground , kViewport
 }
enum  | SetAttributesFlags {
 kDrawableNone = 0 , kDrawableIsAnEntity = 1 , kDrawableUsesNesting = 2 , kDrawableIsCompoundObject = 4 ,
 kDrawableViewIndependentViewportDraw = 8 , kDrawableIsInvisible = 16 , kDrawableHasAttributes = 32 , kDrawableRegenTypeDependentGeometry = 64 ,
 kDrawableIsDimension = 133 , kDrawableRegenDraw = 256 , kDrawableStandardDisplaySingleLOD = 512 , kDrawableShadedDisplaySingleLOD = 1024 ,
 kDrawableViewDependentViewportDraw = 2048 , kDrawableBlockDependentViewportDraw = 4096 , kDrawableIsExternalReference = 8192 , kDrawableNotPlottable = 16384 ,
 kDrawableNotAllowLCS = 32768 , kDrawableMergeControlOff = 65536 , kThreadedWorldDrawViewportDraw = 131072
 }
 Public Member Functions
virtual AcGePoint3d  | axisPoint () const
Get the current axis start point. More...
virtual AcGeVector3d  | axisVector () const
Get the current helix axis vector. More...
virtual double  | baseRadius () const
Get the current helix base radius. More...
virtual ConstrainType  | constrain () const
Get the current helix constraint. More...
Acad::ErrorStatus  | createHelix ()
Initializes the internal spline data. More...
virtual double  | height () const
Get the current helix height. More...
virtual Acad::ErrorStatus  | reverseCurve ()
Reverses the curve parameterization of this curve entity. More...
virtual Acad::ErrorStatus  | setAxisPoint (const AcGePoint3d &, const bool=true)
Sets the axis start point, and optionally moves the helix start point in parallel with the axis point. More...
virtual Acad::ErrorStatus  | setAxisVector (const AcGeVector3d &)
Sets the helix axis direction, and moves the helix start point if needed to keep it perpendicular to the axis start point. More...
virtual Acad::ErrorStatus  | setBaseRadius (double)
Sets the helix base radius. More...
virtual Acad::ErrorStatus  | setConstrain (ConstrainType)
Sets the constraint type. More...
virtual Acad::ErrorStatus  | setHeight (double)
Sets the helix height. More...
virtual Acad::ErrorStatus  | setStartPoint (const AcGePoint3d &)
Sets the helix start point. More...
virtual Acad::ErrorStatus  | setTopRadius (double)
Sets the helix top radius. More...
virtual Acad::ErrorStatus  | setTurnHeight (double)
Sets the helix turn height, or distance between turns. More...
virtual Acad::ErrorStatus  | setTurns (double)
Sets the number or turns (revolutions) of the helix. More...
virtual Acad::ErrorStatus  | setTwist (Adesk::Boolean)
Sets the twist direction of the helix. More...
virtual AcGePoint3d  | startPoint () const
Get the current helix start point. More...
virtual double  | topRadius () const
Get the current helix top radius. More...
virtual double  | totalLength () const
Get the current helix length. More...
virtual double  | turnHeight () const
Get the current helix turn height, or distance between turns. More...
virtual double  | turns () const
Get the current number of turns. More...
virtual double  | turnSlope () const
Get the current helix turn slope. More...
virtual Adesk::Boolean  | twist () const
Get the current helix twist direction. More...
 virtual  | ~AcDbHelix ()
Destructor.
 Public Member Functions inherited from AcDbSpline
AcDbSpline (const AcGePoint3d &, const AcGeVector3d &, const AcGeVector3d &, double, double=0.0, double=(BRX_PI *2.0))
AcDbSpline (const AcGePoint3dArray &, AcGe::KnotParameterization, int=3, double=0.0)
AcDbSpline (const AcGePoint3dArray &, const AcGeVector3d &, const AcGeVector3d &, AcGe::KnotParameterization, int=3, double=0.0)
AcDbSpline (const AcGePoint3dArray &, const AcGeVector3d &, const AcGeVector3d &, int=4, double=0.0)
AcDbSpline (const AcGePoint3dArray &, int=4, double=0.0)
AcDbSpline (int, Adesk::Boolean, Adesk::Boolean, Adesk::Boolean, const AcGePoint3dArray &, const AcGeDoubleArray &, const AcGeDoubleArray &, double=0.0, double=0.0)
virtual DBCURVE_METHODS bool  | castShadows () const
See AcDbCurve::castShadows() . More...
int  | degree () const
Returns the spline degree. More...
Acad::ErrorStatus  | dwgInFields (AcDbDwgFiler *)
Acad::ErrorStatus  | elevateDegree (int)
Increase degree of spline with values starting from current degree value and finishing with values less or equal than 25. More...
double  | fitTolerance () const
Returns the tolerance value used for curve fitting. More...
Acad::ErrorStatus  | getControlPointAt (int, AcGePoint3d &) const
Returns, via pnt (in WCS coordinates), the value of the control point at position cardinal in the list of control points. More...
Acad::ErrorStatus  | getFitData (AcGePoint3dArray &, Adesk::Boolean &, AcGeVector3d &, AcGeVector3d &, AcGe::KnotParameterization &, int &, double &) const
Gets the spline fit points, tangents and tolerance. More...
Acad::ErrorStatus  | getFitData (AcGePoint3dArray &, int &, double &, Adesk::Boolean &, AcGeVector3d &, AcGeVector3d &) const
Gets the spline fit points, tangents and tolerance. More...
Acad::ErrorStatus  | getFitPointAt (int, AcGePoint3d &) const
Returns with pnt set to the value of the fit point at position cardinal. More...
Acad::ErrorStatus  | getFitTangents (AcGeVector3d &, AcGeVector3d &) const
Returns with startPointTangent and endPointTangent set to the start point and end point tangent vectors in WCS coordinates. More...
Acad::ErrorStatus  | getNurbsData (int &, Adesk::Boolean &, Adesk::Boolean &, Adesk::Boolean &, AcGePoint3dArray &, AcGeDoubleArray &, AcGeDoubleArray &, double &, double &) const
Gets the spline NURBS data. More...
Acad::ErrorStatus  | getOffsetCurvesGivenPlaneNormal (const AcGeVector3d &, double, AcDbVoidPtrArray &) const
Adesk::Boolean  | hasFitData () const
Returns Adesk::kTrue if and only if the spline has fit data associated with it. More...
Acad::ErrorStatus  | insertFitPointAt (int, const AcGePoint3d &)
Adds pnt to the list of fit points and refits the spline. More...
Acad::ErrorStatus  | insertKnot (double)
Inserts a new knot on the current spline at the location given by the input spline parameter parameter. More...
Adesk::Boolean  | isNull () const
If this spline attached object is not present returns true. More...
Adesk::Boolean  | isRational () const
If this spline is rational returns true. More...
Acad::ErrorStatus  | modifyPositionAndTangent (double, const AcGePoint3d &, const AcGeVector3d *)
Adjusts the location and tangent of a point on the spline curve with the given parameter. More...
int  | numControlPoints () const
Returns the number of control points in the spline. More...
int  | numFitPoints () const
Returns the number of fit points in the spline. More...
Acad::ErrorStatus  | purgeFitData ()
If the spline is a fitted spline the function purge the fit data.The spline uses NURBS data or control points. More...
virtual bool  | receiveShadows () const
See AcDbCurve::receiveShadows() . More...
Acad::ErrorStatus  | removeFitPointAt (int)
Removes the fit point with the index specified by position. More...
virtual void  | setCastShadows (bool)
See AcDbCurve::setCastShadows(bool) . More...
Acad::ErrorStatus  | setControlPointAt (int, const AcGePoint3d &)
Sets pnt (in WCS coordinates) to be the control point at the cardinal position in the control points list replacing the point value that was previously at cardinal position. More...
Acad::ErrorStatus  | setFitData (const AcGePoint3dArray &, bool, AcGe::KnotParameterization, int=3, double=0.0)
Assigns the fit data for this spline entity. More...
Acad::ErrorStatus  | setFitData (const AcGePoint3dArray &, const AcGeVector3d &, const AcGeVector3d &, AcGe::KnotParameterization, int=3, double=0.0)
Assigns the fit data for this spline entity. More...
Acad::ErrorStatus  | setFitData (const AcGePoint3dArray &, int, double, const AcGeVector3d &, const AcGeVector3d &)
Sets the spline's data using the given params. More...
Acad::ErrorStatus  | setFitPointAt (int, const AcGePoint3d &)
Sets pnt (in WCS coordinates) to be the fit point at the cardinal position in the fit points list (replacing the point value previously at cardinal) More...
Acad::ErrorStatus  | setFitTangents (const AcGeVector3d &, const AcGeVector3d &)
Sets the start end tangents of spline to be startTangent and endTangent respectively and refits the spline. More...
Acad::ErrorStatus  | setFitTol (double)
Sets value to be the new fit point tolerance for the spline and then refits the spline curve. More...
Acad::ErrorStatus  | setNurbsData (int, Adesk::Boolean, Adesk::Boolean, Adesk::Boolean, const AcGePoint3dArray &, const AcGeDoubleArray &, const AcGeDoubleArray &, double=0., double=0.)
Sets the spline's nurbs data with the given params. More...
virtual void  | setReceiveShadows (bool)
See AcDbCurve::setReceiveShadows(bool) . More...
Acad::ErrorStatus  | setType (SplineType)
Sets the spline type: kFitPoints or kControlPoints. More...
 Acad::ErrorStatus  | setWeightAt (int, double)
Acad::ErrorStatus  | toPolyline (AcDbCurve *&, bool, bool, int=10, int *=NULL, unsigned int=kPlineVerticesThrehold) const
Converts this spline entity into a polyline, based on requested parameters. More...
Acad::ErrorStatus  | toPolyline (AcDbCurve *&, int=10, int *=NULL, unsigned int=kPlineVerticesThrehold) const
Converts this spline entity into a polyline, based on PLINETYPE and PLINECONVERTMODE settings. More...
SplineType  | type () const
Gets the spline type: kFitPoints or kControlPoints. More...
Acad::ErrorStatus  | updateFitData ()
Purges the spline fit data. More...
double  | weightAt (int) const
Returns the spline control point weight at a given parameter. More...
 Public Member Functions inherited from AcDbCurve
virtual Acad::ErrorStatus  | extend (Adesk::Boolean, const AcGePoint3d &)
virtual Acad::ErrorStatus  | extend (double)
 virtual Acad::ErrorStatus  | getAcGeCurve (AcGeCurve3d *&, const AcGeTol &=AcGeContext::gTol) const
virtual Acad::ErrorStatus  | getArea (double &) const
virtual Acad::ErrorStatus  | getClosestPointTo (const AcGePoint3d &, AcGePoint3d &, Adesk::Boolean=Adesk::kFalse) const
virtual Acad::ErrorStatus  | getClosestPointTo (const AcGePoint3d &, const AcGeVector3d &, AcGePoint3d &, Adesk::Boolean=Adesk::kFalse) const
virtual Acad::ErrorStatus  | getDistAtParam (double, double &) const
Gets the length of the curve from its start point to the one given by value. More...
virtual Acad::ErrorStatus  | getDistAtPoint (const AcGePoint3d &, double &) const
Gets the lenght of the curve measured from the start point of the curve to the param ptOnCurve. More...
virtual Acad::ErrorStatus  | getEndParam (double &) const
Gets this curve end parameter. More...
virtual Acad::ErrorStatus  | getEndPoint (AcGePoint3d &) const
Set the passed point to end point of the curve, if successful. More...
virtual Acad::ErrorStatus  | getFirstDeriv (const AcGePoint3d &, AcGeVector3d &) const
Gets the first derivative of the curve at the specified point. More...
virtual Acad::ErrorStatus  | getFirstDeriv (double, AcGeVector3d &) const
Gets the first derivative of the curve at the point with curve parameter of value. More...
virtual Acad::ErrorStatus  | getOffsetCurves (double, AcDbVoidPtrArray &) const
virtual Acad::ErrorStatus  | getOffsetCurvesGivenPlaneNormal (const AcGeVector3d &, double, AcDbVoidPtrArray &) const
virtual Acad::ErrorStatus  | getOrthoProjectedCurve (const AcGePlane &, AcDbCurve *&) const
virtual Acad::ErrorStatus  | getParamAtDist (double, double &) const
Gets the parameter of the curve at a point located along the curve at a distance of length from its start point. More...
virtual Acad::ErrorStatus  | getParamAtPoint (const AcGePoint3d &, double &) const
Gets the parameter of the specified point. More...
virtual Acad::ErrorStatus  | getPointAtDist (double, AcGePoint3d &) const
Gets the point on this curve at the distance lenght measured from the start point. More...
virtual Acad::ErrorStatus  | getPointAtParam (double, AcGePoint3d &) const
Gets the point on the curve specified by the passed in param. More...
virtual Acad::ErrorStatus  | getProjectedCurve (const AcGePlane &, const AcGeVector3d &, AcDbCurve *&) const
virtual Acad::ErrorStatus  | getSecondDeriv (const AcGePoint3d &, AcGeVector3d &) const
virtual Acad::ErrorStatus  | getSecondDeriv (double, AcGeVector3d &) const
 virtual Acad::ErrorStatus  | getSpline (AcDbSpline *&) const
virtual Acad::ErrorStatus  | getSplitCurves (const AcGeDoubleArray &, AcDbVoidPtrArray &) const
virtual Acad::ErrorStatus  | getSplitCurves (const AcGePoint3dArray &, AcDbVoidPtrArray &) const
virtual Acad::ErrorStatus  | getStartParam (double &) const
Gets this curve start parameter. More...
virtual Acad::ErrorStatus  | getStartPoint (AcGePoint3d &) const
Set the passed point to start point of the curve, if successful. More...
virtual Adesk::Boolean  | isClosed () const
Returns whether this curve entity is closed. More...
virtual Adesk::Boolean  | isPeriodic () const
Returns whether this curve entity is periodic. More...
virtual Acad::ErrorStatus  | reverseCurve ()
 virtual Acad::ErrorStatus  | setFromAcGeCurve (const AcGeCurve3d &, AcGeVector3d *=NULL, const AcGeTol &=AcGeContext::gTol)
 virtual  | ~AcDbCurve ()
Destructor.
 Public Member Functions inherited from AcDbEntity
 virtual Acad::ErrorStatus  | addSubentPaths (const AcDbFullSubentPathArray &) final
virtual Acad::ErrorStatus  | applyPartialUndo (AcDbDwgFiler *, AcRxClass *)
virtual Acad::ErrorStatus  | audit (AcDbAuditInfo *)
AcDbObjectId  | blockId () const
Returns the Object ID of the BlockTableRecord that owns this entity. More...
Acad::ErrorStatus  | boundingBoxIntersectWith (const AcDbEntity *, AcDb::Intersect, AcGePoint3dArray &, Adesk::GsMarker, Adesk::GsMarker) const
Finds the intersection between the edges of the bounding box for this entity and the pOhter entity. More...
Acad::ErrorStatus  | boundingBoxIntersectWith (const AcDbEntity *, AcDb::Intersect, const AcGePlane &, AcGePoint3dArray &, Adesk::GsMarker, Adesk::GsMarker) const
First, the function projects the other entity and the bounding box of this entity on plane specified by plane. More...
virtual bool  | bounds (AcDbExtents &) const
Returns the extents of this entity as AcDbExtents. More...
virtual bool  | castShadows () const
Checks if this entity is able to cast shadows. More...
virtual Adesk::Boolean  | cloneMeForDragging () final
Checks if a clone will be created for this entity in case of a drag operation. More...
 virtual AcDb::CollisionType  | collisionType () const
AcCmColor  | color () const
Returns the true color information of the entity. More...
Adesk::UInt16  | colorIndex () const
Returns the color number in a range from 0 to 256. More...
 virtual Acad::ErrorStatus  | deleteSubentPaths (const AcDbFullSubentPathArray &) final
virtual void  | dragStatus (const AcDb::DragStat)
Acad::ErrorStatus  | draw ()
Draws or redraws the entity on screen. More...
virtual AcGiDrawable *  | drawable ()
virtual Acad::ErrorStatus  | dwgInFields (AcDbDwgFiler *)
virtual Acad::ErrorStatus  | dwgOutFields (AcDbDwgFiler *) const
virtual Acad::ErrorStatus  | dxfInFields (AcDbDxfFiler *)
virtual Acad::ErrorStatus  | dxfOutFields (AcDbDxfFiler *) const
AcCmEntityColor  | entityColor () const
Returns the lightweight color information of the entity. More...
virtual Acad::ErrorStatus  | explode (AcDbVoidPtrArray &) const final
virtual Acad::ErrorStatus  | getCompoundObjectTransform (AcGeMatrix3d &) const final
It is used for object without geometry like AcDbMleader. More...
virtual void  | getEcs (AcGeMatrix3d &) const
Returns the transformation matrix from OCS (Object Coordinate System) to WCS (World Coordinate System). More...
virtual Acad::ErrorStatus  | getGeomExtents (AcDbExtents &) const final
Returns extents of this entity. More...
 virtual Acad::ErrorStatus  | getGripEntityUCS (const void *, AcGeVector3d &, AcGePoint3d &, AcGeVector3d &) const final
 virtual Acad::ErrorStatus  | getGripPoints (AcDbGripDataPtrArray &, const double, const int, const AcGeVector3d &, const int) const final
virtual Acad::ErrorStatus  | getGripPoints (AcGePoint3dArray &, AcDbIntArray &, AcDbIntArray &) const final
Append grip points to the specified array. More...
 virtual Acad::ErrorStatus  | getGripPointsAtSubentPath (const AcDbFullSubentPath &, AcDbGripDataPtrArray &, const double, const int, const AcGeVector3d &, const int) const final
virtual Acad::ErrorStatus  | getGsMarkersAtSubentPath (const AcDbFullSubentPath &, AcArray< Adesk::GsMarker > &) const final
virtual Acad::ErrorStatus  | getMaterialMapper (AcGiMapper &) const
virtual Acad::ErrorStatus  | getOsnapPoints (AcDb::OsnapMode, Adesk::GsMarker, const AcGePoint3d &, const AcGePoint3d &, const AcGeMatrix3d &, AcGePoint3dArray &, AcDbIntArray &) const final
Gets the entity osnap points. More...
virtual Acad::ErrorStatus  | getOsnapPoints (AcDb::OsnapMode, Adesk::GsMarker, const AcGePoint3d &, const AcGePoint3d &, const AcGeMatrix3d &, AcGePoint3dArray &, AcDbIntArray &, const AcGeMatrix3d &) const final
Gets the entity osnap points. More...
virtual Acad::ErrorStatus  | getPlane (AcGePlane &, AcDb::Planarity &) const
Returns the plane that contains this entity. More...
AcDb::PlotStyleNameType  | getPlotStyleNameId (AcDbObjectId &) const
Returns the plot style name type and its associated id. More...
virtual Acad::ErrorStatus  | getStretchPoints (AcGePoint3dArray &) const final
Append stretch points to the specified array. More...
 virtual Acad::ErrorStatus  | getSubentClassId (const AcDbFullSubentPath &, CLSID *) const final
 virtual Acad::ErrorStatus  | getSubentPathGeomExtents (const AcDbFullSubentPath &, AcDbExtents &) const final
virtual Acad::ErrorStatus  | getSubentPathsAtGsMarker (AcDb::SubentType, Adesk::GsMarker, const AcGePoint3d &, const AcGeMatrix3d &, int &, AcDbFullSubentPath *&, int=0, AcDbObjectId *=NULL) const final
Gets the subentity paths appropriate for the passed in gs marker. More...
virtual Acad::ErrorStatus  | getTransformedCopy (const AcGeMatrix3d &, AcDbEntity *&) const final
Creates a copy of the current entity applying the transformation matrix. More...
 virtual void  | gripStatus (const AcDb::GripStat) final
 virtual bool  | hideMeForDragging () const final
virtual Acad::ErrorStatus  | highlight (const AcDbFullSubentPath &=kNullSubent, const Adesk::Boolean=Adesk::kFalse) const final
Highlights part of, or entire entity. More...
virtual Acad::ErrorStatus  | intersectWith (const AcDbEntity *, AcDb::Intersect, AcGePoint3dArray &, Adesk::GsMarker=0, Adesk::GsMarker=0) const final
Finds the intersection between this entity and the pOhter entity. More...
virtual Acad::ErrorStatus  | intersectWith (const AcDbEntity *, AcDb::Intersect, const AcGePlane &, AcGePoint3dArray &, Adesk::GsMarker=0, Adesk::GsMarker=0) const final
Projects this entity and the pOhter entity on plane, finds the intersection points between these projections and then projects back the points onto the caller entity. More...
 virtual bool  | isContentSnappable () const final
virtual Adesk::Boolean  | isPlanar () const
ACHAR *  | layer () const
Returns the layername. More...
AcDbObjectId  | layerId () const
Returns the Object ID of the LayerTableRecord referenced by this entity. More...
ACHAR *  | linetype () const
Gets the linetype value. More...
AcDbObjectId  | linetypeId () const
Gets the linetypeId value. More...
 double  | linetypeScale () const
returns the linetype scale factor for the entity
AcDb::LineWeight  | lineWeight () const
Gets the entity line weight. More...
virtual void  | list () const final
Prints the properties in drawing window. More...
ACHAR *  | material () const
Gets the material assigned to this entity. More...
AcDbObjectId  | materialId () const
Gets the AcDbObjectId of the material assigned to this entity. More...
virtual Acad::ErrorStatus  | moveGripPointsAt (const AcDbIntArray &, const AcGeVector3d &) final
Move the grip points pointed by the indexes specified in indexArray using the translationVector param direction and length Override this method in custom entities to define your own behaviour. More...
 virtual Acad::ErrorStatus  | moveGripPointsAt (const AcDbVoidPtrArray &, const AcGeVector3d &, const int) final
 virtual Acad::ErrorStatus  | moveGripPointsAtSubentPaths (const AcDbFullSubentPathArray &, const AcDbVoidPtrArray &, const AcGeVector3d &, const int) final
virtual Acad::ErrorStatus  | moveStretchPointsAt (const AcDbIntArray &, const AcGeVector3d &) final
Move the stretch points pointed by the indexes specified in indexArray with the offest specified by translationVector Override this method in custom entities to define your own behaviour. More...
ACHAR *  | plotStyleName () const
Returns the name of the plotStyleName string associated with this entity (DXF 390). More...
virtual bool  | receiveShadows () const
Checks if this entity is able to receive shadows. More...
void  | recordGraphicsModified (Adesk::Boolean=Adesk::kTrue)
Controls the entity display update when closing it Entities not updated when closed are updated at the first regen. More...
virtual void  | saveAs (AcGiWorldDraw *, AcDb::SaveType)
Generates the graphics primitives when a DWG save requiring proxy graphics to be saved is made. More...
virtual void  | setCastShadows (bool)
Sets this entity's flag regarding casting shadows. More...
virtual Acad::ErrorStatus  | setColor (const AcCmColor &, Adesk::Boolean=Adesk::kTrue)
Sets the color information of this entity from an AcCmColor instance. More...
virtual Acad::ErrorStatus  | setColor (const AcCmColor &, bool, AcDbDatabase *)
Sets the color property of this entity from an AcCmColor instance. More...
virtual Acad::ErrorStatus  | setColorIndex (Adesk::UInt16, Adesk::Boolean=Adesk::kTrue)
Sets the color index of this entity (DXF 62). More...
void  | setDatabaseDefaults ()
Applies the default properties of the entities database to this entity. More...
void  | setDatabaseDefaults (AcDbDatabase *)
Applies the default properties of the specified database to this entity. More...
virtual Acad::ErrorStatus  | setLayer (AcDbObjectId, Adesk::Boolean=Adesk::kTrue, bool=false)
Sets the layer to be referenced by this entity (DXF 8). More...
virtual Acad::ErrorStatus  | setLayer (const ACHAR *, Adesk::Boolean=Adesk::kTrue, bool=false)
Sets the layer to be referenced by this entity (DXF 8). More...
virtual Acad::ErrorStatus  | setLinetype (AcDbObjectId, Adesk::Boolean=Adesk::kTrue)
Sets the entities linetype to ltypeObjectId. More...
virtual Acad::ErrorStatus  | setLinetype (const ACHAR *, Adesk::Boolean=Adesk::kTrue)
Sets the entities linetype to the linetpye referenced by layerName. More...
virtual Acad::ErrorStatus  | setLinetypeScale (double, Adesk::Boolean=Adesk::kTrue)
sets value as entity linetype scale factor More...
virtual Acad::ErrorStatus  | setLineWeight (AcDb::LineWeight, Adesk::Boolean=Adesk::kTrue)
Sets the entity line weight. More...
virtual Acad::ErrorStatus  | setMaterial (AcDbObjectId, Adesk::Boolean=Adesk::kTrue)
Not implemented yet. More...
virtual Acad::ErrorStatus  | setMaterial (const ACHAR *, Adesk::Boolean=Adesk::kTrue)
Assigns the material to the entity. More...
virtual Acad::ErrorStatus  | setMaterialMapper (const AcGiMapper &, Adesk::Boolean=Adesk::kTrue)
It is used for apply material (scale, rotation, projection, mode overrides) to an identity.If it is used AcGiMapper::kIdentity it will apply for entity a default mapper. More...
virtual Acad::ErrorStatus  | setPlotStyleName (AcDb::PlotStyleNameType, AcDbObjectId=AcDbObjectId::kNull, Adesk::Boolean=Adesk::kTrue)
Sets the plot style of this entity. More...
virtual Acad::ErrorStatus  | setPlotStyleName (const ACHAR *, Adesk::Boolean=Adesk::kTrue)
Sets the plot style of this entity. More...
Acad::ErrorStatus  | setPropertiesFrom (const AcDbEntity *, Adesk::Boolean=Adesk::kTrue)
Copies the properties color, layer, linetype, linetypescale and visibility from the source entity pEntity to this entity. More...
virtual void  | setReceiveShadows (bool)
Sets this entity's flag regarding receiving shadows. More...
virtual Acad::ErrorStatus  | setTransparency (const AcCmTransparency &, Adesk::Boolean=Adesk::kTrue)
Sets the transparency setting of this entity, and returns eOk if successful. More...
virtual Acad::ErrorStatus  | setVisibility (AcDb::Visibility, Adesk::Boolean=Adesk::kTrue) final
notyetdocumented. More...
 virtual Acad::ErrorStatus  | setVisualStyle (AcDbObjectId, VisualStyleType=kFullVisualStyle, Adesk::Boolean=true)
 virtual void  | subentGripStatus (const AcDb::GripStat, const AcDbFullSubentPath &) final
virtual AcDbEntity *  | subentPtr (const AcDbFullSubentPath &) const final
Creates an entity as a copy of the subentity given by acSubentPath. More...
virtual void  | subSetDatabaseDefaults (AcDbDatabase *)
This function is called by AcDbEntity::setDatabaseDefaults(), to allow custom entities to set their related sub entities, if any; default implementation does nothing. More...
virtual Acad::ErrorStatus  | transformBy (const AcGeMatrix3d &) final
Applies given transformation (matrix) to the entity. More...
 virtual Acad::ErrorStatus  | transformSubentPathsBy (const AcDbFullSubentPathArray &, const AcGeMatrix3d &) final
 AcCmTransparency  | transparency () const
Returns the transparency setting of this entity.
virtual Acad::ErrorStatus  | unhighlight (const AcDbFullSubentPath &=kNullSubent, const Adesk::Boolean=Adesk::kFalse) const final
Unhighlights previously highlighted part of entity, or entire entity. More...
AcDb::Visibility  | visibility () const
Gets the visibility state. More...
 AcDbObjectId  | visualStyleId (VisualStyleType=kFullVisualStyle) const
 Public Member Functions inherited from AcDbObject
virtual Acad::ErrorStatus  | addPersistentReactor (AcDbObjectId)
Adds a persistent reactor to this object reactor list. More...
Acad::ErrorStatus  | addReactor (AcDbObjectReactor *) const
Adds a transient reactor to this object. More...
virtual Acad::ErrorStatus  | applyPartialUndo (AcDbDwgFiler *, AcRxClass *)
This function is called during Undo operations on objects, that use the 'Partial Undo meachanism'; this is, this object is opened with assertWriteEnabled(Adesk::kFalse) to indicate that custom Undo filing is used rather than the default Undo filing. More...
 void  | assertNotifyEnabled () const
 void  | assertReadEnabled () const
 void  | assertWriteEnabled (Adesk::Boolean=Adesk::kTrue, Adesk::Boolean=Adesk::kTrue)
virtual Acad::ErrorStatus  | audit (AcDbAuditInfo *)
Performs the audit operation for this object. More...
Acad::ErrorStatus  | cancel ()
Reverts all changes since the object had been opened and closes the object. More...
virtual void  | cancelled (const AcDbObject *)
A handler function for persistent reactors. More...
virtual AcRxObject *  | clone () const
Creates a shallow clone of this object. More...
Acad::ErrorStatus  | close ()
Closes the object. More...
Acad::ErrorStatus  | closeAndPage (Adesk::Boolean=Adesk::kTrue)
Closes the object. More...
virtual Acad::ErrorStatus  | composeForLoad (AcDb::OdaSaveType, AcDb::AcDbDwgVersion)
This function is intended for future MT file loading support. More...
virtual void  | copied (const AcDbObject *, const AcDbObject *)
A handler function for persistent reactors. More...
virtual Acad::ErrorStatus  | copyFrom (const AcRxObject *)
Copies the pSrc object information in this object. More...
Acad::ErrorStatus  | createExtensionDictionary ()
Creates a dictionary as extension dictionary for this object. More...
AcDbDatabase *  | database () const
Returns the database that contains this object. More...
virtual Acad::ErrorStatus  | decomposeForSave (AcDb::AcDbDwgVersion, AcDbObject *&, AcDbObjectId &, Adesk::Boolean &)
This function is called during dwg and dxf output, to allow a custom object to decompose itself, due to provided dwg/dxf target file version. More...
virtual Acad::ErrorStatus  | deepClone (AcDbObject *, AcDbObject *&, AcDbIdMapping &, Adesk::Boolean=Adesk::kTrue) const final
Clones this object, appends it to the owner pOwner and adds an AcDbIdPair record to the idMap. More...
void  | disableUndoRecording (Adesk::Boolean)
Disables or enables the undo recording for the object. More...
Acad::ErrorStatus  | downgradeOpen ()
Sets the open mode for an object opened for write to be opened for read. More...
Acad::ErrorStatus  | downgradeToNotify (Adesk::Boolean)
Sets the open mode for an object opened for write to be opened for notify. More...
virtual AcGiDrawable *  | drawable ()
Retrieves the AcGiDrawable instance of this object. More...
Acad::ErrorStatus  | dwgIn (AcDbDwgFiler *)
Calls the object's dwgInFields function, and reads any XData if present. More...
virtual Acad::ErrorStatus  | dwgInFields (AcDbDwgFiler *)
Reads the object from the DWG filer. More...
Acad::ErrorStatus  | dwgOut (AcDbDwgFiler *) const
Calls the object's dwgOutFields function, and writes any XData if present. More...
virtual Acad::ErrorStatus  | dwgOutFields (AcDbDwgFiler *) const
Writes the object to the DWG filer. More...
Acad::ErrorStatus  | dxfIn (AcDbDxfFiler *)
Calls the object's dxfInFields function, and reads any XData if present. More...
virtual Acad::ErrorStatus  | dxfInFields (AcDbDxfFiler *)
Reads the object from the DXF filer. More...
Acad::ErrorStatus  | dxfOut (AcDbDxfFiler *, Adesk::Boolean, Adesk::uchar *) const
Calls the object's dxfOutFields function, and writes any XData if present. More...
virtual Acad::ErrorStatus  | dxfOutFields (AcDbDxfFiler *) const
Writes the object to the DXF filer. More...
Acad::ErrorStatus  | erase (Adesk::Boolean=Adesk::kTrue)
Sets the bit that indicates that the object is erased. More...
virtual void  | erased (const AcDbObject *, Adesk::Boolean)
A handler function for persistent reactors. More...
AcDbObjectId  | extensionDictionary () const
Returns the object id of the extension dictionary for this object. More...
void  | getAcDbHandle (AcDbHandle &) const
Returns handle of this object. More...
Acad::ErrorStatus  | getBinaryData (const ACHAR *, Adesk::Int32 &, char *&) const
Creates a copy of the binary data stored as chunks of maximum 127 bytes in the resbuf chain of this object's extension dictionary xrecord entry given by entryName. More...
int  | getBrxOpenCount () const
This function returns the number of open BRX instances for this object. More...
int  | getBrxOpenState () const
This function returns the BRX object open state flags as bitfields, for diagnostic purpose. More...
virtual Acad::ErrorStatus  | getClassID (CLSID *) const final
Gets the COM wrapper Class ID for this entity. More...
int  | getCustomObjectState () const
This function returns the custom object status : 1=isCustomObject 2=DifferentialUndoDisabled. More...
Acad::ErrorStatus  | getField (const ACHAR *, AcDbField *&, AcDb::OpenMode) const
Retrieves the specified Field from this object, and opens it in mode. More...
Acad::ErrorStatus  | getField (const ACHAR *, AcDbObjectId &) const
Gets the pszPropName field object from field dictionary of this AcDbObject object, using pszPropName as key. More...
AcDbObjectId  | getFieldDictionary () const
Returns the Field dictionary associated with this object,. More...
Acad::ErrorStatus  | getFieldDictionary (AcDbDictionary *&, AcDb::OpenMode) const
Gets and opens the field dictionary for this. More...
Acad::ErrorStatus  | getObjectBirthVersion (AcDb::AcDbDwgVersion &, AcDb::MaintenanceReleaseVersion &)
This function is currently not supported by the CAD engine, always returns Acad::eOk, and 'kDHL_CURRENT' + 'kMReleaseCurrent' results. More...
virtual Acad::ErrorStatus  | getObjectSaveVersion (const AcDbDwgFiler *, AcDb::AcDbDwgVersion &, AcDb::MaintenanceReleaseVersion &)
Returns the DWG version for saving the object. More...
virtual Acad::ErrorStatus  | getObjectSaveVersion (const AcDbDxfFiler *, AcDb::AcDbDwgVersion &, AcDb::MaintenanceReleaseVersion &)
Returns the DWG version for saving the object. More...
int  | getOdaOpenCount () const
This function returns the number of open ODA instances for this object. More...
int  | getOdaOpenState () const
This function returns the ODA object open state flags as bitfields, for diagnostic purpose. More...
virtual void  | goodbye (const AcDbObject *)
A handler function for persistent reactors. More...
Acad::ErrorStatus  | handOverTo (AcDbObject *, Adesk::Boolean=Adesk::kTrue, Adesk::Boolean=Adesk::kTrue)
Hands over objects identity to another object. More...
bool  | hasFields () const
Return true if this object has single or multiple fields associated with him. More...
bool  | hasPersistentReactor (AcDbObjectId) const
Checks the input objectId in this object reactor list. More...
bool  | hasSaveVersionOverride ()
This function indicates whether this object overrides the filer's save version. More...
virtual AcDbObjectId  | id () const
Returns the database id of this object. More...
Adesk::Boolean  | isAcDbObjectIdsInFlux () const
Checks whether a deep clone operation was completed. More...
Adesk::Boolean  | isAProxy () const
Adesk::Boolean  | isCancelling () const
Adesk::Boolean  | isErased () const
Returns whether this object is erased. More...
Adesk::Boolean  | isEraseStatusToggled () const
Checks whether the object erase status has been toggled. More...
Adesk::Boolean  | isModified () const
Returns whether this object's assertWriteEnabled() has been called since it was opened. More...
Adesk::Boolean  | isModifiedGraphics () const
Checks whether this object graphics will be updated when the object is closed. More...
Adesk::Boolean  | isModifiedXData () const
Checks whether this object's xData was modified. More...
Adesk::Boolean  | isNewObject () const
Returns true if and only if this object has not been closed since it was created. More...
Adesk::Boolean  | isNotifyEnabled () const
Returns whether this object is opened for notify. More...
Adesk::Boolean  | isNotifying () const
virtual Adesk::Boolean  | isPersistent () const
Returns the 'persistent' status of a database object. More...
Adesk::Boolean  | isReadEnabled () const
Returns whether this object is opened for read. More...
 Adesk::Boolean  | isReallyClosing () const
Checks whether the next close call will completely close this object return true if on the next call the object will be completely closed false otherwise.
Adesk::Boolean  | isTransactionResident () const
Gets the object transaction status. More...
Adesk::Boolean  | isUndoing () const
bool  | isUndoRecordingDisabled () const
Returns whether the undo recording for the object is enabled or not. More...
Adesk::Boolean  | isWriteEnabled () const
Returns whether this object is opened for write. More...
virtual AcDb::DuplicateRecordCloning  | mergeStyle () const
Returns the object's merge behavior during cloning. More...
virtual void  | modified (const AcDbObject *)
A handler function for persistent reactors. More...
virtual void  | modifiedGraphics (const AcDbEntity *)
A handler function for persistent reactors. More...
virtual void  | modifiedXData (const AcDbObject *)
A handler function for persistent reactors. More...
virtual void  | modifyUndone (const AcDbObject *)
A handler function for persistent reactors. More...
virtual void  | objectClosed (const AcDbObjectId)
A handler function for persistent reactors. More...
AcDbObjectId  | objectId () const
Returns object id. More...
virtual void  | openedForModify (const AcDbObject *)
A handler function for persistent reactors. More...
AcDbObjectId  | ownerId () const
Returns object id of the owner. More...
AcDbVoidPtrArray *  | reactors ()
Gets the object pointers to reactors. More...
const AcDbVoidPtrArray *  | reactors () const
Gets the object pointers to reactors. More...
virtual void  | reappended (const AcDbObject *)
A handler function for persistent reactors. More...
 virtual void  | recvPropagateModify (const AcDbObject *)
Not implemented yet.
Acad::ErrorStatus  | releaseExtensionDictionary ()
Removes the extension dictionary associated with this object. More...
virtual Acad::ErrorStatus  | removeField (AcDbObjectId)
Removes the Field specified by acFieldId from this object. More...
virtual Acad::ErrorStatus  | removeField (const ACHAR *)
Removes the Field specified by szKeyString from this object. More...
virtual Acad::ErrorStatus  | removeField (const ACHAR *, AcDbObjectId &)
Removes the Field specified by acPszKeyString from this object, and returns its ObjectId value. More...
virtual Acad::ErrorStatus  | removePersistentReactor (AcDbObjectId)
Removes a persistent reactor from this object reactor list. More...
Acad::ErrorStatus  | removeReactor (AcDbObjectReactor *) const
Removes a transient reactor to this object. More...
void  | setAcDbObjectIdsInFlux ()
Call this function to indicate that the object IDs of this object and its sub-objects (if any) are not yet valid. More...
Acad::ErrorStatus  | setBinaryData (const ACHAR *, Adesk::Int32, const char *)
Creates a copy of the binary data, divides it in up to 127 bytes binary chunks and
 sets them as resbufs in the resbuf chain of this object's extension dictionary xrecord entry given by entryName. More...
virtual Acad::ErrorStatus  | setField (const ACHAR *, AcDbField *, AcDbObjectId &)
Adds the pAcField field object to field dictionary of this AcDbObject object, using pKey as key. More...
void  | setHasSaveVersionOverride (bool)
This function can be called to specify that the object has a "save version override". More...
virtual Acad::ErrorStatus  | setOwnerId (AcDbObjectId)
Sets the ownerId data member of the object to be objId. More...
virtual Acad::ErrorStatus  | setXData (const resbuf *)
Sets/removes xData associated with this object. More...
virtual Acad::ErrorStatus  | subCancel ()
Possibility to veto a cancel operation from within custom entities. More...
virtual Acad::ErrorStatus  | subClose ()
virtual Acad::ErrorStatus  | subErase (Adesk::Boolean)
This hook is called during an AcDbObject::erase call, before any actual erase operation is performed. More...
 virtual Acad::ErrorStatus  | subHandOverTo (AcDbObject *)
virtual void  | subObjModified (const AcDbObject *, const AcDbObject *)
A handler function for persistent reactors. More...
 virtual Acad::ErrorStatus  | subOpen (AcDb::OpenMode)
virtual Acad::ErrorStatus  | subSwapIdWith (AcDbObjectId, Adesk::Boolean=Adesk::kFalse, Adesk::Boolean=Adesk::kFalse)
This hook is called during an AcDbObject::swapIdWith() call, before any actual swap operation is performed. More...
Acad::ErrorStatus  | swapIdWith (AcDbObjectId, Adesk::Boolean=Adesk::kFalse, Adesk::Boolean=Adesk::kFalse)
Swaps the object id's between the object identified by param swapId and this object. More...
virtual Acad::ErrorStatus  | swapReferences (const AcDbIdMapping &)
Not implemented yet. More...
virtual void  | unappended (const AcDbObject *)
A handler function for persistent reactors. More...
AcDbDwgFiler *  | undoFiler ()
Gets the undo filer for this object. More...
Acad::ErrorStatus  | upgradeFromNotify (Adesk::Boolean &)
Upgrades the open status of this object to AcDb::kForWrite, if this object is already open (either in AcDb::kForRead, AcDb::kForNotify or AcDb::kForWrite) More...
Acad::ErrorStatus  | upgradeOpen ()
Changes the objects open mode to AcDb::kForWrite and sends notifications. More...
virtual Acad::ErrorStatus  | wblockClone (AcRxObject *, AcDbObject *&, AcDbIdMapping &, Adesk::Boolean=Adesk::kTrue) const final
Clones this object, appends it to the owner pOwner and adds an AcDbIdPair record to the idMap. More...
virtual resbuf *  | xData (const ACHAR *=NULL) const
Returns the xData associated with this object. More...
Acad::ErrorStatus  | xDataTransformBy (const AcGeMatrix3d &)
Transforms the extended data according to parameter transformation matrix. More...
 virtual void  | xmitPropagateModify () const
Not implemented yet.
 virtual  | ~AcDbObject ()
Destructor.
 Public Member Functions inherited from AcGiDrawable
virtual bool  | bounds (AcDbExtents &) const
virtual DrawableType  | drawableType () const
 virtual AcGiDrawStream *  | drawStream () const
 AcGsNode *  | gsNode () const
virtual AcDbObjectId  | id () const =0
virtual Adesk::Boolean  | isPersistent () const =0
virtual Adesk::UInt32  | regenSupportFlags () const final
Returns whether and to which level this object supports MultiThreading. More...
 virtual Adesk::Boolean  | RolloverHit (Adesk::ULongPtr, Adesk::ULongPtr, Adesk::Boolean)
 virtual Adesk::UInt32  | setAttributes (AcGiDrawableTraits *) final
 virtual void  | setDrawStream (AcGiDrawStream *)
 void  | setGsNode (AcGsNode *)
 virtual void  | viewportDraw (AcGiViewportDraw *) final
 virtual Adesk::UInt32  | viewportDrawLogicalFlags (AcGiViewportDraw *) final
 virtual Adesk::Boolean  | worldDraw (AcGiWorldDraw *) final
 Public Member Functions inherited from AcRxObject
virtual AcRxObject *  | clone () const
Exported and implemented. More...
 virtual AcRx::Ordering  | comparedTo (const AcRxObject *) const
Exported and implemented.
virtual Acad::ErrorStatus  | copyFrom (const AcRxObject *)
Exported and implemented. More...
 virtual AcRxClass *  | isA () const
Exported and implemented.
virtual Adesk::Boolean  | isEqualTo (const AcRxObject *) const
Exported and implemented. More...
bool  | isKindOf (const AcRxClass *) const
Checks the object class. More...
AcRxObject *  | queryX (const AcRxClass *) const
returns the protocol extension object assigned to this class or a parent class. More...
AcRxObject *  | x (const AcRxClass *) const
returns the protocol extension object assigned to this class or a parent class. More...
 virtual  | ~AcRxObject ()
Destructor.
 Public Attributes
AcDbHelix
Default constructor.
 Public Attributes inherited from AcDbSpline
AcDbSpline
Default constructor. More...
 Public Attributes inherited from AcDbCurve
AcDbCurve
Default constructor.
 Public Attributes inherited from AcDbEntity
AcDbEntity
This protected constructor sets the initial value for color to 257, and for the objectids for layer and linetype to AcDbObjectId::kNull. More...
 Protected Member Functions
virtual void  | subGripStatus (const AcDb::GripStat)
 Protected Member Functions inherited from AcDbEntity
 virtual Acad::ErrorStatus  | subAddSubentPaths (const AcDbFullSubentPathArray &)
 virtual Adesk::Boolean  | subCloneMeForDragging ()
 virtual Acad::ErrorStatus  | subDeleteSubentPaths (const AcDbFullSubentPathArray &)
virtual Acad::ErrorStatus  | subExplode (AcDbVoidPtrArray &) const
 virtual Acad::ErrorStatus  | subGetCompoundObjectTransform (AcGeMatrix3d &) const
virtual Acad::ErrorStatus  | subGetGeomExtents (AcDbExtents &) const
virtual Acad::ErrorStatus  | subGetGripEntityUCS (const void *, AcGeVector3d &, AcGePoint3d &, AcGeVector3d &) const
virtual Acad::ErrorStatus  | subGetGripPoints (AcDbGripDataPtrArray &, const double, const int, const AcGeVector3d &, const int) const
virtual Acad::ErrorStatus  | subGetGripPoints (AcGePoint3dArray &, AcDbIntArray &, AcDbIntArray &) const
 virtual Acad::ErrorStatus  | subGetGripPointsAtSubentPath (const AcDbFullSubentPath &, AcDbGripDataPtrArray &, const double, const int, const AcGeVector3d &, const int) const
virtual Acad::ErrorStatus  | subGetGsMarkersAtSubentPath (const AcDbFullSubentPath &, AcArray< Adesk::GsMarker > &) const
virtual Acad::ErrorStatus  | subGetOsnapPoints (AcDb::OsnapMode, Adesk::GsMarker, const AcGePoint3d &, const AcGePoint3d &, const AcGeMatrix3d &, AcGePoint3dArray &, AcDbIntArray &) const
 virtual Acad::ErrorStatus  | subGetOsnapPoints (AcDb::OsnapMode, Adesk::GsMarker, const AcGePoint3d &, const AcGePoint3d &, const AcGeMatrix3d &, AcGePoint3dArray &, AcDbIntArray &, const AcGeMatrix3d &) const
virtual Acad::ErrorStatus  | subGetStretchPoints (AcGePoint3dArray &) const
 virtual Acad::ErrorStatus  | subGetSubentClassId (const AcDbFullSubentPath &, CLSID *) const
 virtual Acad::ErrorStatus  | subGetSubentPathGeomExtents (const AcDbFullSubentPath &, AcDbExtents &) const
virtual Acad::ErrorStatus  | subGetSubentPathsAtGsMarker (AcDb::SubentType, Adesk::GsMarker, const AcGePoint3d &, const AcGeMatrix3d &, int &, AcDbFullSubentPath *&, int=0, AcDbObjectId *=nullptr) const
virtual Acad::ErrorStatus  | subGetTransformedCopy (const AcGeMatrix3d &, AcDbEntity *&) const
virtual void  | subGripStatus (const AcDb::GripStat)
 virtual bool  | subHideMeForDragging () const
virtual Acad::ErrorStatus  | subHighlight (const AcDbFullSubentPath &=kNullSubent, const Adesk::Boolean=false) const
virtual Acad::ErrorStatus  | subIntersectWith (const AcDbEntity *, AcDb::Intersect, AcGePoint3dArray &, Adesk::GsMarker=0, Adesk::GsMarker=0) const
virtual Acad::ErrorStatus  | subIntersectWith (const AcDbEntity *, AcDb::Intersect, const AcGePlane &, AcGePoint3dArray &, Adesk::GsMarker=0, Adesk::GsMarker=0) const
virtual bool  | subIsContentSnappable () const
virtual void  | subList () const
virtual Acad::ErrorStatus  | subMoveGripPointsAt (const AcDbIntArray &, const AcGeVector3d &)
virtual Acad::ErrorStatus  | subMoveGripPointsAt (const AcDbVoidPtrArray &, const AcGeVector3d &, const int)
 virtual Acad::ErrorStatus  | subMoveGripPointsAtSubentPaths (const AcDbFullSubentPathArray &, const AcDbVoidPtrArray &, const AcGeVector3d &, const int)
virtual Acad::ErrorStatus  | subMoveStretchPointsAt (const AcDbIntArray &, const AcGeVector3d &)
virtual Adesk::UInt32  | subSetAttributes (AcGiDrawableTraits *)
Sets the values of this object's subentity traits and returns with the calling object's subentity traits. More...
virtual Acad::ErrorStatus  | subSetVisibility (AcDb::Visibility, Adesk::Boolean=true)
 virtual void  | subSubentGripStatus (const AcDb::GripStat, const AcDbFullSubentPath &)
virtual AcDbEntity *  | subSubentPtr (const AcDbFullSubentPath &) const
virtual Acad::ErrorStatus  | subTransformBy (const AcGeMatrix3d &)
 virtual Acad::ErrorStatus  | subTransformSubentPathsBy (const AcDbFullSubentPathArray &, const AcGeMatrix3d &)
virtual Acad::ErrorStatus  | subUnhighlight (const AcDbFullSubentPath &=kNullSubent, const Adesk::Boolean=false) const
virtual void  | subViewportDraw (AcGiViewportDraw *)
 virtual AcDb::Visibility  | subVisibility () const
virtual Adesk::Boolean  | subWorldDraw (AcGiWorldDraw *)
 Protected Member Functions inherited from AcDbObject
virtual Acad::ErrorStatus  | subDeepClone (AcDbObject *, AcDbObject *&, AcDbIdMapping &, Adesk::Boolean=true) const
virtual Acad::ErrorStatus  | subGetClassID (CLSID *) const
virtual Adesk::UInt32  | subSetAttributes (AcGiDrawableTraits *)
Sets the values of this object's subentity traits and returns with the calling object's subentity traits. More...
virtual void  | subViewportDraw (AcGiViewportDraw *)
virtual Adesk::UInt32  | subViewportDrawLogicalFlags (AcGiViewportDraw *)
virtual Acad::ErrorStatus  | subWblockClone (AcRxObject *, AcDbObject *&, AcDbIdMapping &, Adesk::Boolean=true) const
virtual Adesk::Boolean  | subWorldDraw (AcGiWorldDraw *)
 Protected Member Functions inherited from AcGiDrawable
virtual Adesk::UInt32  | subRegenSupportFlags () const
Returns whether and to which level this object supports MultiThreading. More...
virtual Adesk::UInt32  | subSetAttributes (AcGiDrawableTraits *)=0
virtual void  | subViewportDraw (AcGiViewportDraw *)=0
 virtual Adesk::UInt32  | subViewportDrawLogicalFlags (AcGiViewportDraw *)
virtual Adesk::Boolean  | subWorldDraw (AcGiWorldDraw *)=0
 Protected Member Functions inherited from AcRxObject
AcRxObject ()
Exported and implemented.
 Additional Inherited Members
 Static Public Member Functions inherited from AcDbCurve
 static Acad::ErrorStatus  | createFromAcGeCurve (const AcGeCurve3d &, AcDbCurve *&, AcGeVector3d *=NULL, const AcGeTol &=AcGeContext::gTol)
 Static Public Member Functions inherited from AcRxObject
 static AcRxObject *  | cast (const AcRxObject *)
 static AcRxClass *  | desc ()
Exported and implemented.
 Static Public Member Functions inherited from AcHeapOperators
 static void  | operator delete (void *)
_
 static void  | operator delete (void *, const char *, int)
 static void  | operator delete (void *, void *)
 static void  | operator delete[] (void *)
_
 static void  | operator delete[] (void *, const char *, int)
 static void *  | operator new (size_t)
_
 static void *  | operator new (size_t, const char *, int)
 static void *  | operator new (size_t, void *p)
 static void *  | operator new[] (size_t)
_
 static void *  | operator new[] (size_t, const char *, int)
Detailed Description
_
Member Function Documentation
◆ axisPoint()
 UX_EXPORT_FUNCTION AcGePoint3d AcDbHelix::axisPoint  |  ( |   | ) |   const
virtual
Get the current axis start point.
Returns
axis start point
◆ axisVector()
 UX_EXPORT_FUNCTION AcGeVector3d AcDbHelix::axisVector  |  ( |   | ) |   const
virtual
Get the current helix axis vector.
Returns
helix axis vector
◆ baseRadius()
 UX_EXPORT_FUNCTION double AcDbHelix::baseRadius  |  ( |   | ) |   const
virtual
Get the current helix base radius.
Returns
helix base radius
◆ constrain()
 UX_EXPORT_FUNCTION AcDbHelix::ConstrainType AcDbHelix::constrain  |  ( |   | ) |   const
virtual
Get the current helix constraint.
Returns
helix constraint type
◆ createHelix()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbHelix::createHelix  |  ( |   | )
Initializes the internal spline data.
Returns
Acad::eOk if successful, error code otherwise
◆ height()
 UX_EXPORT_FUNCTION double AcDbHelix::height  |  ( |   | ) |   const
virtual
Get the current helix height.
Returns
helix height
◆ reverseCurve()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbHelix::reverseCurve  |  ( |   | )
virtual
Reverses the curve parameterization of this curve entity.
Returns
Acad::eOk if successful, error code otherwise
Reimplemented from AcDbCurve.
◆ setAxisPoint()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbHelix::setAxisPoint  |  ( |  const AcGePoint3d &  |  axisPt,
|  const bool  |  moveStart = true
)
virtual
Sets the axis start point, and optionally moves the helix start point in parallel with the axis point.
Parameters
[in] | axisPt | new axis definition point
[in] | moveStart | true to move start point with axis point
Returns
Acad::eOk if successful
◆ setAxisVector()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbHelix::setAxisVector  |  ( |  const AcGeVector3d &  |  axis | )
virtual
Sets the helix axis direction, and moves the helix start point if needed to keep it perpendicular to the axis start point.
Parameters
[in] | axis | new axis direction vector
Returns
Acad::eOk if successful
◆ setBaseRadius()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbHelix::setBaseRadius  |  ( |  double  |  radius | )
virtual
Sets the helix base radius.
Parameters
[in] | radius | new base radius
Returns
Acad::eOk if successful
◆ setConstrain()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbHelix::setConstrain  |  ( |  ConstrainType  |  constraint | )
virtual
Sets the constraint type.
The previous setting determines how the new constraint is effected.
Parameters
[in] | constraint | new constrain type
Returns
Acad::eOk if successful
◆ setHeight()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbHelix::setHeight  |  ( |  double  |  height | )
virtual
Sets the helix height.
Parameters
[in] | height | new height
Returns
Acad::eOk if successful
◆ setStartPoint()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbHelix::setStartPoint  |  ( |  const AcGePoint3d &  |  startPt | )
virtual
Sets the helix start point.
Parameters
[in] | startPt | new start point
Returns
Acad::eOk if successful
◆ setTopRadius()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbHelix::setTopRadius  |  ( |  double  |  radius | )
virtual
Sets the helix top radius.
Parameters
[in] | radius | new top radius
Returns
Acad::eOk if successful
◆ setTurnHeight()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbHelix::setTurnHeight  |  ( |  double  |  dist | )
virtual
Sets the helix turn height, or distance between turns.
Parameters
[in] | dist | new turn height
Returns
Acad::eOk if successful
◆ setTurns()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbHelix::setTurns  |  ( |  double  |  turns | )
virtual
Sets the number or turns (revolutions) of the helix.
Parameters
[in] | turns | number of turns
Returns
Acad::eOk if successful
◆ setTwist()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbHelix::setTwist  |  ( |  Adesk::Boolean  |  clockwise | )
virtual
Sets the twist direction of the helix.
Parameters
[in] | clockwise | clockwise twist if Adesk::kTrue, otherwise counter-clockwise
Returns
Acad::eOk if successful
◆ startPoint()
 UX_EXPORT_FUNCTION AcGePoint3d AcDbHelix::startPoint  |  ( |   | ) |   const
virtual
Get the current helix start point.
Returns
helix start point
◆ subGripStatus()
 UX_EXPORT_FUNCTION void AcDbHelix::subGripStatus  |  ( |  const AcDb::GripStat  |  value | )
protectedvirtual
See also
AcDbSpline::gripStatus(const AcDb::GripStat)
Reimplemented from AcDbEntity.
◆ topRadius()
 UX_EXPORT_FUNCTION double AcDbHelix::topRadius  |  ( |   | ) |   const
virtual
Get the current helix top radius.
Returns
helix top radius
◆ totalLength()
 UX_EXPORT_FUNCTION double AcDbHelix::totalLength  |  ( |   | ) |   const
virtual
Get the current helix length.
Returns
helix length
◆ turnHeight()
 UX_EXPORT_FUNCTION double AcDbHelix::turnHeight  |  ( |   | ) |   const
virtual
Get the current helix turn height, or distance between turns.
Returns
helix turn height
◆ turns()
 UX_EXPORT_FUNCTION double AcDbHelix::turns  |  ( |   | ) |   const
virtual
Get the current number of turns.
Returns
helix turns
◆ turnSlope()
 UX_EXPORT_FUNCTION double AcDbHelix::turnSlope  |  ( |   | ) |   const
virtual
Get the current helix turn slope.
Returns
helix slope
◆ twist()
 UX_EXPORT_FUNCTION Adesk::Boolean AcDbHelix::twist  |  ( |   | ) |   const
virtual
Get the current helix twist direction.
Returns
Adesk::kTrue if clockwise, Adesk::kFalse if counter-clockwise