Public Types | Public Member Functions | List of all members
AcDbDate Class Reference
_ More...
#include <AcDbDate.h>
 Public Types
enum  | InitialValue { kInitZero = 1 , kInitLocalTime , kInitUniversalTime }
 Public Member Functions
AcDbDate ()
AcDbDate class default constructor.
AcDbDate (const AcDbDate &)
AcDbDate class copy constructor. More...
AcDbDate (InitialValue)
AcDbDate class constructor with initializer. More...
const AcDbDate &  | add (const AcDbDate &)
Adds the date value of other to this date. More...
short  | day () const
Gets the day. More...
Acad::ErrorStatus  | dwgIn (AcDbDwgFiler *)
Reads the object from the DWG filer. More...
Acad::ErrorStatus  | dwgOut (AcDbDwgFiler *) const
Writes the object to the DWG filer. More...
void  | getDate (short &, short &, short &) const
Gets the date parameter values. More...
 void  | getLocalTime ()
Sets the date to current local time.
void  | getTime (short &, short &, short &, short &) const
Gets the time parameter values. More...
void  | getTime (SYSTEMTIME &) const
Gets date and time in sysTime. More...
 void  | getUniversalTime ()
Sets the date to current universal time.
short  | hour () const
Gets the hour. More...
long  | julianDay () const
Returns the Julian Day Number. More...
double  | julianFraction () const
Returns the data as its double representation. More...
 void  | localToUniversal ()
Converts the internal date from local to universal.
short  | millisecond () const
Gets the millisecond. More...
short  | minute () const
Gets the minute. More...
short  | month () const
Gets the month. More...
long  | msecsPastMidnight () const
Returns the milliseconds past midnight of this date. More...
const AcDbDate  | operator+ (const AcDbDate &) const
Adds the date value of other and this date value. More...
const AcDbDate &  | operator+= (const AcDbDate &)
Adds the date value of other to this date. More...
const AcDbDate  | operator- (const AcDbDate &) const
Subtracts the date value of other from this date value. More...
const AcDbDate &  | operator-= (const AcDbDate &)
Subtracts the date value of other from this date. More...
bool  | operator< (const AcDbDate &) const
Compares whether this date value is smaller other. More...
bool  | operator<= (const AcDbDate &) const
Compares whether this date value is smaller or equal other. More...
const AcDbDate &  | operator= (const AcDbDate &)
Assignment operator. More...
bool  | operator== (const AcDbDate &) const
Equality operator. More...
bool  | operator> (const AcDbDate &) const
Compares whether this date value is greater other. More...
bool  | operator>= (const AcDbDate &) const
Compares whether this date value is greater or equal other. More...
short  | second () const
Gets the second. More...
void  | setDate (short, short, short)
Sets the date. More...
void  | setDay (short)
Sets the day of this date. More...
void  | setHour (short)
Sets the hour of this date. More...
void  | setJulianDate (long, long)
Sets the Julian day and the milliseconds past midnight. More...
void  | setJulianDay (long)
Sets the day as Julian day number. More...
void  | setJulianFraction (double)
Sets the date given as double value. More...
void  | setMillisecond (short)
Sets the millisecond of this date. More...
void  | setMinute (short)
Sets the minute of this date. More...
void  | setMonth (short)
Sets the month of this date. More...
void  | setMsecsPastMidnight (long)
Sets the milliseconds past midnight of this date. More...
void  | setSecond (short)
Sets the second of this date. More...
void  | setTime (const SYSTEMTIME &)
Sets date and time with values in sysTime. More...
void  | setTime (short, short, short, short)
Sets the time. More...
 void  | setToZero ()
Sets the date to 0.
void  | setYear (short)
Sets the year of this date. More...
const AcDbDate &  | subtract (const AcDbDate &)
Subtracts the date value of other from this date. More...
 void  | universalToLocal ()
Converts the internal date from universal to local.
short  | year () const
Gets the year. More...
 virtual  | ~AcDbDate ()
AcDbDate class destructor.
Detailed Description
_
Constructor & Destructor Documentation
◆ AcDbDate() [1/2]
 UX_EXPORT_FUNCTION AcDbDate::AcDbDate  |  ( |  InitialValue  |  initTime | )
AcDbDate class constructor with initializer.
Parameters
[in] | initial | value
◆ AcDbDate() [2/2]
 UX_EXPORT_FUNCTION AcDbDate::AcDbDate  |  ( |  const AcDbDate &  |  source | )
AcDbDate class copy constructor.
Parameters
[in] | source | AcDbDate value
Member Function Documentation
◆ add()
 UX_EXPORT_FUNCTION const AcDbDate & AcDbDate::add  |  ( |  const AcDbDate &  |  other | )
Adds the date value of other to this date.
Parameters
[in] | other | object to add
Returns
reference to this object
◆ day()
 UX_EXPORT_FUNCTION short AcDbDate::day  |  ( |   | ) |   const
Gets the day.
Returns
day of this object [1-31]
◆ dwgIn()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbDate::dwgIn  |  ( |  AcDbDwgFiler *  |  dwgFiler | )
Reads the object from the DWG filer.
Parameters
[in] | dwgFiler | the DWG filer containing the object data
Returns
Acad::eOk if successful
◆ dwgOut()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbDate::dwgOut  |  ( |  AcDbDwgFiler *  |  dwgFiler | ) |   const
Writes the object to the DWG filer.
Parameters
[in] | dwgFiler | the DWG filer that receives the object data
Returns
Acad::eOk if successful
◆ getDate()
 UX_EXPORT_FUNCTION void AcDbDate::getDate  |  ( |  short &  |  m,
|  short &  |  d,
|  short &  |  y
) |   |  const
Gets the date parameter values.
Parameters
[out] | m | month
[out] | d | day
[out] | y | year
◆ getTime() [1/2]
 UX_EXPORT_FUNCTION void AcDbDate::getTime  |  ( |  short &  |  h,
|  short &  |  m,
|  short &  |  s,
|  short &  |  ms
) |   |  const
Gets the time parameter values.
Parameters
[out] | h | hour
[out] | m | minute
[out] | s | second
[out] | ms | millisecond
◆ getTime() [2/2]
 UX_EXPORT_FUNCTION void AcDbDate::getTime  |  ( |  SYSTEMTIME &  |  sysTime | ) |   const
Gets date and time in sysTime.
Parameters
[out] | sysTime
◆ hour()
 UX_EXPORT_FUNCTION short AcDbDate::hour  |  ( |  void  |   | ) |   const
Gets the hour.
Returns
hour [0-23]
◆ julianDay()
 UX_EXPORT_FUNCTION long AcDbDate::julianDay  |  ( |   | ) |   const
Returns the Julian Day Number.
Returns
a long representing the Julian Day Number
◆ julianFraction()
 UX_EXPORT_FUNCTION double AcDbDate::julianFraction  |  ( |   | ) |   const
Returns the data as its double representation.
Returns
a double representing the JDN with the fractions of a day
◆ millisecond()
 UX_EXPORT_FUNCTION short AcDbDate::millisecond  |  ( |  void  |   | ) |   const
Gets the millisecond.
Returns
millisecond [0-999]
◆ minute()
 UX_EXPORT_FUNCTION short AcDbDate::minute  |  ( |  void  |   | ) |   const
Gets the minute.
Returns
minute [0-59]
◆ month()
 UX_EXPORT_FUNCTION short AcDbDate::month  |  ( |   | ) |   const
Gets the month.
Returns
month of this object [1-12]
◆ msecsPastMidnight()
 UX_EXPORT_FUNCTION long AcDbDate::msecsPastMidnight  |  ( |   | ) |   const
Returns the milliseconds past midnight of this date.
Returns
milliseconds past midnight
◆ operator+()
 UX_EXPORT_FUNCTION const AcDbDate AcDbDate::operator+  |  ( |  const AcDbDate &  |  other | ) |   const
Adds the date value of other and this date value.
Parameters
[in] | other | object to add
Returns
result of addition
◆ operator+=()
 UX_EXPORT_FUNCTION const AcDbDate & AcDbDate::operator+=  |  ( |  const AcDbDate &  |  other | )
Adds the date value of other to this date.
Parameters
[in] | other | object to add
Returns
reference to this object
◆ operator-()
 UX_EXPORT_FUNCTION const AcDbDate AcDbDate::operator-  |  ( |  const AcDbDate &  |  other | ) |   const
Subtracts the date value of other from this date value.
Parameters
[in] | other | object to subtract
Returns
result of subtraction
◆ operator-=()
 UX_EXPORT_FUNCTION const AcDbDate & AcDbDate::operator-=  |  ( |  const AcDbDate &  |  other | )
Subtracts the date value of other from this date.
Parameters
[in] | other | to subtract
Returns
reference to this object
◆ operator<()
 UX_EXPORT_FUNCTION bool AcDbDate::operator<  |  ( |  const AcDbDate &  |  other | ) |   const
Compares whether this date value is smaller other.
Parameters
[in] | other | comparison object
Returns
comparison result
◆ operator<=()
 UX_EXPORT_FUNCTION bool AcDbDate::operator<=  |  ( |  const AcDbDate &  |  other | ) |   const
Compares whether this date value is smaller or equal other.
Parameters
[in] | other | comparison object
Returns
comparison result
◆ operator=()
 UX_EXPORT_FUNCTION const AcDbDate & AcDbDate::operator=  |  ( |  const AcDbDate &  |  other | )
Assignment operator.
Parameters
[in] | other | source object
Returns
reference to this object
◆ operator==()
 UX_EXPORT_FUNCTION bool AcDbDate::operator==  |  ( |  const AcDbDate &  |  other | ) |   const
Equality operator.
Parameters
[in] | other | other AcDbDate object to compare with this one
Returns
true if dates are the same false otherwise
◆ operator>()
 UX_EXPORT_FUNCTION bool AcDbDate::operator>  |  ( |  const AcDbDate &  |  other | ) |   const
Compares whether this date value is greater other.
Parameters
[in] | other | comparison object
Returns
comparison result
◆ operator>=()
 UX_EXPORT_FUNCTION bool AcDbDate::operator>=  |  ( |  const AcDbDate &  |  other | ) |   const
Compares whether this date value is greater or equal other.
Parameters
[in] | other | comparison object
Returns
comparison result
◆ second()
 UX_EXPORT_FUNCTION short AcDbDate::second  |  ( |  void  |   | ) |   const
Gets the second.
Returns
second [0-59]
◆ setDate()
 UX_EXPORT_FUNCTION void AcDbDate::setDate  |  ( |  short  |  m,
|  short  |  d,
|  short  |  y
)
Sets the date.
Parameters
[in] | m | month
[in] | d | day
[in] | y | year
◆ setDay()
 UX_EXPORT_FUNCTION void AcDbDate::setDay  |  ( |  short  |  day | )
Sets the day of this date.
Has to be between 1 and 31. Nothing happens for other values day.
Parameters
[in] | day | day to set
◆ setHour()
 UX_EXPORT_FUNCTION void AcDbDate::setHour  |  ( |  short  |  hour | )
Sets the hour of this date.
Has to be between 0 and 23. Nothing happens for other values hour.
Parameters
[in] | hour | hour to set
◆ setJulianDate()
 UX_EXPORT_FUNCTION void AcDbDate::setJulianDate  |  ( |  long  |  day,
|  long  |  mseconds
)
Sets the Julian day and the milliseconds past midnight.
Parameters
[in] | day | day to set(1 to 365)
[in] | mseconds | milliseconds to set
◆ setJulianDay()
 UX_EXPORT_FUNCTION void AcDbDate::setJulianDay  |  ( |  long  |  day | )
Sets the day as Julian day number.
Works correctly as date from 2378862(1.1.1801) to 2488069(31.12.2099) In fact setting with this function and getting with the get function julianDay work for all possible numbers. But the correct date result is only given for the numbers in above range
◆ setJulianFraction()
 UX_EXPORT_FUNCTION void AcDbDate::setJulianFraction  |  ( |  double  |  date | )
Sets the date given as double value.
Date
Parameters
[in] | fraction
◆ setMillisecond()
 UX_EXPORT_FUNCTION void AcDbDate::setMillisecond  |  ( |  short  |  ms | )
Sets the millisecond of this date.
Has to be between 0 and 999. Nothing happens for other values ms.
Parameters
[in] | ms | millisecond to set
◆ setMinute()
 UX_EXPORT_FUNCTION void AcDbDate::setMinute  |  ( |  short  |  minute | )
Sets the minute of this date.
Has to be between 0 and 59. Nothing happens for other values minute.
Parameters
[in] | minute | minute to set
◆ setMonth()
 UX_EXPORT_FUNCTION void AcDbDate::setMonth  |  ( |  short  |  month | )
Sets the month of this date.
Has to be between 1 and 12. Nothing happens for other values month.
Parameters
[in] | month | month to set
◆ setMsecsPastMidnight()
 UX_EXPORT_FUNCTION void AcDbDate::setMsecsPastMidnight  |  ( |  long  |  mSeconds | )
Sets the milliseconds past midnight of this date.
Parameters
[in] | mSeconds | milliseconds to set (0 to 86399999)
◆ setSecond()
 UX_EXPORT_FUNCTION void AcDbDate::setSecond  |  ( |  short  |  second | )
Sets the second of this date.
Has to be between 0 and 59. Nothing happens for other values second.
Parameters
[in] | second | second to set
◆ setTime() [1/2]
 UX_EXPORT_FUNCTION void AcDbDate::setTime  |  ( |  const SYSTEMTIME &  |  sysTime | )
Sets date and time with values in sysTime.
Parameters
[in] | sysTime
◆ setTime() [2/2]
 UX_EXPORT_FUNCTION void AcDbDate::setTime  |  ( |  short  |  h,
|  short  |  m,
|  short  |  s,
|  short  |  ms
)
Sets the time.
Parameters
[in] | h | hour
[in] | m | minute
[in] | s | second
[in] | ms | millisecond
◆ setYear()
 UX_EXPORT_FUNCTION void AcDbDate::setYear  |  ( |  short  |  year | )
Sets the year of this date.
Nothing happens for negative or 0 value year.
Parameters
[in] | year | year to set - for reasonable date it has to be a value from 1801 to 2099
◆ subtract()
 UX_EXPORT_FUNCTION const AcDbDate & AcDbDate::subtract  |  ( |  const AcDbDate &  |  other | )
Subtracts the date value of other from this date.
Parameters
[in] | other | object to subtract
Returns
reference to this object
◆ year()
 UX_EXPORT_FUNCTION short AcDbDate::year  |  ( |   | ) |   const
Gets the year.
Returns
year of this object