Public Member Functions | List of all members
AcDbSoftPointerId Class Reference
_ More...
#include <AcDbSoftPointerId.h>
 Public Member Functions
AcDbSoftPointerId (const AcDbObjectId &)
AcDbSoftPointerId (const AcDbStub *)
operator AcDbStub * () const
 bool  | operator!= (const AcDbObjectId &) const
 bool  | operator!= (const AcDbStub *) const
 AcDbSoftPointerId &  | operator= (const AcDbObjectId &)
 AcDbSoftPointerId &  | operator= (const AcDbSoftPointerId &)
 AcDbSoftPointerId &  | operator= (const AcDbStub *)
 bool  | operator== (const AcDbObjectId &) const
 bool  | operator== (const AcDbStub *) const
 Public Member Functions inherited from AcDbObjectId
AcDbObjectId (const AcDbStub *)
 LONG_PTR  | asOldId () const
bool  | convertToRedirectedId ()
If this ObjectId has been redirected from another database, then the function will set this ObjectId to that ObjectId value actually used in that other database. More...
AcDbDatabase *  | database () const
Returns the database this object is resident in. More...
AcDbHandle  | handle () const
Returns the handle associated with this object ID. More...
bool  | isEffectivelyErased () const
Returns true if the object associated with this object ID is erased. More...
bool  | isErased () const
Returns true if the object associated with this object ID is erased. More...
 bool  | isNull () const
bool  | isResident () const
Returns whether this ObjectId is actually memory-resident or not ("left on disk" then). More...
bool  | isValid () const
bool  | isWellBehaved () const
Verifies whether the object id "behaves well". More...
AcDbHandle  | nonForwardedHandle () const
If this ObjectId is an object inside a XRef database, then this function returns the handle of this object as used inside the XRef. More...
AcRxClass *  | objectClass () const
Returns the object class descriptor for the AcDbObject assigned to this AcDbObjectId. More...
bool  | objectLeftOnDisk () const
Returns whether this ObjectId is actually non-memory-resident ("left on disk"). More...
operator AcDbStub * () const
 bool  | operator!= (const AcDbObjectId &) const
 bool  | operator!= (const AcDbStub *) const
 bool  | operator< (const AcDbObjectId &) const
 bool  | operator< (const AcDbStub *) const
 bool  | operator<= (const AcDbObjectId &) const
 bool  | operator<= (const AcDbStub *) const
 AcDbObjectId &  | operator= (const AcDbObjectId &)
 AcDbObjectId &  | operator= (const AcDbStub *)
 bool  | operator== (const AcDbObjectId &) const
 bool  | operator== (const AcDbStub *) const
 bool  | operator> (const AcDbObjectId &) const
 bool  | operator> (const AcDbStub *) const
 bool  | operator>= (const AcDbObjectId &) const
 bool  | operator>= (const AcDbStub *) const
AcDbDatabase *  | originalDatabase () const
Gets the original database with which the object having this id is associated. More...
 AcDbObjectId &  | setFromOldId (LONG_PTR)
 void  | setNull ()
 Additional Inherited Members
 Static Public Attributes inherited from AcDbObjectId
 static const AcDbObjectId  | kNull
 Protected Attributes inherited from AcDbObjectId
 AcDbStub *  | mId
Detailed Description
_