Public Member Functions | Public Attributes | List of all members
AcDbGroup Class Reference
_ More...
#include <AcDbGroup.h>
 Public Member Functions
AcDbGroup (const ACHAR *, bool=true)
Adesk::UInt32  | allEntityIds (AcDbObjectIdArray &) const
Fills an array with the object id's of the group members. More...
Acad::ErrorStatus  | append (AcDbObjectId)
Appends the object to the group. More...
Acad::ErrorStatus  | append (AcDbObjectIdArray)
Appends an object array to the group. More...
virtual Acad::ErrorStatus  | applyPartialUndo (AcDbDwgFiler *, AcRxClass *)
Acad::ErrorStatus  | clear ()
Removes all objects from the group, leaving group properties unmodified. More...
const ACHAR *  | description () const
Gets the description string. More...
virtual Acad::ErrorStatus  | dwgInFields (AcDbDwgFiler *)
virtual Acad::ErrorStatus  | dwgOutFields (AcDbDwgFiler *) const
virtual Acad::ErrorStatus  | dxfInFields (AcDbDxfFiler *)
virtual Acad::ErrorStatus  | dxfOutFields (AcDbDxfFiler *) const
virtual void  | erased (const AcDbObject *, Adesk::Boolean)
Acad::ErrorStatus  | getIndex (AcDbObjectId, Adesk::UInt32 &) const
Acad::ErrorStatus  | getName (ACHAR *&) const
Gets the group name. More...
virtual void  | goodbye (const AcDbObject *)
bool  | has (const AcDbEntity *) const
Returns the apartenence of an entity to the group. More...
Acad::ErrorStatus  | insertAt (Adesk::UInt32, AcDbObjectId)
Inserts into the group the specified object id at the index location. More...
 Acad::ErrorStatus  | insertAt (Adesk::UInt32, AcDbObjectIdArray)
bool  | isAnonymous () const
Determines, whether this group is an anonymous group. More...
bool  | isNotAccessible () const
Determines, whether this group is an inaccessible group. More...
bool  | isSelectable () const
Returns the group selectability as a whole. More...
const ACHAR *  | name () const
Gets the group name. More...
AcDbGroupIterator *  | newIterator ()
Allows iteration through the entities in the group. More...
Adesk::UInt32  | numEntities () const
Gets the count of the entities in the group. More...
Acad::ErrorStatus  | prepend (AcDbObjectId)
Adds the specified entity to the group, as first entry (prepend). More...
Acad::ErrorStatus  | prepend (AcDbObjectIdArray)
Adds the specified entities to the group, as first entries (prepend). More...
Acad::ErrorStatus  | remove (AcDbObjectId)
Removes object from the group. More...
Acad::ErrorStatus  | remove (AcDbObjectIdArray)
Removes the specified entities from this group. More...
 Acad::ErrorStatus  | removeAt (Adesk::UInt32)
 Acad::ErrorStatus  | removeAt (Adesk::UInt32, AcDbObjectIdArray)
Acad::ErrorStatus  | replace (AcDbObjectId, AcDbObjectId)
Replace an entity in this group with a new entity. More...
Acad::ErrorStatus  | reverse ()
Reverts the order of entities inside the group. More...
Acad::ErrorStatus  | setAnonymous ()
Sets this group to be an anonymous group. More...
Acad::ErrorStatus  | setColor (const AcCmColor &)
Sets the color for all entities in the group. More...
Acad::ErrorStatus  | setColorIndex (Adesk::UInt16)
Sets the color for all entities in the group. More...
Acad::ErrorStatus  | setDescription (const ACHAR *)
Sets the description string. More...
Acad::ErrorStatus  | setHighlight (bool)
Highlights or unhighlights all entities of this group. More...
Acad::ErrorStatus  | setLayer (AcDbObjectId)
Sets the layer for all entities in the group. More...
Acad::ErrorStatus  | setLayer (const ACHAR *)
Sets the layer for all entities in the group. More...
Acad::ErrorStatus  | setLinetype (AcDbObjectId)
Sets the linetype for all entities in the group. More...
Acad::ErrorStatus  | setLinetype (const ACHAR *)
Sets the linetype for all entities in the group. More...
Acad::ErrorStatus  | setLinetypeScale (double)
Sets the linetype scale for all entities in the group. More...
Acad::ErrorStatus  | setMaterial (AcDbObjectId)
Sets the material for all entities in the group. More...
Acad::ErrorStatus  | setMaterial (const ACHAR *)
Sets the material for all entities in the group. More...
Acad::ErrorStatus  | setName (const ACHAR *)
Sets the group name. More...
Acad::ErrorStatus  | setSelectable (bool)
Sets the group selectable status. More...
Acad::ErrorStatus  | setVisibility (AcDb::Visibility)
Sets the visibility for all entities in the group. More...
virtual Acad::ErrorStatus  | subClose ()
virtual Acad::ErrorStatus  | subErase (Adesk::Boolean=Adesk::kTrue)
Acad::ErrorStatus  | transfer (Adesk::UInt32, Adesk::UInt32, Adesk::UInt32)
Adds the specified entity to the group, as first entry (prepend). More...
 Public Member Functions inherited from AcDbObject
virtual Acad::ErrorStatus  | addPersistentReactor (AcDbObjectId)
Adds a persistent reactor to this object reactor list. More...
Acad::ErrorStatus  | addReactor (AcDbObjectReactor *) const
Adds a transient reactor to this object. More...
virtual Acad::ErrorStatus  | applyPartialUndo (AcDbDwgFiler *, AcRxClass *)
This function is called during Undo operations on objects, that use the 'Partial Undo meachanism'; this is, this object is opened with assertWriteEnabled(Adesk::kFalse) to indicate that custom Undo filing is used rather than the default Undo filing. More...
 void  | assertNotifyEnabled () const
 void  | assertReadEnabled () const
 void  | assertWriteEnabled (Adesk::Boolean=Adesk::kTrue, Adesk::Boolean=Adesk::kTrue)
virtual Acad::ErrorStatus  | audit (AcDbAuditInfo *)
Performs the audit operation for this object. More...
Acad::ErrorStatus  | cancel ()
Reverts all changes since the object had been opened and closes the object. More...
virtual void  | cancelled (const AcDbObject *)
A handler function for persistent reactors. More...
virtual AcRxObject *  | clone () const
Creates a shallow clone of this object. More...
Acad::ErrorStatus  | close ()
Closes the object. More...
Acad::ErrorStatus  | closeAndPage (Adesk::Boolean=Adesk::kTrue)
Closes the object. More...
virtual Acad::ErrorStatus  | composeForLoad (AcDb::OdaSaveType, AcDb::AcDbDwgVersion)
This function is intended for future MT file loading support. More...
virtual void  | copied (const AcDbObject *, const AcDbObject *)
A handler function for persistent reactors. More...
virtual Acad::ErrorStatus  | copyFrom (const AcRxObject *)
Copies the pSrc object information in this object. More...
Acad::ErrorStatus  | createExtensionDictionary ()
Creates a dictionary as extension dictionary for this object. More...
AcDbDatabase *  | database () const
Returns the database that contains this object. More...
virtual Acad::ErrorStatus  | decomposeForSave (AcDb::AcDbDwgVersion, AcDbObject *&, AcDbObjectId &, Adesk::Boolean &)
This function is called during dwg and dxf output, to allow a custom object to decompose itself, due to provided dwg/dxf target file version. More...
virtual Acad::ErrorStatus  | deepClone (AcDbObject *, AcDbObject *&, AcDbIdMapping &, Adesk::Boolean=Adesk::kTrue) const final
Clones this object, appends it to the owner pOwner and adds an AcDbIdPair record to the idMap. More...
void  | disableUndoRecording (Adesk::Boolean)
Disables or enables the undo recording for the object. More...
Acad::ErrorStatus  | downgradeOpen ()
Sets the open mode for an object opened for write to be opened for read. More...
Acad::ErrorStatus  | downgradeToNotify (Adesk::Boolean)
Sets the open mode for an object opened for write to be opened for notify. More...
virtual AcGiDrawable *  | drawable ()
Retrieves the AcGiDrawable instance of this object. More...
Acad::ErrorStatus  | dwgIn (AcDbDwgFiler *)
Calls the object's dwgInFields function, and reads any XData if present. More...
virtual Acad::ErrorStatus  | dwgInFields (AcDbDwgFiler *)
Reads the object from the DWG filer. More...
Acad::ErrorStatus  | dwgOut (AcDbDwgFiler *) const
Calls the object's dwgOutFields function, and writes any XData if present. More...
virtual Acad::ErrorStatus  | dwgOutFields (AcDbDwgFiler *) const
Writes the object to the DWG filer. More...
Acad::ErrorStatus  | dxfIn (AcDbDxfFiler *)
Calls the object's dxfInFields function, and reads any XData if present. More...
virtual Acad::ErrorStatus  | dxfInFields (AcDbDxfFiler *)
Reads the object from the DXF filer. More...
Acad::ErrorStatus  | dxfOut (AcDbDxfFiler *, Adesk::Boolean, Adesk::uchar *) const
Calls the object's dxfOutFields function, and writes any XData if present. More...
virtual Acad::ErrorStatus  | dxfOutFields (AcDbDxfFiler *) const
Writes the object to the DXF filer. More...
Acad::ErrorStatus  | erase (Adesk::Boolean=Adesk::kTrue)
Sets the bit that indicates that the object is erased. More...
virtual void  | erased (const AcDbObject *, Adesk::Boolean)
A handler function for persistent reactors. More...
AcDbObjectId  | extensionDictionary () const
Returns the object id of the extension dictionary for this object. More...
void  | getAcDbHandle (AcDbHandle &) const
Returns handle of this object. More...
Acad::ErrorStatus  | getBinaryData (const ACHAR *, Adesk::Int32 &, char *&) const
Creates a copy of the binary data stored as chunks of maximum 127 bytes in the resbuf chain of this object's extension dictionary xrecord entry given by entryName. More...
int  | getBrxOpenCount () const
This function returns the number of open BRX instances for this object. More...
int  | getBrxOpenState () const
This function returns the BRX object open state flags as bitfields, for diagnostic purpose. More...
virtual Acad::ErrorStatus  | getClassID (CLSID *) const final
Gets the COM wrapper Class ID for this entity. More...
int  | getCustomObjectState () const
This function returns the custom object status : 1=isCustomObject 2=DifferentialUndoDisabled. More...
Acad::ErrorStatus  | getField (const ACHAR *, AcDbField *&, AcDb::OpenMode) const
Retrieves the specified Field from this object, and opens it in mode. More...
Acad::ErrorStatus  | getField (const ACHAR *, AcDbObjectId &) const
Gets the pszPropName field object from field dictionary of this AcDbObject object, using pszPropName as key. More...
AcDbObjectId  | getFieldDictionary () const
Returns the Field dictionary associated with this object,. More...
Acad::ErrorStatus  | getFieldDictionary (AcDbDictionary *&, AcDb::OpenMode) const
Gets and opens the field dictionary for this. More...
Acad::ErrorStatus  | getObjectBirthVersion (AcDb::AcDbDwgVersion &, AcDb::MaintenanceReleaseVersion &)
This function is currently not supported by the CAD engine, always returns Acad::eOk, and 'kDHL_CURRENT' + 'kMReleaseCurrent' results. More...
virtual Acad::ErrorStatus  | getObjectSaveVersion (const AcDbDwgFiler *, AcDb::AcDbDwgVersion &, AcDb::MaintenanceReleaseVersion &)
Returns the DWG version for saving the object. More...
virtual Acad::ErrorStatus  | getObjectSaveVersion (const AcDbDxfFiler *, AcDb::AcDbDwgVersion &, AcDb::MaintenanceReleaseVersion &)
Returns the DWG version for saving the object. More...
int  | getOdaOpenCount () const
This function returns the number of open ODA instances for this object. More...
int  | getOdaOpenState () const
This function returns the ODA object open state flags as bitfields, for diagnostic purpose. More...
virtual void  | goodbye (const AcDbObject *)
A handler function for persistent reactors. More...
Acad::ErrorStatus  | handOverTo (AcDbObject *, Adesk::Boolean=Adesk::kTrue, Adesk::Boolean=Adesk::kTrue)
Hands over objects identity to another object. More...
bool  | hasFields () const
Return true if this object has single or multiple fields associated with him. More...
bool  | hasPersistentReactor (AcDbObjectId) const
Checks the input objectId in this object reactor list. More...
bool  | hasSaveVersionOverride ()
This function indicates whether this object overrides the filer's save version. More...
virtual AcDbObjectId  | id () const
Returns the database id of this object. More...
Adesk::Boolean  | isAcDbObjectIdsInFlux () const
Checks whether a deep clone operation was completed. More...
Adesk::Boolean  | isAProxy () const
Adesk::Boolean  | isCancelling () const
Adesk::Boolean  | isErased () const
Returns whether this object is erased. More...
Adesk::Boolean  | isEraseStatusToggled () const
Checks whether the object erase status has been toggled. More...
Adesk::Boolean  | isModified () const
Returns whether this object's assertWriteEnabled() has been called since it was opened. More...
Adesk::Boolean  | isModifiedGraphics () const
Checks whether this object graphics will be updated when the object is closed. More...
Adesk::Boolean  | isModifiedXData () const
Checks whether this object's xData was modified. More...
Adesk::Boolean  | isNewObject () const
Returns true if and only if this object has not been closed since it was created. More...
Adesk::Boolean  | isNotifyEnabled () const
Returns whether this object is opened for notify. More...
Adesk::Boolean  | isNotifying () const
virtual Adesk::Boolean  | isPersistent () const
Returns the 'persistent' status of a database object. More...
Adesk::Boolean  | isReadEnabled () const
Returns whether this object is opened for read. More...
 Adesk::Boolean  | isReallyClosing () const
Checks whether the next close call will completely close this object return true if on the next call the object will be completely closed false otherwise.
Adesk::Boolean  | isTransactionResident () const
Gets the object transaction status. More...
Adesk::Boolean  | isUndoing () const
bool  | isUndoRecordingDisabled () const
Returns whether the undo recording for the object is enabled or not. More...
Adesk::Boolean  | isWriteEnabled () const
Returns whether this object is opened for write. More...
virtual AcDb::DuplicateRecordCloning  | mergeStyle () const
Returns the object's merge behavior during cloning. More...
virtual void  | modified (const AcDbObject *)
A handler function for persistent reactors. More...
virtual void  | modifiedGraphics (const AcDbEntity *)
A handler function for persistent reactors. More...
virtual void  | modifiedXData (const AcDbObject *)
A handler function for persistent reactors. More...
virtual void  | modifyUndone (const AcDbObject *)
A handler function for persistent reactors. More...
virtual void  | objectClosed (const AcDbObjectId)
A handler function for persistent reactors. More...
AcDbObjectId  | objectId () const
Returns object id. More...
virtual void  | openedForModify (const AcDbObject *)
A handler function for persistent reactors. More...
AcDbObjectId  | ownerId () const
Returns object id of the owner. More...
AcDbVoidPtrArray *  | reactors ()
Gets the object pointers to reactors. More...
const AcDbVoidPtrArray *  | reactors () const
Gets the object pointers to reactors. More...
virtual void  | reappended (const AcDbObject *)
A handler function for persistent reactors. More...
 virtual void  | recvPropagateModify (const AcDbObject *)
Not implemented yet.
Acad::ErrorStatus  | releaseExtensionDictionary ()
Removes the extension dictionary associated with this object. More...
virtual Acad::ErrorStatus  | removeField (AcDbObjectId)
Removes the Field specified by acFieldId from this object. More...
virtual Acad::ErrorStatus  | removeField (const ACHAR *)
Removes the Field specified by szKeyString from this object. More...
virtual Acad::ErrorStatus  | removeField (const ACHAR *, AcDbObjectId &)
Removes the Field specified by acPszKeyString from this object, and returns its ObjectId value. More...
virtual Acad::ErrorStatus  | removePersistentReactor (AcDbObjectId)
Removes a persistent reactor from this object reactor list. More...
Acad::ErrorStatus  | removeReactor (AcDbObjectReactor *) const
Removes a transient reactor to this object. More...
void  | setAcDbObjectIdsInFlux ()
Call this function to indicate that the object IDs of this object and its sub-objects (if any) are not yet valid. More...
Acad::ErrorStatus  | setBinaryData (const ACHAR *, Adesk::Int32, const char *)
Creates a copy of the binary data, divides it in up to 127 bytes binary chunks and
 sets them as resbufs in the resbuf chain of this object's extension dictionary xrecord entry given by entryName. More...
virtual Acad::ErrorStatus  | setField (const ACHAR *, AcDbField *, AcDbObjectId &)
Adds the pAcField field object to field dictionary of this AcDbObject object, using pKey as key. More...
void  | setHasSaveVersionOverride (bool)
This function can be called to specify that the object has a "save version override". More...
virtual Acad::ErrorStatus  | setOwnerId (AcDbObjectId)
Sets the ownerId data member of the object to be objId. More...
virtual Acad::ErrorStatus  | setXData (const resbuf *)
Sets/removes xData associated with this object. More...
virtual Acad::ErrorStatus  | subCancel ()
Possibility to veto a cancel operation from within custom entities. More...
virtual Acad::ErrorStatus  | subClose ()
virtual Acad::ErrorStatus  | subErase (Adesk::Boolean)
This hook is called during an AcDbObject::erase call, before any actual erase operation is performed. More...
 virtual Acad::ErrorStatus  | subHandOverTo (AcDbObject *)
virtual void  | subObjModified (const AcDbObject *, const AcDbObject *)
A handler function for persistent reactors. More...
 virtual Acad::ErrorStatus  | subOpen (AcDb::OpenMode)
virtual Acad::ErrorStatus  | subSwapIdWith (AcDbObjectId, Adesk::Boolean=Adesk::kFalse, Adesk::Boolean=Adesk::kFalse)
This hook is called during an AcDbObject::swapIdWith() call, before any actual swap operation is performed. More...
Acad::ErrorStatus  | swapIdWith (AcDbObjectId, Adesk::Boolean=Adesk::kFalse, Adesk::Boolean=Adesk::kFalse)
Swaps the object id's between the object identified by param swapId and this object. More...
virtual Acad::ErrorStatus  | swapReferences (const AcDbIdMapping &)
Not implemented yet. More...
virtual void  | unappended (const AcDbObject *)
A handler function for persistent reactors. More...
AcDbDwgFiler *  | undoFiler ()
Gets the undo filer for this object. More...
Acad::ErrorStatus  | upgradeFromNotify (Adesk::Boolean &)
Upgrades the open status of this object to AcDb::kForWrite, if this object is already open (either in AcDb::kForRead, AcDb::kForNotify or AcDb::kForWrite) More...
Acad::ErrorStatus  | upgradeOpen ()
Changes the objects open mode to AcDb::kForWrite and sends notifications. More...
virtual Acad::ErrorStatus  | wblockClone (AcRxObject *, AcDbObject *&, AcDbIdMapping &, Adesk::Boolean=Adesk::kTrue) const final
Clones this object, appends it to the owner pOwner and adds an AcDbIdPair record to the idMap. More...
virtual resbuf *  | xData (const ACHAR *=NULL) const
Returns the xData associated with this object. More...
Acad::ErrorStatus  | xDataTransformBy (const AcGeMatrix3d &)
Transforms the extended data according to parameter transformation matrix. More...
 virtual void  | xmitPropagateModify () const
Not implemented yet.
 virtual  | ~AcDbObject ()
Destructor.
 Public Member Functions inherited from AcGiDrawable
virtual bool  | bounds (AcDbExtents &) const
virtual DrawableType  | drawableType () const
 virtual AcGiDrawStream *  | drawStream () const
 AcGsNode *  | gsNode () const
virtual AcDbObjectId  | id () const =0
virtual Adesk::Boolean  | isPersistent () const =0
virtual Adesk::UInt32  | regenSupportFlags () const final
Returns whether and to which level this object supports MultiThreading. More...
 virtual Adesk::Boolean  | RolloverHit (Adesk::ULongPtr, Adesk::ULongPtr, Adesk::Boolean)
 virtual Adesk::UInt32  | setAttributes (AcGiDrawableTraits *) final
 virtual void  | setDrawStream (AcGiDrawStream *)
 void  | setGsNode (AcGsNode *)
 virtual void  | viewportDraw (AcGiViewportDraw *) final
 virtual Adesk::UInt32  | viewportDrawLogicalFlags (AcGiViewportDraw *) final
 virtual Adesk::Boolean  | worldDraw (AcGiWorldDraw *) final
 Public Member Functions inherited from AcRxObject
virtual AcRxObject *  | clone () const
Exported and implemented. More...
 virtual AcRx::Ordering  | comparedTo (const AcRxObject *) const
Exported and implemented.
virtual Acad::ErrorStatus  | copyFrom (const AcRxObject *)
Exported and implemented. More...
 virtual AcRxClass *  | isA () const
Exported and implemented.
virtual Adesk::Boolean  | isEqualTo (const AcRxObject *) const
Exported and implemented. More...
bool  | isKindOf (const AcRxClass *) const
Checks the object class. More...
AcRxObject *  | queryX (const AcRxClass *) const
returns the protocol extension object assigned to this class or a parent class. More...
AcRxObject *  | x (const AcRxClass *) const
returns the protocol extension object assigned to this class or a parent class. More...
 virtual  | ~AcRxObject ()
Destructor.
 Public Attributes
AcDbGroup
Default constructor. More...
 Additional Inherited Members
 Public Types inherited from AcGiDrawable
enum  | DrawableType {
 kGeometry = 0 , kDistantLight , kPointLight , kSpotLight ,
 kAmbientLight , kSolidBackground , kGradientBackground , kImageBackground ,
 kGroundPlaneBackground , kViewport
 }
enum  | SetAttributesFlags {
 kDrawableNone = 0 , kDrawableIsAnEntity = 1 , kDrawableUsesNesting = 2 , kDrawableIsCompoundObject = 4 ,
 kDrawableViewIndependentViewportDraw = 8 , kDrawableIsInvisible = 16 , kDrawableHasAttributes = 32 , kDrawableRegenTypeDependentGeometry = 64 ,
 kDrawableIsDimension = 133 , kDrawableRegenDraw = 256 , kDrawableStandardDisplaySingleLOD = 512 , kDrawableShadedDisplaySingleLOD = 1024 ,
 kDrawableViewDependentViewportDraw = 2048 , kDrawableBlockDependentViewportDraw = 4096 , kDrawableIsExternalReference = 8192 , kDrawableNotPlottable = 16384 ,
 kDrawableNotAllowLCS = 32768 , kDrawableMergeControlOff = 65536 , kThreadedWorldDrawViewportDraw = 131072
 }
 Static Public Member Functions inherited from AcRxObject
 static AcRxObject *  | cast (const AcRxObject *)
 static AcRxClass *  | desc ()
Exported and implemented.
 Static Public Member Functions inherited from AcHeapOperators
 static void  | operator delete (void *)
_
 static void  | operator delete (void *, const char *, int)
 static void  | operator delete (void *, void *)
 static void  | operator delete[] (void *)
_
 static void  | operator delete[] (void *, const char *, int)
 static void *  | operator new (size_t)
_
 static void *  | operator new (size_t, const char *, int)
 static void *  | operator new (size_t, void *p)
 static void *  | operator new[] (size_t)
_
 static void *  | operator new[] (size_t, const char *, int)
 Protected Member Functions inherited from AcDbObject
virtual Acad::ErrorStatus  | subDeepClone (AcDbObject *, AcDbObject *&, AcDbIdMapping &, Adesk::Boolean=true) const
virtual Acad::ErrorStatus  | subGetClassID (CLSID *) const
virtual Adesk::UInt32  | subSetAttributes (AcGiDrawableTraits *)
Sets the values of this object's subentity traits and returns with the calling object's subentity traits. More...
virtual void  | subViewportDraw (AcGiViewportDraw *)
virtual Adesk::UInt32  | subViewportDrawLogicalFlags (AcGiViewportDraw *)
virtual Acad::ErrorStatus  | subWblockClone (AcRxObject *, AcDbObject *&, AcDbIdMapping &, Adesk::Boolean=true) const
virtual Adesk::Boolean  | subWorldDraw (AcGiWorldDraw *)
 Protected Member Functions inherited from AcGiDrawable
virtual Adesk::UInt32  | subRegenSupportFlags () const
Returns whether and to which level this object supports MultiThreading. More...
virtual Adesk::UInt32  | subSetAttributes (AcGiDrawableTraits *)=0
virtual void  | subViewportDraw (AcGiViewportDraw *)=0
 virtual Adesk::UInt32  | subViewportDrawLogicalFlags (AcGiViewportDraw *)
virtual Adesk::Boolean  | subWorldDraw (AcGiWorldDraw *)=0
 Protected Member Functions inherited from AcRxObject
AcRxObject ()
Exported and implemented.
Detailed Description
_
Member Function Documentation
◆ allEntityIds()
 UX_EXPORT_FUNCTION Adesk::UInt32 AcDbGroup::allEntityIds  |  ( |  AcDbObjectIdArray &  |  entityIdArray | ) |   const
Fills an array with the object id's of the group members.
Parameters
[in] | entityIdArray | array to be filled
Returns
the number of the entities belonging to the group
◆ append() [1/2]
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbGroup::append  |  ( |  AcDbObjectId  |  objectId | )
Appends the object to the group.
Parameters
[in] | objectId | object id
Returns
Acad::eOk if successful Acad::eAlreadyInGroup if the object is appended again Acad::eNotAnEntity if the object is not an entity Acad::eNullObjectId if the id is not valid
◆ append() [2/2]
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbGroup::append  |  ( |  AcDbObjectIdArray  |  idArray | )
Appends an object array to the group.
Parameters
[in] | object | id array
Returns
Acad::eOk if successful Acad::eAlreadyInGroup if an object is appended again Acad::eNotAnEntity if an object is not an entity Acad::eNullObjectId if an object id is not valid
◆ applyPartialUndo()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbGroup::applyPartialUndo  |  ( |  AcDbDwgFiler *  |  container,
|  AcRxClass *  |  pObject
)
virtual
See also
AcDbObject::applyPartialUndo(AcDbDwgFiler*, AcRxClass*)
Reimplemented from AcDbObject.
◆ clear()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbGroup::clear  |  ( |   | )
Removes all objects from the group, leaving group properties unmodified.
Returns
Acad::eOk if successful Error code otherwise
◆ description()
 UX_EXPORT_FUNCTION const ACHAR * AcDbGroup::description  |  ( |   | ) |   const
Gets the description string.
Returns
description string
◆ dwgInFields()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbGroup::dwgInFields  |  ( |  AcDbDwgFiler *  |  dwgFiler | )
virtual
See also
AcDbObject::dwgInFields(AcDbDwgFiler*)
Reimplemented from AcDbObject.
◆ dwgOutFields()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbGroup::dwgOutFields  |  ( |  AcDbDwgFiler *  |  dwgFiler | ) |   const
virtual
See also
AcDbObject::dwgOutFields(AcDbDwgFiler*)
Reimplemented from AcDbObject.
◆ dxfInFields()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbGroup::dxfInFields  |  ( |  AcDbDxfFiler *  |  dxfFiler | )
virtual
See also
AcDbObject::dxfInFields(AcDbDxfFiler*)
Reimplemented from AcDbObject.
◆ dxfOutFields()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbGroup::dxfOutFields  |  ( |  AcDbDxfFiler *  |  dxfFiler | ) |   const
virtual
See also
AcDbObject::dxfOutFields(AcDbDxfFiler*)
Reimplemented from AcDbObject.
◆ erased()
 UX_EXPORT_FUNCTION void AcDbGroup::erased  |  ( |  const AcDbObject *  |  erasedObj,
|  Adesk::Boolean  |  bIsErased
)
virtual
See also
AcDbObject::erased(const AcDbObject*, Adesk::Boolean)
Date
2008-12-06 lucd implemented
Reimplemented from AcDbObject.
◆ getIndex()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbGroup::getIndex  |  ( |  AcDbObjectId  |  objectId,
|  Adesk::UInt32 &  |  idx
) |   |  const
Parameters
[in] | objectId | ID of the object to get the index for
[out] | idx | index of given object
Returns
Acad::eOk if successful
◆ getName()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbGroup::getName  |  ( |  ACHAR *&  |  groupName | ) |   const
Gets the group name.
Parameters
[in] | groupName | pointer to the group name to be freed by the calling routine
Returns
Acad::eOk if successful Error code otherwise
◆ goodbye()
 UX_EXPORT_FUNCTION void AcDbGroup::goodbye  |  ( |  const AcDbObject *  |  pObj | )
virtual
See also
AcDbObject::goodbye(const AcDbObject*)
Reimplemented from AcDbObject.
◆ has()
 UX_EXPORT_FUNCTION bool AcDbGroup::has  |  ( |  const AcDbEntity *  |  pEntLookUp | ) |   const
Returns the apartenence of an entity to the group.
Parameters
[in] | pEntLookUp | pointer to the entity
Returns
true if the entity belongs to the group
false if the entity does not belong to the group
◆ insertAt()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbGroup::insertAt  |  ( |  Adesk::UInt32  |  index,
|  AcDbObjectId  |  objectId
)
Inserts into the group the specified object id at the index location.
Parameters
[in] | index | the position in the group where the object id should be inserted.
[in] | objectid | the id of the object which will be inserted.
Returns
Acad::eOk if successful Acad::eInvalidIndex if an invalid index is passed in Acad::eNullObjectId if a null id is passed in Acad::eAlreadyInGroup if the id passed in is already a member of the group
◆ isAnonymous()
 UX_EXPORT_FUNCTION bool AcDbGroup::isAnonymous  |  ( |   | ) |   const
Determines, whether this group is an anonymous group.
Returns
true, if this group is an anonymous group
◆ isNotAccessible()
 UX_EXPORT_FUNCTION bool AcDbGroup::isNotAccessible  |  ( |   | ) |   const
Determines, whether this group is an inaccessible group.
Returns
true, if this group is an inaccessible group
Remarks
Groups are always accessible in Bricscad, so this function always returns false.
◆ isSelectable()
 UX_EXPORT_FUNCTION bool AcDbGroup::isSelectable  |  ( |   | ) |   const
Returns the group selectability as a whole.
Parameters
[in] | new | name
Returns
true if the group is selectable as a whole
false if the individual entities composing the group will be selected
◆ name()
 UX_EXPORT_FUNCTION const ACHAR * AcDbGroup::name  |  ( |   | ) |   const
Gets the group name.
Returns
group name
◆ newIterator()
 UX_EXPORT_FUNCTION AcDbGroupIterator * AcDbGroup::newIterator  |  ( |   | )
Allows iteration through the entities in the group.
Returns
pointer to AcDbGroupIterator
◆ numEntities()
 UX_EXPORT_FUNCTION Adesk::UInt32 AcDbGroup::numEntities  |  ( |   | ) |   const
Gets the count of the entities in the group.
Returns
count
◆ prepend() [1/2]
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbGroup::prepend  |  ( |  AcDbObjectId  |  id | )
Adds the specified entity to the group, as first entry (prepend).
Parameters
[in] | id | - ObjectId of the entity to prepend
Returns
Acad::eOk, or error status
◆ prepend() [2/2]
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbGroup::prepend  |  ( |  AcDbObjectIdArray  |  ids | )
Adds the specified entities to the group, as first entries (prepend).
Parameters
[in] | id | - ObjectId of the entity to prepend
Returns
Acad::eOk, or error status
◆ remove() [1/2]
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbGroup::remove  |  ( |  AcDbObjectId  |  objectId | )
Removes object from the group.
Parameters
[in] | objectId | ID of the object to be removed
Returns
Acad::eOk if successful
Error code otherwise
◆ remove() [2/2]
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbGroup::remove  |  ( |  AcDbObjectIdArray  |  entArray | )
Removes the specified entities from this group.
Parameters
[in] | entArray | - the entity set to be removed
Returns
Acad::eOk if successful, error code otherwise
◆ replace()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbGroup::replace  |  ( |  AcDbObjectId  |  idOld,
|  AcDbObjectId  |  IdNew
)
Replace an entity in this group with a new entity.
Parameters
[in | idOld object id to replace
[in] | IdNew | object id to replace with
Returns
Acad::eOk if successful Acad::eNotInGroup if idOld is not member of the group Acad::eAlreadyInGroup if IdNew is already member of the group Acad::eNotAnEntity if IdNew is not an entity
◆ reverse()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbGroup::reverse  |  ( |   | )
Reverts the order of entities inside the group.
Returns
Acad::eOk if successful
◆ setAnonymous()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbGroup::setAnonymous  |  ( |   | )
Sets this group to be an anonymous group.
Returns
Acad::eOk if successful, error status otherwise
Remarks
the new name of the group is automatically created by this function
◆ setColor()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbGroup::setColor  |  ( |  const AcCmColor &  |  color | )
Sets the color for all entities in the group.
Parameters
[in] | color | the new color to set
Returns
Acad::eOk if successful, error status otherwise
◆ setColorIndex()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbGroup::setColorIndex  |  ( |  Adesk::UInt16  |  color | )
Sets the color for all entities in the group.
Parameters
[in] | color | the new color to set
Returns
Acad::eOk if successful, error status otherwise
◆ setDescription()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbGroup::setDescription  |  ( |  const ACHAR *  |  description | )
Sets the description string.
Returns
Acad::eOk if successful
◆ setHighlight()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbGroup::setHighlight  |  ( |  bool  |  highlight | )
Highlights or unhighlights all entities of this group.
Returns
Acad::eOk if successful, error status otherwise
Parameters
[in] | highlight | true, to highlight all entities of the group, false to unhighlight
◆ setLayer() [1/2]
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbGroup::setLayer  |  ( |  AcDbObjectId  |  idLayer | )
Sets the layer for all entities in the group.
Parameters
[in] | idLayer | the new layer to set
Returns
Acad::eOk if successful, error status otherwise
◆ setLayer() [2/2]
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbGroup::setLayer  |  ( |  const ACHAR *  |  layer | )
Sets the layer for all entities in the group.
Parameters
[in] | layer | the new layer to set
Returns
Acad::eOk if successful, error status otherwise
◆ setLinetype() [1/2]
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbGroup::setLinetype  |  ( |  AcDbObjectId  |  idLinetype | )
Sets the linetype for all entities in the group.
Parameters
[in] | idLinetype | the new linetype to set
Returns
Acad::eOk if successful, error status otherwise
Remarks
the linetype must be already loaded to succeed
◆ setLinetype() [2/2]
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbGroup::setLinetype  |  ( |  const ACHAR *  |  linetype | )
Sets the linetype for all entities in the group.
Parameters
[in] | linetype | the new linetype to set
Returns
Acad::eOk if successful, error status otherwise
Remarks
the linetype must be already loaded to succeed
◆ setLinetypeScale()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbGroup::setLinetypeScale  |  ( |  double  |  scale | )
Sets the linetype scale for all entities in the group.
Parameters
[in] | scale | the new linetype scale to set
Returns
Acad::eOk if successful, error status otherwise
◆ setMaterial() [1/2]
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbGroup::setMaterial  |  ( |  AcDbObjectId  |  idMaterial | )
Sets the material for all entities in the group.
Parameters
[in] | idMaterial | the new material to set
Returns
Acad::eOk if successful, error status otherwise
◆ setMaterial() [2/2]
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbGroup::setMaterial  |  ( |  const ACHAR *  |  material | )
Sets the material for all entities in the group.
Parameters
[in] | material | the new material to set
Returns
Acad::eOk if successful, error status otherwise
◆ setName()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbGroup::setName  |  ( |  const ACHAR *  |  name | )
Sets the group name.
Parameters
[in] | name | group name
Returns
Acad::eOk if successful
◆ setSelectable()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbGroup::setSelectable  |  ( |  bool  |  status | )
Sets the group selectable status.
Parameters
[in] | status | if true the group objects are used as a whole , if false the group objects used are one by one
Returns
Acad::eOk if successful Error code otherwise
◆ setVisibility()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbGroup::setVisibility  |  ( |  AcDb::Visibility  |  visible | )
Sets the visibility for all entities in the group.
Parameters
[in] | visible | AcDb::kInvisible or AcDb::kVisible
Returns
Acad::eOk if successful, error status otherwise
◆ subClose()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbGroup::subClose  |  ( |   | )
virtual
See also
AcDbObject::subClose()
Reimplemented from AcDbObject.
◆ subErase()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbGroup::subErase  |  ( |  Adesk::Boolean  |  bErase = Adesk::kTrue | )
virtual
See also
AcDbObject::subErase(Adesk::Boolean bErase)
Reimplemented from AcDbObject.
◆ transfer()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbGroup::transfer  |  ( |  Adesk::UInt32  |  fromIdx,
|  Adesk::UInt32  |  toIdx,
|  Adesk::UInt32  |  numItems
)
Adds the specified entity to the group, as first entry (prepend).
Parameters
[in] | fromIdx | - index of first entry to move to 'toIdx'
[in] | toIdx | - index of first entry to move to
[in] | nmItems | - number of items to move inside the group
Returns
Acad::eOk, or error status
Member Data Documentation
◆ AcDbGroup
 UX_EXPORT_FUNCTION AcDbGroup::AcDbGroup
Default constructor.
Constructor.
Parameters
[in] | description | group description
[in] | selectStatus | selectable status input