Public Member Functions | Public Attributes | List of all members
AcDbSortentsTable Class Reference
_ More...
#include <AcDbSortentsTable.h>
 Public Member Functions
virtual Acad::ErrorStatus  | applyPartialUndo (AcDbDwgFiler *, AcRxClass *)
virtual Acad::ErrorStatus  | audit (AcDbAuditInfo *)
AcDbObjectId  | blockId () const
Returns the object id of the block table record associated with this sortents table. More...
virtual Acad::ErrorStatus  | dwgInFields (AcDbDwgFiler *)
virtual Acad::ErrorStatus  | dwgOutFields (AcDbDwgFiler *) const
virtual Acad::ErrorStatus  | dxfInFields (AcDbDxfFiler *)
virtual Acad::ErrorStatus  | dxfOutFields (AcDbDxfFiler *) const
Acad::ErrorStatus  | firstEntityIsDrawnBeforeSecond (AcDbObjectId, AcDbObjectId, bool &) const
Sets the bool value to true if the first entity is drawn before the second entity. More...
Acad::ErrorStatus  | getFullDrawOrder (AcDbObjectIdArray &, Adesk::UInt8=0) const
Gets the draw order used if the SORTENTS required bits are set. More...
Acad::ErrorStatus  | getRelativeDrawOrder (AcDbObjectIdArray &, Adesk::UInt8=0) const
Rearranges the specified entity ids into their current relative draw order for this sortents table order. More...
void  | getSortHandle (AcDbObjectId, AcDbHandle &) const
Gets the handle value that indicates the draw order based on the given object ID. More...
Acad::ErrorStatus  | moveAbove (const AcDbObjectIdArray &, AcDbObjectId)
Places all entities spceified by acIdArray above acId in the drawing list, keeping their relative draw order. More...
Acad::ErrorStatus  | moveBelow (const AcDbObjectIdArray &, AcDbObjectId)
Places all entities specified by acIdArray below acId in the drawing list, keeping their relative draw order. More...
Acad::ErrorStatus  | moveToBottom (const AcDbObjectIdArray &)
The entities contained in the array are placed to be the first ones in the draw order. More...
Acad::ErrorStatus  | moveToTop (const AcDbObjectIdArray &)
The entities contained in the array are placed to be the last ones in the draw order. More...
 Acad::ErrorStatus  | remove (AcDbObjectId)
Acad::ErrorStatus  | setBlockId (AcDbObjectId)
Sets the object id for the block table record associated with this sortents table. More...
Acad::ErrorStatus  | setRelativeDrawOrder (const AcDbObjectIdArray &)
Input the specified entity ids into their draw order for this sortents table order. More...
Adesk::Boolean  | sortAs (AcDbObjectId, AcDbHandle &) const
Gets the handle that indicates the draw order of the object with the target id. More...
Acad::ErrorStatus  | swapOrder (AcDbObjectId, AcDbObjectId)
In the same block table record swap id for two entity. More...
 virtual  | ~AcDbSortentsTable ()
Destructor.
 Public Member Functions inherited from AcDbObject
virtual Acad::ErrorStatus  | addPersistentReactor (AcDbObjectId)
Adds a persistent reactor to this object reactor list. More...
Acad::ErrorStatus  | addReactor (AcDbObjectReactor *) const
Adds a transient reactor to this object. More...
virtual Acad::ErrorStatus  | applyPartialUndo (AcDbDwgFiler *, AcRxClass *)
This function is called during Undo operations on objects, that use the 'Partial Undo meachanism'; this is, this object is opened with assertWriteEnabled(Adesk::kFalse) to indicate that custom Undo filing is used rather than the default Undo filing. More...
 void  | assertNotifyEnabled () const
 void  | assertReadEnabled () const
 void  | assertWriteEnabled (Adesk::Boolean=Adesk::kTrue, Adesk::Boolean=Adesk::kTrue)
virtual Acad::ErrorStatus  | audit (AcDbAuditInfo *)
Performs the audit operation for this object. More...
Acad::ErrorStatus  | cancel ()
Reverts all changes since the object had been opened and closes the object. More...
virtual void  | cancelled (const AcDbObject *)
A handler function for persistent reactors. More...
virtual AcRxObject *  | clone () const
Creates a shallow clone of this object. More...
Acad::ErrorStatus  | close ()
Closes the object. More...
Acad::ErrorStatus  | closeAndPage (Adesk::Boolean=Adesk::kTrue)
Closes the object. More...
virtual Acad::ErrorStatus  | composeForLoad (AcDb::OdaSaveType, AcDb::AcDbDwgVersion)
This function is intended for future MT file loading support. More...
virtual void  | copied (const AcDbObject *, const AcDbObject *)
A handler function for persistent reactors. More...
virtual Acad::ErrorStatus  | copyFrom (const AcRxObject *)
Copies the pSrc object information in this object. More...
Acad::ErrorStatus  | createExtensionDictionary ()
Creates a dictionary as extension dictionary for this object. More...
AcDbDatabase *  | database () const
Returns the database that contains this object. More...
virtual Acad::ErrorStatus  | decomposeForSave (AcDb::AcDbDwgVersion, AcDbObject *&, AcDbObjectId &, Adesk::Boolean &)
This function is called during dwg and dxf output, to allow a custom object to decompose itself, due to provided dwg/dxf target file version. More...
virtual Acad::ErrorStatus  | deepClone (AcDbObject *, AcDbObject *&, AcDbIdMapping &, Adesk::Boolean=Adesk::kTrue) const final
Clones this object, appends it to the owner pOwner and adds an AcDbIdPair record to the idMap. More...
void  | disableUndoRecording (Adesk::Boolean)
Disables or enables the undo recording for the object. More...
Acad::ErrorStatus  | downgradeOpen ()
Sets the open mode for an object opened for write to be opened for read. More...
Acad::ErrorStatus  | downgradeToNotify (Adesk::Boolean)
Sets the open mode for an object opened for write to be opened for notify. More...
virtual AcGiDrawable *  | drawable ()
Retrieves the AcGiDrawable instance of this object. More...
Acad::ErrorStatus  | dwgIn (AcDbDwgFiler *)
Calls the object's dwgInFields function, and reads any XData if present. More...
virtual Acad::ErrorStatus  | dwgInFields (AcDbDwgFiler *)
Reads the object from the DWG filer. More...
Acad::ErrorStatus  | dwgOut (AcDbDwgFiler *) const
Calls the object's dwgOutFields function, and writes any XData if present. More...
virtual Acad::ErrorStatus  | dwgOutFields (AcDbDwgFiler *) const
Writes the object to the DWG filer. More...
Acad::ErrorStatus  | dxfIn (AcDbDxfFiler *)
Calls the object's dxfInFields function, and reads any XData if present. More...
virtual Acad::ErrorStatus  | dxfInFields (AcDbDxfFiler *)
Reads the object from the DXF filer. More...
Acad::ErrorStatus  | dxfOut (AcDbDxfFiler *, Adesk::Boolean, Adesk::uchar *) const
Calls the object's dxfOutFields function, and writes any XData if present. More...
virtual Acad::ErrorStatus  | dxfOutFields (AcDbDxfFiler *) const
Writes the object to the DXF filer. More...
Acad::ErrorStatus  | erase (Adesk::Boolean=Adesk::kTrue)
Sets the bit that indicates that the object is erased. More...
virtual void  | erased (const AcDbObject *, Adesk::Boolean)
A handler function for persistent reactors. More...
AcDbObjectId  | extensionDictionary () const
Returns the object id of the extension dictionary for this object. More...
void  | getAcDbHandle (AcDbHandle &) const
Returns handle of this object. More...
Acad::ErrorStatus  | getBinaryData (const ACHAR *, Adesk::Int32 &, char *&) const
Creates a copy of the binary data stored as chunks of maximum 127 bytes in the resbuf chain of this object's extension dictionary xrecord entry given by entryName. More...
int  | getBrxOpenCount () const
This function returns the number of open BRX instances for this object. More...
int  | getBrxOpenState () const
This function returns the BRX object open state flags as bitfields, for diagnostic purpose. More...
virtual Acad::ErrorStatus  | getClassID (CLSID *) const final
Gets the COM wrapper Class ID for this entity. More...
int  | getCustomObjectState () const
This function returns the custom object status : 1=isCustomObject 2=DifferentialUndoDisabled. More...
Acad::ErrorStatus  | getField (const ACHAR *, AcDbField *&, AcDb::OpenMode) const
Retrieves the specified Field from this object, and opens it in mode. More...
Acad::ErrorStatus  | getField (const ACHAR *, AcDbObjectId &) const
Gets the pszPropName field object from field dictionary of this AcDbObject object, using pszPropName as key. More...
AcDbObjectId  | getFieldDictionary () const
Returns the Field dictionary associated with this object,. More...
Acad::ErrorStatus  | getFieldDictionary (AcDbDictionary *&, AcDb::OpenMode) const
Gets and opens the field dictionary for this. More...
Acad::ErrorStatus  | getObjectBirthVersion (AcDb::AcDbDwgVersion &, AcDb::MaintenanceReleaseVersion &)
This function is currently not supported by the CAD engine, always returns Acad::eOk, and 'kDHL_CURRENT' + 'kMReleaseCurrent' results. More...
virtual Acad::ErrorStatus  | getObjectSaveVersion (const AcDbDwgFiler *, AcDb::AcDbDwgVersion &, AcDb::MaintenanceReleaseVersion &)
Returns the DWG version for saving the object. More...
virtual Acad::ErrorStatus  | getObjectSaveVersion (const AcDbDxfFiler *, AcDb::AcDbDwgVersion &, AcDb::MaintenanceReleaseVersion &)
Returns the DWG version for saving the object. More...
int  | getOdaOpenCount () const
This function returns the number of open ODA instances for this object. More...
int  | getOdaOpenState () const
This function returns the ODA object open state flags as bitfields, for diagnostic purpose. More...
virtual void  | goodbye (const AcDbObject *)
A handler function for persistent reactors. More...
Acad::ErrorStatus  | handOverTo (AcDbObject *, Adesk::Boolean=Adesk::kTrue, Adesk::Boolean=Adesk::kTrue)
Hands over objects identity to another object. More...
bool  | hasFields () const
Return true if this object has single or multiple fields associated with him. More...
bool  | hasPersistentReactor (AcDbObjectId) const
Checks the input objectId in this object reactor list. More...
bool  | hasSaveVersionOverride ()
This function indicates whether this object overrides the filer's save version. More...
virtual AcDbObjectId  | id () const
Returns the database id of this object. More...
Adesk::Boolean  | isAcDbObjectIdsInFlux () const
Checks whether a deep clone operation was completed. More...
Adesk::Boolean  | isAProxy () const
Adesk::Boolean  | isCancelling () const
Adesk::Boolean  | isErased () const
Returns whether this object is erased. More...
Adesk::Boolean  | isEraseStatusToggled () const
Checks whether the object erase status has been toggled. More...
Adesk::Boolean  | isModified () const
Returns whether this object's assertWriteEnabled() has been called since it was opened. More...
Adesk::Boolean  | isModifiedGraphics () const
Checks whether this object graphics will be updated when the object is closed. More...
Adesk::Boolean  | isModifiedXData () const
Checks whether this object's xData was modified. More...
Adesk::Boolean  | isNewObject () const
Returns true if and only if this object has not been closed since it was created. More...
Adesk::Boolean  | isNotifyEnabled () const
Returns whether this object is opened for notify. More...
Adesk::Boolean  | isNotifying () const
virtual Adesk::Boolean  | isPersistent () const
Returns the 'persistent' status of a database object. More...
Adesk::Boolean  | isReadEnabled () const
Returns whether this object is opened for read. More...
 Adesk::Boolean  | isReallyClosing () const
Checks whether the next close call will completely close this object return true if on the next call the object will be completely closed false otherwise.
Adesk::Boolean  | isTransactionResident () const
Gets the object transaction status. More...
Adesk::Boolean  | isUndoing () const
bool  | isUndoRecordingDisabled () const
Returns whether the undo recording for the object is enabled or not. More...
Adesk::Boolean  | isWriteEnabled () const
Returns whether this object is opened for write. More...
virtual AcDb::DuplicateRecordCloning  | mergeStyle () const
Returns the object's merge behavior during cloning. More...
virtual void  | modified (const AcDbObject *)
A handler function for persistent reactors. More...
virtual void  | modifiedGraphics (const AcDbEntity *)
A handler function for persistent reactors. More...
virtual void  | modifiedXData (const AcDbObject *)
A handler function for persistent reactors. More...
virtual void  | modifyUndone (const AcDbObject *)
A handler function for persistent reactors. More...
virtual void  | objectClosed (const AcDbObjectId)
A handler function for persistent reactors. More...
AcDbObjectId  | objectId () const
Returns object id. More...
virtual void  | openedForModify (const AcDbObject *)
A handler function for persistent reactors. More...
AcDbObjectId  | ownerId () const
Returns object id of the owner. More...
AcDbVoidPtrArray *  | reactors ()
Gets the object pointers to reactors. More...
const AcDbVoidPtrArray *  | reactors () const
Gets the object pointers to reactors. More...
virtual void  | reappended (const AcDbObject *)
A handler function for persistent reactors. More...
 virtual void  | recvPropagateModify (const AcDbObject *)
Not implemented yet.
Acad::ErrorStatus  | releaseExtensionDictionary ()
Removes the extension dictionary associated with this object. More...
virtual Acad::ErrorStatus  | removeField (AcDbObjectId)
Removes the Field specified by acFieldId from this object. More...
virtual Acad::ErrorStatus  | removeField (const ACHAR *)
Removes the Field specified by szKeyString from this object. More...
virtual Acad::ErrorStatus  | removeField (const ACHAR *, AcDbObjectId &)
Removes the Field specified by acPszKeyString from this object, and returns its ObjectId value. More...
virtual Acad::ErrorStatus  | removePersistentReactor (AcDbObjectId)
Removes a persistent reactor from this object reactor list. More...
Acad::ErrorStatus  | removeReactor (AcDbObjectReactor *) const
Removes a transient reactor to this object. More...
void  | setAcDbObjectIdsInFlux ()
Call this function to indicate that the object IDs of this object and its sub-objects (if any) are not yet valid. More...
Acad::ErrorStatus  | setBinaryData (const ACHAR *, Adesk::Int32, const char *)
Creates a copy of the binary data, divides it in up to 127 bytes binary chunks and
 sets them as resbufs in the resbuf chain of this object's extension dictionary xrecord entry given by entryName. More...
virtual Acad::ErrorStatus  | setField (const ACHAR *, AcDbField *, AcDbObjectId &)
Adds the pAcField field object to field dictionary of this AcDbObject object, using pKey as key. More...
void  | setHasSaveVersionOverride (bool)
This function can be called to specify that the object has a "save version override". More...
virtual Acad::ErrorStatus  | setOwnerId (AcDbObjectId)
Sets the ownerId data member of the object to be objId. More...
virtual Acad::ErrorStatus  | setXData (const resbuf *)
Sets/removes xData associated with this object. More...
virtual Acad::ErrorStatus  | subCancel ()
Possibility to veto a cancel operation from within custom entities. More...
virtual Acad::ErrorStatus  | subClose ()
virtual Acad::ErrorStatus  | subErase (Adesk::Boolean)
This hook is called during an AcDbObject::erase call, before any actual erase operation is performed. More...
 virtual Acad::ErrorStatus  | subHandOverTo (AcDbObject *)
virtual void  | subObjModified (const AcDbObject *, const AcDbObject *)
A handler function for persistent reactors. More...
 virtual Acad::ErrorStatus  | subOpen (AcDb::OpenMode)
virtual Acad::ErrorStatus  | subSwapIdWith (AcDbObjectId, Adesk::Boolean=Adesk::kFalse, Adesk::Boolean=Adesk::kFalse)
This hook is called during an AcDbObject::swapIdWith() call, before any actual swap operation is performed. More...
Acad::ErrorStatus  | swapIdWith (AcDbObjectId, Adesk::Boolean=Adesk::kFalse, Adesk::Boolean=Adesk::kFalse)
Swaps the object id's between the object identified by param swapId and this object. More...
virtual Acad::ErrorStatus  | swapReferences (const AcDbIdMapping &)
Not implemented yet. More...
virtual void  | unappended (const AcDbObject *)
A handler function for persistent reactors. More...
AcDbDwgFiler *  | undoFiler ()
Gets the undo filer for this object. More...
Acad::ErrorStatus  | upgradeFromNotify (Adesk::Boolean &)
Upgrades the open status of this object to AcDb::kForWrite, if this object is already open (either in AcDb::kForRead, AcDb::kForNotify or AcDb::kForWrite) More...
Acad::ErrorStatus  | upgradeOpen ()
Changes the objects open mode to AcDb::kForWrite and sends notifications. More...
virtual Acad::ErrorStatus  | wblockClone (AcRxObject *, AcDbObject *&, AcDbIdMapping &, Adesk::Boolean=Adesk::kTrue) const final
Clones this object, appends it to the owner pOwner and adds an AcDbIdPair record to the idMap. More...
virtual resbuf *  | xData (const ACHAR *=NULL) const
Returns the xData associated with this object. More...
Acad::ErrorStatus  | xDataTransformBy (const AcGeMatrix3d &)
Transforms the extended data according to parameter transformation matrix. More...
 virtual void  | xmitPropagateModify () const
Not implemented yet.
 virtual  | ~AcDbObject ()
Destructor.
 Public Member Functions inherited from AcGiDrawable
virtual bool  | bounds (AcDbExtents &) const
virtual DrawableType  | drawableType () const
 virtual AcGiDrawStream *  | drawStream () const
 AcGsNode *  | gsNode () const
virtual AcDbObjectId  | id () const =0
virtual Adesk::Boolean  | isPersistent () const =0
virtual Adesk::UInt32  | regenSupportFlags () const final
Returns whether and to which level this object supports MultiThreading. More...
 virtual Adesk::Boolean  | RolloverHit (Adesk::ULongPtr, Adesk::ULongPtr, Adesk::Boolean)
 virtual Adesk::UInt32  | setAttributes (AcGiDrawableTraits *) final
 virtual void  | setDrawStream (AcGiDrawStream *)
 void  | setGsNode (AcGsNode *)
 virtual void  | viewportDraw (AcGiViewportDraw *) final
 virtual Adesk::UInt32  | viewportDrawLogicalFlags (AcGiViewportDraw *) final
 virtual Adesk::Boolean  | worldDraw (AcGiWorldDraw *) final
 Public Member Functions inherited from AcRxObject
virtual AcRxObject *  | clone () const
Exported and implemented. More...
 virtual AcRx::Ordering  | comparedTo (const AcRxObject *) const
Exported and implemented.
virtual Acad::ErrorStatus  | copyFrom (const AcRxObject *)
Exported and implemented. More...
 virtual AcRxClass *  | isA () const
Exported and implemented.
virtual Adesk::Boolean  | isEqualTo (const AcRxObject *) const
Exported and implemented. More...
bool  | isKindOf (const AcRxClass *) const
Checks the object class. More...
AcRxObject *  | queryX (const AcRxClass *) const
returns the protocol extension object assigned to this class or a parent class. More...
AcRxObject *  | x (const AcRxClass *) const
returns the protocol extension object assigned to this class or a parent class. More...
 virtual  | ~AcRxObject ()
Destructor.
 Public Attributes
AcDbSortentsTable
Default constructor.
 Additional Inherited Members
 Public Types inherited from AcGiDrawable
enum  | DrawableType {
 kGeometry = 0 , kDistantLight , kPointLight , kSpotLight ,
 kAmbientLight , kSolidBackground , kGradientBackground , kImageBackground ,
 kGroundPlaneBackground , kViewport
 }
enum  | SetAttributesFlags {
 kDrawableNone = 0 , kDrawableIsAnEntity = 1 , kDrawableUsesNesting = 2 , kDrawableIsCompoundObject = 4 ,
 kDrawableViewIndependentViewportDraw = 8 , kDrawableIsInvisible = 16 , kDrawableHasAttributes = 32 , kDrawableRegenTypeDependentGeometry = 64 ,
 kDrawableIsDimension = 133 , kDrawableRegenDraw = 256 , kDrawableStandardDisplaySingleLOD = 512 , kDrawableShadedDisplaySingleLOD = 1024 ,
 kDrawableViewDependentViewportDraw = 2048 , kDrawableBlockDependentViewportDraw = 4096 , kDrawableIsExternalReference = 8192 , kDrawableNotPlottable = 16384 ,
 kDrawableNotAllowLCS = 32768 , kDrawableMergeControlOff = 65536 , kThreadedWorldDrawViewportDraw = 131072
 }
 Static Public Member Functions inherited from AcRxObject
 static AcRxObject *  | cast (const AcRxObject *)
 static AcRxClass *  | desc ()
Exported and implemented.
 Static Public Member Functions inherited from AcHeapOperators
 static void  | operator delete (void *)
_
 static void  | operator delete (void *, const char *, int)
 static void  | operator delete (void *, void *)
 static void  | operator delete[] (void *)
_
 static void  | operator delete[] (void *, const char *, int)
 static void *  | operator new (size_t)
_
 static void *  | operator new (size_t, const char *, int)
 static void *  | operator new (size_t, void *p)
 static void *  | operator new[] (size_t)
_
 static void *  | operator new[] (size_t, const char *, int)
 Protected Member Functions inherited from AcDbObject
virtual Acad::ErrorStatus  | subDeepClone (AcDbObject *, AcDbObject *&, AcDbIdMapping &, Adesk::Boolean=true) const
virtual Acad::ErrorStatus  | subGetClassID (CLSID *) const
virtual Adesk::UInt32  | subSetAttributes (AcGiDrawableTraits *)
Sets the values of this object's subentity traits and returns with the calling object's subentity traits. More...
virtual void  | subViewportDraw (AcGiViewportDraw *)
virtual Adesk::UInt32  | subViewportDrawLogicalFlags (AcGiViewportDraw *)
virtual Acad::ErrorStatus  | subWblockClone (AcRxObject *, AcDbObject *&, AcDbIdMapping &, Adesk::Boolean=true) const
virtual Adesk::Boolean  | subWorldDraw (AcGiWorldDraw *)
 Protected Member Functions inherited from AcGiDrawable
virtual Adesk::UInt32  | subRegenSupportFlags () const
Returns whether and to which level this object supports MultiThreading. More...
virtual Adesk::UInt32  | subSetAttributes (AcGiDrawableTraits *)=0
virtual void  | subViewportDraw (AcGiViewportDraw *)=0
 virtual Adesk::UInt32  | subViewportDrawLogicalFlags (AcGiViewportDraw *)
virtual Adesk::Boolean  | subWorldDraw (AcGiWorldDraw *)=0
 Protected Member Functions inherited from AcRxObject
AcRxObject ()
Exported and implemented.
Detailed Description
_
Member Function Documentation
◆ applyPartialUndo()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbSortentsTable::applyPartialUndo  |  ( |  AcDbDwgFiler *  |  container,
|  AcRxClass *  |  pObject
)
virtual
See also
AcDbObject::applyPartialUndo(AcDbDwgFiler*, AcRxClass*)
Reimplemented from AcDbObject.
◆ audit()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbSortentsTable::audit  |  ( |  AcDbAuditInfo *  |  info | )
virtual
See also
AcDbObject::audit(AcDbAuditInfo*)
Reimplemented from AcDbObject.
◆ blockId()
 UX_EXPORT_FUNCTION AcDbObjectId AcDbSortentsTable::blockId  |  ( |   | ) |   const
Returns the object id of the block table record associated with this sortents table.
Returns
id of the block table record
AcDbObjectId::kNull otherwise
◆ dwgInFields()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbSortentsTable::dwgInFields  |  ( |  AcDbDwgFiler *  |  dwgFiler | )
virtual
See also
AcDbObject::dwgInFields(AcDbDwgFiler*)
Reimplemented from AcDbObject.
◆ dwgOutFields()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbSortentsTable::dwgOutFields  |  ( |  AcDbDwgFiler *  |  dwgFiler | ) |   const
virtual
See also
AcDbObject::dwgOutFields(AcDbDwgFiler*)
Reimplemented from AcDbObject.
◆ dxfInFields()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbSortentsTable::dxfInFields  |  ( |  AcDbDxfFiler *  |  dxfFiler | )
virtual
See also
AcDbObject::dxfInFields(AcDbDxfFiler*)
Reimplemented from AcDbObject.
◆ dxfOutFields()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbSortentsTable::dxfOutFields  |  ( |  AcDbDxfFiler *  |  dxfFiler | ) |   const
virtual
See also
AcDbObject::dxfOutFields(AcDbDxfFiler*)
Reimplemented from AcDbObject.
◆ firstEntityIsDrawnBeforeSecond()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbSortentsTable::firstEntityIsDrawnBeforeSecond  |  ( |  AcDbObjectId  |  firstObjectId,
|  AcDbObjectId  |  secondObjectId,
|  bool &  |  result
) |   |  const
Sets the bool value to true if the first entity is drawn before the second entity.
Parameters
[in,out] | result | that indicates if the first object id is drawn before second object id.
[in] | firstObjectId | object id to be input
[in] | secondObjectId | object id to be input
Returns
Acad::eOk if successful Acad::eInvalidInput if any of the input object ids is not valid or it is not belonging to the current block table record
◆ getFullDrawOrder()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbSortentsTable::getFullDrawOrder  |  ( |  AcDbObjectIdArray &  |  acIds,
|  Adesk::UInt8  |  sortentsMask = 0
) |   |  const
Gets the draw order used if the SORTENTS required bits are set.
Parameters
[in] | acIds | Empty object Id array
[in] | sortentsMask | mask to be checked against the SORTENTS variable
Returns
Acad::eOk if successful
errorCode otherwise
◆ getRelativeDrawOrder()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbSortentsTable::getRelativeDrawOrder  |  ( |  AcDbObjectIdArray &  |  acIds,
|  Adesk::UInt8  |  sortentsMask = 0
) |   |  const
Rearranges the specified entity ids into their current relative draw order for this sortents table order.
Parameters
[in,out] | acIds | array of object ids to be rearranged
[in] | sortentsMask | mask to be checked against the SORTENTS variable
Returns
Acad::eOk if successful,
 Acad::eInvalidInput if the input array has invalid entries,
 Acad::eDuplicateKey if the input array has multiple entries of the same id
Remarks
The second parameter is not yet supported.
◆ getSortHandle()
 UX_EXPORT_FUNCTION void AcDbSortentsTable::getSortHandle  |  ( |  AcDbObjectId  |  acId,
|  AcDbHandle &  |  acHandle
) |   |  const
Gets the handle value that indicates the draw order based on the given object ID.
Parameters
[in,out] | acHandle | that indicates the draw order
[in] | acId | object id to be input
Returns
AcDbHandle value
◆ moveAbove()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbSortentsTable::moveAbove  |  ( |  const AcDbObjectIdArray &  |  acIdArray,
|  AcDbObjectId  |  acId
)
Places all entities spceified by acIdArray above acId in the drawing list, keeping their relative draw order.
Parameters
[in] | acIdArray | - id list of objects to be moved
[in] | acId | - id of target object
Returns
- Acad::eInvalidInput if acIdArray is empty or it contains an id not belonging to the current block table record
Acad::eDuplicateKey if there are two identical ids in acIdArray
Acad::eInvalidKey if acId does not belong to the current block table record
Acad::eOk otherwise
◆ moveBelow()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbSortentsTable::moveBelow  |  ( |  const AcDbObjectIdArray &  |  acIdArray,
|  AcDbObjectId  |  acId
)
Places all entities specified by acIdArray below acId in the drawing list, keeping their relative draw order.
Parameters
[in] | acIdArray | - id list of objects to be moved
[in] | acId | - id of target object
Returns
- Acad::eInvalidInput if acIdArray is empty or it contains an id not belonging to the current block table record
Acad::eDuplicateKey if there are two identical ids in acIdArray
Acad::eInvalidKey if acId does not belong to the current block table record
Acad::eOk otherwise
◆ moveToBottom()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbSortentsTable::moveToBottom  |  ( |  const AcDbObjectIdArray &  |  inArray | )
The entities contained in the array are placed to be the first ones in the draw order.
Parameters
[in] | ar | Object Id array
Returns
Acad::eOk if successful
eInvalidInput the array is empty
eDuplicateKey if an array item is present more then once in the array
◆ moveToTop()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbSortentsTable::moveToTop  |  ( |  const AcDbObjectIdArray &  |  inArray | )
The entities contained in the array are placed to be the last ones in the draw order.
Parameters
[in] | inArray | Object Id array
Returns
Acad::eOk if successful
eInvalidInput the array is empty
eDuplicateKey if an array item is present more then once in the array
◆ setBlockId()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbSortentsTable::setBlockId  |  ( |  AcDbObjectId  |  acId | )
Sets the object id for the block table record associated with this sortents table.
Parameters
[in] | acId | id to be set for the corresponding block table record
Returns
Acad::eOk
Acad::eInvalidInput otherwise
◆ setRelativeDrawOrder()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbSortentsTable::setRelativeDrawOrder  |  ( |  const AcDbObjectIdArray &  |  acIds | )
Input the specified entity ids into their draw order for this sortents table order.
You can use moveXxx() for move or consolidate the draw order slots of these object IDs.
Parameters
[in] | acIds | array of object ids to be input
Returns
Acad::eOk if successful,
 Acad::eInvalidInput if the input array has invalid entries,
 Acad::eDuplicateKey if the input array has multiple entries of the same id
◆ sortAs()
 UX_EXPORT_FUNCTION Adesk::Boolean AcDbSortentsTable::sortAs  |  ( |  AcDbObjectId  |  acId,
|  AcDbHandle &  |  acHandle
) |   |  const
Gets the handle that indicates the draw order of the object with the target id.
Parameters
[in] | acId | - target id
[out] | acHandle | - the output handle object
Returns
Adesk::kTrue if the given object has an explicit draw order
◆ swapOrder()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbSortentsTable::swapOrder  |  ( |  AcDbObjectId  |  firstObjectId,
|  AcDbObjectId  |  secondObjectId
)
In the same block table record swap id for two entity.
Parameters
[in] | firstObjectId | - id first for swap with secondObjectId
[in] | secondObjectId | - id second for swap with firstObjectId
Returns
- Acad::eInvalidInput if firstObjectId or secondObjectId is empty or it contains an id not belonging to the current block table record
Acad::eOk otherwise