Public Types | Public Member Functions | Static Public Member Functions | Public Attributes | List of all members
AcDbDatabase Class Reference
_ More...
#include <AcDbDatabase.h>
 Public Types
enum  | OpenMode { kForReadAndReadShare = 1 , kForReadAndWriteNoShare , kForReadAndAllShare , kTryForReadShare }
 Public Member Functions
void  | abortDeepClone (AcDbIdMapping &)
This function initiates an 'abortDeepClone' editor reactor event. More...
AcDbDatabase (bool=true, bool=false)
Acad::ErrorStatus  | addAcDbObject (AcDbObject *)
Adds an object to the database, giving it a handle and an object ID. More...
Acad::ErrorStatus  | addAcDbObject (AcDbObjectId &, AcDbObject *)
Adds an object to the database, giving it a handle and an object ID. More...
Acad::ErrorStatus  | addReactor (AcDbDatabaseReactor *) const
Adds a database reactor. More...
double  | angbase () const
Gets the ANGBASE system variable. More...
bool  | angdir () const
Gets the ANGDIR system variable. More...
bool  | annoAllVisible () const
Returns the current value of ANNOALLVISIBLE database variable. More...
bool  | annotativeDwg () const
Returns the current value of ANNOTATIVEDWG database variable. More...
 Acad::ErrorStatus  | applyPartialOpenFilters (const AcDbSpatialFilter *, const AcDbLayerFilter *)
int  | approxNumObjects () const
Returns the approximated number of objects in this database. More...
bool  | attdia () const
Returns ATTDIA value of drawing editor. More...
Adesk::Int16  | attmode () const
Gets the ATTMODE system variable. More...
bool  | attreq () const
Returns the current value of ATTREQ system variable. More...
Acad::ErrorStatus  | audit (AcDbAuditInfo *)
This function runs the audit operation on this database. More...
 Acad::ErrorStatus  | auditXData (AcDbAuditInfo *)
Adesk::Int16  | aunits () const
Gets the value of AUNITS system variable. More...
Adesk::Int16  | auprec () const
Gets the value of AUPREC system variable. More...
bool  | blipmode () const
Returns BLIPMODE value of this database. More...
AcDbObjectId  | blockTableId () const
Returns the Block Table objectId. More...
AcDbObjectId  | byBlockLinetype () const
Gets the objectId of the "ByBlock" linetype. More...
AcDbObjectId  | byBlockMaterial () const
Gets the objectId of the "ByBlock" material. More...
AcDbObjectId  | byLayerLinetype () const
Gets the objectId of the "ByLayer" linetype. More...
AcDbObjectId  | byLayerMaterial () const
Gets the objectId of the "ByLayer" material. More...
 bool  | cameraDisplay () const
 double  | cameraHeight () const
AcDbAnnotationScale *  | cannoscale () const
Returns the current annotation scale object of this database (CANNOSCALE). More...
AcCmColor  | cecolor () const
Gets the CECOLOR value for the database. More...
double  | celtscale () const
Gets the CELTSCALE value. More...
AcDbObjectId  | celtype () const
Gets the objectId of the linetype pointed by CELTYPE system variable. More...
AcDb::LineWeight  | celweight () const
Gets the CELWEIGHT value. More...
AcCmTransparency  | cetransparency () const
Returns the current entity transparency (CETRANSPARENCY). More...
double  | chamfera () const
Gets the CHAMFERA variable value. More...
double  | chamferb () const
Gets the CHAMFERB variable value. More...
double  | chamferc () const
Gets the CHAMFERC variable value. More...
double  | chamferd () const
Gets the CHAMFERD variable value. More...
 const ACHAR *  | classDxfName (const AcRxClass *)
AcDbObjectId  | clayer () const
Returns the objectId of the current layer, which is set in the drawing variable CLAYER. More...
const SecurityParams *  | cloneSecurityParams ()
Retrieves the security parameters as used by this database. More...
Acad::ErrorStatus  | closeInput (bool=false)
AcDbObjectId  | cmaterial () const
Returns the value of CMATERIAL system variable for this database. More...
Adesk::Int16  | cmljust () const
Gets the CMLJUST system variable. More...
double  | cmlscale () const
Gets the CMLSCALE system variable. More...
AcDbObjectId  | cmlstyleID () const
Gets the CMLSTYLEID system variable. More...
AcDbObjectId  | colorDictionaryId () const
Returns id of the color dictionary. More...
AcDbObjectId  | continuousLinetype () const
Gets the objectId of the continuous linetype. More...
Adesk::Int16  | coords () const
Returns the current value of COORDS system variable. More...
Acad::ErrorStatus  | countHardReferences (const AcDbObjectIdArray &, Adesk::UInt32 *)
Function search in database for each objects whose objectId entities are in the ids array. More...
 Adesk::UInt8  | cshadow () const
AcDbObjectId  | currentSpaceId () const
Returns the objectId of the current space. More...
 AcDbObjectId  | dataLinkDictionaryId () const
Acad::ErrorStatus  | deepCloneObjects (AcDbObjectIdArray &, AcDbObjectId &, AcDbIdMapping &, bool=false)
'deepCloneObjects' clones the objects in objectIdArray to the owner objectsOwnerId. More...
Acad::ErrorStatus  | deepCloneObjects (const AcDbObjectIdArray &, const AcDbObjectId &, AcDbIdMapping &, bool=false)
'deepCloneObjects' clones the objects in objectIdArray to the owner objectsOwnerId. More...
Adesk::Int16  | delUsedObj () const
Returns the current value of DELUSEDOBJ system variable. More...
AcDbObjectId  | detailViewStyleDictionaryId () const
Returns id of the DetailViewStyle dictionary. More...
 Adesk::UInt8  | dgnframe () const
bool  | dimaso () const
Returns value of DIMASO system variable. More...
Adesk::UInt8  | dimAssoc () const
Returns the current value of DIMASSOC database variable. More...
int  | dimfit () const
Gets the variables DIMATFIT of the current database. More...
bool  | dimsho () const
Returns value of DIMSHO system variable. More...
AcDbObjectId  | dimstyle () const
Gets the DIMSTYLE system variable. More...
AcDbObjectId  | dimStyleTableId () const
Returns the DimStyle Table objectId. More...
int  | dimunit () const
Gets the variables DIMUNIT of the current database. More...
void  | disablePartialOpen ()
Calling this function during AcRxEventReractor::partialOpenNotice() cancels the open operation. More...
 void  | disableUndoRecording (bool)
Activates or deactivates the undo recording param[in] disableUndoRecording flag for undo recording behaviour to set.
bool  | dispSilh () const
Gets DISPSILH system variable. More...
Adesk::Int16  | dragmode () const
Returns the current value of DRAGMODE system variable. More...
 AcDbObjectId  | dragVisStyle () const
Adesk::UInt8  | drawOrderCtl () const
The function returns the value for DRAWORDERCTL database variable. More...
Adesk::UInt8  | dwfframe () const
The function returns the DWFFRAME database variable. More...
bool  | dwgFileWasSavedByAutodeskSoftware () const
Determines if the file was last saved by AutoCAD. More...
Acad::ErrorStatus  | dxfIn (const ACHAR *, const ACHAR *=NULL)
Reads a dxf file into the database. More...
Acad::ErrorStatus  | dxfOut (const ACHAR *, const int=16, AcDb::AcDbDwgVersion=AcDb::kDHL_CURRENT, const bool=false)
Saves data from the database into dxf file format. More...
double  | elevation () const
Returns ELEVATION value of this database model space. More...
AcDb::EndCaps  | endCaps () const
Returns the 'endCaps' value of this database. More...
 Acad::ErrorStatus  | evaluateFields (int, const ACHAR *=NULL, AcDbDatabase *=NULL, int *=NULL, int *=NULL)
AcGePoint3d  | extmax () const
Gets the EXTMAX system variable. More...
AcGePoint3d  | extmin () const
Gets the EXTMIN system variable. More...
double  | facetres () const
Returns FACETRES value of this database. More...
 AcFileDependencyManager *  | fileDependencyManager () const
Returns a pointer to the AcFileDependencyManager for this database.
double  | filletrad () const
Returns FILLETRAD value of this database. More...
bool  | fillmode () const
Gets the FILLMODE system variable set for this database. More...
void  | forceWblockDatabaseCopy ()
Empty implementation. More...
 double  | get3dDwfPrec () const
Acad::ErrorStatus  | getAcDbObjectId (AcDbObjectId &, bool, const AcDbHandle &, Adesk::UInt32=0)
Gets the objectId from a handle. More...
Acad::ErrorStatus  | getBlockTable (AcDbBlockTable *&, AcDb::OpenMode=AcDb::kForRead)
Returns the Block Table of the Database. More...
Acad::ErrorStatus  | getBlockTable (AcDbSymbolTable *&, AcDb::OpenMode=AcDb::kForRead)
Returns the Block Table of the Database. More...
AcDb::PlotStyleNameType  | getCePlotStyleNameId (AcDbObjectId &) const
Gets the current plotstylenametype. More...
Acad::ErrorStatus  | getColorDictionary (AcDbDictionary *&, AcDb::OpenMode=AcDb::kForRead)
Returns the Color Dictionary opened in the openmode specified by openmode. More...
 Acad::ErrorStatus  | getDataLinkDictionary (AcDbDictionary *&, AcDb::OpenMode=AcDb::kForRead)
 AcDbDataLinkManager *  | getDataLinkManager () const
Acad::ErrorStatus  | getDetailViewStyleDictionary (AcDbDictionary *&, AcDb::OpenMode=AcDb::kForRead)
Returns the DetailViewStyle Dictionary opened in the openmode specified by openmode. More...
 Acad::ErrorStatus  | getDimapost (ACHAR *&) const
 Acad::ErrorStatus  | getDimblk (ACHAR *&) const
 Acad::ErrorStatus  | getDimblk1 (ACHAR *&) const
 Acad::ErrorStatus  | getDimblk2 (ACHAR *&) const
Acad::ErrorStatus  | getDimpost (ACHAR *&) const
Gets the value of DIMPOST system variable. More...
 Acad::ErrorStatus  | getDimRecentStyleList (AcDbObjectIdArray &) const
 Acad::ErrorStatus  | getDimstyleChildData (const AcRxClass *, AcDbDimStyleTableRecord *&, AcDbObjectId &) const
AcDbObjectId  | getDimstyleChildId (const AcRxClass *, AcDbObjectId &) const
Returns the child dimension style if available, parent style otherwise. More...
Acad::ErrorStatus  | getDimstyleData (AcDbDimStyleTableRecord *&) const
Gets the dimension variable from current database into DimStyleTableRecord pRecord. More...
AcDbObjectId  | getDimstyleParentId (AcDbObjectId &) const
Returns the parent dimension style. More...
 Acad::ErrorStatus  | getDimStyleTable (AcDbDimStyleTable *&, AcDb::OpenMode=AcDb::kForRead)
Acad::ErrorStatus  | getDimStyleTable (AcDbSymbolTable *&, AcDb::OpenMode=AcDb::kForRead)
Returns the DimStyle Table of the Database. More...
Acad::ErrorStatus  | getFilename (const ACHAR *&) const
Gets the drawing file name. More...
Acad::ErrorStatus  | getFingerprintGuid (ACHAR *&) const
Returns the 'FingerPrintGuid' of this database. More...
Acad::ErrorStatus  | getGroupDictionary (AcDbDictionary *&, AcDb::OpenMode=AcDb::kForRead)
Returns the Group Dictionary opened in the openmode specified by openmode. More...
Acad::ErrorStatus  | getHyperlinkBase (ACHAR *&) const
Gets the value of HYPERLINKBASE variable. More...
 AcDbLayerStateManager *  | getLayerStateManager () const
Returns the AcDbLayerStateManager corresponding to this database.
 Acad::ErrorStatus  | getLayerTable (AcDbLayerTable *&, AcDb::OpenMode=AcDb::kForRead)
Acad::ErrorStatus  | getLayerTable (AcDbSymbolTable *&, AcDb::OpenMode=AcDb::kForRead)
Returns the Layer Table of the Database. More...
Acad::ErrorStatus  | getLayoutDictionary (AcDbDictionary *&, AcDb::OpenMode=AcDb::kForRead)
Returns the Layout Dictionary opened in the openmode specified by openmode. More...
 Acad::ErrorStatus  | getLinetypeTable (AcDbLinetypeTable *&, AcDb::OpenMode=AcDb::kForRead)
Acad::ErrorStatus  | getLinetypeTable (AcDbSymbolTable *&, AcDb::OpenMode=AcDb::kForRead)
Returns the Linetype Table of the Database. More...
Acad::ErrorStatus  | getMaterialDictionary (AcDbDictionary *&, AcDb::OpenMode=AcDb::kForRead)
Returns the Material Dictionary opened in the openmode specified by openmode. More...
Acad::ErrorStatus  | getMenu (ACHAR *&) const
Returns the current value of MENUNAME database variable. More...
Acad::ErrorStatus  | getMLeaderStyleDictionary (AcDbDictionary *&, AcDb::OpenMode=AcDb::kForRead)
Returns the MLeaderStyle Dictionary opened in the openmode specified by openmode. More...
Acad::ErrorStatus  | getMLStyleDictionary (AcDbDictionary *&, AcDb::OpenMode=AcDb::kForRead)
Returns the MlineStyle Dictionary opened in the openmode specified by openmode. More...
Acad::ErrorStatus  | getNamedObjectsDictionary (AcDbDictionary *&, AcDb::OpenMode=AcDb::kForRead)
Returns the NamedObjects Dictionary opened in the openmode specified by openmode. More...
Acad::ErrorStatus  | getPlotSettingsDictionary (AcDbDictionary *&, AcDb::OpenMode=AcDb::kForRead)
Returns the PlotSettings Dictionary opened in the openmode specified by openmode. More...
Acad::ErrorStatus  | getPlotStyleNameDictionary (AcDbDictionaryWithDefault *&, AcDb::OpenMode=AcDb::kForRead)
Returns the PlotStyleName Dictionary opened in the openmode specified by openmode. More...
Acad::ErrorStatus  | getProjectName (ACHAR *&) const
Returns the current value of PROJECTNAME database variable. More...
 Acad::ErrorStatus  | getRegAppTable (AcDbRegAppTable *&, AcDb::OpenMode=AcDb::kForRead)
Acad::ErrorStatus  | getRegAppTable (AcDbSymbolTable *&, AcDb::OpenMode=AcDb::kForRead)
Returns the RegApp Table of the Database. More...
Acad::ErrorStatus  | getScaleListDictionary (AcDbDictionary *&, AcDb::OpenMode=AcDb::kForRead)
Returns the ScaleList Dictionary opened in the openmode specified by openmode. More...
AcDbObjectId  | getSectionManager () const
Returns the object ID of the section manager. More...
Acad::ErrorStatus  | getSectionManager (AcDbSectionManager *&, AcDb::OpenMode=AcDb::kForRead) const
Gets a pointer to the section manager object. More...
Acad::ErrorStatus  | getSectionViewStyleDictionary (AcDbDictionary *&, AcDb::OpenMode=AcDb::kForRead)
Returns the SectionViewStyleD Dictionary opened in the openmode specified by openmode. More...
Acad::ErrorStatus  | getStyleSheet (ACHAR *&) const
Gets the STYLESHEET system variable of this database object. More...
Acad::ErrorStatus  | getSymbolTable (AcDbBlockTable *&, AcDb::OpenMode=AcDb::kForRead)
Opens the block table in the openmode specified by openmode. More...
Acad::ErrorStatus  | getSymbolTable (AcDbDimStyleTable *&, AcDb::OpenMode=AcDb::kForRead)
Opens the dimstyle table in the openmode specified by openmode. More...
Acad::ErrorStatus  | getSymbolTable (AcDbLayerTable *&, AcDb::OpenMode=AcDb::kForRead)
Opens the layer table in the openmode specified by openmode. More...
Acad::ErrorStatus  | getSymbolTable (AcDbLinetypeTable *&, AcDb::OpenMode=AcDb::kForRead)
Opens the linetype table in the openmode specified by openmode. More...
Acad::ErrorStatus  | getSymbolTable (AcDbRegAppTable *&, AcDb::OpenMode=AcDb::kForRead)
Opens the regapp table in the openmode specified by openmode. More...
Acad::ErrorStatus  | getSymbolTable (AcDbTextStyleTable *&, AcDb::OpenMode=AcDb::kForRead)
Opens the textstyle table in the openmode specified by openmode. More...
Acad::ErrorStatus  | getSymbolTable (AcDbUCSTable *&, AcDb::OpenMode=AcDb::kForRead)
Opens the UCS table in the openmode specified by openmode. More...
Acad::ErrorStatus  | getSymbolTable (AcDbViewportTable *&, AcDb::OpenMode=AcDb::kForRead)
Opens the viewport table in the openmode specified by openmode. More...
Acad::ErrorStatus  | getSymbolTable (AcDbViewTable *&, AcDb::OpenMode=AcDb::kForRead)
Opens the view table in the openmode specified by openmode. More...
 template<class SymbolTable >
AcDbObjectId  | getSymbolTableId () const
 template<>
AcDbObjectId  | getSymbolTableId () const
 template<>
AcDbObjectId  | getSymbolTableId () const
 template<>
AcDbObjectId  | getSymbolTableId () const
 template<>
AcDbObjectId  | getSymbolTableId () const
 template<>
AcDbObjectId  | getSymbolTableId () const
 template<>
AcDbObjectId  | getSymbolTableId () const
 template<>
AcDbObjectId  | getSymbolTableId () const
 template<>
AcDbObjectId  | getSymbolTableId () const
 template<>
AcDbObjectId  | getSymbolTableId () const
Acad::ErrorStatus  | getTableStyleDictionary (AcDbDictionary *&, AcDb::OpenMode)
Returns the TableStyle Dictionary opened in the openmode specified by openmode. More...
Acad::ErrorStatus  | getTextStyleTable (AcDbSymbolTable *&, AcDb::OpenMode=AcDb::kForRead)
Returns the TextStyle Table of the Database. More...
 Acad::ErrorStatus  | getTextStyleTable (AcDbTextStyleTable *&, AcDb::OpenMode=AcDb::kForRead)
 Acad::ErrorStatus  | getTimeZoneInfo (AcDb::TimeZone, double &, AcString &) const
Acad::ErrorStatus  | getUCSTable (AcDbSymbolTable *&, AcDb::OpenMode=AcDb::kForRead)
Returns the UCS Table of the Database. More...
 Acad::ErrorStatus  | getUCSTable (AcDbUCSTable *&, AcDb::OpenMode=AcDb::kForRead)
Acad::ErrorStatus  | getVersionGuid (ACHAR *&) const
Returns the 'VersionGuid' of this database. More...
Acad::ErrorStatus  | getViewportArray (AcDbObjectIdArray &, bool=true) const
Gets AcDbViewport objects contained in this database and appends them to the array. More...
Acad::ErrorStatus  | getViewportTable (AcDbSymbolTable *&, AcDb::OpenMode=AcDb::kForRead)
Returns the Viewport Table of the Database. More...
 Acad::ErrorStatus  | getViewportTable (AcDbViewportTable *&, AcDb::OpenMode=AcDb::kForRead)
Acad::ErrorStatus  | getViewTable (AcDbSymbolTable *&, AcDb::OpenMode=AcDb::kForRead)
Returns the View Table of the Database. More...
 Acad::ErrorStatus  | getViewTable (AcDbViewTable *&, AcDb::OpenMode=AcDb::kForRead)
Acad::ErrorStatus  | getVisualStyleDictionary (AcDbDictionary *&, AcDb::OpenMode=AcDb::kForRead)
Returns the Visualstyle Dictionary opened in the openmode specified by openmode. More...
Acad::ErrorStatus  | getVisualStyleList (AcArray< const ACHAR * > &)
Returns a list of localized names of the visual styles. More...
AcDbObjectId  | globalMaterial () const
Gets the objectId of the global material. More...
AcDbObjectId  | groupDictionaryId () const
Returns id of the group dictionary. More...
 AcGsModel *  | gsHighlightModel () const
AcGsModel *  | gsModel () const
Returns the AcGsModel associated with this database. More...
 Adesk::UInt8  | haloGap () const
AcDbHandle  | handseed () const
Returns the next available handle value. More...
 Adesk::UInt8  | hideText () const
bool  | hpInherit () const
Returns the value of HPINHERIT system variable for this database. More...
AcGePoint2d  | hpOrigin () const
Returns the value of HPORIGIN system variable for this database. More...
AcGePoint3d  | insbase () const
Gets the INSBASE variable value (model space). More...
Acad::ErrorStatus  | insert (AcDbObjectId &, const ACHAR *, AcDbDatabase *, bool=true)
Inserts the source database pSourceDb as a new block table record. More...
Acad::ErrorStatus  | insert (AcDbObjectId &, const ACHAR *, const ACHAR *, AcDbDatabase *, bool=true)
Creates a new block table record with the entities of a block table record out of a source database. More...
Acad::ErrorStatus  | insert (const AcGeMatrix3d &, AcDbDatabase *, bool=true)
Inserts all Model Space objects of the source database to the calling database. More...
AcDb::UnitsValue  | insunits () const
Gets the INSUNITS value. More...
 AcCmColor  | interfereColor () const
 AcDbObjectId  | interfereObjVisStyle () const
 AcDbObjectId  | interfereVpVisStyle () const
 Adesk::UInt16  | intersectColor () const
 Adesk::UInt8  | intersectDisplay () const
bool  | isEMR () const
Returns true or false whether this database object was created by an educational version of the application. More...
Adesk::Int16  | isolines () const
Returns ISOLINES value of this database. More...
bool  | isPartiallyOpened () const
Returns whether this database is opened partially. More...
bool  | isPucsOrthographic (AcDb::OrthographicView &) const
Checks whether the current paper space UCS has an orthographic view with respect to PUCSBASE. More...
bool  | isUcsOrthographic (AcDb::OrthographicView &) const
Checks whether the current UCS has an orthographic view with respect to UCSBASE. More...
bool  | isUndoing () const
Returns whether this database is in undoing state. More...
AcDb::JoinStyle  | joinStyle () const
Returns the 'joinStyle' value of this database. More...
AcDb::MaintenanceReleaseVersion  | lastSavedAsMaintenanceVersion () const
Returns the dwg file maintenance version of this database when last "save as" to disk. More...
AcDb::AcDbDwgVersion  | lastSavedAsVersion () const
Returns the dwg file version of this database when last "save as" to disk. More...
double  | latitude () const
It returns in decimal degrees the location of the model (latitude). More...
AcDbObjectId  | layerTableId () const
Returns the Layer Table objectId. More...
AcDbObjectId  | layerZero () const
Returns the objectId of Layer "0". More...
AcDbObjectId  | layoutDictionaryId () const
Returns id of the layout dictionary. More...
 double  | lensLength () const
 Adesk::UInt8  | lightGlyphDisplay () const
bool  | limcheck () const
Returns the LIMCHECK system variable of this database object. More...
AcGePoint2d  | limmax () const
Gets the LIMMAX value. More...
AcGePoint2d  | limmin () const
Gets the LIMMIN value. More...
AcDbObjectId  | linetypeTableId () const
Returns the Linetype Table objectId. More...
bool  | lineWeightDisplay () const
Returns true if line weight display is on or false if it is off. More...
Acad::ErrorStatus  | loadLineTypeFile (const ACHAR *, const ACHAR *)
Loads a linetype. More...
double  | loftAng1 () const
Gets the value of LOFTANG1 system variable. More...
double  | loftAng2 () const
Gets the value of LOFTANG2 system variable. More...
double  | loftMag1 () const
Gets the value of LOFTMAG1 system variable. More...
double  | loftMag2 () const
Gets the value of LOFTMAG2 system variable. More...
Adesk::UInt8  | loftNormals () const
Gets the value of LOFTNORMALS system variable. More...
Adesk::UInt16  | loftParam () const
Gets the value of LOFTPARAM system variable. More...
double  | longitude () const
It returns in decimal degrees the location of the model (longitude). More...
double  | ltscale () const
Gets the LTSCALE value. More...
Adesk::Int16  | lunits () const
Gets the value of LUNITS system variable. More...
Adesk::Int16  | luprec () const
Gets the LUPREC value. More...
Adesk::UInt8  | maintenanceReleaseVersion () const
Returns the point release version of this database. More...
AcDbObjectId  | materialDictionaryId () const
Returns id of the material dictionary. More...
Adesk::Int16  | maxactvp () const
Returns the current value of MAXACTVP database variable. More...
AcDb::MeasurementValue  | measurement () const
Gets MEASUREMENT system variable. More...
bool  | mirrtext () const
Gets the MIRRTEXT variable value. More...
double  | mleaderscale () const
Returns the current MLeader scale object of this database (CMLSCALE). More...
AcDbObjectId  | mleaderstyle () const
Gets the MLEADERSTYLE system variable. More...
AcDbObjectId  | mleaderStyleDictionaryId () const
Returns id of the NLeaderStyle dictionary. More...
AcDbObjectId  | mLStyleDictionaryId () const
Returns id of the mLStyles dictionary. More...
bool  | msltscale () const
Gets MSLTSCALE system variable. More...
AcDbObjectId  | namedObjectsDictionaryId () const
Returns id of the namedObjects dictionary. More...
double  | northDirection () const
Returns the North direction value for this database (angle in radians, to WCS X axis). More...
Adesk::Int32  | numberOfSaves () const
Returns the number of save operations for the database in active session. More...
 AcDbObjectContextManager *  | objectContextManager () const
 Adesk::UInt16  | obscuredColor () const
 Adesk::UInt8  | obscuredLineType () const
bool  | oleStartUp () const
Returns the current value of OLESTARTUP database variable. More...
AcDb::MaintenanceReleaseVersion  | originalFileMaintenanceVersion () const
Returns the dwg file maintenance version of this database as saved on disk. More...
const ACHAR *  | originalFileName () const
Gets the file name as it was when it was opened. More...
AcDb::MaintenanceReleaseVersion  | originalFileSavedByMaintenanceVersion () const
Returns the database maintenance version from which this file was saved. More...
AcDb::AcDbDwgVersion  | originalFileSavedByVersion () const
Returns the database version from which this file was saved. More...
AcDb::AcDbDwgVersion  | originalFileVersion () const
Returns the dwg file version of this database as saved on disk. More...
bool  | orthomode () const
Gets the ORTHOMODE system value. More...
AcDbObjectId  | paperSpaceVportId () const
Returns the objectId of the paperspace viewport of the database. More...
Adesk::Int16  | pdmode () const
Gets the value of PDMODE system variable. More...
double  | pdsize () const
Gets the value of PDSIZE system variable. More...
double  | pelevation () const
Returns PELEVATION value of this database model space. More...
AcGePoint3d  | pextmax () const
Gets the PEXTMAX system variable set for this database. More...
AcGePoint3d  | pextmin () const
Gets the PEXTMIN system variable set for this database. More...
Adesk::Int16  | pickstyle () const
The variable PICKSTYLE is no database variable. More...
AcGePoint3d  | pinsbase () const
Gets the INSBASE variable value (paper space). More...
bool  | plimcheck () const
Returns the current value of paperspace LIMCHECK database variable. More...
AcGePoint2d  | plimmax () const
Returns the LIMMAX system variable of this database object. More...
AcGePoint2d  | plimmin () const
Returns the LIMMIN system variable of this database object. More...
bool  | plineEllipse () const
Returns the current value of PELLIPSE database variable. More...
bool  | plinegen () const
Gets the value of PLINEGEN system variable. More...
double  | plinewid () const
Returns PLINEWID value of this database. More...
AcDbObjectId  | plotSettingsDictionaryId () const
Returns id of the plotSettings dictionary. More...
bool  | plotStyleMode () const
Determines whether the drawing database is in color-dependent or named plotstyles plotting mode. More...
AcDbObjectId  | plotStyleNameDictionaryId () const
Returns id of the plotStyleNames dictionary. More...
bool  | psltscale () const
Gets PSLTSCALE system variable. More...
 double  | psolHeight () const
 double  | psolWidth () const
AcDbObjectId  | pucsBase () const
Gets the objectId of the currently active UCS table entry for the paperspace. More...
AcDbObjectId  | pucsname () const
Gets the objectId of the currently active UCS table entry for the paperspace. More...
AcGePoint3d  | pucsorg () const
Returns point which is the current Paper Space UCSORG System Variable value for this database. More...
AcGeVector3d  | pucsxdir () const
Returns the 3d vector of the current UCS x direction (paperspace). More...
AcGeVector3d  | pucsydir () const
Returns the 3d vector of the current UCS y direction (paperspace). More...
Acad::ErrorStatus  | purge (AcDbObjectIdArray &)
Removes objectIds' from the array objectIdArray that are hard referenced in the database. More...
 Acad::ErrorStatus  | purge (AcDbObjectIdGraph &)
bool  | qtextmode () const
Returns the current value of QTEXTMODE database variable. More...
Acad::ErrorStatus  | readDwgFile (const ACHAR *, const int=_SH_DENYWR, bool=false, const ACHAR *=NULL)
Reads the drawing in the database. More...
Acad::ErrorStatus  | readDwgFile (const ACHAR *, OpenMode, bool=false, const ACHAR *=NULL)
Reads the drawing in the database. More...
 bool  | realWorldScale () const
Acad::ErrorStatus  | reclaimMemoryFromErasedObjects (const AcDbObjectIdArray &)
Releases extra memory for specified erased database objects. More...
AcDbObjectId  | regAppTableId () const
Returns the RegApp Table objectId. More...
bool  | regenmode () const
Returns true if REGENMODE is on or false if it is off. More...
Acad::ErrorStatus  | removeReactor (AcDbDatabaseReactor *) const
Removes a database reactor. More...
Acad::ErrorStatus  | restoreForwardingXrefSymbols ()
The function sets the xref back to a valid situation. More...
Acad::ErrorStatus  | restoreOriginalXrefSymbols ()
The function set all data in database with the value until we open the file. More...
bool  | retainOriginalThumbnailBitmap () const
Returns whether the generation of any new thumbnail bitmap is suppressed - that is, the database will always try to keep the original thumbnail bitmap (if existing). More...
Acad::ErrorStatus  | save ()
Saves the database. More...
Acad::ErrorStatus  | saveAs (const ACHAR *, const bool, const AcDb::AcDbDwgVersion=AcDb::kDHL_CURRENT, const SecurityParams *=NULL)
Saves the database using specified dwg file version and security parameters if provided. More...
Acad::ErrorStatus  | saveAs (const ACHAR *, const SecurityParams *=NULL)
Saves the database using security parameters if provided. More...
Adesk::Int16  | saveproxygraphics () const
Returns the PROXYGRAPHICS value for the database. More...
AcDbObjectId  | scaleListDictionaryId () const
Returns id of the ScaleList dictionary. More...
AcDbObjectId  | sectionViewStyleDictionaryId () const
Returns id of the SectionViewStyle dictionary. More...
 Acad::ErrorStatus  | set3dDwfPrec (double)
Acad::ErrorStatus  | setAngbase (double)
Sets ANGBASE system variable. More...
Acad::ErrorStatus  | setAngdir (bool)
Sets ANGDIR system variable. More...
Acad::ErrorStatus  | setAnnoAllVisible (bool)
Sets the current value of ANNOALLVISIBLE database variable. More...
Acad::ErrorStatus  | setAnnotativeDwg (bool)
Sets the current value of ANNOTATIVEDWG database variable. More...
Acad::ErrorStatus  | setAttdia (bool)
Sets ATTDIA value of drawing editor - always returns Acad::eNotApplicable, as this system variable is no longer database-resident, but stored in Registry. More...
Acad::ErrorStatus  | setAttmode (Adesk::Int16)
Sets the ATTMODE system variable. More...
Acad::ErrorStatus  | setAttreq (bool)
Sets the ATTREQ system variable. More...
Acad::ErrorStatus  | setAunits (Adesk::Int16)
Sets the value of AUNITS system variable. More...
Acad::ErrorStatus  | setAuprec (Adesk::Int16)
Sets the value of AUPREC system variable. More...
Acad::ErrorStatus  | setBlipmode (bool)
Sets BLIPMODE value of drawing editor - always returns Acad::eNotApplicable, as this system variable is no longer database-resident, but stored in Registry. More...
 Acad::ErrorStatus  | setCameraDisplay (const bool)
 Acad::ErrorStatus  | setCameraHeight (const double)
Acad::ErrorStatus  | setCannoscale (AcDbAnnotationScale *)
Sets the current annotation scale object of this database (CANNOSCALE). More...
Acad::ErrorStatus  | setCecolor (const AcCmColor &)
Sets the CECOLOR value for the database from given color object. More...
Acad::ErrorStatus  | setCeltscale (double)
Sets the CELTSCALE value. More...
Acad::ErrorStatus  | setCeltype (AcDbObjectId)
Sets the LinetypeTableRecord identified by celtypeId to be the database's CELTYPE system variable. More...
Acad::ErrorStatus  | setCelweight (AcDb::LineWeight)
Sets the CELWEIGHT value. More...
Acad::ErrorStatus  | setCePlotStyleName (AcDb::PlotStyleNameType, AcDbObjectId=AcDbObjectId::kNull)
Sets the plotstylenametype value. More...
Acad::ErrorStatus  | setCetransparency (const AcCmTransparency &)
Sets the current entity transparency (CETRANSPARENCY). More...
Acad::ErrorStatus  | setChamfera (double)
Sets the CHAMFERA variable value. More...
Acad::ErrorStatus  | setChamferb (double)
Sets the CHAMFERB variable value. More...
Acad::ErrorStatus  | setChamferc (double)
Sets the CHAMFERC variable value. More...
Acad::ErrorStatus  | setChamferd (double)
Sets the CHAMFERD variable value. More...
Acad::ErrorStatus  | setClayer (AcDbObjectId)
Sets the current layer to given layer; this sets variable CLAYER. More...
Acad::ErrorStatus  | setCmaterial (AcDbObjectId)
Sets CMATERIAL system variable for this database. More...
Acad::ErrorStatus  | setCmljust (Adesk::Int16)
Sets the CMLJUST system variable. More...
Acad::ErrorStatus  | setCmlscale (double)
Sets the CMLSCALE system variable. More...
Acad::ErrorStatus  | setCmlstyleID (AcDbObjectId)
Sets the CMLSTYLEID system variable. More...
Acad::ErrorStatus  | setCoords (Adesk::Int16)
Sets the COORDS system variable. More...
 Acad::ErrorStatus  | setCshadow (Adesk::UInt8)
Acad::ErrorStatus  | setDelUsedObj (Adesk::Int16)
Sets the DELUSEDOBJ system variable. More...
 Acad::ErrorStatus  | setDgnframe (Adesk::UInt8)
Acad::ErrorStatus  | setDimaso (bool)
Sets the DIMASO variable value. More...
Acad::ErrorStatus  | setDimAssoc (Adesk::UInt8)
Sets the current value of DIMASSOC database variable. More...
Acad::ErrorStatus  | setDimfit (int)
Sets the variables DIMATFIT of the current database. More...
Acad::ErrorStatus  | setDimsho (bool)
Sets the DIMSHO variable value. More...
Acad::ErrorStatus  | setDimstyle (AcDbObjectId)
Sets the DIMSTYLE system variable. More...
Acad::ErrorStatus  | setDimstyleData (AcDbDimStyleTableRecord *)
Sets the dimension variable from pRecord into current database. More...
Acad::ErrorStatus  | setDimstyleData (AcDbObjectId)
Sets the dimension variable from DimStyleTableRecord with id objectId into current database. More...
Acad::ErrorStatus  | setDimunit (int)
Sets the variables DIMLUNIT and DIMFRAC of the current database. More...
Acad::ErrorStatus  | setDispSilh (bool)
Sets DISPSILH system variable. More...
Acad::ErrorStatus  | setDragmode (Adesk::Int16)
Sets the DRAGMODE system variable. More...
 Acad::ErrorStatus  | setDragVisStyle (AcDbObjectId)
Acad::ErrorStatus  | setDrawOrderCtl (Adesk::UInt8)
The function sets the value for DRAWORDERCTL database variable. More...
Acad::ErrorStatus  | setDwfframe (Adesk::UInt8)
The function sets the DWFFRAME database variable. More...
Acad::ErrorStatus  | setElevation (double)
Sets ELEVATION value of this database model space. More...
Acad::ErrorStatus  | setEndCaps (AcDb::EndCaps)
Sets the 'endCaps' value of this database. More...
Acad::ErrorStatus  | setExtmax (const AcGePoint3d &)
Sets the EXTMAX system variable. More...
Acad::ErrorStatus  | setExtmin (const AcGePoint3d &)
Sets the EXTMIN system variable. More...
Acad::ErrorStatus  | setFacetres (double)
Sets FACETRES value for this database. More...
Acad::ErrorStatus  | setFilletrad (double)
Sets FILLETRAD value for this database. More...
Acad::ErrorStatus  | setFillmode (bool)
Sets the FILLMODE system variable for this database. More...
Acad::ErrorStatus  | setFingerprintGuid (const ACHAR *)
Sets the 'FingerPrintGuid' of this database to provided GUID string. More...
 void  | setGsHighlightModel (AcGsModel *)
void  | setGsModel (AcGsModel *)
Associates pAcModel with this database. More...
 Acad::ErrorStatus  | setHaloGap (Adesk::UInt8)
 Acad::ErrorStatus  | setHandseed (const AcDbHandle &)
 Acad::ErrorStatus  | setHideText (Adesk::UInt8)
Acad::ErrorStatus  | setHpInherit (const bool)
Sets HPINHERIT system variable for this database. More...
Acad::ErrorStatus  | setHpOrigin (const AcGePoint2d &)
Sets HPORIGIN system variable for this database. More...
Acad::ErrorStatus  | setHyperlinkBase (const ACHAR *)
Sets the value of HYPERLINKBASE variable. More...
Acad::ErrorStatus  | setInsbase (const AcGePoint3d &)
Sets the INSBASE variable value (model space). More...
Acad::ErrorStatus  | setInsunits (const AcDb::UnitsValue)
Sets the INSUNITS variable value. More...
 Acad::ErrorStatus  | setInterfereColor (const AcCmColor &)
 Acad::ErrorStatus  | setInterfereObjVisStyle (AcDbObjectId)
 Acad::ErrorStatus  | setInterfereVpVisStyle (AcDbObjectId)
 Acad::ErrorStatus  | setIntersectColor (Adesk::UInt16)
 Acad::ErrorStatus  | setIntersectDisplay (Adesk::UInt8)
Acad::ErrorStatus  | setIsolines (Adesk::Int16)
Sets ISOLINES value for this database. More...
Acad::ErrorStatus  | setJoinStyle (AcDb::JoinStyle)
Sets the 'joinStyle' value of this database. More...
Acad::ErrorStatus  | setLatitude (double)
The function sets the latitude of the site where the model is it. More...
 Acad::ErrorStatus  | setLensLength (const double)
 Acad::ErrorStatus  | setLightGlyphDisplay (Adesk::UInt8)
Acad::ErrorStatus  | setLimcheck (bool)
Sets the LIMCHECK system variable for this database object. More...
Acad::ErrorStatus  | setLimmax (const AcGePoint2d &)
Sets the LIMMAX system variable to limmax. More...
Acad::ErrorStatus  | setLimmin (const AcGePoint2d &)
Sets the LIMMIN system variable to limmin. More...
Acad::ErrorStatus  | setLineWeightDisplay (bool)
Sets the value of LWDISPLAY (line weight display) system variable for the database. More...
Acad::ErrorStatus  | setLoftAng1 (double)
Sets the value of LOFTANG1 system variable. More...
Acad::ErrorStatus  | setLoftAng2 (double)
Sets the value of LOFTANG2 system variable. More...
Acad::ErrorStatus  | setLoftMag1 (double)
Sets the value of LOFTMAG1 system variable. More...
Acad::ErrorStatus  | setLoftMag2 (double)
Sets the value of LOFTMAG2 system variable. More...
Acad::ErrorStatus  | setLoftNormals (Adesk::UInt8)
Sets the value of LOFTNORMALS system variable. More...
Acad::ErrorStatus  | setLoftParam (Adesk::UInt16)
Sets the value of LOFTPARAM system variable. More...
Acad::ErrorStatus  | setLongitude (double)
The function sets the longitude of the site where the model is it. More...
Acad::ErrorStatus  | setLtscale (double)
Sets LTSCALE sistem variable to ltScale. More...
Acad::ErrorStatus  | setLunits (Adesk::Int16)
Sets the value of LUNITS system variable. More...
Acad::ErrorStatus  | setLuprec (Adesk::Int16)
Sets the LUPREC value. More...
Acad::ErrorStatus  | setMaxactvp (Adesk::Int16)
Sets the current value of MAXACTVP database variable. More...
Acad::ErrorStatus  | setMeasurement (AcDb::MeasurementValue)
Sets MEASUREMENT system variable. More...
Acad::ErrorStatus  | setMirrtext (bool)
Sets the MIRRTEXT variable value. More...
Acad::ErrorStatus  | setMLeaderscale (double)
Sets the current MLeader scale object of this database (CMLSCALE). More...
Acad::ErrorStatus  | setMLeaderstyle (AcDbObjectId)
Sets the MLEADERSTYLE system variable. More...
Acad::ErrorStatus  | setMsltscale (bool)
Sets MSLTSCALE system variable. More...
Acad::ErrorStatus  | setNorthDirection (double)
Sets the North direction value for this database (angle in radians, to WCS X axis). More...
 Acad::ErrorStatus  | setObscuredColor (Adesk::UInt16)
 Acad::ErrorStatus  | setObscuredLineType (Adesk::UInt8)
Acad::ErrorStatus  | setOleStartUp (bool)
Sets the current value of OLESTARTUP database variable. More...
Acad::ErrorStatus  | setOrthomode (bool)
Sets ORTHOMODE system variable to orthoMode. More...
Acad::ErrorStatus  | setPdmode (Adesk::Int16)
Sets the value of PDMODE system variable. More...
Acad::ErrorStatus  | setPdsize (double)
Sets the value of PDSIZE system variable. More...
Acad::ErrorStatus  | setPelevation (double)
Sets PELEVATION value of this database paper space. More...
Acad::ErrorStatus  | setPextmax (const AcGePoint3d &)
Sets the PEXTMAX system variable for this database. More...
Acad::ErrorStatus  | setPextmin (const AcGePoint3d &)
Sets the PEXTMIN system variable for this database. More...
Acad::ErrorStatus  | setPickstyle (Adesk::Int16)
The variable PICKSTYLE is no database variable. More...
Acad::ErrorStatus  | setPinsbase (const AcGePoint3d &)
Sets the INSBASE variable value (paper space). More...
Acad::ErrorStatus  | setPlimcheck (bool)
Sets the current value of paperspace LIMCHECK database variable. More...
Acad::ErrorStatus  | setPlimmax (const AcGePoint2d &)
Sets the LIMMAX system variable for this database object. More...
Acad::ErrorStatus  | setPlimmin (const AcGePoint2d &)
Sets the LIMMIN system variable for this database object. More...
Acad::ErrorStatus  | setPlineEllipse (bool)
Sets the current value of PELLIPSE database variable. More...
Acad::ErrorStatus  | setPlinegen (bool)
Sets the PLINEGEN system variable. More...
Acad::ErrorStatus  | setPlinewid (double)
Sets PLINEWID value for this database. More...
Acad::ErrorStatus  | setProjectName (const ACHAR *)
Sets the value of PROJECTNAME database variable. More...
Acad::ErrorStatus  | setPsltscale (bool)
Sets PSLTSCALE system variable. More...
 Acad::ErrorStatus  | setPsolHeight (double)
 Acad::ErrorStatus  | setPsolWidth (double)
Acad::ErrorStatus  | setPucs (const AcGePoint3d &, const AcGeVector3d &, const AcGeVector3d &)
Sets the UCS for the current Paper Space. More...
Acad::ErrorStatus  | setPucsBase (const AcDbObjectId &)
Sets the objectId of the active UCS table entry for paperspace. More...
 Acad::ErrorStatus  | setPucsname (const AcDbObjectId &)
Acad::ErrorStatus  | setQtextmode (bool)
Sets the current value of QTEXTMODE database variable. More...
 Acad::ErrorStatus  | setRealWorldScale (const bool)
Acad::ErrorStatus  | setRegenmode (bool)
Sets the value of REGENMODE system variable. More...
void  | setRetainOriginalThumbnailBitmap (bool)
This function specifies, whether or not the preview image (thumbnail bitmap) should be preserved (if existing);. More...
Acad::ErrorStatus  | setSaveproxygraphics (Adesk::Int16)
Sets the value for PROXYGRAPHICS value for the database. More...
bool  | setSecurityParams (const SecurityParams *, bool=true)
Sets the security parameters for this database. More...
Acad::ErrorStatus  | setShadedge (Adesk::Int16)
Sets the current value of SHADEDGE database variable. More...
Acad::ErrorStatus  | setShadedif (Adesk::Int16)
Sets the current value of SHADEDIF database variable. More...
 Acad::ErrorStatus  | setShadowPlaneLocation (double)
 Acad::ErrorStatus  | setShowHist (Adesk::UInt8)
Acad::ErrorStatus  | setSketchinc (double)
Sets SKETCHINC value for this database. More...
Acad::ErrorStatus  | setSkpoly (bool)
Sets the current value of SKPOLY database variable. More...
 Acad::ErrorStatus  | setSolidHist (Adesk::UInt8)
Acad::ErrorStatus  | setSortEnts (Adesk::UInt8)
This function set for curent database variable sortens. More...
Acad::ErrorStatus  | setSplframe (bool)
Sets SPLFRAME system variable for this database. More...
Acad::ErrorStatus  | setSplinesegs (Adesk::Int16)
Sets the value of system variable SPLINESEGS. More...
Acad::ErrorStatus  | setSplinetype (Adesk::Int16)
Setter function for SPLINETYPE system variable. More...
 Acad::ErrorStatus  | setStepSize (double)
 Acad::ErrorStatus  | setStepsPerSec (double)
Acad::ErrorStatus  | setStyleSheet (const ACHAR *)
Sets the STYLESHEET system variable of this database object. More...
Acad::ErrorStatus  | setSurftab1 (Adesk::Int16)
Sets the current value of SURFTAB1 database variable. More...
Acad::ErrorStatus  | setSurftab2 (Adesk::Int16)
Sets the current value of SURFTAB2 database variable. More...
Acad::ErrorStatus  | setSurftype (Adesk::Int16)
Sets the current value of SURFTYPE database variable. More...
Acad::ErrorStatus  | setSurfu (Adesk::Int16)
Sets the current value of SURFU database variable. More...
Acad::ErrorStatus  | setSurfv (Adesk::Int16)
Sets the current value of SURFV database variable. More...
Acad::ErrorStatus  | setTablestyle (AcDbObjectId)
Sets the ObjectId of the table style to be the current one (as specified by CTABLESTYLE system variable). More...
Acad::ErrorStatus  | setTextsize (double)
Sets TEXTSIZE sistem variable to textsize. More...
Acad::ErrorStatus  | setTextstyle (AcDbObjectId)
Sets the current textstyle to given textstyle; this sets variable TEXTSTYKE,. More...
Acad::ErrorStatus  | setThickness (double)
Sets THICKNESS value for this database. More...
Acad::ErrorStatus  | setThumbnailBitmap (void *)
Sets the database's thumbnail preview image to provided image. More...
Acad::ErrorStatus  | setTilemode (bool)
Sets the TILEMODE variable for the database to given value. More...
 Acad::ErrorStatus  | setTileModeLightSynch (Adesk::UInt8)
Acad::ErrorStatus  | setTimeZone (AcDb::TimeZone)
Sets the timezone value for this database. More...
 Acad::ErrorStatus  | setTimeZoneAsUtcOffset (double)
Acad::ErrorStatus  | setTracewid (double)
Sets TRACEWID value for this database. More...
Acad::ErrorStatus  | setTreedepth (Adesk::Int16)
Sets the current value of TREEDEPTH database variable. More...
Acad::ErrorStatus  | setTStackAlign (int)
Sets the current value of TSTACKALIGN database variable. More...
Acad::ErrorStatus  | setTStackSize (int)
Sets the current value of TSTACKSIZE database variable. More...
Acad::ErrorStatus  | setUcs (const AcGePoint3d &, const AcGeVector3d &, const AcGeVector3d &)
Sets the UCS for the current database. More...
Acad::ErrorStatus  | setUcsBase (AcDbObjectId)
Sets id, which is the objectId of an AcDbUcsTableRecord to determine the value of UCSBASE system variable. More...
Acad::ErrorStatus  | setUnitmode (Adesk::Int16)
Sets the UNITMODE value for this database. More...
Acad::ErrorStatus  | setUseri1 (Adesk::Int16)
Sets the USERI1 variable value. More...
Acad::ErrorStatus  | setUseri2 (Adesk::Int16)
Sets the USERI2 variable value. More...
Acad::ErrorStatus  | setUseri3 (Adesk::Int16)
Sets the USERI3 variable value. More...
Acad::ErrorStatus  | setUseri4 (Adesk::Int16)
Sets the USERI4 variable value. More...
Acad::ErrorStatus  | setUseri5 (Adesk::Int16)
Sets the USERI5 variable value. More...
Acad::ErrorStatus  | setUserr1 (double)
Sets the USERR1 system variable. More...
Acad::ErrorStatus  | setUserr2 (double)
Sets the USERR2 system variable. More...
Acad::ErrorStatus  | setUserr3 (double)
Sets the USERR3 system variable. More...
Acad::ErrorStatus  | setUserr4 (double)
Sets the USERR4 system variable. More...
Acad::ErrorStatus  | setUserr5 (double)
Sets the USERR5 system variable. More...
Acad::ErrorStatus  | setUsrtimer (bool)
The function sets the USRTIMER database variable to enabled or disabled. More...
 Acad::ErrorStatus  | setVersionGuid (const ACHAR *)
Acad::ErrorStatus  | setViewportScaleDefault (double)
Sets the current value of PSVPSCALE database variable. More...
Acad::ErrorStatus  | setVisretain (bool)
Sets the current value of VISRETAIN database variable. More...
 Acad::ErrorStatus  | setWorldPucsBaseOrigin (const AcGePoint3d &, AcDb::OrthographicView)
 Acad::ErrorStatus  | setWorldUcsBaseOrigin (const AcGePoint3d &, AcDb::OrthographicView)
Acad::ErrorStatus  | setWorldview (bool)
Sets the current value of WORLDVIEW database variable. More...
Acad::ErrorStatus  | setXrefEditEnabled (bool)
Sets the current value of XEDIT database variable. More...
Adesk::Int16  | shadedge () const
Returns the current value of SHADEDGE database variable. More...
Adesk::Int16  | shadedif () const
Returns the current value of SHADEDIF database variable. More...
 double  | shadowPlaneLocation () const
 Adesk::UInt8  | showHist () const
double  | sketchinc () const
Returns SKETCHINC value of this database. More...
bool  | skpoly () const
Returns the current value of SKPOLY database variable. More...
 Adesk::UInt8  | solidHist () const
Adesk::UInt8  | sortEnts () const
This function return for curent database variable sortens. More...
bool  | splframe () const
Returns the value of SPLFRAME system variable for this database. More...
Adesk::Int16  | splinesegs () const
Returns value of system variable SPLINESEGS. More...
Adesk::Int16  | splinetype () const
Gets the value of SPLINETYPE system variable. More...
 double  | stepSize () const
 double  | stepsPerSec () const
Adesk::Int16  | surftab1 () const
Returns the current value of SURFTAB1 database variable. More...
Adesk::Int16  | surftab2 () const
Returns the current value of SURFTAB2 database variable. More...
Adesk::Int16  | surftype () const
Returns the current value of SURFTYPE database variable. More...
Adesk::Int16  | surfu () const
Returns the current value of SURFU database variable. More...
Adesk::Int16  | surfv () const
Returns the current value of SURFV database variable. More...
AcDbObjectId  | tablestyle () const
Returns the ObjectId of the table style specified by CTABLESTYLE system variable. More...
AcDbObjectId  | tableStyleDictionaryId () const
Returns id of the tableStyles dictionary. More...
const AcDbDate  | tdcreate () const
Gets the TDCREATE system variable. More...
const AcDbDate  | tdindwg () const
Gets the TDINDWG system variable. More...
const AcDbDate  | tducreate () const
Gets the TDUCREATE system variable. More...
const AcDbDate  | tdupdate () const
Gets the TDUPDATE system variable. More...
const AcDbDate  | tdusrtimer () const
Gets the TDUSRTIMER system variable. More...
const AcDbDate  | tduupdate () const
Gets the TDUUPDATE system variable. More...
double  | textsize () const
Gets the TEXTSIZE value. More...
AcDbObjectId  | textstyle () const
Returns the objectId of the current textstyle, which is set in the drawing variable TEXTSTYLE. More...
AcDbObjectId  | textStyleTableId () const
Returns the TextStyle Table objectId. More...
double  | thickness () const
Returns THICKNESS value of this database. More...
void *  | thumbnailBitmap () const
Returns the database's thumbnail preview image, or NULL if no preview is available. More...
bool  | tilemode () const
Returns the current TILEMODE value for the database. More...
 Adesk::UInt8  | tileModeLightSynch () const
AcDb::TimeZone  | timeZone () const
Returns the timezone setting for this database. More...
double  | tracewid () const
Returns TRACEWID value of this database. More...
AcDbTransactionManager *  | transactionManager () const
Returns a pointer to the AcDbTransactionManager for this database. More...
Adesk::Int16  | treedepth () const
Returns the current value of TREEDEPTH database variable. More...
int  | tstackalign () const
Returns the current value of TSTACKALIGN database variable. More...
int  | tstacksize () const
Returns the current value of TSTACKSIZE database variable. More...
AcDbObjectId  | ucsBase () const
Returns objectId of the AcDbUcsTableRecord, that corresponds to current UCSBASE system variable. More...
AcDbObjectId  | ucsname () const
Gets the objectId of the currently active UCS table entry for the modelspace. More...
AcGePoint3d  | ucsorg () const
Returns point which is the current Model Space UCSORG System Variable value for this database. More...
AcDbObjectId  | UCSTableId () const
Returns the UCS Table objectId. More...
AcGeVector3d  | ucsxdir () const
Returns the 3d vector of the current UCS x direction (modelspace). More...
AcGeVector3d  | ucsydir () const
Returns the 3d vector of the current UCS y direction (modelspace). More...
 AcDbUndoController *  | undoController () const
bool  | undoRecording () const
Returns whether Undo recording is active for this database. More...
Adesk::Int16  | unitmode () const
Returns the UNITMODE value for this database. More...
 Acad::ErrorStatus  | updateDataLink (AcDb::UpdateDirection, AcDb::UpdateOption)
Acad::ErrorStatus  | updateExt (bool=false)
Calculates the extents of all entities in this database. More...
Adesk::Int16  | useri1 () const
Gets the USERI1 variable value. More...
Adesk::Int16  | useri2 () const
Gets the USERI2 variable value. More...
Adesk::Int16  | useri3 () const
Gets the USERI3 variable value. More...
Adesk::Int16  | useri4 () const
Gets the USERI4 variable value. More...
Adesk::Int16  | useri5 () const
Gets the USERI5 variable value. More...
double  | userr1 () const
Gets the USERR1 system variable. More...
double  | userr2 () const
Gets the USERR2 system variable. More...
double  | userr3 () const
Gets the USERR3 system variable. More...
double  | userr4 () const
Gets the USERR4 system variable. More...
double  | userr5 () const
Gets the USERR5 system variable. More...
bool  | usrtimer () const
The function returns the value for USRTIMER database variable. More...
double  | viewportScaleDefault () const
Returns the current value of PSVPSCALE database variable. More...
AcDbObjectId  | viewportTableId () const
Returns the Viewport Table objectId. More...
AcDbObjectId  | viewTableId () const
Returns the View Table objectId. More...
bool  | visretain () const
Returns the current value of VISRETAIN database variable. More...
AcDbObjectId  | visualStyleDictionaryId () const
Returns id of the visualStyles dictionary. More...
Acad::ErrorStatus  | wblock (AcDbDatabase *&)
Writes the contents of this database into a new database. More...
Acad::ErrorStatus  | wblock (AcDbDatabase *&, AcDbObjectId)
Writes the contents of an AcDbBlockTableRecord into a new database. More...
Acad::ErrorStatus  | wblock (AcDbDatabase *&, const AcDbObjectIdArray &, const AcGePoint3d &)
Writes an array of objects into a new database. More...
Acad::ErrorStatus  | wblock (AcDbDatabase *, const AcDbObjectIdArray &, const AcGePoint3d &, AcDb::DuplicateRecordCloning)
Writes an array of objects into an existing database. More...
Acad::ErrorStatus  | wblockCloneObjects (AcDbObjectIdArray &, AcDbObjectId &, AcDbIdMapping &, AcDb::DuplicateRecordCloning, bool=false)
'wblockCloneObjects' deep-clones the objects in objectIdArray to the owner clonesOwnerId; wblockCloning also clones referenced objects, allows for cloning between different databases. More...
Acad::ErrorStatus  | wblockCloneObjects (const AcDbObjectIdArray &, const AcDbObjectId &, AcDbIdMapping &, AcDb::DuplicateRecordCloning, bool=false)
'wblockCloneObjects' deep-clones the objects in objectIdArray to the owner clonesOwnerId; wblockCloning also clones referenced objects, allows for cloning between different databases. More...
 AcGePoint3d  | worldPucsBaseOrigin (AcDb::OrthographicView) const
 AcGePoint3d  | worldUcsBaseOrigin (AcDb::OrthographicView) const
bool  | worldview () const
Returns the current value of WORLDVIEW database variable. More...
AcDbObjectId  | xrefBlockId () const
Gets the object id of the block table record which references this xref database. More...
bool  | xrefEditEnabled () const
Returns the current value of XEDIT database variable. More...
 virtual  | ~AcDbDatabase ()
Destructor.
 Public Member Functions inherited from AcRxObject
virtual AcRxObject *  | clone () const
Exported and implemented. More...
 virtual AcRx::Ordering  | comparedTo (const AcRxObject *) const
Exported and implemented.
virtual Acad::ErrorStatus  | copyFrom (const AcRxObject *)
Exported and implemented. More...
 virtual AcRxClass *  | isA () const
Exported and implemented.
virtual Adesk::Boolean  | isEqualTo (const AcRxObject *) const
Exported and implemented. More...
bool  | isKindOf (const AcRxClass *) const
Checks the object class. More...
AcRxObject *  | queryX (const AcRxClass *) const
returns the protocol extension object assigned to this class or a parent class. More...
AcRxObject *  | x (const AcRxClass *) const
returns the protocol extension object assigned to this class or a parent class. More...
 virtual  | ~AcRxObject ()
Destructor.
 Static Public Member Functions
 static void  | disposeSecurityParams (const SecurityParams *)
Releases any resources allocated by the security parameters (strings); pSecParams must originate from AcDbDatabase::cloneSecurityParams() call !
static AcDb::LineWeight  | getNearestLineWeight (int)
Returns the nearest defined lineweight for a given lineweight value (in 100th of millimeter) More...
 static bool  | isObjectNonPersistent (AcDbObjectId)
static bool  | isValidLineWeight (int)
Checks whether lw is a predefined lineweight. More...
 static Acad::ErrorStatus  | markObjectNonPersistent (AcDbObjectId, bool)
 Static Public Member Functions inherited from AcRxObject
 static AcRxObject *  | cast (const AcRxObject *)
 static AcRxClass *  | desc ()
Exported and implemented.
 Static Public Member Functions inherited from AcHeapOperators
 static void  | operator delete (void *)
_
 static void  | operator delete (void *, const char *, int)
 static void  | operator delete (void *, void *)
 static void  | operator delete[] (void *)
_
 static void  | operator delete[] (void *, const char *, int)
 static void *  | operator new (size_t)
_
 static void *  | operator new (size_t, const char *, int)
 static void *  | operator new (size_t, void *p)
 static void *  | operator new[] (size_t)
_
 static void *  | operator new[] (size_t, const char *, int)
 Public Attributes
AcDbDatabase
Default constructor. More...
 Additional Inherited Members
 Protected Member Functions inherited from AcRxObject
AcRxObject ()
Exported and implemented.
Detailed Description
_
Member Function Documentation
◆ abortDeepClone()
 UX_EXPORT_FUNCTION void AcDbDatabase::abortDeepClone  |  ( |  AcDbIdMapping &  |  objectIdMap | )
This function initiates an 'abortDeepClone' editor reactor event.
Parameters
[in] | objectIdMap | used in deepClone/wblockClone operation
Remarks
this function does not interrupt any deepClone/wblockClone operation !
◆ addAcDbObject() [1/2]
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbDatabase::addAcDbObject  |  ( |  AcDbObject *  |  pAcObjectToAdd | )
Adds an object to the database, giving it a handle and an object ID.
The object ID is not returned and in order to set ownership it needs to be obtained differently.
Parameters
[in] | pAcDbObjectToAdd | object to add.
Returns
Acad::eOk if successful,
 Acad::eAlreadyInDb if the object is already in the database
◆ addAcDbObject() [2/2]
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbDatabase::addAcDbObject  |  ( |  AcDbObjectId &  |  objectId,
|  AcDbObject *  |  pAcObjectToAdd
)
Adds an object to the database, giving it a handle and an object ID.
Parameters
[out] | objectId | new object ID
[in] | pAcDbObjectToAdd | object to add.
Returns
Acad::eOk if successful,
 Acad::eWrongObjectType if the object is an entity and its owner isn't a BTR,
 Acad::eAlreadyInDb if the object is already in the database
◆ addReactor()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbDatabase::addReactor  |  ( |  AcDbDatabaseReactor *  |  pAcReactorToAdd | ) |   const
Adds a database reactor.
Parameters
[in] | pAcReactorToAdd | reactor to add.
Returns
Acad::eOk for success, or error status otherwise
◆ angbase()
 UX_EXPORT_FUNCTION double AcDbDatabase::angbase  |  ( |   | ) |   const
Gets the ANGBASE system variable.
Returns
variable value
◆ angdir()
 UX_EXPORT_FUNCTION bool AcDbDatabase::angdir  |  ( |   | ) |   const
Gets the ANGDIR system variable.
Returns
variable value
◆ annoAllVisible()
 UX_EXPORT_FUNCTION bool AcDbDatabase::annoAllVisible  |  ( |   | ) |   const
Returns the current value of ANNOALLVISIBLE database variable.
Returns
true / false
◆ annotativeDwg()
 UX_EXPORT_FUNCTION bool AcDbDatabase::annotativeDwg  |  ( |   | ) |   const
Returns the current value of ANNOTATIVEDWG database variable.
Returns
true / false
◆ approxNumObjects()
 UX_EXPORT_FUNCTION int AcDbDatabase::approxNumObjects  |  ( |   | ) |   const
Returns the approximated number of objects in this database.
Returns
approx. number of objects in this database
◆ attdia()
 UX_EXPORT_FUNCTION bool AcDbDatabase::attdia  |  ( |   | ) |   const
Returns ATTDIA value of drawing editor.
Returns
true, if ATTDIA value is 1, false otherwise
Remarks
ATTDIA is not database stored - but mimics this to keep compatibility
◆ attmode()
 UX_EXPORT_FUNCTION Adesk::Int16 AcDbDatabase::attmode  |  ( |   | ) |   const
Gets the ATTMODE system variable.
ATTMODE = displaying of attributes.
Returns
current value of the ATTMODE system variable
◆ attreq()
 UX_EXPORT_FUNCTION bool AcDbDatabase::attreq  |  ( |   | ) |   const
Returns the current value of ATTREQ system variable.
Returns
value of ATTREQ
◆ audit()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbDatabase::audit  |  ( |  AcDbAuditInfo *  |  pAuditInfo | )
This function runs the audit operation on this database.
Parameters
[in] | pAuditInfo | controls audit operation and receives audit status
Returns
Acad::eOk for success or error status otherwise
◆ aunits()
 UX_EXPORT_FUNCTION Adesk::Int16 AcDbDatabase::aunits  |  ( |   | ) |   const
Gets the value of AUNITS system variable.
Returns
Adesk::Int16 value of AUNITS system variable
◆ auprec()
 UX_EXPORT_FUNCTION Adesk::Int16 AcDbDatabase::auprec  |  ( |   | ) |   const
Gets the value of AUPREC system variable.
Returns
Adesk::Int16 value of AUPREC system variable
◆ blipmode()
 UX_EXPORT_FUNCTION bool AcDbDatabase::blipmode  |  ( |   | ) |   const
Returns BLIPMODE value of this database.
Returns
BLIPMODE value of the database
◆ blockTableId()
 UX_EXPORT_FUNCTION AcDbObjectId AcDbDatabase::blockTableId  |  ( |   | ) |   const
Returns the Block Table objectId.
Returns
objectId of the table
◆ byBlockLinetype()
 UX_EXPORT_FUNCTION AcDbObjectId AcDbDatabase::byBlockLinetype  |  ( |   | ) |   const
Gets the objectId of the "ByBlock" linetype.
Returns
AcDbObjectId of the AcDbLinetypeTableRecord for the "ByBlock" linetype.
◆ byBlockMaterial()
 UX_EXPORT_FUNCTION AcDbObjectId AcDbDatabase::byBlockMaterial  |  ( |   | ) |   const
Gets the objectId of the "ByBlock" material.
Returns
AcDbObjectId of the "ByBlock" material.
◆ byLayerLinetype()
 UX_EXPORT_FUNCTION AcDbObjectId AcDbDatabase::byLayerLinetype  |  ( |   | ) |   const
Gets the objectId of the "ByLayer" linetype.
Returns
AcDbObjectId of the AcDbLinetypeTableRecord for the "ByLayer" linetype.
◆ byLayerMaterial()
 UX_EXPORT_FUNCTION AcDbObjectId AcDbDatabase::byLayerMaterial  |  ( |   | ) |   const
Gets the objectId of the "ByLayer" material.
Returns
AcDbObjectId of the "ByLayer" material.
◆ cannoscale()
 UX_EXPORT_FUNCTION AcDbAnnotationScale * AcDbDatabase::cannoscale  |  ( |   | ) |   const
Returns the current annotation scale object of this database (CANNOSCALE).
Returns
a copy of current annotation scale object, to be deleted by caller
◆ cecolor()
 UX_EXPORT_FUNCTION AcCmColor AcDbDatabase::cecolor  |  ( |   | ) |   const
Gets the CECOLOR value for the database.
Returns
current entity color
◆ celtscale()
 UX_EXPORT_FUNCTION double AcDbDatabase::celtscale  |  ( |   | ) |   const
Gets the CELTSCALE value.
Returns
drawing value.
◆ celtype()
 UX_EXPORT_FUNCTION AcDbObjectId AcDbDatabase::celtype  |  ( |   | ) |   const
Gets the objectId of the linetype pointed by CELTYPE system variable.
Returns
linetype objectId
◆ celweight()
 UX_EXPORT_FUNCTION AcDb::LineWeight AcDbDatabase::celweight  |  ( |   | ) |   const
Gets the CELWEIGHT value.
Returns
drawing value.
◆ cetransparency()
 UX_EXPORT_FUNCTION AcCmTransparency AcDbDatabase::cetransparency  |  ( |   | ) |   const
Returns the current entity transparency (CETRANSPARENCY).
Returns
transparency
◆ chamfera()
 UX_EXPORT_FUNCTION double AcDbDatabase::chamfera  |  ( |   | ) |   const
Gets the CHAMFERA variable value.
Returns
variable value
◆ chamferb()
 UX_EXPORT_FUNCTION double AcDbDatabase::chamferb  |  ( |   | ) |   const
Gets the CHAMFERB variable value.
Returns
variable value
◆ chamferc()
 UX_EXPORT_FUNCTION double AcDbDatabase::chamferc  |  ( |   | ) |   const
Gets the CHAMFERC variable value.
Returns
variable value
◆ chamferd()
 UX_EXPORT_FUNCTION double AcDbDatabase::chamferd  |  ( |   | ) |   const
Gets the CHAMFERD variable value.
Returns
variable value
◆ clayer()
 UX_EXPORT_FUNCTION AcDbObjectId AcDbDatabase::clayer  |  ( |   | ) |   const
Returns the objectId of the current layer, which is set in the drawing variable CLAYER.
Returns
ObjectId of the current layer
◆ cloneSecurityParams()
 UX_EXPORT_FUNCTION const SecurityParams * AcDbDatabase::cloneSecurityParams  |  ( |   | )
Retrieves the security parameters as used by this database.
Returns
a copy of security parameters as used by the database; if no security parameters are assigned to the database, NULL is returned
 a pointer to allocated SecurityParams structure
◆ closeInput()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbDatabase::closeInput  |  ( |  bool  |  bClose = false | )
Parameters
[in] | bClose | boolean value indicating whether to close the drawing file.
Returns
Acad::eOk if successful
◆ cmaterial()
 UX_EXPORT_FUNCTION AcDbObjectId AcDbDatabase::cmaterial  |  ( |   | ) |   const
Returns the value of CMATERIAL system variable for this database.
Returns
the current material id for this database
◆ cmljust()
 UX_EXPORT_FUNCTION Adesk::Int16 AcDbDatabase::cmljust  |  ( |   | ) |   const
Gets the CMLJUST system variable.
CMLJUST = default justification for new multiline entities.
Returns
current value of the CMLJUST system variable
Remarks
allowed values are:
 0 - Top
 1 - Middle
 2 - Bottom
◆ cmlscale()
 UX_EXPORT_FUNCTION double AcDbDatabase::cmlscale  |  ( |   | ) |   const
Gets the CMLSCALE system variable.
CMLSCALE = default width scale for new multiline entities.
Returns
current value of the CMLSCALE system variable
◆ cmlstyleID()
 UX_EXPORT_FUNCTION AcDbObjectId AcDbDatabase::cmlstyleID  |  ( |   | ) |   const
Gets the CMLSTYLEID system variable.
CMLSTYLEID = default style for new multiline entities.
Returns
current value of the CMLSTYLEID system variable
◆ colorDictionaryId()
 UX_EXPORT_FUNCTION AcDbObjectId AcDbDatabase::colorDictionaryId  |  ( |   | ) |   const
Returns id of the color dictionary.
Returns
objectId of the dictionary, or AcDbObjectId::kNull
◆ continuousLinetype()
 UX_EXPORT_FUNCTION AcDbObjectId AcDbDatabase::continuousLinetype  |  ( |   | ) |   const
Gets the objectId of the continuous linetype.
Returns
objectId of the AcDbLinetypeTableRecord for the continuous linetype.
◆ coords()
 UX_EXPORT_FUNCTION Adesk::Int16 AcDbDatabase::coords  |  ( |   | ) |   const
Returns the current value of COORDS system variable.
Returns
value of COORDS
◆ countHardReferences()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbDatabase::countHardReferences  |  ( |  const AcDbObjectIdArray &  |  objectIdArray,
|  Adesk::UInt32 *  |  pCounter
)
Function search in database for each objects whose objectId entities are in the ids array.
If a hard reference is found, the conter will be incremented by one.It result if a hard reference is found in ids[0] then pConter[0] become with +1(was increment with one). It's important to set pCounter until use it.
Parameters
[in] | It | is an array of objectId.Those objectId is entities of object
[in] | Input | an array. It have the same size as ids that will be stuffed in with the counts for each corresponding element in ids
Returns
Acad::eOk if function run well
◆ currentSpaceId()
 UX_EXPORT_FUNCTION AcDbObjectId AcDbDatabase::currentSpaceId  |  ( |   | ) |   const
Returns the objectId of the current space.
Returns
objectId of the AcDbBlockTableRecord for the current model space or paper space according to the TILEMODE value
◆ deepCloneObjects() [1/2]
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbDatabase::deepCloneObjects  |  ( |  AcDbObjectIdArray &  |  objectIdArray,
|  AcDbObjectId &  |  objectsOwnerId,
|  AcDbIdMapping &  |  outputIdPairsMap,
|  bool  |  noIdTranslation = false
)
'deepCloneObjects' clones the objects in objectIdArray to the owner objectsOwnerId.
All the objects and the clones owner have to belong to the same database
Parameters
[in] | objectIdArray | input array of objects to be cloned
[in] | objectsOwnerId | owner ID of the clones
[out] | outputIdPairsMap | output AcDbPair array for pairing the new created objects with the old ones
[in] | noIdTranslation | flag to control the ID translation
Returns
Acad::eOk
Remarks
◆ deepCloneObjects() [2/2]
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbDatabase::deepCloneObjects  |  ( |  const AcDbObjectIdArray &  |  objectIdArray,
|  const AcDbObjectId &  |  objectsOwnerId,
|  AcDbIdMapping &  |  outputIdPairsMap,
|  bool  |  noIdTranslation = false
)
'deepCloneObjects' clones the objects in objectIdArray to the owner objectsOwnerId.
All the objects and the clones owner have to belong to the same database
Parameters
[in] | objectIdArray | input array of objects to be cloned
[in] | objectsOwnerId | owner ID of the clones
[out] | outputIdPairsMap | output AcDbPair array for pairing the new created objects with the old ones
[in] | noIdTranslation | flag to control the ID translation
Returns
Acad::eOk
◆ delUsedObj()
 UX_EXPORT_FUNCTION Adesk::Int16 AcDbDatabase::delUsedObj  |  ( |   | ) |   const
Returns the current value of DELUSEDOBJ system variable.
Returns
value of DELUSEDOBJ
◆ detailViewStyleDictionaryId()
 UX_EXPORT_FUNCTION AcDbObjectId AcDbDatabase::detailViewStyleDictionaryId  |  ( |   | ) |   const
Returns id of the DetailViewStyle dictionary.
Returns
objectId of the dictionary, or AcDbObjectId::kNull
◆ dimaso()
 UX_EXPORT_FUNCTION bool AcDbDatabase::dimaso  |  ( |   | ) |   const
Returns value of DIMASO system variable.
Returns
value of DIMASO system variable
◆ dimAssoc()
 UX_EXPORT_FUNCTION Adesk::UInt8 AcDbDatabase::dimAssoc  |  ( |   | ) |   const
Returns the current value of DIMASSOC database variable.
Returns
value of DIMASSOC
◆ dimfit()
 UX_EXPORT_FUNCTION int AcDbDatabase::dimfit  |  ( |   | ) |   const
Gets the variables DIMATFIT of the current database.
Parameters
[in] | fitValue | fit value (must be between 0 and 5)
Returns
Acad::eOk, if successful
◆ dimsho()
 UX_EXPORT_FUNCTION bool AcDbDatabase::dimsho  |  ( |   | ) |   const
Returns value of DIMSHO system variable.
Returns
value of DIMSHO system variable
◆ dimstyle()
 UX_EXPORT_FUNCTION AcDbObjectId AcDbDatabase::dimstyle  |  ( |   | ) |   const
Gets the DIMSTYLE system variable.
Returns
the ObjectId of the DIMSTYLE dimension style
◆ dimStyleTableId()
 UX_EXPORT_FUNCTION AcDbObjectId AcDbDatabase::dimStyleTableId  |  ( |   | ) |   const
Returns the DimStyle Table objectId.
Returns
objectId of the table
◆ dimunit()
 UX_EXPORT_FUNCTION int AcDbDatabase::dimunit  |  ( |   | ) |   const
Gets the variables DIMUNIT of the current database.
Parameters
[in] | fitValue | fit value (must be between 0 and 5)
Returns
Acad::eOk, if successful
◆ disablePartialOpen()
 UX_EXPORT_FUNCTION void AcDbDatabase::disablePartialOpen  |  ( |   | )
Calling this function during AcRxEventReractor::partialOpenNotice() cancels the open operation.
Note
the database core does not use nor support partial open, so disablePartialOpen() has no effect (but provided for compatibility)
◆ dispSilh()
 UX_EXPORT_FUNCTION bool AcDbDatabase::dispSilh  |  ( |   | ) |   const
Gets DISPSILH system variable.
Returns
current value of DISPSILH system variable (false is off is 0, true is on is 1)
◆ dragmode()
 UX_EXPORT_FUNCTION Adesk::Int16 AcDbDatabase::dragmode  |  ( |   | ) |   const
Returns the current value of DRAGMODE system variable.
Returns
value of DRAGMODE
◆ drawOrderCtl()
 UX_EXPORT_FUNCTION Adesk::UInt8 AcDbDatabase::drawOrderCtl  |  ( |   | ) |   const
The function returns the value for DRAWORDERCTL database variable.
Returns
value in range 0-3
◆ dwfframe()
 UX_EXPORT_FUNCTION Adesk::UInt8 AcDbDatabase::dwfframe  |  ( |   | ) |   const
The function returns the DWFFRAME database variable.
Returns
DWFFRAME value (0,1,2)
◆ dwgFileWasSavedByAutodeskSoftware()
 UX_EXPORT_FUNCTION bool AcDbDatabase::dwgFileWasSavedByAutodeskSoftware  |  ( |   | ) |   const
Determines if the file was last saved by AutoCAD.
Returns
true if last saved by AutoCAD, false otherwise
◆ dxfIn()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbDatabase::dxfIn  |  ( |  const ACHAR *  |  name,
|  const ACHAR *  |  logName = NULL
)
Reads a dxf file into the database.
Parameters
[in] | name | DXF file name
[in] | logName | not yet supported, for now only NULL is accepted
Returns
Acad::eOk if successful
 Acad::eInvalidInput if name is NULL
 Acad::eBadDxfFile if name is empty or pointing to a non-existing file.
◆ dxfOut()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbDatabase::dxfOut  |  ( |  const ACHAR *  |  name,
|  const int  |  accuracy = 16,
|  AcDb::AcDbDwgVersion  |  dbVersion = AcDb::kDHL_CURRENT,
|  const bool  |  saveThumbnail = false
)
Saves data from the database into dxf file format.
Parameters
[in] | name | flie name for saving in current directory or file path to save in chosen location
[in] | accuracy | 0..16 bits of precision, or -1 to save as binary dxf
[in] | dbVersion | database version to be used
[in] | saveThumbnail | indicates whether to save thumbnail image in dxf
Returns
Acad::eOk if successful
 Acad::eInvalidInput if passed NULL for name or invalid value for precision
 Acad::eFileAccessErr if passed an empty or invalid string for a name.
◆ elevation()
 UX_EXPORT_FUNCTION double AcDbDatabase::elevation  |  ( |   | ) |   const
Returns ELEVATION value of this database model space.
Returns
Model space ELEVATION value of the database
◆ endCaps()
 UX_EXPORT_FUNCTION AcDb::EndCaps AcDbDatabase::endCaps  |  ( |   | ) |   const
Returns the 'endCaps' value of this database.
Returns
endCaps value
◆ extmax()
 UX_EXPORT_FUNCTION AcGePoint3d AcDbDatabase::extmax  |  ( |   | ) |   const
Gets the EXTMAX system variable.
EXTMAX = upper-right corner of the extents of the Model Space.
Returns
point being the EXTMAX
◆ extmin()
 UX_EXPORT_FUNCTION AcGePoint3d AcDbDatabase::extmin  |  ( |   | ) |   const
Gets the EXTMIN system variable.
EXTMIN = lower-left corner of the extents of the Model Space.
Returns
point being the EXTMIN
◆ facetres()
 UX_EXPORT_FUNCTION double AcDbDatabase::facetres  |  ( |   | ) |   const
Returns FACETRES value of this database.
Returns
FACETRES value of the database
◆ filletrad()
 UX_EXPORT_FUNCTION double AcDbDatabase::filletrad  |  ( |   | ) |   const
Returns FILLETRAD value of this database.
Returns
FILLETRAD value of the database
◆ fillmode()
 UX_EXPORT_FUNCTION bool AcDbDatabase::fillmode  |  ( |   | ) |   const
Gets the FILLMODE system variable set for this database.
Returns
the value of FILLMODE
◆ forceWblockDatabaseCopy()
 UX_EXPORT_FUNCTION void AcDbDatabase::forceWblockDatabaseCopy  |  ( |   | )
Empty implementation.
This function ensures that objects are always copied during wblock cloning.
◆ getAcDbObjectId()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbDatabase::getAcDbObjectId  |  ( |  AcDbObjectId &  |  acId,
|  bool  |  create,
|  const AcDbHandle &  |  acHandle,
|  Adesk::UInt32  |  reserved = 0
)
Gets the objectId from a handle.
Parameters
[out] | acId | resulting objectId
[in] | create | has always be set to false
[in] | acHandle | Handle to look for the objectId
[in] | reserved | not used
Returns
Acad::eOk, if successful
 appropriate error code else
◆ getBlockTable() [1/2]
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbDatabase::getBlockTable  |  ( |  AcDbBlockTable *&  |  pTable,
|  AcDb::OpenMode  |  eMode = AcDb::kForRead
)
Returns the Block Table of the Database.
Parameters
[out] | pTable | requested Symbol Table
[in] | eMode | mode to get
◆ getBlockTable() [2/2]
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbDatabase::getBlockTable  |  ( |  AcDbSymbolTable *&  |  pBlockTable,
|  AcDb::OpenMode  |  openmode = AcDb::kForRead
)
Returns the Block Table of the Database.
Parameters
[out] | pBlockTable | requested Symbol Table
[in] | openmode | mode to get
◆ getCePlotStyleNameId()
 UX_EXPORT_FUNCTION AcDb::PlotStyleNameType AcDbDatabase::getCePlotStyleNameId  |  ( |  AcDbObjectId &  |  plotStyleId | ) |   const
Gets the current plotstylenametype.
Parameters
[out] | plotStyleId | of the current plotstyle, if return value is AcDb::kPlotStyleNameById
 AcDbObjectId::kNull otherwise
Returns
one of AcDb::kPlotStyleNameByLayer, AcDb::kPlotStyleNameByBlock, AcDb::kPlotStyleNameIsDictDefault, AcDb::kPlotStyleNameById
◆ getColorDictionary()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbDatabase::getColorDictionary  |  ( |  AcDbDictionary *&  |  pColorDictionary,
|  AcDb::OpenMode  |  openmode = AcDb::kForRead
)
Returns the Color Dictionary opened in the openmode specified by openmode.
Parameters
[out] | pColorDictionary | opened dictionary or NULL
[in] | openmode | kForRead or kForWrite or kForNotify
Returns
Acad::eOk if dictionary can be opened
 errorcode returned by acdbOpenAcDbObject else
◆ getDetailViewStyleDictionary()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbDatabase::getDetailViewStyleDictionary  |  ( |  AcDbDictionary *&  |  pDetailViewStyleDict,
|  AcDb::OpenMode  |  mode = AcDb::kForRead
)
Returns the DetailViewStyle Dictionary opened in the openmode specified by openmode.
Parameters
[out] | pDetailViewStyleDict | opened dictionary or NULL
[in] | mode | kForRead or kForWrite or kForNotify
Returns
Acad::eOk if dictionary can be opened
 errorcode returned by acdbOpenAcDbObject else
◆ getDimpost()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbDatabase::getDimpost  |  ( |  ACHAR *&  |  dimvalue | ) |   const
Gets the value of DIMPOST system variable.
Parameters
[out] | dimvalue | value of DIMPOST system variable
Returns
Acad::eOk, if successful
◆ getDimstyleChildId()
 UX_EXPORT_FUNCTION AcDbObjectId AcDbDatabase::getDimstyleChildId  |  ( |  const AcRxClass *  |  pDimClass,
|  AcDbObjectId &  |  parentStyle
) |   |  const
Returns the child dimension style if available, parent style otherwise.
Parameters
[in] | pDimClass | desired child dimension style
[in] | parentStyle | parent dimension style
Returns
object id of the child style (parent style if no child style exists)
◆ getDimstyleData()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbDatabase::getDimstyleData  |  ( |  AcDbDimStyleTableRecord *&  |  pRecord | ) |   const
Gets the dimension variable from current database into DimStyleTableRecord pRecord.
Parameters
[out] | pRecord | existing DimStyleTableRecord where to get dimension value
Returns
Acad::eOk, if successful
◆ getDimstyleParentId()
 UX_EXPORT_FUNCTION AcDbObjectId AcDbDatabase::getDimstyleParentId  |  ( |  AcDbObjectId &  |  childStyle | ) |   const
Returns the parent dimension style.
Parameters
[in] | childStyle | child dimension style
Returns
object id of the parent style
◆ getDimStyleTable()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbDatabase::getDimStyleTable  |  ( |  AcDbSymbolTable *&  |  pDimStyleTable,
|  AcDb::OpenMode  |  openmode = AcDb::kForRead
)
Returns the DimStyle Table of the Database.
Parameters
[out] | pDimStyleTable | requested Symbol Table
[in] | openmode | mode to get
◆ getFilename()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbDatabase::getFilename  |  ( |  const ACHAR *&  |  pFilename | ) |   const
Gets the drawing file name.
param[out] pFilename the drawings file name.
◆ getFingerprintGuid()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbDatabase::getFingerprintGuid  |  ( |  ACHAR *&  |  guidString | ) |   const
Returns the 'FingerPrintGuid' of this database.
Parameters
[out] | guidString | - allocated GUID string, should be deallocated by caller using acutDelString()
Returns
Acad::eOk, or error status
◆ getGroupDictionary()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbDatabase::getGroupDictionary  |  ( |  AcDbDictionary *&  |  pGroupDictionary,
|  AcDb::OpenMode  |  openmode = AcDb::kForRead
)
Returns the Group Dictionary opened in the openmode specified by openmode.
Parameters
[out] | pGroupDictionary | opened dictionary or NULL
[in] | openmode | kForRead or kForWrite or kForNotify
Returns
Acad::eOk if dictionary can be opened
 errorcode returned by acdbOpenAcDbObject else
◆ getHyperlinkBase()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbDatabase::getHyperlinkBase  |  ( |  ACHAR *&  |  pathString | ) |   const
Gets the value of HYPERLINKBASE variable.
Parameters
[out] | pathString | current value of HYPERLINKBASE variable
Returns
Acad::eOk if successful
◆ getLayerTable()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbDatabase::getLayerTable  |  ( |  AcDbSymbolTable *&  |  pLayerTable,
|  AcDb::OpenMode  |  openmode = AcDb::kForRead
)
Returns the Layer Table of the Database.
Parameters
[out] | pLayerTable | requested Symbol Table
[in] | openmode | mode to get
◆ getLayoutDictionary()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbDatabase::getLayoutDictionary  |  ( |  AcDbDictionary *&  |  pLayoutDictionary,
|  AcDb::OpenMode  |  openmode = AcDb::kForRead
)
Returns the Layout Dictionary opened in the openmode specified by openmode.
Parameters
[out] | pLayoutDictionary | opened dictionary or NULL
[in] | openmode | kForRead or kForWrite or kForNotify
Returns
Acad::eOk if dictionary can be opened
 errorcode returned by acdbOpenAcDbObject else
◆ getLinetypeTable()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbDatabase::getLinetypeTable  |  ( |  AcDbSymbolTable *&  |  pLinetypeTable,
|  AcDb::OpenMode  |  openmode = AcDb::kForRead
)
Returns the Linetype Table of the Database.
Parameters
[out] | pLinetypeTable | requested Symbol Table
[in] | openmode | mode to get
◆ getMaterialDictionary()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbDatabase::getMaterialDictionary  |  ( |  AcDbDictionary *&  |  pMaterialDictionary,
|  AcDb::OpenMode  |  openmode = AcDb::kForRead
)
Returns the Material Dictionary opened in the openmode specified by openmode.
Parameters
[out] | pMaterialDictionary | opened dictionary or NULL
[in] | openmode | kForRead or kForWrite or kForNotify
Returns
Acad::eOk if dictionary can be opened
 errorcode returned by acdbOpenAcDbObject else
◆ getMenu()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbDatabase::getMenu  |  ( |  ACHAR *&  |  menu | ) |   const
Returns the current value of MENUNAME database variable.
Parameters
[in] | menu | current menu name
Returns
Acad::eOk, or error status
◆ getMLeaderStyleDictionary()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbDatabase::getMLeaderStyleDictionary  |  ( |  AcDbDictionary *&  |  pMLeaderStyleDict,
|  AcDb::OpenMode  |  mode = AcDb::kForRead
)
Returns the MLeaderStyle Dictionary opened in the openmode specified by openmode.
Parameters
[out] | pMLeaderStyleDict | opened dictionary or NULL
[in] | mode | kForRead or kForWrite or kForNotify
Returns
Acad::eOk if dictionary can be opened
 errorcode returned by acdbOpenAcDbObject else
◆ getMLStyleDictionary()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbDatabase::getMLStyleDictionary  |  ( |  AcDbDictionary *&  |  pMLStyleDictionary,
|  AcDb::OpenMode  |  openmode = AcDb::kForRead
)
Returns the MlineStyle Dictionary opened in the openmode specified by openmode.
Parameters
[out] | pMLStyleDictionary | opened dictionary or NULL
[in] | openmode | kForRead or kForWrite or kForNotify
Returns
Acad::eOk if dictionary can be opened
 errorcode returned by acdbOpenAcDbObject else
◆ getNamedObjectsDictionary()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbDatabase::getNamedObjectsDictionary  |  ( |  AcDbDictionary *&  |  pNamedObjectsDictionary,
|  AcDb::OpenMode  |  openmode = AcDb::kForRead
)
Returns the NamedObjects Dictionary opened in the openmode specified by openmode.
Parameters
[out] | pNamedObjectsDictionary | opened dictionary or NULL
[in] | openmode | kForRead or kForWrite or kForNotify
Returns
Acad::eOk if dictionary can be opened
 errorcode returned by acdbOpenAcDbObject else
◆ getNearestLineWeight()
 UX_EXPORT_FUNCTION AcDb::LineWeight AcDbDatabase::getNearestLineWeight  |  ( |  int  |  givenLineWeight | )
static
Returns the nearest defined lineweight for a given lineweight value (in 100th of millimeter)
Parameters
[in] | givenLineWeight | lineweight to query for (in 100th of a millimeter)
Returns
the nearest defined lineweight
◆ getPlotSettingsDictionary()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbDatabase::getPlotSettingsDictionary  |  ( |  AcDbDictionary *&  |  pPlotSettingsDictionary,
|  AcDb::OpenMode  |  openmode = AcDb::kForRead
)
Returns the PlotSettings Dictionary opened in the openmode specified by openmode.
Parameters
[out] | pPlotSettingsDictionary | opened dictionary or NULL
[in] | openmode | kForRead or kForWrite or kForNotify
Returns
Acad::eOk if dictionary can be opened
 errorcode returned by acdbOpenAcDbObject else
◆ getPlotStyleNameDictionary()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbDatabase::getPlotStyleNameDictionary  |  ( |  AcDbDictionaryWithDefault *&  |  pPlotStyleNameDictionary,
|  AcDb::OpenMode  |  openmode = AcDb::kForRead
)
Returns the PlotStyleName Dictionary opened in the openmode specified by openmode.
Parameters
[out] | pPlotStyleNameDictionary | opened dictionary or NULL
[in] | openmode | kForRead or kForWrite or kForNotify
Returns
Acad::eOk if dictionary can be opened
 errorcode returned by acdbOpenAcDbObject else
◆ getProjectName()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbDatabase::getProjectName  |  ( |  ACHAR *&  |  project | ) |   const
Returns the current value of PROJECTNAME database variable.
Parameters
[in] | project | current project name
Returns
Acad::eOk, or error status
◆ getRegAppTable()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbDatabase::getRegAppTable  |  ( |  AcDbSymbolTable *&  |  pRegAppTable,
|  AcDb::OpenMode  |  openmode = AcDb::kForRead
)
Returns the RegApp Table of the Database.
Parameters
[out] | pRegAppTable | requested Symbol Table
[in] | openmode | mode to get
◆ getScaleListDictionary()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbDatabase::getScaleListDictionary  |  ( |  AcDbDictionary *&  |  pScaleListDict,
|  AcDb::OpenMode  |  mode = AcDb::kForRead
)
Returns the ScaleList Dictionary opened in the openmode specified by openmode.
Parameters
[out] | pScaleListDict | opened dictionary or NULL
[in] | mode | kForRead or kForWrite or kForNotify
Returns
Acad::eOk if dictionary can be opened
 errorcode returned by acdbOpenAcDbObject else
◆ getSectionManager() [1/2]
 UX_EXPORT_FUNCTION AcDbObjectId AcDbDatabase::getSectionManager  |  ( |   | ) |   const
Returns the object ID of the section manager.
Returns
ID may be null if the database has never contained any section planes since creation
◆ getSectionManager() [2/2]
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbDatabase::getSectionManager  |  ( |  AcDbSectionManager *&  |  pMgr,
|  AcDb::OpenMode  |  mode = AcDb::kForRead
) |   |  const
Gets a pointer to the section manager object.
Parameters
[in] | pMgr | output pointer to receive the manager object
[in] | input | mode in which to open the object
Returns
Acad::eOk if successful Acad::eKeyNotFound if the database has never contained any section planes since creation
◆ getSectionViewStyleDictionary()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbDatabase::getSectionViewStyleDictionary  |  ( |  AcDbDictionary *&  |  pSectionViewStyleD,
|  AcDb::OpenMode  |  mode = AcDb::kForRead
)
Returns the SectionViewStyleD Dictionary opened in the openmode specified by openmode.
Parameters
[out] | pSectionViewStyleD | opened dictionary or NULL
[in] | mode | kForRead or kForWrite or kForNotify
Returns
Acad::eOk if dictionary can be opened
 errorcode returned by acdbOpenAcDbObject else
◆ getStyleSheet()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbDatabase::getStyleSheet  |  ( |  ACHAR *&  |  value | ) |   const
Gets the STYLESHEET system variable of this database object.
Parameters
[out] | value | value of STYLESHEET system variable
Returns
Acad::eOk if successful, otherwise a corresponding error code will be returned
◆ getSymbolTable() [1/9]
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbDatabase::getSymbolTable  |  ( |  AcDbBlockTable *&  |  pBlockTable,
|  AcDb::OpenMode  |  openmode = AcDb::kForRead
)
Opens the block table in the openmode specified by openmode.
Parameters
[out] | pBlockTable | opened block table or NULL
[in] | openmode | mode to open
Returns
Acad::eOk if successful
 Acad::eWasOpenForWrite, if block table could not be opened in the specified mode
◆ getSymbolTable() [2/9]
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbDatabase::getSymbolTable  |  ( |  AcDbDimStyleTable *&  |  pDimStyleTable,
|  AcDb::OpenMode  |  openmode = AcDb::kForRead
)
Opens the dimstyle table in the openmode specified by openmode.
Parameters
[out] | pDimStyleTable | opened dimstyle table or NULL
[in] | openmode | mode to open
Returns
Acad::eOk if successful
 Acad::eWasOpenForWrite, if dimstyle table could not be opened in the specified mode
◆ getSymbolTable() [3/9]
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbDatabase::getSymbolTable  |  ( |  AcDbLayerTable *&  |  pLayerTable,
|  AcDb::OpenMode  |  openmode = AcDb::kForRead
)
Opens the layer table in the openmode specified by openmode.
Parameters
[out] | pLayerTable | opened layer table or NULL
[in] | openmode | mode to open
Returns
Acad::eOk if successful
 Acad::eWasOpenForWrite, if layer table could not be opened in the specified mode
◆ getSymbolTable() [4/9]
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbDatabase::getSymbolTable  |  ( |  AcDbLinetypeTable *&  |  pLinetypeTable,
|  AcDb::OpenMode  |  openmode = AcDb::kForRead
)
Opens the linetype table in the openmode specified by openmode.
Parameters
[out] | pLinetypeTable | opened linetype table or NULL
[in] | openmode | mode to open
Returns
Acad::eOk if successful
 Acad::eWasOpenForWrite, if linetype table could not be opened in the specified mode
◆ getSymbolTable() [5/9]
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbDatabase::getSymbolTable  |  ( |  AcDbRegAppTable *&  |  pRegAppTable,
|  AcDb::OpenMode  |  openmode = AcDb::kForRead
)
Opens the regapp table in the openmode specified by openmode.
Parameters
[out] | pRegAppTable | opened regapp table or NULL
[in] | openmode | mode to open
Returns
Acad::eOk if successful
 Acad::eWasOpenForWrite, if regapp table could not be opened in the specified mode
◆ getSymbolTable() [6/9]
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbDatabase::getSymbolTable  |  ( |  AcDbTextStyleTable *&  |  pTextStyleTable,
|  AcDb::OpenMode  |  openmode = AcDb::kForRead
)
Opens the textstyle table in the openmode specified by openmode.
Parameters
[out] | pTextStyleTable | opened textstyle table or NULL
[in] | openmode | mode to open
Returns
Acad::eOk if successful
 Acad::eWasOpenForWrite, if textstyle table could not be opened in the specified mode
◆ getSymbolTable() [7/9]
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbDatabase::getSymbolTable  |  ( |  AcDbUCSTable *&  |  pUCSTable,
|  AcDb::OpenMode  |  openmode = AcDb::kForRead
)
Opens the UCS table in the openmode specified by openmode.
Parameters
[out] | pUCSTable | opened UCS table or NULL
[in] | openmode | mode to open
Returns
Acad::eOk if successful
 Acad::eWasOpenForWrite, if UCS table could not be opened in the specified mode
◆ getSymbolTable() [8/9]
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbDatabase::getSymbolTable  |  ( |  AcDbViewportTable *&  |  pViewportTable,
|  AcDb::OpenMode  |  openmode = AcDb::kForRead
)
Opens the viewport table in the openmode specified by openmode.
Parameters
[out] | pViewportTable | opened viewport table or NULL
[in] | openmode | mode to open
Returns
Acad::eOk if successful
 Acad::eWasOpenForWrite, if viewport table could not be opened in the specified mode
◆ getSymbolTable() [9/9]
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbDatabase::getSymbolTable  |  ( |  AcDbViewTable *&  |  pViewTable,
|  AcDb::OpenMode  |  openmode = AcDb::kForRead
)
Opens the view table in the openmode specified by openmode.
Parameters
[out] | pViewTable | opened view table or NULL
[in] | openmode | mode to open
Returns
Acad::eOk if successful
 Acad::eWasOpenForWrite, if block view could not be opened in the specified openmode
◆ getTableStyleDictionary()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbDatabase::getTableStyleDictionary  |  ( |  AcDbDictionary *&  |  pTableStyleDictionary,
|  AcDb::OpenMode  |  openmode
)
Returns the TableStyle Dictionary opened in the openmode specified by openmode.
Parameters
[out] | pTableStyleDictionary | opened dictionary or NULL
[in] | openmode | kForRead or kForWrite or kForNotify
Returns
Acad::eOk if dictionary can be opened
 errorcode returned by acdbOpenAcDbObject else
◆ getTextStyleTable()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbDatabase::getTextStyleTable  |  ( |  AcDbSymbolTable *&  |  pTextStyleTable,
|  AcDb::OpenMode  |  openmode = AcDb::kForRead
)
Returns the TextStyle Table of the Database.
Parameters
[out] | pTextStyleTable | requested Symbol Table
[in] | openmode | mode to get
◆ getUCSTable()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbDatabase::getUCSTable  |  ( |  AcDbSymbolTable *&  |  pUCSTable,
|  AcDb::OpenMode  |  openmode = AcDb::kForRead
)
Returns the UCS Table of the Database.
Parameters
[out] | pUCSTable | requested Symbol Table
[in] | openmode | mode to get
◆ getVersionGuid()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbDatabase::getVersionGuid  |  ( |  ACHAR *&  |  guidString | ) |   const
Returns the 'VersionGuid' of this database.
Parameters
[out] | guidString | allocated GUID string, should be deallocated by caller using acutDelString()
Returns
Acad::eOk, or error status
◆ getViewportArray()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbDatabase::getViewportArray  |  ( |  AcDbObjectIdArray &  |  viewportArray,
|  bool  |  getPspaceViewports = true
) |   |  const
Gets AcDbViewport objects contained in this database and appends them to the array.
Parameters
[out] | viewportArray | array containing object ids of AcDbViewport objects
[in] | getPspaceViewports | flag indicating whether to include paperspace viewports
Returns
Acad::eOk if successful
◆ getViewportTable()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbDatabase::getViewportTable  |  ( |  AcDbSymbolTable *&  |  pViewportTable,
|  AcDb::OpenMode  |  openmode = AcDb::kForRead
)
Returns the Viewport Table of the Database.
Parameters
[out] | pViewportTable | requested Symbol Table
[in] | openmode | mode to get
◆ getViewTable()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbDatabase::getViewTable  |  ( |  AcDbSymbolTable *&  |  pViewTable,
|  AcDb::OpenMode  |  openmode = AcDb::kForRead
)
Returns the View Table of the Database.
Parameters
[out] | pViewTable | requested Symbol Table
[in] | openmode | mode to get
◆ getVisualStyleDictionary()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbDatabase::getVisualStyleDictionary  |  ( |  AcDbDictionary *&  |  pVisualStyleDictionary,
|  AcDb::OpenMode  |  openmode = AcDb::kForRead
)
Returns the Visualstyle Dictionary opened in the openmode specified by openmode.
Parameters
[out] | pVisualStyleDictionary | opened dictionary or NULL
[in] | openmode | kForRead or kForWrite or kForNotify
Returns
Acad::eOk if dictionary can be opened
 errorcode returned by acdbOpenAcDbObject else
◆ getVisualStyleList()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbDatabase::getVisualStyleList  |  ( |  AcArray< const ACHAR * > &  |  pVisualStyleList | )
Returns a list of localized names of the visual styles.
Parameters
[out] | pVisualStyleList | the list of localized names of the visual styles
Returns
Acad::eOk if successful
 Acad::eKeyNotFound if the visual style dictionary doesn't exist
 Acad::eWasOpenForWrite if the visual style dictionary was previously opened for write
◆ globalMaterial()
 UX_EXPORT_FUNCTION AcDbObjectId AcDbDatabase::globalMaterial  |  ( |   | ) |   const
Gets the objectId of the global material.
Returns
AcDbObjectId of the global material.
◆ groupDictionaryId()
 UX_EXPORT_FUNCTION AcDbObjectId AcDbDatabase::groupDictionaryId  |  ( |   | ) |   const
Returns id of the group dictionary.
Returns
objectId of the dictionary, or AcDbObjectId::kNull
◆ gsModel()
 UX_EXPORT_FUNCTION AcGsModel * AcDbDatabase::gsModel  |  ( |   | ) |   const
Returns the AcGsModel associated with this database.
Returns
pointer to the AcGsModel associated with this database
◆ handseed()
 UX_EXPORT_FUNCTION AcDbHandle AcDbDatabase::handseed  |  ( |   | ) |   const
Returns the next available handle value.
Returns
next available handle value for database
◆ hpInherit()
 UX_EXPORT_FUNCTION bool AcDbDatabase::hpInherit  |  ( |   | ) |   const
Returns the value of HPINHERIT system variable for this database.
Returns
the current setting for HPINHERIT (true or false) for this database
◆ hpOrigin()
 UX_EXPORT_FUNCTION AcGePoint2d AcDbDatabase::hpOrigin  |  ( |   | ) |   const
Returns the value of HPORIGIN system variable for this database.
Returns
the current matial id for this database
◆ insbase()
 UX_EXPORT_FUNCTION AcGePoint3d AcDbDatabase::insbase  |  ( |   | ) |   const
Gets the INSBASE variable value (model space).
Returns
insertion base point in WCS.
◆ insert() [1/3]
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbDatabase::insert  |  ( |  AcDbObjectId &  |  outBlockId,
|  const ACHAR *  |  pNewBlockName,
|  AcDbDatabase *  |  pSourceDb,
|  bool  |  keepSourceUnchanged = true
)
Inserts the source database pSourceDb as a new block table record.
Parameters
[out] | outBlockId | Id of the resulting block table record.
[in] | pNewBlockName | Name to give to the new block table record.
[in] | pSourceDb | Database to insert.
[in] | keepSourceUnchanged | flag controlling, whether the input is copied or moved.
Returns
◆ insert() [2/3]
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbDatabase::insert  |  ( |  AcDbObjectId &  |  outBlockId,
|  const ACHAR *  |  pSourceBlockName,
|  const ACHAR *  |  pNewBlockName,
|  AcDbDatabase *  |  pSourceDb,
|  bool  |  keepSourceUnchanged = true
)
Creates a new block table record with the entities of a block table record out of a source database.
Parameters
[out] | outBlockId | Id of the resulting block table record.
[in] | pSourceBlockName | Name of the block table record to insert.
[in] | pNewBlockName | Name to give to the new block table record.
[in] | pSourceDb | Database where pSourceBlockName comes from.
[in] | keepSourceUnchanged | flag controlling, whether the input is copied or moved.
Returns
Acad::eKeyNotFound if pSourceBlockName not found in pSourceDb
 Acad::eInvalidKey if pSourceBlockName or pNewBlockName are NULL or if NewBlockName is an empty string.
 Acad::eNullObjectPointer if pSourceDb is NULL.
 Acad::eInvalidOwnerObject, if pSourceDb is this database and a block with pSourceBlockName exists. But some copying had been done.
 Acad::eSelfReference if pNewBlockName is contained in pSourceBlockName
◆ insert() [3/3]
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbDatabase::insert  |  ( |  const AcGeMatrix3d &  |  transfMatrix,
|  AcDbDatabase *  |  pSourceDb,
|  bool  |  keepSourceUnchanged = true
)
Inserts all Model Space objects of the source database to the calling database.
All objects get transformed using the transfMatrix matrix via their transformBy() function.
Parameters
[in] | transfMatrix | transformation matrix to apply on the insert action
[in] | pSourceDb | source database.
[in] | keepSourceUnchanged | not used.
Returns
Acad::eOk if successful.
Remarks
Passing a non uniform scaling matrix as transfMatrix may result in exploding of block references. Other entities may be converted as to allow non uniform scaling. Circle to Ellipse, etc. Parameter keepSourceUnchanged is not used. Entities from the source database are never erased.
◆ insunits()
 UX_EXPORT_FUNCTION AcDb::UnitsValue AcDbDatabase::insunits  |  ( |   | ) |   const
Gets the INSUNITS value.
Returns
enum AcDb::UnitsValue
◆ isEMR()
 UX_EXPORT_FUNCTION bool AcDbDatabase::isEMR  |  ( |   | ) |   const
Returns true or false whether this database object was created by an educational version of the application.
Returns
@ true: if the drawing was saved by an EMR product at least once @ false: if the drawing was never saved by an EMR product
◆ isolines()
 UX_EXPORT_FUNCTION Adesk::Int16 AcDbDatabase::isolines  |  ( |   | ) |   const
Returns ISOLINES value of this database.
Returns
ISOLINES value of the database
◆ isPartiallyOpened()
 UX_EXPORT_FUNCTION bool AcDbDatabase::isPartiallyOpened  |  ( |   | ) |   const
Returns whether this database is opened partially.
Returns
partially opened state
◆ isPucsOrthographic()
 UX_EXPORT_FUNCTION bool AcDbDatabase::isPucsOrthographic  |  ( |  AcDb::OrthographicView &  |  view | ) |   const
Checks whether the current paper space UCS has an orthographic view with respect to PUCSBASE.
Parameters
[out] | view | the orthographic view direction
Returns
true if an orthographic view is available
◆ isUcsOrthographic()
 UX_EXPORT_FUNCTION bool AcDbDatabase::isUcsOrthographic  |  ( |  AcDb::OrthographicView &  |  view | ) |   const
Checks whether the current UCS has an orthographic view with respect to UCSBASE.
Parameters
[out] | view | the orthographic view direction
Returns
true if an orthographic view is available
◆ isUndoing()
 UX_EXPORT_FUNCTION bool AcDbDatabase::isUndoing  |  ( |   | ) |   const
Returns whether this database is in undoing state.
Returns
bool - true, if the database is just undoing (or redoing), false otherwise
◆ isValidLineWeight()
 UX_EXPORT_FUNCTION bool AcDbDatabase::isValidLineWeight  |  ( |  int  |  lw | )
static
Checks whether lw is a predefined lineweight.
Parameters
[in] | lw | lineweight to check for in 100th of a millimeter
Returns
true, if lw is a predefined lineweight, false if not.
Remarks
-3, -2 and -1 are valid, as they represent kLnWtByLwDefault, kLnWtByBlock and kLnWtByLayer
◆ joinStyle()
 UX_EXPORT_FUNCTION AcDb::JoinStyle AcDbDatabase::joinStyle  |  ( |   | ) |   const
Returns the 'joinStyle' value of this database.
Returns
joinStyle value
◆ lastSavedAsMaintenanceVersion()
 UX_EXPORT_FUNCTION AcDb::MaintenanceReleaseVersion AcDbDatabase::lastSavedAsMaintenanceVersion  |  ( |   | ) |   const
Returns the dwg file maintenance version of this database when last "save as" to disk.
Returns
maintenance version of file when it was last stored by "save as"
◆ lastSavedAsVersion()
 UX_EXPORT_FUNCTION AcDb::AcDbDwgVersion AcDbDatabase::lastSavedAsVersion  |  ( |   | ) |   const
Returns the dwg file version of this database when last "save as" to disk.
Returns
version of file when it was last stored by "save as"
◆ latitude()
 UX_EXPORT_FUNCTION double AcDbDatabase::latitude  |  ( |   | ) |   const
It returns in decimal degrees the location of the model (latitude).
It is used to calculate angle for sunlight , together with longitude north direction date and time.
Returns
latitude. It is posible to be between -180 to +180 degrees It have positiv value for east latitude.
◆ layerTableId()
 UX_EXPORT_FUNCTION AcDbObjectId AcDbDatabase::layerTableId  |  ( |   | ) |   const
Returns the Layer Table objectId.
Returns
objectId of the table
◆ layerZero()
 UX_EXPORT_FUNCTION AcDbObjectId AcDbDatabase::layerZero  |  ( |   | ) |   const
Returns the objectId of Layer "0".
Returns
AcDbObjectId of layer "0"
◆ layoutDictionaryId()
 UX_EXPORT_FUNCTION AcDbObjectId AcDbDatabase::layoutDictionaryId  |  ( |   | ) |   const
Returns id of the layout dictionary.
Returns
objectId of the dictionary, or AcDbObjectId::kNull
◆ limcheck()
 UX_EXPORT_FUNCTION bool AcDbDatabase::limcheck  |  ( |   | ) |   const
Returns the LIMCHECK system variable of this database object.
Returns
false for 0, true for 1
◆ limmax()
 UX_EXPORT_FUNCTION AcGePoint2d AcDbDatabase::limmax  |  ( |   | ) |   const
Gets the LIMMAX value.
Returns
LIMMAX point
◆ limmin()
 UX_EXPORT_FUNCTION AcGePoint2d AcDbDatabase::limmin  |  ( |   | ) |   const
Gets the LIMMIN value.
Returns
LIMMIN point
◆ linetypeTableId()
 UX_EXPORT_FUNCTION AcDbObjectId AcDbDatabase::linetypeTableId  |  ( |   | ) |   const
Returns the Linetype Table objectId.
Returns
objectId of the table
◆ lineWeightDisplay()
 UX_EXPORT_FUNCTION bool AcDbDatabase::lineWeightDisplay  |  ( |   | ) |   const
Returns true if line weight display is on or false if it is off.
Returns
current value of the LWDISPLAY system variable
◆ loadLineTypeFile()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbDatabase::loadLineTypeFile  |  ( |  const ACHAR *  |  linetypeName,
|  const ACHAR *  |  pFileName
)
Loads a linetype.
Parameters
[in] | linetypeName | Name of the linetype
[in] | pFileName | Name of the file, where linetypeName is defined.
Returns
Acad::eNullObjectPointer if one of the arguments is NULL
 Acad::eFileSystemErr if the file pFilename can not be opened
 Acad::eUndefinedLineType if the linetype linetypeName is not defined in pFilename
 Acad::eBadLinetypeName if there is a syntax error in the file
 Acad::eDuplicateRecordName if a linetype with name linetypeName already exists in this database.
 Internet specific error status, if pFilename is an URL and content can not be transferred
 Acad::eOk if successful
◆ loftAng1()
 UX_EXPORT_FUNCTION double AcDbDatabase::loftAng1  |  ( |   | ) |   const
Gets the value of LOFTANG1 system variable.
Returns
value of the system variable
◆ loftAng2()
 UX_EXPORT_FUNCTION double AcDbDatabase::loftAng2  |  ( |   | ) |   const
Gets the value of LOFTANG2 system variable.
Returns
value of the system variable
◆ loftMag1()
 UX_EXPORT_FUNCTION double AcDbDatabase::loftMag1  |  ( |   | ) |   const
Gets the value of LOFTMAG1 system variable.
Returns
value of the system variable
◆ loftMag2()
 UX_EXPORT_FUNCTION double AcDbDatabase::loftMag2  |  ( |   | ) |   const
Gets the value of LOFTMAG2 system variable.
Returns
value of the system variable
◆ loftNormals()
 UX_EXPORT_FUNCTION Adesk::UInt8 AcDbDatabase::loftNormals  |  ( |   | ) |   const
Gets the value of LOFTNORMALS system variable.
Returns
value of the system variable
◆ loftParam()
 UX_EXPORT_FUNCTION Adesk::UInt16 AcDbDatabase::loftParam  |  ( |   | ) |   const
Gets the value of LOFTPARAM system variable.
Returns
value of the system variable
◆ longitude()
 UX_EXPORT_FUNCTION double AcDbDatabase::longitude  |  ( |   | ) |   const
It returns in decimal degrees the location of the model (longitude).
It is used to calculate angle for sunlight , together with latitude north direction date and time.
Returns
longitude. It is posible to be between -180 to +180 degrees It have positiv value for east longitude.
◆ ltscale()
 UX_EXPORT_FUNCTION double AcDbDatabase::ltscale  |  ( |   | ) |   const
Gets the LTSCALE value.
Returns
value
◆ lunits()
 UX_EXPORT_FUNCTION Adesk::Int16 AcDbDatabase::lunits  |  ( |   | ) |   const
Gets the value of LUNITS system variable.
Returns
Adesk::Int16 value of LUNITS system variable
◆ luprec()
 UX_EXPORT_FUNCTION Adesk::Int16 AcDbDatabase::luprec  |  ( |   | ) |   const
Gets the LUPREC value.
Returns
drawing LUPREC value.
◆ maintenanceReleaseVersion()
 UX_EXPORT_FUNCTION Adesk::UInt8 AcDbDatabase::maintenanceReleaseVersion  |  ( |   | ) |   const
Returns the point release version of this database.
Returns
point version
◆ materialDictionaryId()
 UX_EXPORT_FUNCTION AcDbObjectId AcDbDatabase::materialDictionaryId  |  ( |   | ) |   const
Returns id of the material dictionary.
Returns
objectId of the dictionary, or AcDbObjectId::kNull
◆ maxactvp()
 UX_EXPORT_FUNCTION Adesk::Int16 AcDbDatabase::maxactvp  |  ( |   | ) |   const
Returns the current value of MAXACTVP database variable.
Returns
value of MAXACTVP
◆ measurement()
 UX_EXPORT_FUNCTION AcDb::MeasurementValue AcDbDatabase::measurement  |  ( |   | ) |   const
Gets MEASUREMENT system variable.
Returns
current value of MEASUREMENT
◆ mirrtext()
 UX_EXPORT_FUNCTION bool AcDbDatabase::mirrtext  |  ( |   | ) |   const
Gets the MIRRTEXT variable value.
Returns
false is not mirrored, true is mirrored
◆ mleaderscale()
 UX_EXPORT_FUNCTION double AcDbDatabase::mleaderscale  |  ( |   | ) |   const
Returns the current MLeader scale object of this database (CMLSCALE).
Returns
the current MLeader scale of this database
◆ mleaderstyle()
 UX_EXPORT_FUNCTION AcDbObjectId AcDbDatabase::mleaderstyle  |  ( |   | ) |   const
Gets the MLEADERSTYLE system variable.
Returns
the ObjectId of the MLEADERSTYLE dimension style
◆ mleaderStyleDictionaryId()
 UX_EXPORT_FUNCTION AcDbObjectId AcDbDatabase::mleaderStyleDictionaryId  |  ( |   | ) |   const
Returns id of the NLeaderStyle dictionary.
Returns
objectId of the dictionary, or AcDbObjectId::kNull
◆ mLStyleDictionaryId()
 UX_EXPORT_FUNCTION AcDbObjectId AcDbDatabase::mLStyleDictionaryId  |  ( |   | ) |   const
Returns id of the mLStyles dictionary.
Returns
objectId of the dictionary, or AcDbObjectId::kNull
◆ msltscale()
 UX_EXPORT_FUNCTION bool AcDbDatabase::msltscale  |  ( |   | ) |   const
Gets MSLTSCALE system variable.
Returns
current value of MSLTSCALE system variable (false is off is 0, true is on is 1)
◆ namedObjectsDictionaryId()
 UX_EXPORT_FUNCTION AcDbObjectId AcDbDatabase::namedObjectsDictionaryId  |  ( |   | ) |   const
Returns id of the namedObjects dictionary.
Returns
objectId of the dictionary, or AcDbObjectId::kNull
◆ northDirection()
 double AcDbDatabase::northDirection  |  ( |   | ) |   const
Returns the North direction value for this database (angle in radians, to WCS X axis).
Returns
AcDb::TimeZone - returns one of the enum values, or AcDb::kInternationalDateLine in case of an error
◆ numberOfSaves()
 UX_EXPORT_FUNCTION Adesk::Int32 AcDbDatabase::numberOfSaves  |  ( |   | ) |   const
Returns the number of save operations for the database in active session.
Returns
bumber of saves
◆ oleStartUp()
 UX_EXPORT_FUNCTION bool AcDbDatabase::oleStartUp  |  ( |   | ) |   const
Returns the current value of OLESTARTUP database variable.
Returns
value of OLESTARTUP
◆ originalFileMaintenanceVersion()
 UX_EXPORT_FUNCTION AcDb::MaintenanceReleaseVersion AcDbDatabase::originalFileMaintenanceVersion  |  ( |   | ) |   const
Returns the dwg file maintenance version of this database as saved on disk.
Returns
maintenance version of file when it was opened
◆ originalFileName()
 UX_EXPORT_FUNCTION const ACHAR * AcDbDatabase::originalFileName  |  ( |   | ) |   const
Gets the file name as it was when it was opened.
Returns
file name
◆ originalFileSavedByMaintenanceVersion()
 UX_EXPORT_FUNCTION AcDb::MaintenanceReleaseVersion AcDbDatabase::originalFileSavedByMaintenanceVersion  |  ( |   | ) |   const
Returns the database maintenance version from which this file was saved.
Returns
maintenance version of database when file was saved
◆ originalFileSavedByVersion()
 UX_EXPORT_FUNCTION AcDb::AcDbDwgVersion AcDbDatabase::originalFileSavedByVersion  |  ( |   | ) |   const
Returns the database version from which this file was saved.
Returns
version of database when file was saved
◆ originalFileVersion()
 UX_EXPORT_FUNCTION AcDb::AcDbDwgVersion AcDbDatabase::originalFileVersion  |  ( |   | ) |   const
Returns the dwg file version of this database as saved on disk.
Returns
version of file when it was opened
◆ orthomode()
 UX_EXPORT_FUNCTION bool AcDbDatabase::orthomode  |  ( |   | ) |   const
Gets the ORTHOMODE system value.
Returns
orthomode
◆ paperSpaceVportId()
 UX_EXPORT_FUNCTION AcDbObjectId AcDbDatabase::paperSpaceVportId  |  ( |   | ) |   const
Returns the objectId of the paperspace viewport of the database.
Returns
objectId of the AcDbBlockTableRecord for the paperspace viewport
◆ pdmode()
 UX_EXPORT_FUNCTION Adesk::Int16 AcDbDatabase::pdmode  |  ( |   | ) |   const
Gets the value of PDMODE system variable.
Returns
Adesk::Int16 mode of point display
◆ pdsize()
 UX_EXPORT_FUNCTION double AcDbDatabase::pdsize  |  ( |   | ) |   const
Gets the value of PDSIZE system variable.
Returns
double size of point display
◆ pelevation()
 UX_EXPORT_FUNCTION double AcDbDatabase::pelevation  |  ( |   | ) |   const
Returns PELEVATION value of this database model space.
Returns
Paper space PELEVATION value of the database
◆ pextmax()
 UX_EXPORT_FUNCTION AcGePoint3d AcDbDatabase::pextmax  |  ( |   | ) |   const
Gets the PEXTMAX system variable set for this database.
Returns
the value of PEXTMAX
◆ pextmin()
 UX_EXPORT_FUNCTION AcGePoint3d AcDbDatabase::pextmin  |  ( |   | ) |   const
Gets the PEXTMIN system variable set for this database.
Returns
the value of PEXTMIN
◆ pickstyle()
 UX_EXPORT_FUNCTION Adesk::Int16 AcDbDatabase::pickstyle  |  ( |   | ) |   const
The variable PICKSTYLE is no database variable.
This function returns value of system variable PICKSTYLE.
Returns
value of PICKSTYLE
◆ pinsbase()
 UX_EXPORT_FUNCTION AcGePoint3d AcDbDatabase::pinsbase  |  ( |   | ) |   const
Gets the INSBASE variable value (paper space).
Returns
insertion base point in WCS.
◆ plimcheck()
 UX_EXPORT_FUNCTION bool AcDbDatabase::plimcheck  |  ( |   | ) |   const
Returns the current value of paperspace LIMCHECK database variable.
Returns
false for 0, true for 1
◆ plimmax()
 UX_EXPORT_FUNCTION AcGePoint2d AcDbDatabase::plimmax  |  ( |   | ) |   const
Returns the LIMMAX system variable of this database object.
Returns
An AcGePoint2d, which is the upper-right corner of the grid limits for the current paper space.
◆ plimmin()
 UX_EXPORT_FUNCTION AcGePoint2d AcDbDatabase::plimmin  |  ( |   | ) |   const
Returns the LIMMIN system variable of this database object.
Returns
An AcGePoint2d, which is the lower-left corner of the grid limits for the current paper space
◆ plineEllipse()
 UX_EXPORT_FUNCTION bool AcDbDatabase::plineEllipse  |  ( |   | ) |   const
Returns the current value of PELLIPSE database variable.
Returns
value of PELLIPSE
◆ plinegen()
 UX_EXPORT_FUNCTION bool AcDbDatabase::plinegen  |  ( |   | ) |   const
Gets the value of PLINEGEN system variable.
Returns
the value of PLINEGEN
◆ plinewid()
 UX_EXPORT_FUNCTION double AcDbDatabase::plinewid  |  ( |   | ) |   const
Returns PLINEWID value of this database.
Returns
PLINEWID value of the database
◆ plotSettingsDictionaryId()
 UX_EXPORT_FUNCTION AcDbObjectId AcDbDatabase::plotSettingsDictionaryId  |  ( |   | ) |   const
Returns id of the plotSettings dictionary.
Returns
objectId of the dictionary, or AcDbObjectId::kNull
◆ plotStyleMode()
 UX_EXPORT_FUNCTION bool AcDbDatabase::plotStyleMode  |  ( |   | ) |   const
Determines whether the drawing database is in color-dependent or named plotstyles plotting mode.
Returns
true if database is in color-dependent mode; false if in named plotstyles mode
◆ plotStyleNameDictionaryId()
 UX_EXPORT_FUNCTION AcDbObjectId AcDbDatabase::plotStyleNameDictionaryId  |  ( |   | ) |   const
Returns id of the plotStyleNames dictionary.
Returns
objectId of the dictionary, or AcDbObjectId::kNull
◆ psltscale()
 UX_EXPORT_FUNCTION bool AcDbDatabase::psltscale  |  ( |   | ) |   const
Gets PSLTSCALE system variable.
Returns
current value of PSLTSCALE system variable (false is off is 0, true is on is 1)
◆ pucsBase()
 UX_EXPORT_FUNCTION AcDbObjectId AcDbDatabase::pucsBase  |  ( |   | ) |   const
Gets the objectId of the currently active UCS table entry for the paperspace.
Returns
AcDbObjectId of the UCS table record currently used for paperspace (PUCSNAME)
◆ pucsname()
 UX_EXPORT_FUNCTION AcDbObjectId AcDbDatabase::pucsname  |  ( |   | ) |   const
Gets the objectId of the currently active UCS table entry for the paperspace.
Returns
AcDbObjectId of the UCS table record currently used for paperspace (UCSNAME in paperspace)
◆ pucsorg()
 UX_EXPORT_FUNCTION AcGePoint3d AcDbDatabase::pucsorg  |  ( |   | ) |   const
Returns point which is the current Paper Space UCSORG System Variable value for this database.
Returns
UCSORG value
Remarks
To get value for Model Space, use AcDbDatabase::ucsorg() function.
◆ pucsxdir()
 UX_EXPORT_FUNCTION AcGeVector3d AcDbDatabase::pucsxdir  |  ( |   | ) |   const
Returns the 3d vector of the current UCS x direction (paperspace).
Returns
AcGeVector3d
◆ pucsydir()
 UX_EXPORT_FUNCTION AcGeVector3d AcDbDatabase::pucsydir  |  ( |   | ) |   const
Returns the 3d vector of the current UCS y direction (paperspace).
Returns
AcGeVector3d
◆ purge()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbDatabase::purge  |  ( |  AcDbObjectIdArray &  |  objectIdArray | )
Removes objectIds' from the array objectIdArray that are hard referenced in the database.
Therefore it leaves objectids in objectIdArray of objects that can be safely erased.
Parameters
[in,out] | objectIdArray | of objects to check for hard reference.
Returns
Acad::eOk if successful
◆ qtextmode()
 UX_EXPORT_FUNCTION bool AcDbDatabase::qtextmode  |  ( |   | ) |   const
Returns the current value of QTEXTMODE database variable.
Returns
value of QTEXTMODE
◆ readDwgFile() [1/2]
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbDatabase::readDwgFile  |  ( |  const ACHAR *  |  pFilename,
|  const int  |  shareflag = _SH_DENYWR,
|  bool  |  codePageConversionAllowed = false,
|  const ACHAR *  |  pPassword = NULL
)
Reads the drawing in the database.
Only call it with an empty database created with the first argument of the constructor (createMinimalCompleteDwg) set to false.
Remarks
BrxApi in any case fails if called with a non empty database. Other database engines may succeed. But it should not be done either.
Parameters
[in] | pFilename | file to read in
[in] | shareflag | the way other programs may access the file pFilename, as long it is opened by this function
 one of _SH_DENYRW, _SH_DENYWR, _SH_DENYRD, _SH_DENYNO
[in] | codePageConversionAllowed | conversion from other code pages allowed
[in] | pPassword | drawing password for pFilename
Returns
Acad::eOk if successful,
 appropriate error code else
◆ readDwgFile() [2/2]
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbDatabase::readDwgFile  |  ( |  const ACHAR *  |  pFilename,
|  OpenMode  |  shareMode,
|  bool  |  codePageConversionAllowed = false,
|  const ACHAR *  |  pPassword = NULL
)
Reads the drawing in the database.
Only call it with an empty database created with the first argument of the constructor (createMinimalCompleteDwg) set to false.
Remarks
BrxApi in any case fails if called with a non empty database. Other database engines may succeed. But it should not be done either.
Parameters
[in] | pFilename | file to read in
[in] | shareMode | the way other programs may access the file pFilename, as long it is opened by this function, one of kForReadAndReadShare, kForReadAndWriteNoShare, kForReadAndAllShare or kTryForReadShare
[in] | codePageConversionAllowed | conversion from other code pages allowed
[in] | pPassword | drawing password for pFilename
Returns
Acad::eOk if successful, or appropriate error code
◆ reclaimMemoryFromErasedObjects()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbDatabase::reclaimMemoryFromErasedObjects  |  ( |  const AcDbObjectIdArray &  |  objects | )
Releases extra memory for specified erased database objects.
Returns
Acad::eOk always, no real memory cleanup in BricsCAD (would violate undo logic)
◆ regAppTableId()
 UX_EXPORT_FUNCTION AcDbObjectId AcDbDatabase::regAppTableId  |  ( |   | ) |   const
Returns the RegApp Table objectId.
Returns
objectId of the table
◆ regenmode()
 UX_EXPORT_FUNCTION bool AcDbDatabase::regenmode  |  ( |   | ) |   const
Returns true if REGENMODE is on or false if it is off.
REGENMODE = automatic regeneration.
Returns
current value of the REGENMODE system variable
◆ removeReactor()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbDatabase::removeReactor  |  ( |  AcDbDatabaseReactor *  |  pAcReactorToRem | ) |   const
Removes a database reactor.
Parameters
[in] | pAcReactorToRem | reactor to remove
Returns
Acad::eOk for success, or error status otherwise
◆ restoreForwardingXrefSymbols()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbDatabase::restoreForwardingXrefSymbols  |  ( |   | )
The function sets the xref back to a valid situation.
Returns
Acad::eOk or eNotApplicable or eNotHandled
◆ restoreOriginalXrefSymbols()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbDatabase::restoreOriginalXrefSymbols  |  ( |   | )
The function set all data in database with the value until we open the file.
Table and Records for blocks, layers, linetypes, text styles, dimension styles are afected. If It use restoreForwardingXrefSymbols() call after releaseFile() It will be not multiple calls to restore the symbols.
Returns
Acad::eOk or eNotApplicable or eNotHandled
◆ retainOriginalThumbnailBitmap()
 UX_EXPORT_FUNCTION bool AcDbDatabase::retainOriginalThumbnailBitmap  |  ( |   | ) |   const
Returns whether the generation of any new thumbnail bitmap is suppressed - that is, the database will always try to keep the original thumbnail bitmap (if existing).
Returns
true, if the database will keep the original thumbnail bitmap, false otherwise
Remarks
the default setting for this database flag is 'false'
◆ save()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbDatabase::save  |  ( |   | )
Saves the database.
Returns
Acad::eOk if successful
 Acad::eFileInternalErr if the database has no filename
 Acad::eFileAccessErr if the file can not be saved due to file access problems
◆ saveAs() [1/2]
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbDatabase::saveAs  |  ( |  const ACHAR *  |  name,
|  const bool  |  doBackup,
|  const AcDb::AcDbDwgVersion  |  dwgVer = AcDb::kDHL_CURRENT,
|  const SecurityParams *  |  pSecPars = NULL
)
Saves the database using specified dwg file version and security parameters if provided.
Currently, saving using SecurityParams is not implemented. File will be saved as if NULL for SecurityParams was passed.
Parameters
[in] | name | filename for saving in current directory or file path to save in chosen location
[in] | doBackup | creates a backup of current file (.bak) - ignored, .bak is always created
[in] | dwgVer | specifies the dwg file version; AcDb::kDHL_CURRENT by default
[in] | pSecPars | for encrypting and/or digital signature. Not used. Pass NULL.
Returns
Acad::eOk if successful
 Acad::eInvalidInput if passed NULL or empty string for name
 Acad::eFileAccessErr if passed an invalid string for a name. Acad::eFileSharingViolation if filename name is a file in use.
◆ saveAs() [2/2]
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbDatabase::saveAs  |  ( |  const ACHAR *  |  name,
|  const SecurityParams *  |  pSecPars = NULL
)
Saves the database using security parameters if provided.
Currently, saving using SecurityParams is not implemented. File will be saved as if NULL for SecurityParams was passed.
Parameters
[in] | name | filename for saving in current directory or file path to save in chosen location
[in] | pSecPars | for encrypting and/or digital signature. Not used. Pass NULL.
Returns
Acad::eOk if successful
 Acad::eInvalidInput if passed NULL or empty string for name
 Acad::eFileAccessErr if passed an invalid string for a name.
◆ saveproxygraphics()
 UX_EXPORT_FUNCTION Adesk::Int16 AcDbDatabase::saveproxygraphics  |  ( |   | ) |   const
Returns the PROXYGRAPHICS value for the database.
Returns
0 not to save, 1 to save proxy graphics
◆ scaleListDictionaryId()
 UX_EXPORT_FUNCTION AcDbObjectId AcDbDatabase::scaleListDictionaryId  |  ( |   | ) |   const
Returns id of the ScaleList dictionary.
Returns
objectId of the dictionary, or AcDbObjectId::kNull
◆ sectionViewStyleDictionaryId()
 UX_EXPORT_FUNCTION AcDbObjectId AcDbDatabase::sectionViewStyleDictionaryId  |  ( |   | ) |   const
Returns id of the SectionViewStyle dictionary.
Returns
objectId of the dictionary, or AcDbObjectId::kNull
◆ setAngbase()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbDatabase::setAngbase  |  ( |  double  |  newAng | )
Sets ANGBASE system variable.
Parameters
[in] | newAng | new value of the ANGBASE to set (in radians)
Returns
Acad::eOk
◆ setAngdir()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbDatabase::setAngdir  |  ( |  bool  |  newDir | )
Sets ANGDIR system variable.
Parameters
[in] | newDir | new value of the ANGDIR to set
Returns
Acad::eOk
◆ setAnnoAllVisible()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbDatabase::setAnnoAllVisible  |  ( |  bool  |  allVisible | )
Sets the current value of ANNOALLVISIBLE database variable.
Parameters
[in] | allVisible | true/false for current ANNOALLVISIBLE database variable
Returns
Acad::eOk, or error statzs
◆ setAnnotativeDwg()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbDatabase::setAnnotativeDwg  |  ( |  bool  |  asAnnotative | )
Sets the current value of ANNOTATIVEDWG database variable.
Parameters
[in] | allVisible | true/false for current ANNOTATIVEDWG database variable
Returns
Acad::eOk, or error statzs
◆ setAttdia()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbDatabase::setAttdia  |  ( |  bool  |  attdia | )
Sets ATTDIA value of drawing editor - always returns Acad::eNotApplicable, as this system variable is no longer database-resident, but stored in Registry.
Parameters
[in] | attdia | to set the ATTDIA value to
Returns
Acad:eNotApplicable always
◆ setAttmode()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbDatabase::setAttmode  |  ( |  Adesk::Int16  |  newMode | )
Sets the ATTMODE system variable.
ATTMODE = displaying of attributes.
Parameters
[in] | newMode | new value of the ATTMODE to set.
Returns
Acad::eOk, if successful
 Acad::eInvalidInput, if the value passed is out of allowed range.
Remarks
allowed values are:
 0 - All attributes are invisible.
 1 - Visible attributes are visible, and invisible attributes are invisible.
 2 - All attributes are visible.
◆ setAttreq()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbDatabase::setAttreq  |  ( |  bool  |  newVal | )
Sets the ATTREQ system variable.
Parameters
[in] | newVal | new value to set.
Returns
Acad::eOk if successful
◆ setAunits()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbDatabase::setAunits  |  ( |  Adesk::Int16  |  aunits | )
Sets the value of AUNITS system variable.
Parameters
[in] | aunits | AUNITS value
Returns
Acad::eOk, or error status
◆ setAuprec()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbDatabase::setAuprec  |  ( |  Adesk::Int16  |  auprec | )
Sets the value of AUPREC system variable.
Parameters
[in] | auprec | AUPREC value
Returns
Acad::eOk, or error status
◆ setBlipmode()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbDatabase::setBlipmode  |  ( |  bool  |  blipmode | )
Sets BLIPMODE value of drawing editor - always returns Acad::eNotApplicable, as this system variable is no longer database-resident, but stored in Registry.
Parameters
[in] | attdia | to set the ATTDIA value to
Returns
Acad:eNotApplicable always
◆ setCannoscale()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbDatabase::setCannoscale  |  ( |  AcDbAnnotationScale *  |  annoScale | )
Sets the current annotation scale object of this database (CANNOSCALE).
Parameters
[in] | annoScale | AcDbAnnotationScale object
Returns
Acad::eOk, or error statzs
◆ setCecolor()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbDatabase::setCecolor  |  ( |  const AcCmColor &  |  newColor | )
Sets the CECOLOR value for the database from given color object.
CECOLOR sets the default color value for new objects. Valid values are from 0 (BYBLOCK) over 1-255 to 256 (BYLAYER). On Creating new entities
Parameters
[in] | newColor | current entity color
Returns
Acad::eOk, Acad::eInvalidInput
◆ setCeltscale()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbDatabase::setCeltscale  |  ( |  double  |  celtScale | )
Sets the CELTSCALE value.
Parameters
[in] | celtScale | to set.
Returns
Acad::eOk, if successful
◆ setCeltype()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbDatabase::setCeltype  |  ( |  AcDbObjectId  |  celtypeId | )
Sets the LinetypeTableRecord identified by celtypeId to be the database's CELTYPE system variable.
Parameters
[in] | celtypeId | LinetypeTableRecord objectId
Returns
Acad::eOk
◆ setCelweight()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbDatabase::setCelweight  |  ( |  AcDb::LineWeight  |  celWeight | )
Sets the CELWEIGHT value.
Parameters
[in] | celWeight | value to set
Returns
Acad::eOk, if successful
◆ setCePlotStyleName()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbDatabase::setCePlotStyleName  |  ( |  AcDb::PlotStyleNameType  |  plotStyleNameType,
|  AcDbObjectId  |  id = AcDbObjectId::kNull
)
Sets the plotstylenametype value.
Parameters
[in] | plotStyleNameType | plotstylenametype to set
[in] | id | plotstyleid to set, if plotStyleNameType is AcDb::kPlotStyleNameById
 for any other plotStyleNameType value id is ignored id has to be a plotstyledictionary entry.
Returns
Acad::eOk, if successful
 Acad::eInvalidInput if plotStyleNameType is not valid or id is not valid
◆ setCetransparency()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbDatabase::setCetransparency  |  ( |  const AcCmTransparency &  |  transp | )
Sets the current entity transparency (CETRANSPARENCY).
Parameters
[in] | transp | new AcCmTransparency value
Returns
Acad::eOk or error status
◆ setChamfera()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbDatabase::setChamfera  |  ( |  double  |  newVal | )
Sets the CHAMFERA variable value.
Parameters
[in] | newVal | new Value of the CHAMFERA
Returns
Acad::eOk
◆ setChamferb()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbDatabase::setChamferb  |  ( |  double  |  newVal | )
Sets the CHAMFERB variable value.
Parameters
[in] | newVal | new Value of the CHAMFERB
Returns
Acad::eOk
◆ setChamferc()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbDatabase::setChamferc  |  ( |  double  |  newVal | )
Sets the CHAMFERC variable value.
Parameters
[in] | newVal | new Value of the CHAMFERC
Returns
Acad::eOk
◆ setChamferd()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbDatabase::setChamferd  |  ( |  double  |  newVal | )
Sets the CHAMFERD variable value.
Parameters
[in] | newVal | new Value of the CHAMFERD
Returns
Acad::eOk
◆ setClayer()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbDatabase::setClayer  |  ( |  AcDbObjectId  |  layerid | )
Sets the current layer to given layer; this sets variable CLAYER.
Parameters
[in] | layerid | of the current layer
Returns
Acad::eOk for success
◆ setCmaterial()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbDatabase::setCmaterial  |  ( |  AcDbObjectId  |  material | )
Sets CMATERIAL system variable for this database.
Parameters
[in] | material | new value for current material
Returns
Acad::eOk, or error code
◆ setCmljust()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbDatabase::setCmljust  |  ( |  Adesk::Int16  |  newJust | )
Sets the CMLJUST system variable.
CMLJUST = default justification for new multiline entities.
Parameters
[in] | newJust | new value of the CMLJUST to set.
Returns
Acad::eOk, if successful
 Acad::eInvalidInput, if the value passed is out of allowed range
◆ setCmlscale()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbDatabase::setCmlscale  |  ( |  double  |  newScale | )
Sets the CMLSCALE system variable.
CMLSCALE = default width scale for new multiline entities.
Parameters
[in] | newScale | new value of the CMLSCALE to set.
Returns
Acad::eOk
◆ setCmlstyleID()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbDatabase::setCmlstyleID  |  ( |  AcDbObjectId  |  styleId | )
Sets the CMLSTYLEID system variable.
Sets the ID styleId of the AcDbMlineStyle object to be the CMLSTYLEID (default style for new multiline entities) value for this database.
Parameters
[in] | styleId | to be set as new CMLSTYLEID value.
Returns
Acad::eOk, if successful
 Acad::eInvalidInput, if the object id passed is invalid
◆ setCoords()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbDatabase::setCoords  |  ( |  Adesk::Int16  |  newVal | )
Sets the COORDS system variable.
Parameters
[in] | newVal | new value to set.
Returns
Acad::eOk if successful
◆ setDelUsedObj()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbDatabase::setDelUsedObj  |  ( |  Adesk::Int16  |  newVal | )
Sets the DELUSEDOBJ system variable.
Parameters
[in] | newVal | new value to set.
Returns
Acad::eOk if successful
◆ setDimaso()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbDatabase::setDimaso  |  ( |  bool  |  associative | )
Sets the DIMASO variable value.
Parameters
[in] | associative | new setting for DIMASO
Returns
Acad::eOk if successful
◆ setDimAssoc()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbDatabase::setDimAssoc  |  ( |  Adesk::UInt8  |  val | )
Sets the current value of DIMASSOC database variable.
Parameters
[in] | val | new value for DIMASSOC
Returns
Acad::eOk, or error status
◆ setDimfit()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbDatabase::setDimfit  |  ( |  int  |  fitValue | )
Sets the variables DIMATFIT of the current database.
Parameters
[in] | fitValue | fit value (must be between 0 and 5)
Returns
Acad::eOk, if successful
◆ setDimsho()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbDatabase::setDimsho  |  ( |  bool  |  val | )
Sets the DIMSHO variable value.
Parameters
[in] | val | new setting for DIMSHO
Returns
Acad::eOk if successful
◆ setDimstyle()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbDatabase::setDimstyle  |  ( |  AcDbObjectId  |  dimStyleId | )
Sets the DIMSTYLE system variable.
Parameters
[in] | dimStyleId | the ObjectId of the dimension style for DIMSTYLE
Returns
Acad::eOk, or error code
◆ setDimstyleData() [1/2]
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbDatabase::setDimstyleData  |  ( |  AcDbDimStyleTableRecord *  |  pRecord | )
Sets the dimension variable from pRecord into current database.
Parameters
[in] | pRecord | pointer to DimStyleTableRecord from where to get dimension value
Returns
Acad::eOk, if successful
◆ setDimstyleData() [2/2]
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbDatabase::setDimstyleData  |  ( |  AcDbObjectId  |  objectId | )
Sets the dimension variable from DimStyleTableRecord with id objectId into current database.
Parameters
[in] | objectId | object id of DimStyleTableRecord from where to get dimension value
Returns
Acad::eOk, if successful
◆ setDimunit()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbDatabase::setDimunit  |  ( |  int  |  unitValue | )
Sets the variables DIMLUNIT and DIMFRAC of the current database.
Parameters
[in] | unitValue | unit value (must be between 1 and 8)
Returns
Acad::eOk, if successful
◆ setDispSilh()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbDatabase::setDispSilh  |  ( |  bool  |  bEnable | )
Sets DISPSILH system variable.
Parameters
[in] | bEnable | new value of DISPSILH system variable (false=off=0, true=on=1)
Returns
Acad::eOk, or error code
◆ setDragmode()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbDatabase::setDragmode  |  ( |  Adesk::Int16  |  newVal | )
Sets the DRAGMODE system variable.
Parameters
[in] | newVal | new value to set.
Returns
Acad::eOk if successful
◆ setDrawOrderCtl()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbDatabase::setDrawOrderCtl  |  ( |  Adesk::UInt8  |  mode | )
The function sets the value for DRAWORDERCTL database variable.
Parameters
[in] | mode | the new value for DRAWORDERCTL, in range 0-3
Returns
Acad::eOk if value is in range 0-3, Acad::eInvalidInput otherwise
◆ setDwfframe()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbDatabase::setDwfframe  |  ( |  Adesk::UInt8  |  mode | )
The function sets the DWFFRAME database variable.
Parameters
[in] | mode | input values 0,1,2 to control DWF frame display + plotting
Returns
Acad::eOk for success, error status otherwise
◆ setElevation()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbDatabase::setElevation  |  ( |  double  |  e | )
Sets ELEVATION value of this database model space.
Parameters
[in] | e | ELEVATION to set
Returns
Acad::eOk, if successful
◆ setEndCaps()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbDatabase::setEndCaps  |  ( |  AcDb::EndCaps  |  val | )
Sets the 'endCaps' value of this database.
Parameters
[in] | val | endCaps value
Returns
Acad::eOk, or error status
◆ setExtmax()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbDatabase::setExtmax  |  ( |  const AcGePoint3d &  |  newMax | )
Sets the EXTMAX system variable.
EXTMAX = upper-right corner of the extents of the Model Space.
Parameters
[in] | newMax | to set as EXTMAX
Returns
Acad::eOk
◆ setExtmin()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbDatabase::setExtmin  |  ( |  const AcGePoint3d &  |  newMin | )
Sets the EXTMIN system variable.
EXTMIN = lower-left corner of the extents of the Model Space.
Parameters
[in] | newMin | to set as EXTMIN
Returns
Acad::eOk
◆ setFacetres()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbDatabase::setFacetres  |  ( |  double  |  facetRes | )
Sets FACETRES value for this database.
Parameters
[in] | facetRes | new FACETRES value to set for this database
Returns
Acad::eOk if successful
◆ setFilletrad()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbDatabase::setFilletrad  |  ( |  double  |  radFillet | )
Sets FILLETRAD value for this database.
Parameters
[in] | radFillet | new FILLETRAD value to set for this database
◆ setFillmode()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbDatabase::setFillmode  |  ( |  bool  |  fillmode | )
Sets the FILLMODE system variable for this database.
Parameters
[in] | fillmode | value to be set
Returns
Acad::eOk if successful
◆ setFingerprintGuid()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbDatabase::setFingerprintGuid  |  ( |  const ACHAR *  |  guidString | )
Sets the 'FingerPrintGuid' of this database to provided GUID string.
Parameters
[in] | guidString | - new GUID string, to be assigned to this database
Returns
Acad::eOk, or error status
◆ setGsModel()
 UX_EXPORT_FUNCTION void AcDbDatabase::setGsModel  |  ( |  AcGsModel *  |  pAcModel | )
Associates pAcModel with this database.
Parameters
[in] | pAcModel | pointer to AcGsModel
◆ setHpInherit()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbDatabase::setHpInherit  |  ( |  const bool  |  inheritHP | )
Sets HPINHERIT system variable for this database.
Parameters
[in] | inheritHP | new value for HPINHERIT for this database
Returns
Acad::eOk, or error code
◆ setHpOrigin()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbDatabase::setHpOrigin  |  ( |  const AcGePoint2d &  |  originPt | )
Sets HPORIGIN system variable for this database.
Parameters
[in] | originPt | new value for HPORIGIN
Returns
Acad::eOk, or error code
◆ setHyperlinkBase()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbDatabase::setHyperlinkBase  |  ( |  const ACHAR *  |  pathString | )
Sets the value of HYPERLINKBASE variable.
Parameters
[in] | pathString | new value for HYPERLINKBASE variable
Returns
Acad::eOk if successful
◆ setInsbase()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbDatabase::setInsbase  |  ( |  const AcGePoint3d &  |  insbase | )
Sets the INSBASE variable value (model space).
Returns
Acad::eOk or error status
◆ setInsunits()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbDatabase::setInsunits  |  ( |  const AcDb::UnitsValue  |  insUnits | )
Sets the INSUNITS variable value.
Parameters
[in] | insUnits | unit type
Returns
Acad::eOk
 Acad::eInvalidInput if the insUnits value not in range [AcDb::kUnitsUndefined, AcDb::kUnitsMaxkUnitsMax]
◆ setIsolines()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbDatabase::setIsolines  |  ( |  Adesk::Int16  |  isoLines | )
Sets ISOLINES value for this database.
Parameters
[in] | isoLines | new ISOLINES value to set for this database
Returns
Acad::eOk if successful
◆ setJoinStyle()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbDatabase::setJoinStyle  |  ( |  AcDb::JoinStyle  |  val | )
Sets the 'joinStyle' value of this database.
Parameters
[in] | val | joinStyle value
Returns
Acad::eOk, or error status
◆ setLatitude()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbDatabase::setLatitude  |  ( |  double  |  lat | )
The function sets the latitude of the site where the model is it.
It has a positiv value for north latitude.
Parameters
[in] | The | latitude input parameter. Is in degrees.
Returns
Acad::eOk if function set a value between -90 and 90.If is not between intervals then return Acad::eOutOfRange.
◆ setLimcheck()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbDatabase::setLimcheck  |  ( |  bool  |  value | )
Sets the LIMCHECK system variable for this database object.
Parameters
[in] | value | new value for LIMCHECK variable
Returns
Acad::eOk if successful, otherwise a corresponding error code will be returned
◆ setLimmax()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbDatabase::setLimmax  |  ( |  const AcGePoint2d &  |  limmax | )
Sets the LIMMAX system variable to limmax.
Parameters
[in] | limmax | LIMMAX value
Returns
Acad::eOk
◆ setLimmin()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbDatabase::setLimmin  |  ( |  const AcGePoint2d &  |  limmin | )
Sets the LIMMIN system variable to limmin.
Parameters
[in] | limmin | LIMMIN value
Returns
Acad::eOk
◆ setLineWeightDisplay()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbDatabase::setLineWeightDisplay  |  ( |  bool  |  isDisplayed | )
Sets the value of LWDISPLAY (line weight display) system variable for the database.
Parameters
[in] | isDisplayed | true=displayed, false=not displayed
Returns
Acad::eOk
◆ setLoftAng1()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbDatabase::setLoftAng1  |  ( |  double  |  value | )
Sets the value of LOFTANG1 system variable.
Parameters
[in] | - | value the new value
Returns
Acad::eOk if successful
◆ setLoftAng2()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbDatabase::setLoftAng2  |  ( |  double  |  value | )
Sets the value of LOFTANG2 system variable.
Parameters
[in] | - | value the new value
Returns
Acad::eOk if successful
◆ setLoftMag1()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbDatabase::setLoftMag1  |  ( |  double  |  value | )
Sets the value of LOFTMAG1 system variable.
Parameters
[in] | - | value the new value
Returns
Acad::eOk if successful
◆ setLoftMag2()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbDatabase::setLoftMag2  |  ( |  double  |  value | )
Sets the value of LOFTMAG2 system variable.
Parameters
[in] | - | value the new value
Returns
Acad::eOk if successful
◆ setLoftNormals()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbDatabase::setLoftNormals  |  ( |  Adesk::UInt8  |  value | )
Sets the value of LOFTNORMALS system variable.
Parameters
[in] | - | value the new value
Returns
Acad::eOk if successful
◆ setLoftParam()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbDatabase::setLoftParam  |  ( |  Adesk::UInt16  |  value | )
Sets the value of LOFTPARAM system variable.
Parameters
[in] | - | value the new value
Returns
Acad::eOk if successful
◆ setLongitude()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbDatabase::setLongitude  |  ( |  double  |  longit | )
The function sets the longitude of the site where the model is it.
It have positiv value for east longitude.
Parameters
[in] | The | longitude input parameter. Is in degrees.
Returns
Acad::eOk if function set a value between -180 and 180. If is not between intervals then return Acad::eOutOfRange.
◆ setLtscale()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbDatabase::setLtscale  |  ( |  double  |  ltScale | )
Sets LTSCALE sistem variable to ltScale.
Parameters
[in] | ltScale | linetype scale
Returns
Acad::eOk
◆ setLunits()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbDatabase::setLunits  |  ( |  Adesk::Int16  |  lunits | )
Sets the value of LUNITS system variable.
Parameters
[in] | lunits | LUNITS value
Returns
Acad::eOk, or error status
◆ setLuprec()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbDatabase::setLuprec  |  ( |  Adesk::Int16  |  luprec | )
Sets the LUPREC value.
Parameters
[in] | luprec | LUPREC value to set.
Returns
Acad::eOk, if successful
 Acad::eInvalidInput, if prec is outside range of [0,8]
Remarks
With other CAD Libraries it may be possible to set a LUPREC value out of the range [0,8]. with BRX luprec has to be between 0 and 8.
◆ setMaxactvp()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbDatabase::setMaxactvp  |  ( |  Adesk::Int16  |  max | )
Sets the current value of MAXACTVP database variable.
Parameters
[in] | max | new value for MAXACTVP
Returns
Acad::eOk, or error status
◆ setMeasurement()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbDatabase::setMeasurement  |  ( |  AcDb::MeasurementValue  |  newType | )
Sets MEASUREMENT system variable.
Parameters
[in] | newType | new value of the MEASUREMENT to set
Returns
Acad::eOk, or error code
◆ setMirrtext()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbDatabase::setMirrtext  |  ( |  bool  |  mirrtext | )
Sets the MIRRTEXT variable value.
Parameters
[in] | mirrtext | false=not mirrored, true=mirrored
Returns
Acad::eOk
◆ setMLeaderscale()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbDatabase::setMLeaderscale  |  ( |  double  |  curScale | )
Sets the current MLeader scale object of this database (CMLSCALE).
Parameters
[in] | curScale | the current MLeader scale factor
Returns
Acad::eOk, or error statzs
◆ setMLeaderstyle()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbDatabase::setMLeaderstyle  |  ( |  AcDbObjectId  |  mleaderStyleId | )
Sets the MLEADERSTYLE system variable.
Parameters
[in] | mleaderStyleId | the ObjectId of the multileader style for DIMSTYLE
Returns
Acad::eOk, or error code
◆ setMsltscale()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbDatabase::setMsltscale  |  ( |  bool  |  bEnable | )
Sets MSLTSCALE system variable.
Parameters
[in] | bEnable | new value of the MSLTSCALE system variable (false=off=0, true=on=1)
Returns
Acad::eOk, or error code
◆ setNorthDirection()
 Acad::ErrorStatus AcDbDatabase::setNorthDirection  |  ( |  double  |  northDir | )
Sets the North direction value for this database (angle in radians, to WCS X axis).
Parameters
[in] | timezone | - new AcDb::TimeZone to be assigned
Returns
Acad::eOk or error status
◆ setOleStartUp()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbDatabase::setOleStartUp  |  ( |  bool  |  val | )
Sets the current value of OLESTARTUP database variable.
Parameters
[in] | val | new value for OLESTARTUP
Returns
Acad::eOk, or error status
◆ setOrthomode()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbDatabase::setOrthomode  |  ( |  bool  |  orthoMode | )
Sets ORTHOMODE system variable to orthoMode.
Parameters
[in] | orthoMode | orthomode
Returns
Acad::eOk
◆ setPdmode()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbDatabase::setPdmode  |  ( |  Adesk::Int16  |  mode | )
Sets the value of PDMODE system variable.
Parameters
[in] | pdmode | PDMODE value
Returns
Acad::eOk, or error status
◆ setPdsize()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbDatabase::setPdsize  |  ( |  double  |  size | )
Sets the value of PDSIZE system variable.
Parameters
[in] | pdsize | value
Returns
Acad::eOk, or error status
◆ setPelevation()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbDatabase::setPelevation  |  ( |  double  |  e | )
Sets PELEVATION value of this database paper space.
Parameters
[in] | e | PELEVATION to set
◆ setPextmax()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbDatabase::setPextmax  |  ( |  const AcGePoint3d &  |  pextmax | )
Sets the PEXTMAX system variable for this database.
Parameters
[in] | pextmax | value to be set
Returns
Acad::eOk if successful
◆ setPextmin()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbDatabase::setPextmin  |  ( |  const AcGePoint3d &  |  pextmax | )
Sets the PEXTMIN system variable for this database.
Parameters
[in] | pextmin | value to be set
Returns
Acad::eOk if successful
◆ setPickstyle()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbDatabase::setPickstyle  |  ( |  Adesk::Int16  |  p | )
The variable PICKSTYLE is no database variable.
This function does nothing.
Parameters
[in] | p | ignored
Returns
Acad::eNotImplementedYet
◆ setPinsbase()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbDatabase::setPinsbase  |  ( |  const AcGePoint3d &  |  insbase | )
Sets the INSBASE variable value (paper space).
Returns
Acad::eOk or error status
◆ setPlimcheck()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbDatabase::setPlimcheck  |  ( |  bool  |  val | )
Sets the current value of paperspace LIMCHECK database variable.
Parameters
[in] | val | new value for LIMCHECK
Returns
Acad::eOk, or error status
◆ setPlimmax()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbDatabase::setPlimmax  |  ( |  const AcGePoint2d &  |  point | )
Sets the LIMMAX system variable for this database object.
LIMMAX specifies the upper-right corner of the grid limits for the current paper space.
Parameters
[in] | point | new value for LIMMAX variable
Returns
Acad::eOk if successful, otherwise a corresponding error code will be returned
◆ setPlimmin()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbDatabase::setPlimmin  |  ( |  const AcGePoint2d &  |  point | )
Sets the LIMMIN system variable for this database object.
LIMMIN specifies the lower-left corner of the grid limits for the current paper space.
Parameters
[in] | point | new value for LIMMIN variable
Returns
Acad::eOk if successful, otherwise a corresponding error code will be returned
◆ setPlineEllipse()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbDatabase::setPlineEllipse  |  ( |  bool  |  val | )
Sets the current value of PELLIPSE database variable.
Parameters
[in] | val | new value for PELLIPSE
Returns
Acad::eOk, or error status
◆ setPlinegen()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbDatabase::setPlinegen  |  ( |  bool  |  generate | )
Sets the PLINEGEN system variable.
Parameters
[in] | generate | - new value to be set to PLINEGEN
Returns
Acad::eOk if successful
◆ setPlinewid()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbDatabase::setPlinewid  |  ( |  double  |  plinewidth | )
Sets PLINEWID value for this database.
Parameters
[in] | plinewidth | new PLINEWID value to set for this database
◆ setProjectName()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbDatabase::setProjectName  |  ( |  const ACHAR *  |  project | )
Sets the value of PROJECTNAME database variable.
Parameters
[in] | project | project name
Returns
Acad::eOk, or error status
◆ setPsltscale()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbDatabase::setPsltscale  |  ( |  bool  |  bEnable | )
Sets PSLTSCALE system variable.
Parameters
[in] | bEnable | new value of the PSLTSCALE system variable (false=off=0, true=on=1)
Returns
Acad::eOk, or error code
◆ setPucs()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbDatabase::setPucs  |  ( |  const AcGePoint3d &  |  originPoint,
|  const AcGeVector3d &  |  xVec,
|  const AcGeVector3d &  |  yVec
)
Sets the UCS for the current Paper Space.
Parameters
[in] | originPoint | - new AcGePoint3d originPoint
[in] | xVec | - new UCS x direction
[in] | yVec | - new UCS y direction
Returns
Acad::eOk if successful
◆ setPucsBase()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbDatabase::setPucsBase  |  ( |  const AcDbObjectId &  |  ucsId | )
Sets the objectId of the active UCS table entry for paperspace.
Returns
Acad::eOk for success
◆ setQtextmode()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbDatabase::setQtextmode  |  ( |  bool  |  val | )
Sets the current value of QTEXTMODE database variable.
Parameters
[in] | val | new value for QTEXTMODE
Returns
Acad::eOk, or error status
◆ setRegenmode()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbDatabase::setRegenmode  |  ( |  bool  |  isRegen | )
Sets the value of REGENMODE system variable.
REGENMODE = automatic regeneration.
Parameters
[in] | isRegen | true=on, false=off.
Returns
Acad::eOk
◆ setRetainOriginalThumbnailBitmap()
 UX_EXPORT_FUNCTION void AcDbDatabase::setRetainOriginalThumbnailBitmap  |  ( |  bool  |  retainBitmap | )
This function specifies, whether or not the preview image (thumbnail bitmap) should be preserved (if existing);.
Parameters
[in] | retainBitmap | if true, the existing preview image is preserved; if false, the database will automatically manage and update the preview image
◆ setSaveproxygraphics()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbDatabase::setSaveproxygraphics  |  ( |  Adesk::Int16  |  saveProxy | )
Sets the value for PROXYGRAPHICS value for the database.
Returns
Acad::eOk for success
◆ setSecurityParams()
 UX_EXPORT_FUNCTION bool AcDbDatabase::setSecurityParams  |  ( |  const SecurityParams *  |  pSecParams,
|  bool  |  bSetDbMod = true
)
Sets the security parameters for this database.
Parameters
[in] | pSecParams | security parameters to be assigned
[in] | bSetDbMod | specifies thether this database is set to be modified
Returns
true, if security parameters were successfully applied, false otherwise
◆ setShadedge()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbDatabase::setShadedge  |  ( |  Adesk::Int16  |  val | )
Sets the current value of SHADEDGE database variable.
Parameters
[in] | val | new value for SHADEDGE
Returns
Acad::eOk, or error status
◆ setShadedif()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbDatabase::setShadedif  |  ( |  Adesk::Int16  |  val | )
Sets the current value of SHADEDIF database variable.
Parameters
[in] | val | new value for SHADEDIF
Returns
Acad::eOk, or error status
◆ setSketchinc()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbDatabase::setSketchinc  |  ( |  double  |  sketchIncr | )
Sets SKETCHINC value for this database.
Parameters
[in] | sketchIncr | new SKETCHINC value to set for this database
◆ setSkpoly()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbDatabase::setSkpoly  |  ( |  bool  |  val | )
Sets the current value of SKPOLY database variable.
Parameters
[in] | val | new value for SKPOLY
Returns
Acad::eOk, or error status
◆ setSortEnts()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbDatabase::setSortEnts  |  ( |  Adesk::UInt8  |  value | )
This function set for curent database variable sortens.
Parameters
[in] | value | for sortens
Returns
Acad::eOk for success or error status otherwise
◆ setSplframe()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbDatabase::setSplframe  |  ( |  bool  |  showFrame | )
Sets SPLFRAME system variable for this database.
Parameters
[in] | showFrame | new value for SPLFRAME for this database
Returns
Acad::eOk, or error code
◆ setSplinesegs()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbDatabase::setSplinesegs  |  ( |  Adesk::Int16  |  value | )
Sets the value of system variable SPLINESEGS.
Parameters
[in] | value | new value for SPLINESEGS system variable.
Returns
Acad::eOk if successful Acad::eInvalidInput if value is 0
◆ setSplinetype()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbDatabase::setSplinetype  |  ( |  Adesk::Int16  |  value | )
Setter function for SPLINETYPE system variable.
Parameters
[in] | value | new value for SPLINETYPE system variable. A valid value would be 5 or 6.
Returns
Acad::eOk if successful, Acad::eInvalidInput otherwise.
◆ setStyleSheet()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbDatabase::setStyleSheet  |  ( |  const ACHAR *  |  value | )
Sets the STYLESHEET system variable of this database object.
Parameters
[in] | value | value of STYLESHEET system variable
Returns
Acad::eOk if successful, otherwise a corresponding error code will be returned
◆ setSurftab1()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbDatabase::setSurftab1  |  ( |  Adesk::Int16  |  val | )
Sets the current value of SURFTAB1 database variable.
Parameters
[in] | val | new value for SURFTAB1
Returns
Acad::eOk, or error status
◆ setSurftab2()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbDatabase::setSurftab2  |  ( |  Adesk::Int16  |  val | )
Sets the current value of SURFTAB2 database variable.
Parameters
[in] | val | new value for SURFTAB2
Returns
Acad::eOk, or error status
◆ setSurftype()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbDatabase::setSurftype  |  ( |  Adesk::Int16  |  val | )
Sets the current value of SURFTYPE database variable.
Parameters
[in] | val | new value for SURFTYPE
Returns
Acad::eOk, or error status
◆ setSurfu()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbDatabase::setSurfu  |  ( |  Adesk::Int16  |  val | )
Sets the current value of SURFU database variable.
Parameters
[in] | val | new value for SURFU
Returns
Acad::eOk, or error status
◆ setSurfv()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbDatabase::setSurfv  |  ( |  Adesk::Int16  |  val | )
Sets the current value of SURFV database variable.
Parameters
[in] | val | new value for SURFV
Returns
Acad::eOk, or error status
◆ setTablestyle()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbDatabase::setTablestyle  |  ( |  AcDbObjectId  |  styleId | )
Sets the ObjectId of the table style to be the current one (as specified by CTABLESTYLE system variable).
Parameters
[in] | ObjectId | of the table style to be made current
Returns
Acad::eOk, or Acad::eInvalidInput in case of failure
◆ setTextsize()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbDatabase::setTextsize  |  ( |  double  |  textsize | )
Sets TEXTSIZE sistem variable to textsize.
Parameters
[in] | textsize | text size
Returns
Acad::eOk
◆ setTextstyle()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbDatabase::setTextstyle  |  ( |  AcDbObjectId  |  styleid | )
Sets the current textstyle to given textstyle; this sets variable TEXTSTYKE,.
Parameters
[in] | styleid | style idof the new current textstyle
Returns
Acad::eOk for success
◆ setThickness()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbDatabase::setThickness  |  ( |  double  |  thickness | )
Sets THICKNESS value for this database.
Parameters
[in] | thickness | new THICKNESS value to set for this database
◆ setThumbnailBitmap()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbDatabase::setThumbnailBitmap  |  ( |  void *  |  bitmap | )
Sets the database's thumbnail preview image to provided image.
Parameters
[in] | bitmap | preview thumbnail; actually this is a BITMAPINFO* pointer
Returns
Acad::eOk for success, error status otherwise
◆ setTilemode()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbDatabase::setTilemode  |  ( |  bool  |  bTileMode | )
Sets the TILEMODE variable for the database to given value.
Parameters
[in] | bTileMode | true for modelspace, false for paperspace
Returns
Acad::eOk for success
◆ setTimeZone()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbDatabase::setTimeZone  |  ( |  AcDb::TimeZone  |  timezone | )
Sets the timezone value for this database.
Parameters
[in] | timezone | - new AcDb::TimeZone to be assigned
Returns
Acad::eOk or error status
◆ setTracewid()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbDatabase::setTracewid  |  ( |  double  |  tracewidth | )
Sets TRACEWID value for this database.
Parameters
[in] | tracewidth | new PLINEWID value to set for this database
◆ setTreedepth()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbDatabase::setTreedepth  |  ( |  Adesk::Int16  |  val | )
Sets the current value of TREEDEPTH database variable.
Parameters
[in] | val | new value for TREEDEPTH
Returns
Acad::eOk, or error status
◆ setTStackAlign()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbDatabase::setTStackAlign  |  ( |  int  |  val | )
Sets the current value of TSTACKALIGN database variable.
Parameters
[in] | val | new value for TSTACKALIGN
Returns
Acad::eOk, or error status
◆ setTStackSize()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbDatabase::setTStackSize  |  ( |  int  |  val | )
Sets the current value of TSTACKSIZE database variable.
Parameters
[in] | val | new value for TSTACKSIZE
Returns
Acad::eOk, or error status
◆ setUcs()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbDatabase::setUcs  |  ( |  const AcGePoint3d &  |  originPoint,
|  const AcGeVector3d &  |  xVec,
|  const AcGeVector3d &  |  yVec
)
Sets the UCS for the current database.
Parameters
[in] | originPoint | - new AcGePoint3d originPoint
[in] | xVec | - new UCS x direction
[in] | yVec | - new UCS y direction
Returns
Acad::eOk if successful
◆ setUcsBase()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbDatabase::setUcsBase  |  ( |  AcDbObjectId  |  id | )
Sets id, which is the objectId of an AcDbUcsTableRecord to determine the value of UCSBASE system variable.
Parameters
[in] | id | objectId of AcDbUcsTableRecord
Returns
◆ setUnitmode()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbDatabase::setUnitmode  |  ( |  Adesk::Int16  |  uMode | )
Sets the UNITMODE value for this database.
Parameters
[in] | UNITMODE | value, must be 0 or 1
Returns
◆ setUseri1()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbDatabase::setUseri1  |  ( |  Adesk::Int16  |  newVal | )
Sets the USERI1 variable value.
Parameters
[in] | newVal | new Value of the Useri1
Returns
Acad::eOk
◆ setUseri2()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbDatabase::setUseri2  |  ( |  Adesk::Int16  |  newVal | )
Sets the USERI2 variable value.
Parameters
[in] | newVal | new Value of the Useri2
Returns
Acad::eOk
◆ setUseri3()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbDatabase::setUseri3  |  ( |  Adesk::Int16  |  newVal | )
Sets the USERI3 variable value.
Parameters
[in] | newVal | new Value of the Useri3
Returns
Acad::eOk
◆ setUseri4()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbDatabase::setUseri4  |  ( |  Adesk::Int16  |  newVal | )
Sets the USERI4 variable value.
Parameters
[in] | newVal | new Value of the Useri4
Returns
Acad::eOk
◆ setUseri5()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbDatabase::setUseri5  |  ( |  Adesk::Int16  |  newVal | )
Sets the USERI5 variable value.
Parameters
[in] | newVal | new Value of the Useri5
Returns
Acad::eOk
◆ setUserr1()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbDatabase::setUserr1  |  ( |  double  |  value | )
Sets the USERR1 system variable.
Parameters
[in] | value | - the value to set
Returns
Acad::eOk if successfull
◆ setUserr2()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbDatabase::setUserr2  |  ( |  double  |  value | )
Sets the USERR2 system variable.
Parameters
[in] | value | - the value to set
Returns
Acad::eOk if successfull
◆ setUserr3()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbDatabase::setUserr3  |  ( |  double  |  value | )
Sets the USERR3 system variable.
Parameters
[in] | value | - the value to set
Returns
Acad::eOk if successfull
◆ setUserr4()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbDatabase::setUserr4  |  ( |  double  |  value | )
Sets the USERR4 system variable.
Parameters
[in] | value | - the value to set
Returns
Acad::eOk if successfull
◆ setUserr5()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbDatabase::setUserr5  |  ( |  double  |  value | )
Sets the USERR5 system variable.
Parameters
[in] | value | - the value to set
Returns
Acad::eOk if successfull
◆ setUsrtimer()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbDatabase::setUsrtimer  |  ( |  bool  |  enable | )
The function sets the USRTIMER database variable to enabled or disabled.
Parameters
[in] | true | or false to set USRTIMER as enabled / disabled
Returns
Acad::eOk for success, error status otherwise
◆ setViewportScaleDefault()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbDatabase::setViewportScaleDefault  |  ( |  double  |  scale | )
Sets the current value of PSVPSCALE database variable.
Parameters
[in] | scale | new default scale
Returns
Acad::eOk, or error status
◆ setVisretain()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbDatabase::setVisretain  |  ( |  bool  |  val | )
Sets the current value of VISRETAIN database variable.
Parameters
[in] | val | new value for VISRETAIN
Returns
Acad::eOk, or error status
◆ setWorldview()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbDatabase::setWorldview  |  ( |  bool  |  val | )
Sets the current value of WORLDVIEW database variable.
Parameters
[in] | val | new value for WORLDVIEW
Returns
Acad::eOk, or error status
◆ setXrefEditEnabled()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbDatabase::setXrefEditEnabled  |  ( |  bool  |  val | )
Sets the current value of XEDIT database variable.
Parameters
[in] | val | new value for XEDIT
Returns
Acad::eOk, or error status
◆ shadedge()
 UX_EXPORT_FUNCTION Adesk::Int16 AcDbDatabase::shadedge  |  ( |   | ) |   const
Returns the current value of SHADEDGE database variable.
Returns
value of SHADEDGE
◆ shadedif()
 UX_EXPORT_FUNCTION Adesk::Int16 AcDbDatabase::shadedif  |  ( |   | ) |   const
Returns the current value of SHADEDIF database variable.
Returns
value of SHADEDIF
◆ sketchinc()
 UX_EXPORT_FUNCTION double AcDbDatabase::sketchinc  |  ( |   | ) |   const
Returns SKETCHINC value of this database.
Returns
SKETCHINC value of the database
◆ skpoly()
 UX_EXPORT_FUNCTION bool AcDbDatabase::skpoly  |  ( |   | ) |   const
Returns the current value of SKPOLY database variable.
Returns
value of SKPOLY
◆ sortEnts()
 UX_EXPORT_FUNCTION Adesk::UInt8 AcDbDatabase::sortEnts  |  ( |   | ) |   const
This function return for curent database variable sortens.
Returns
Acad::eOk for success or error status otherwise
◆ splframe()
 UX_EXPORT_FUNCTION bool AcDbDatabase::splframe  |  ( |   | ) |   const
Returns the value of SPLFRAME system variable for this database.
Returns
the current setting for SPLFRAME (true or false) for this database
◆ splinesegs()
 UX_EXPORT_FUNCTION Adesk::Int16 AcDbDatabase::splinesegs  |  ( |   | ) |   const
Returns value of system variable SPLINESEGS.
Returns
value of SPLINESEGS
◆ splinetype()
 UX_EXPORT_FUNCTION Adesk::Int16 AcDbDatabase::splinetype  |  ( |   | ) |   const
Gets the value of SPLINETYPE system variable.
Returns
value of SPLINETYPE system variable
◆ surftab1()
 UX_EXPORT_FUNCTION Adesk::Int16 AcDbDatabase::surftab1  |  ( |   | ) |   const
Returns the current value of SURFTAB1 database variable.
Returns
value of SURFTAB1
◆ surftab2()
 UX_EXPORT_FUNCTION Adesk::Int16 AcDbDatabase::surftab2  |  ( |   | ) |   const
Returns the current value of SURFTAB2 database variable.
Returns
value of SURFTAB2
◆ surftype()
 UX_EXPORT_FUNCTION Adesk::Int16 AcDbDatabase::surftype  |  ( |   | ) |   const
Returns the current value of SURFTYPE database variable.
Returns
value of SURFTYPE
◆ surfu()
 UX_EXPORT_FUNCTION Adesk::Int16 AcDbDatabase::surfu  |  ( |   | ) |   const
Returns the current value of SURFU database variable.
Returns
value of SURFU
◆ surfv()
 UX_EXPORT_FUNCTION Adesk::Int16 AcDbDatabase::surfv  |  ( |   | ) |   const
Returns the current value of SURFV database variable.
Returns
value of SURFV
◆ tablestyle()
 UX_EXPORT_FUNCTION AcDbObjectId AcDbDatabase::tablestyle  |  ( |   | ) |   const
Returns the ObjectId of the table style specified by CTABLESTYLE system variable.
Returns
ObjectId of the current table style
◆ tableStyleDictionaryId()
 UX_EXPORT_FUNCTION AcDbObjectId AcDbDatabase::tableStyleDictionaryId  |  ( |   | ) |   const
Returns id of the tableStyles dictionary.
Returns
objectId of the dictionary, or AcDbObjectId::kNull
◆ tdcreate()
 UX_EXPORT_FUNCTION const AcDbDate AcDbDatabase::tdcreate  |  ( |   | ) |   const
Gets the TDCREATE system variable.
Returns
AcDbDate
◆ tdindwg()
 UX_EXPORT_FUNCTION const AcDbDate AcDbDatabase::tdindwg  |  ( |   | ) |   const
Gets the TDINDWG system variable.
Returns
AcDbDate
◆ tducreate()
 UX_EXPORT_FUNCTION const AcDbDate AcDbDatabase::tducreate  |  ( |   | ) |   const
Gets the TDUCREATE system variable.
Returns
AcDbDate
◆ tdupdate()
 UX_EXPORT_FUNCTION const AcDbDate AcDbDatabase::tdupdate  |  ( |   | ) |   const
Gets the TDUPDATE system variable.
Returns
AcDbDate
◆ tdusrtimer()
 UX_EXPORT_FUNCTION const AcDbDate AcDbDatabase::tdusrtimer  |  ( |   | ) |   const
Gets the TDUSRTIMER system variable.
Returns
AcDbDate
◆ tduupdate()
 UX_EXPORT_FUNCTION const AcDbDate AcDbDatabase::tduupdate  |  ( |   | ) |   const
Gets the TDUUPDATE system variable.
Returns
AcDbDate
◆ textsize()
 UX_EXPORT_FUNCTION double AcDbDatabase::textsize  |  ( |   | ) |   const
Gets the TEXTSIZE value.
Returns
textsize
◆ textstyle()
 UX_EXPORT_FUNCTION AcDbObjectId AcDbDatabase::textstyle  |  ( |   | ) |   const
Returns the objectId of the current textstyle, which is set in the drawing variable TEXTSTYLE.
Returns
ObjectId of the current textstyle
◆ textStyleTableId()
 UX_EXPORT_FUNCTION AcDbObjectId AcDbDatabase::textStyleTableId  |  ( |   | ) |   const
Returns the TextStyle Table objectId.
Returns
objectId of the table
◆ thickness()
 UX_EXPORT_FUNCTION double AcDbDatabase::thickness  |  ( |   | ) |   const
Returns THICKNESS value of this database.
Returns
THICKNESS value of the database
◆ thumbnailBitmap()
 UX_EXPORT_FUNCTION void * AcDbDatabase::thumbnailBitmap  |  ( |   | ) |   const
Returns the database's thumbnail preview image, or NULL if no preview is available.
Returns
void* preview thumbnail; actually this is a BITMAPINFO* pointer
◆ tilemode()
 UX_EXPORT_FUNCTION bool AcDbDatabase::tilemode  |  ( |   | ) |   const
Returns the current TILEMODE value for the database.
Returns
true for modelspace, false for paperspace
◆ timeZone()
 UX_EXPORT_FUNCTION AcDb::TimeZone AcDbDatabase::timeZone  |  ( |   | ) |   const
Returns the timezone setting for this database.
Returns
AcDb::TimeZone - returns one of the enum values, or AcDb::kInternationalDateLine in case of an error
◆ tracewid()
 UX_EXPORT_FUNCTION double AcDbDatabase::tracewid  |  ( |   | ) |   const
Returns TRACEWID value of this database.
Returns
TRACEWID value of the database
◆ transactionManager()
 UX_EXPORT_FUNCTION AcDbTransactionManager * AcDbDatabase::transactionManager  |  ( |   | ) |   const
Returns a pointer to the AcDbTransactionManager for this database.
Returns
pointer to the Transaction Manager
Remarks
On other CAD platforms you may get pointer to Transaction Manager only for databases which documents are opened (viewed) in one of the child windows. On BricsCAD you may get the Transaction Manager for any database, including temporal databases created "on the fly".
◆ treedepth()
 UX_EXPORT_FUNCTION Adesk::Int16 AcDbDatabase::treedepth  |  ( |   | ) |   const
Returns the current value of TREEDEPTH database variable.
Returns
value of TREEDEPTH
◆ tstackalign()
 UX_EXPORT_FUNCTION int AcDbDatabase::tstackalign  |  ( |   | ) |   const
Returns the current value of TSTACKALIGN database variable.
Returns
value of TSTACKALIGN
◆ tstacksize()
 UX_EXPORT_FUNCTION int AcDbDatabase::tstacksize  |  ( |   | ) |   const
Returns the current value of TSTACKSIZE database variable.
Returns
value of TSTACKSIZE
◆ ucsBase()
 UX_EXPORT_FUNCTION AcDbObjectId AcDbDatabase::ucsBase  |  ( |   | ) |   const
Returns objectId of the AcDbUcsTableRecord, that corresponds to current UCSBASE system variable.
Returns
objectId of AcDbUcsTableRecord
◆ ucsname()
 UX_EXPORT_FUNCTION AcDbObjectId AcDbDatabase::ucsname  |  ( |   | ) |   const
Gets the objectId of the currently active UCS table entry for the modelspace.
Returns
AcDbObjectId of the UCS table record currently used for modelspace (UCSNAME in modelspace)
◆ ucsorg()
 UX_EXPORT_FUNCTION AcGePoint3d AcDbDatabase::ucsorg  |  ( |   | ) |   const
Returns point which is the current Model Space UCSORG System Variable value for this database.
Returns
UCSORG value
Remarks
To get value for Paper Space, use AcDbDatabase::pucsorg() function.
◆ UCSTableId()
 UX_EXPORT_FUNCTION AcDbObjectId AcDbDatabase::UCSTableId  |  ( |   | ) |   const
Returns the UCS Table objectId.
Returns
objectId of the table
◆ ucsxdir()
 UX_EXPORT_FUNCTION AcGeVector3d AcDbDatabase::ucsxdir  |  ( |   | ) |   const
Returns the 3d vector of the current UCS x direction (modelspace).
Returns
AcGeVector3d
◆ ucsydir()
 UX_EXPORT_FUNCTION AcGeVector3d AcDbDatabase::ucsydir  |  ( |   | ) |   const
Returns the 3d vector of the current UCS y direction (modelspace).
Returns
AcGeVector3d
◆ undoRecording()
 UX_EXPORT_FUNCTION bool AcDbDatabase::undoRecording  |  ( |   | ) |   const
Returns whether Undo recording is active for this database.
Returns
true, if undo recording is enabled for the database; false otherwise
◆ unitmode()
 UX_EXPORT_FUNCTION Adesk::Int16 AcDbDatabase::unitmode  |  ( |   | ) |   const
Returns the UNITMODE value for this database.
Returns
the UNITMODE value, 0 or 1
◆ updateExt()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbDatabase::updateExt  |  ( |  bool  |  findTightestBox = false | )
Calculates the extents of all entities in this database.
Iterates through all entities in the Model Space and updates the Model Space extents variables EXTMAX and EXTMIN to the new values, that have been calculated.
Parameters
[in] | findTightestBox | for future use.
Returns
Acad::eOk
Remarks
parameter findBestFit is provided for future block reference's best fit calculation.
 This method does not calculate polyline extents.
◆ useri1()
 UX_EXPORT_FUNCTION Adesk::Int16 AcDbDatabase::useri1  |  ( |   | ) |   const
Gets the USERI1 variable value.
Returns
variable value
◆ useri2()
 UX_EXPORT_FUNCTION Adesk::Int16 AcDbDatabase::useri2  |  ( |   | ) |   const
Gets the USERI2 variable value.
Returns
variable value
◆ useri3()
 UX_EXPORT_FUNCTION Adesk::Int16 AcDbDatabase::useri3  |  ( |   | ) |   const
Gets the USERI3 variable value.
Returns
variable value
◆ useri4()
 UX_EXPORT_FUNCTION Adesk::Int16 AcDbDatabase::useri4  |  ( |   | ) |   const
Gets the USERI4 variable value.
Returns
variable value
◆ useri5()
 UX_EXPORT_FUNCTION Adesk::Int16 AcDbDatabase::useri5  |  ( |   | ) |   const
Gets the USERI5 variable value.
Returns
variable value
◆ userr1()
 UX_EXPORT_FUNCTION double AcDbDatabase::userr1  |  ( |   | ) |   const
Gets the USERR1 system variable.
Returns
the value of USERR1
◆ userr2()
 UX_EXPORT_FUNCTION double AcDbDatabase::userr2  |  ( |   | ) |   const
Gets the USERR2 system variable.
Returns
the value of USERR2
◆ userr3()
 UX_EXPORT_FUNCTION double AcDbDatabase::userr3  |  ( |   | ) |   const
Gets the USERR3 system variable.
Returns
the value of USERR3
◆ userr4()
 UX_EXPORT_FUNCTION double AcDbDatabase::userr4  |  ( |   | ) |   const
Gets the USERR4 system variable.
Returns
the value of USERR4
◆ userr5()
 UX_EXPORT_FUNCTION double AcDbDatabase::userr5  |  ( |   | ) |   const
Gets the USERR5 system variable.
Returns
the value of USERR5
◆ usrtimer()
 UX_EXPORT_FUNCTION bool AcDbDatabase::usrtimer  |  ( |   | ) |   const
The function returns the value for USRTIMER database variable.
Returns
true or false to indicate the status
◆ viewportScaleDefault()
 UX_EXPORT_FUNCTION double AcDbDatabase::viewportScaleDefault  |  ( |   | ) |   const
Returns the current value of PSVPSCALE database variable.
Returns
default scale
◆ viewportTableId()
 UX_EXPORT_FUNCTION AcDbObjectId AcDbDatabase::viewportTableId  |  ( |   | ) |   const
Returns the Viewport Table objectId.
Returns
objectId of the table
◆ viewTableId()
 UX_EXPORT_FUNCTION AcDbObjectId AcDbDatabase::viewTableId  |  ( |   | ) |   const
Returns the View Table objectId.
Returns
objectId of the table
◆ visretain()
 UX_EXPORT_FUNCTION bool AcDbDatabase::visretain  |  ( |   | ) |   const
Returns the current value of VISRETAIN database variable.
Returns
value of VISRETAIN
◆ visualStyleDictionaryId()
 UX_EXPORT_FUNCTION AcDbObjectId AcDbDatabase::visualStyleDictionaryId  |  ( |   | ) |   const
Returns id of the visualStyles dictionary.
Returns
objectId of the dictionary, or AcDbObjectId::kNull
◆ wblock() [1/4]
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbDatabase::wblock  |  ( |  AcDbDatabase *&  |  pDbOut | )
Writes the contents of this database into a new database.
Parameters
[out] | pDbOut | pointer to the new database
Returns
Acad::eOk
◆ wblock() [2/4]
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbDatabase::wblock  |  ( |  AcDbDatabase *&  |  pDbOut,
|  AcDbObjectId  |  blockId
)
Writes the contents of an AcDbBlockTableRecord into a new database.
Parameters
[in] | blockId | ID of the AcDbBlockTableRecord to clone
[out] | pDbOut | pointer to the new database
Returns
Acad::eOk
◆ wblock() [3/4]
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbDatabase::wblock  |  ( |  AcDbDatabase *&  |  pDbOut,
|  const AcDbObjectIdArray &  |  objectIdArray,
|  const AcGePoint3d &  |  point
)
Writes an array of objects into a new database.
Parameters
[in] | objectIdArray | ID object array to be wblocked
[in] | Point | pDbOut base point
[out] | pDbOut | pointer to the new database
Returns
Acad::eOk
◆ wblock() [4/4]
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbDatabase::wblock  |  ( |  AcDbDatabase *  |  pDbIn,
|  const AcDbObjectIdArray &  |  objectIdArray,
|  const AcGePoint3d &  |  point,
|  AcDb::DuplicateRecordCloning  |  drc
)
Writes an array of objects into an existing database.
Parameters
[in] | pDbIn | existing database pointer to clone the objects into
[in] | objectIdArray | ID object array to be wblocked
[in] | point | base point
[in] | DuplicateRecordCloning | type of cloning to use
Returns
Acad::eOk
◆ wblockCloneObjects() [1/2]
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbDatabase::wblockCloneObjects  |  ( |  AcDbObjectIdArray &  |  objectIdArray,
|  AcDbObjectId &  |  clonesOwnerId,
|  AcDbIdMapping &  |  outputIdPairsMap,
|  AcDb::DuplicateRecordCloning  |  duplicateRecords,
|  bool  |  noIdTranslation = false
)
'wblockCloneObjects' deep-clones the objects in objectIdArray to the owner clonesOwnerId; wblockCloning also clones referenced objects, allows for cloning between different databases.
Parameters
[in] | objectIdArray | input array of objects to be cloned
[in] | clonesOwnerId | owner ID
[out] | outputIdPairsMap | output AcDbPair array for pairing the new created objects with the old ones
[in] | duplicateRecords | action to take if duplicate value exists in destination
[in] | noIdTranslation | flag to control the ID translation
Returns
Acad::eOk
◆ wblockCloneObjects() [2/2]
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbDatabase::wblockCloneObjects  |  ( |  const AcDbObjectIdArray &  |  objectIdArray,
|  const AcDbObjectId &  |  clonesOwnerId,
|  AcDbIdMapping &  |  outputIdPairsMap,
|  AcDb::DuplicateRecordCloning  |  duplicateRecords,
|  bool  |  noIdTranslation = false
)
'wblockCloneObjects' deep-clones the objects in objectIdArray to the owner clonesOwnerId; wblockCloning also clones referenced objects, allows for cloning between different databases.
Parameters
[in] | objectIdArray | input array of objects to be cloned
[in] | clonesOwnerId | owner ID
[out] | outputIdPairsMap | output AcDbPair array for pairing the new created objects with the old ones
[in] | duplicateRecords | action to take if duplicate value exists in destination
[in] | noIdTranslation | flag to control the ID translation
Returns
Acad::eOk
◆ worldview()
 UX_EXPORT_FUNCTION bool AcDbDatabase::worldview  |  ( |   | ) |   const
Returns the current value of WORLDVIEW database variable.
Returns
value of WORLDVIEW
◆ xrefBlockId()
 UX_EXPORT_FUNCTION AcDbObjectId AcDbDatabase::xrefBlockId  |  ( |   | ) |   const
Gets the object id of the block table record which references this xref database.
Returns
object id of the block table record or NULL id if this is not an xref database
◆ xrefEditEnabled()
 UX_EXPORT_FUNCTION bool AcDbDatabase::xrefEditEnabled  |  ( |   | ) |   const
Returns the current value of XEDIT database variable.
Returns
value of XEDIT
Member Data Documentation
◆ AcDbDatabase
 UX_EXPORT_FUNCTION AcDbDatabase::AcDbDatabase
Default constructor.
If createMinimalCompleteDwg is false, a completely empty drawing will be created, if it is true, the default objects will be created, too, e.g. modelspace, paperspace, tables.
Parameters
[in] | createMinimalCompleteDwg | create all defaults necessary for a database or create an empty drawing.
[in] | notAssigendToDocument | argument ignored
Remarks