Public Member Functions | List of all members
AcDbGripOverrule Class Reference
_ More...
#include <AcDbGripOverrule.h>
 Public Member Functions
 virtual Acad::ErrorStatus  | getGripPoints (const AcDbEntity *, AcDbGripDataPtrArray &, const double, const int, const AcGeVector3d &, const int)
 virtual Acad::ErrorStatus  | getGripPoints (const AcDbEntity *, AcGePoint3dArray &, AcDbIntArray &, AcDbIntArray &)
 virtual Acad::ErrorStatus  | getStretchPoints (const AcDbEntity *, AcGePoint3dArray &)
 virtual void  | gripStatus (AcDbEntity *, const AcDb::GripStat)
 virtual Acad::ErrorStatus  | moveGripPointsAt (AcDbEntity *, const AcDbIntArray &, const AcGeVector3d &)
 virtual Acad::ErrorStatus  | moveGripPointsAt (AcDbEntity *, const AcDbVoidPtrArray &, const AcGeVector3d &, const int)
 virtual Acad::ErrorStatus  | moveStretchPointsAt (AcDbEntity *, const AcDbIntArray &, const AcGeVector3d &)
 Public Member Functions inherited from AcRxOverrule
 virtual bool  | isApplicable (const AcRxObject *) const =0
 Public Member Functions inherited from AcRxObject
virtual AcRxObject *  | clone () const
Exported and implemented. More...
 virtual AcRx::Ordering  | comparedTo (const AcRxObject *) const
Exported and implemented.
virtual Acad::ErrorStatus  | copyFrom (const AcRxObject *)
Exported and implemented. More...
 virtual AcRxClass *  | isA () const
Exported and implemented.
virtual Adesk::Boolean  | isEqualTo (const AcRxObject *) const
Exported and implemented. More...
bool  | isKindOf (const AcRxClass *) const
Checks the object class. More...
AcRxObject *  | queryX (const AcRxClass *) const
returns the protocol extension object assigned to this class or a parent class. More...
AcRxObject *  | x (const AcRxClass *) const
returns the protocol extension object assigned to this class or a parent class. More...
 virtual  | ~AcRxObject ()
Destructor.
 Additional Inherited Members
 Static Public Member Functions inherited from AcRxOverrule
 static Acad::ErrorStatus  | addOverrule (AcRxClass *, AcRxOverrule *, bool=false)
 static bool  | hasOverrule (const AcRxObject *, AcRxClass *)
 static bool  | isOverruling (void)
 static Acad::ErrorStatus  | removeOverrule (AcRxClass *, AcRxOverrule *)
 static void  | setIsOverruling (bool)
 Static Public Member Functions inherited from AcRxObject
 static AcRxObject *  | cast (const AcRxObject *)
 static AcRxClass *  | desc ()
Exported and implemented.
 Protected Member Functions inherited from AcRxObject
AcRxObject ()
Exported and implemented.
Detailed Description
_