Public Member Functions | List of all members
AcDbFormattedTableData Class Reference
 Public Member Functions
virtual AcDb::CellAlignment  | alignment (int, int) const
Returns the cell alignment of the specified cell. More...
virtual AcCmColor  | backgroundColor (int, int) const
Returns the background colour of the specified cell. More...
virtual AcCmColor  | contentColor (int, int) const
Returns the colour of the cell at the specified row & column index. More...
virtual AcCmColor  | contentColor (int, int, int) const
Returns the colour of the cell at the specified row, column & content index. More...
virtual AcDb::CellContentLayout  | contentLayout (int, int)
Returns the content layout of the cell at the specified row & column index. More...
virtual Acad::ErrorStatus  | enableMergeAll (int, int, bool)
Enables or disables the Merge All flag for a given row or column. More...
virtual AcDb::FlowDirection  | flowDirection () const
Returns the flow direction for the table (Top-to-Bottom / Bottom-to-Top) More...
virtual Acad::ErrorStatus  | getGridProperty (int, int, AcDb::GridLineType, AcGridProperty &) const
Obtains the grid properties for the cell at the specified row & column index. More...
virtual AcCellRange  | getMergeRange (int, int) const
Returns a cell range representing the range of merged cells containing the given row & column index; an invalid cell range is returned if the supplied cell is not part of a merged range. More...
virtual AcDb::GridProperty  | getOverride (int, int, AcDb::GridLineType) const
Returns a GridProperty enum describing overrides applied to the specified grid line type for the row, column, or cell at the given index. More...
virtual AcDb::CellProperty  | getOverride (int, int, int) const
Returns a CellProperty enum describing overrides applied to the row, column, cell or content index at the given index. More...
virtual AcCmColor  | gridColor (int, int, AcDb::GridLineType) const
Returns the colour of the given grid line type surrounding the row, column, or cell at the given index. More...
virtual double  | gridDoubleLineSpacing (int, int, AcDb::GridLineType) const
Returns the double-line spacing applied to a grid line type surrounding a cell. More...
virtual AcDb::GridLineStyle  | gridLineStyle (int, int, AcDb::GridLineType) const
Returns the grid line style for a single cell or an entire row or column. More...
virtual AcDbObjectId  | gridLinetype (int, int, AcDb::GridLineType) const
Returns the linetype applied to a grid line type surrounding a row, column, or cell. More...
virtual AcDb::LineWeight  | gridLineWeight (int, int, AcDb::GridLineType) const
Returns the lineweight applied to the grid line type surrounding a row, column, or cell. More...
virtual AcDb::Visibility  | gridVisibility (int, int, AcDb::GridLineType) const
Returns the visibility of the grid line type surrounding a row, column, or cell. More...
virtual int  | insertColumnAndInherit (int, int, int)
Inserts one or more columns at the given index, inheriting column properties from a given column index. More...
virtual int  | insertRowAndInherit (int, int, int)
Inserts one or more rows at the given index, inheriting row properties from a given row index. More...
virtual bool  | isAutoScale (int, int) const
Returns true if auto-scaling is enabled for the first block in the cell at the given row & column index. More...
virtual bool  | isAutoScale (int, int, int) const
Returns true if auto-scaling is enabled for the block in the cell at the given row, column, & content index. More...
virtual bool  | isFormatEditable (int, int) const
Checks if the cell format can be modified at the given row & column index. More...
virtual bool  | isMergeAllEnabled (int, int) const
Returns true if merge all is enabled for the given row, column, or cell. More...
virtual bool  | isMerged (int, int) const
Returns true if the cell at the given row & column index is part of a merged range. More...
virtual double  | margin (int, int, AcDb::CellMargin) const
Returns the size of the given margin type, for a given row, column, or cell. More...
virtual Acad::ErrorStatus  | merge (const AcCellRange &)
Merges the cells in the given cell range. More...
virtual Acad::ErrorStatus  | removeAllOverrides (int, int)
Removes all property overrides from the row, column, or cell at the given index. More...
virtual double  | rotation (int, int) const
Returns the rotation (in radians) of the first content in the cell at the given row & column index. More...
virtual double  | rotation (int, int, int) const
Returns the rotation (in radians) of the content in the cell at the given row, column, & content index. More...
virtual double  | scale (int, int) const
Returns the scale of the first content in the cell at the given row & column index. More...
virtual double  | scale (int, int, int) const
Returns the scale of the content in the cell at the given row, column, & content index. More...
virtual Acad::ErrorStatus  | setAlignment (int, int, AcDb::CellAlignment)
Sets the alignment of the content held by the cell at the given row & column index. More...
virtual Acad::ErrorStatus  | setAutoScale (int, int, bool)
Enables/disables auto-scaling for the first block within the content of the cell at the given row & column index. More...
virtual Acad::ErrorStatus  | setAutoScale (int, int, int, bool)
Enables/disables auto-scaling for the block at the given row, column, & content index. More...
virtual Acad::ErrorStatus  | setBackgroundColor (int, int, const AcCmColor &)
Sets the background colour for the row, column, or cell at the given index. More...
virtual Acad::ErrorStatus  | setContentColor (int, int, const AcCmColor &)
Sets the colour of the first content found in the cell at the given row & column index. More...
virtual Acad::ErrorStatus  | setContentColor (int, int, int, const AcCmColor &)
Sets the colour of the content found in the cell at the given row, column, & content index. More...
virtual Acad::ErrorStatus  | setContentLayout (int, int, AcDb::CellContentLayout)
Sets the layout of the first content found in the cell at the given row & column index. More...
virtual Acad::ErrorStatus  | setFieldId (int, int, const AcDbObjectId &, AcDb::CellOption)
Assigns an AcDbField object to the cell at the given row & column index. More...
virtual Acad::ErrorStatus  | setFieldId (int, int, int, const AcDbObjectId &, AcDb::CellOption)
Assigns an AcDbField object to the cell at the given row, column, & content index. More...
virtual Acad::ErrorStatus  | setFlowDirection (AcDb::FlowDirection)
Sets the table flow direction (top-to-bottom or bottom-to-top) More...
virtual Acad::ErrorStatus  | setGridColor (int, int, AcDb::GridLineType, const AcCmColor &)
Sets the colour of the grid line type surrounding the row, column, or cell at the given index. More...
virtual Acad::ErrorStatus  | setGridDoubleLineSpacing (int, int, AcDb::GridLineType, double)
Sets the double-line spacing for one or more grid line type surrounding a cell. More...
virtual Acad::ErrorStatus  | setGridLineStyle (int, int, AcDb::GridLineType, AcDb::GridLineStyle)
Sets the grid line style for a row, column, or cell at the given index. More...
virtual Acad::ErrorStatus  | setGridLinetype (int, int, AcDb::GridLineType, const AcDbObjectId &)
Sets the linetype for one or more grid line types surrounding a row, column, or cell. More...
virtual Acad::ErrorStatus  | setGridLineWeight (int, int, AcDb::GridLineType, AcDb::LineWeight)
Sets the lineweight for one or more grid line types surrounding a row, column, or cell. More...
virtual Acad::ErrorStatus  | setGridProperty (const AcCellRange &, AcDb::GridLineType, const AcGridProperty &)
Sets the grid properties for a given cell range. More...
virtual Acad::ErrorStatus  | setGridProperty (int, int, AcDb::GridLineType, const AcGridProperty &)
Sets the grid properties for a row, column, or cell at a given index. More...
virtual Acad::ErrorStatus  | setGridVisibility (int, int, AcDb::GridLineType, AcDb::Visibility)
Sets the visibility of the grid line type surrounding a row, column, or cell. More...
virtual Acad::ErrorStatus  | setMargin (int, int, AcDb::CellMargin, double)
Sets the size of the given margin type(s), for a given row, column, or cell. More...
virtual Acad::ErrorStatus  | setOverride (int, int, AcDb::GridLineType, AcDb::GridProperty)
Overrides properties for one or more grid line types surrounding a row, column, or cell at a given index. More...
virtual Acad::ErrorStatus  | setOverride (int, int, int, AcDb::CellProperty)
Overrides cell properties for content at a given row, column, and content index. More...
virtual Acad::ErrorStatus  | setRotation (int, int, double)
Sets the rotation (in radians) of the first content in the cell at the given row & column index. More...
virtual Acad::ErrorStatus  | setRotation (int, int, int, double)
Sets the rotation (in radians) of the content in the cell at the given row, column, & content index. More...
virtual Acad::ErrorStatus  | setScale (int, int, double)
Sets the scale of the first content in the cell at the given row & column index. More...
virtual Acad::ErrorStatus  | setScale (int, int, int, double)
Sets the scale of the content in the cell at the given row, column, & content index. More...
virtual Acad::ErrorStatus  | setTextHeight (int, int, double)
Sets the text height of the first content in the cell at the given row & column index. More...
virtual Acad::ErrorStatus  | setTextHeight (int, int, int, double)
Sets the text height of the content in the cell at the given row, column, & content index. More...
virtual Acad::ErrorStatus  | setTextStyle (int, int, const AcDbObjectId &)
Sets the text style of the first content in the cell at the given row & column index. More...
virtual Acad::ErrorStatus  | setTextStyle (int, int, int, const AcDbObjectId &)
Sets the text style of the content in the cell at the given row, column, & content index. More...
virtual double  | textHeight (int, int) const
Returns the text height of the first content in the cell at the given row & column index. More...
virtual double  | textHeight (int, int, int) const
Returns the text height of the content in the cell at the given row, column, & content index. More...
virtual AcDbObjectId  | textStyle (int, int) const
Returns the ObjectId of the text style of the first content in the cell at the given row & column index. More...
virtual AcDbObjectId  | textStyle (int, int, int) const
Returns the ObjectId of the text style of the content in the cell at the given row, column, & content index. More...
virtual Acad::ErrorStatus  | unmerge (const AcCellRange &)
Unmerges cells in the given cell range. More...
 Public Member Functions inherited from AcDbLinkedTableData
virtual int  | appendColumn (int)
Appends multiple columns. More...
virtual int  | appendRow (int)
Appends multiple rows. More...
virtual bool  | canDelete (int, int, bool) const
Checks the possibility of deleting rows or columns. More...
virtual bool  | canInsert (int, bool) const
Checks the possibility of inserting rows or columns at index. More...
virtual AcDb::CellState  | cellState (int, int) const
Returns the cell state for the specified cell. More...
Acad::ErrorStatus  | clear () override
Clears table data. More...
virtual AcDb::CellContentType  | contentType (int, int) const
Returns the content type actually defined for this cell. More...
virtual AcDb::CellContentType  | contentType (int, int, int) const
Returns the content type actually defined for this cell. More...
virtual Acad::ErrorStatus  | copyFrom (const AcDbLinkedTableData *, AcDb::TableCopyOption)
Copies another table content to this one. More...
virtual Acad::ErrorStatus  | copyFrom (const AcDbLinkedTableData *, AcDb::TableCopyOption, const AcCellRange &, const AcCellRange &, AcCellRange *)
Copies another table content to this one. More...
virtual int  | createContent (int, int, int)
Creates a new cell content for specified cell, using given content index. More...
virtual AcString  | dataFormat (int, int) const
Returns the data format string for the first content of the specified table cell. More...
virtual AcString  | dataFormat (int, int, int) const
Returns the data format string for the content of the specified table cell. More...
virtual Acad::ErrorStatus  | deleteColumn (int, int)
Deletes some of this table's columns. More...
virtual Acad::ErrorStatus  | deleteContent (const AcCellRange &)
Deletes the specified content for the specified cell. More...
virtual Acad::ErrorStatus  | deleteContent (int, int)
Deletes the specified content for the specified cell. More...
virtual Acad::ErrorStatus  | deleteContent (int, int, int)
Deletes the specified content for the specified cell. More...
virtual Acad::ErrorStatus  | deleteRow (int, int)
Deletes some of this table's rows. More...
Acad::ErrorStatus  | dwgInFields (AcDbDwgFiler *) override
Acad::ErrorStatus  | dwgOutFields (AcDbDwgFiler *) const override
Acad::ErrorStatus  | dxfInFields (AcDbDxfFiler *) override
Acad::ErrorStatus  | dxfOutFields (AcDbDxfFiler *) const override
 virtual Acad::ErrorStatus  | evaluateFormula ()
virtual AcString  | getBlockAttributeValue (int, int, const AcDbObjectId &) const
Gets the attribute value for the block at the cell specified with row and column, if the content for this cell is a block. More...
virtual AcString  | getBlockAttributeValue (int, int, int, const AcDbObjectId &) const
Gets the attribute value for the block at the cell specified with row and column, if the content for this cell is a block. More...
virtual AcDbObjectId  | getBlockTableRecordId (int, int) const
Returns the block table record id. More...
virtual AcDbObjectId  | getBlockTableRecordId (int, int, int) const
Returns the block table record id. More...
virtual const ACHAR *  | getColumnName (int) const
Returns the column name for the specified column. More...
virtual int  | getCustomData (int, int) const
Gets custom data to row, or column, or cell. More...
virtual Acad::ErrorStatus  | getCustomData (int, int, const ACHAR *, AcValue *) const
Gets custom data to row, or column, or cell. More...
virtual int  | getDataLink (const AcCellRange *, AcDbObjectIdArray &) const
Get a data link. More...
virtual AcDbObjectId  | getDataLink (int, int) const
Get a data link of a specific cell. More...
virtual Acad::ErrorStatus  | getDataLink (int, int, AcDbDataLink *&, AcDb::OpenMode) const
Get a data link. More...
virtual AcCellRange  | getDataLinkRange (int, int) const
Returns data linked cell range. More...
virtual Acad::ErrorStatus  | getDataType (int, int, AcValue::DataType &, AcValue::UnitType &) const
Returns the data type and unit type for the first content of the specified table cell. More...
virtual Acad::ErrorStatus  | getDataType (int, int, int, AcValue::DataType &, AcValue::UnitType &) const
Returns the data type and unit type for the first content of the specified table cell. More...
virtual Acad::ErrorStatus  | getField (int, int, int, AcDbField *&, AcDb::OpenMode) const
Get the cell field. More...
virtual AcDbObjectId  | getFieldId (int, int) const
Get the field id of a specific cell. More...
virtual AcDbObjectId  | getFieldId (int, int, int) const
Get the field id of a specific cell. More...
virtual AcString  | getFormula (int, int, int) const
Returns the string formula for the content of the specified table cell. More...
AcDbTableIterator *  | getIterator () const
Returns the table iterator. More...
AcDbTableIterator *  | getIterator (const AcCellRange *, AcDb::TableIteratorOption) const
Returns the table iterator. More...
virtual AcString  | getText (int, int) const
Returns the text string for the first content of the specified table cell. More...
virtual AcString  | getText (int, int, int) const
Returns the text string for the content of the specified table cell. More...
virtual AcString  | getText (int, int, int, AcValue::FormatOption) const
Returns the text string for the content of the specified table cell. More...
virtual AcString  | getToolTip (int, int) const
Get the row, column or cell tooltip string. More...
virtual Acad::ErrorStatus  | getValue (int, int, AcValue &) const
Gets the content value. More...
virtual Acad::ErrorStatus  | getValue (int, int, int, AcValue::FormatOption, AcValue &) const
Gets the content value. More...
virtual bool  | hasFormula (int, int, int) const
Checks if the cell has formula. More...
virtual int  | insertColumn (int, int)
Inserts new columns into this table entity at the specified column index. More...
virtual int  | insertRow (int, int)
Inserts new rows into this table entity at the specified row index. More...
virtual bool  | isContentEditable (int, int) const
Checks if the cell content can be modified. More...
virtual bool  | isLinked (int, int) const
Checks if the cell has data link. More...
virtual Acad::ErrorStatus  | moveContent (int, int, int, int)
Move table cell content possition. More...
virtual int  | numColumns () const
Returns the number of colums for this table object. More...
virtual int  | numContents (int, int) const
Return the number of contents for the specified cell. More...
virtual int  | numRows (void) const
Returns the number of rows for this table object. More...
virtual Acad::ErrorStatus  | removeDataLink ()
Remove table data link. More...
virtual Acad::ErrorStatus  | removeDataLink (int, int)
Remove table data link. More...
virtual Acad::ErrorStatus  | setBlockAttributeValue (int, int, const AcDbObjectId &, const ACHAR *)
Sets the attribute value for the attribute defininition attId and for the block at the cell specified with row and column, if the content for this cell is a block. More...
virtual Acad::ErrorStatus  | setBlockAttributeValue (int, int, int, const AcDbObjectId &, const ACHAR *)
Sets the attribute value for the attribute defininition attId and for the block at the cell specified with row and column, if the content for this cell is a block. More...
virtual Acad::ErrorStatus  | setBlockTableRecordId (int, int, const AcDbObjectId &)
Sets the block table record object id at the given row and column. More...
virtual Acad::ErrorStatus  | setBlockTableRecordId (int, int, int, const AcDbObjectId &)
Sets the block table record object id at the given row and column. More...
virtual Acad::ErrorStatus  | setCellState (int, int, AcDb::CellState)
Sets the cell state for the specified cell. More...
virtual Acad::ErrorStatus  | setColumnName (int, const ACHAR *)
Sets the name of the column. More...
virtual Acad::ErrorStatus  | setCustomData (int, int, const ACHAR *, const AcValue *)
Sets custom data to row, or column, or cell. More...
virtual Acad::ErrorStatus  | setCustomData (int, int, int)
Sets custom data to row, or column, or cell. More...
virtual Acad::ErrorStatus  | setDataFormat (int, int, const ACHAR *)
Defines the data format string for the first content of the specified table cell. More...
virtual Acad::ErrorStatus  | setDataFormat (int, int, int, const ACHAR *)
Defines the data format string for the first content of the specified table cell. More...
virtual Acad::ErrorStatus  | setDataLink (const AcCellRange &, const AcDbObjectId &, bool)
Set table data link. More...
virtual Acad::ErrorStatus  | setDataLink (int, int, const AcDbObjectId &, bool)
Set table data link. More...
virtual Acad::ErrorStatus  | setDataType (int, int, AcValue::DataType, AcValue::UnitType)
Sets the data type and unit for the specified content of the specified table cell. More...
virtual Acad::ErrorStatus  | setDataType (int, int, int, AcValue::DataType, AcValue::UnitType)
Sets the data type and unit for the specified content of the specified table cell. More...
virtual Acad::ErrorStatus  | setFieldId (int, int, const AcDbObjectId &)
Assigns an AcDbField object to the specified table cell. More...
virtual Acad::ErrorStatus  | setFieldId (int, int, int, const AcDbObjectId &)
Assigns an AcDbField object to the specified table cell. More...
virtual Acad::ErrorStatus  | setFormula (int, int, int, const ACHAR *)
Set the content formula. More...
virtual Acad::ErrorStatus  | setSize (int, int)
Sets the table size. More...
virtual Acad::ErrorStatus  | setText (int, int, const ACHAR *)
Set the first content text. More...
virtual Acad::ErrorStatus  | setText (int, int, int, const ACHAR *)
Set the first content text. More...
virtual Acad::ErrorStatus  | setToolTip (int, int, const ACHAR *)
Sets the tool tip for the specified cell. More...
virtual Acad::ErrorStatus  | setValue (int, int, const AcValue &)
Sets the first content of the specified table cell to the given value. More...
virtual Acad::ErrorStatus  | setValue (int, int, int, const AcValue &)
Sets the specified table cell at specified content index to the given value. More...
virtual Acad::ErrorStatus  | setValue (int, int, int, const AcValue &, AcValue::ParseOption)
Sets the specified table cell at specified content index to the given value. More...
virtual Acad::ErrorStatus  | updateDataLink (AcDb::UpdateDirection, AcDb::UpdateOption)
Update table data link. More...
virtual Acad::ErrorStatus  | updateDataLink (int, int, AcDb::UpdateDirection, AcDb::UpdateOption)
Update table data link. More...
 Public Member Functions inherited from AcDbLinkedData
virtual Acad::ErrorStatus  | clear (void)
virtual const ACHAR *  | description () const
Returns the data description, it can be empty. More...
Acad::ErrorStatus  | dwgInFields (AcDbDwgFiler *pFiler) override
Acad::ErrorStatus  | dwgOutFields (AcDbDwgFiler *pFiler) const override
Acad::ErrorStatus  | dxfInFields (AcDbDxfFiler *pFiler) override
Acad::ErrorStatus  | dxfOutFields (AcDbDxfFiler *pFiler) const override
 virtual bool  | isEmpty () const
virtual const ACHAR *  | name () const
Returns the data name, it can be empty. More...
virtual Acad::ErrorStatus  | setDescription (const ACHAR *pszDescription)
Sets data description. More...
virtual Acad::ErrorStatus  | setName (const ACHAR *pszName)
Sets data name. More...
 Public Member Functions inherited from AcDbObject
virtual Acad::ErrorStatus  | addPersistentReactor (AcDbObjectId)
Adds a persistent reactor to this object reactor list. More...
Acad::ErrorStatus  | addReactor (AcDbObjectReactor *) const
Adds a transient reactor to this object. More...
virtual Acad::ErrorStatus  | applyPartialUndo (AcDbDwgFiler *, AcRxClass *)
This function is called during Undo operations on objects, that use the 'Partial Undo meachanism'; this is, this object is opened with assertWriteEnabled(Adesk::kFalse) to indicate that custom Undo filing is used rather than the default Undo filing. More...
 void  | assertNotifyEnabled () const
 void  | assertReadEnabled () const
 void  | assertWriteEnabled (Adesk::Boolean=Adesk::kTrue, Adesk::Boolean=Adesk::kTrue)
virtual Acad::ErrorStatus  | audit (AcDbAuditInfo *)
Performs the audit operation for this object. More...
Acad::ErrorStatus  | cancel ()
Reverts all changes since the object had been opened and closes the object. More...
virtual void  | cancelled (const AcDbObject *)
A handler function for persistent reactors. More...
virtual AcRxObject *  | clone () const
Creates a shallow clone of this object. More...
Acad::ErrorStatus  | close ()
Closes the object. More...
Acad::ErrorStatus  | closeAndPage (Adesk::Boolean=Adesk::kTrue)
Closes the object. More...
virtual Acad::ErrorStatus  | composeForLoad (AcDb::OdaSaveType, AcDb::AcDbDwgVersion)
This function is intended for future MT file loading support. More...
virtual void  | copied (const AcDbObject *, const AcDbObject *)
A handler function for persistent reactors. More...
virtual Acad::ErrorStatus  | copyFrom (const AcRxObject *)
Copies the pSrc object information in this object. More...
Acad::ErrorStatus  | createExtensionDictionary ()
Creates a dictionary as extension dictionary for this object. More...
AcDbDatabase *  | database () const
Returns the database that contains this object. More...
virtual Acad::ErrorStatus  | decomposeForSave (AcDb::AcDbDwgVersion, AcDbObject *&, AcDbObjectId &, Adesk::Boolean &)
This function is called during dwg and dxf output, to allow a custom object to decompose itself, due to provided dwg/dxf target file version. More...
virtual Acad::ErrorStatus  | deepClone (AcDbObject *, AcDbObject *&, AcDbIdMapping &, Adesk::Boolean=Adesk::kTrue) const final
Clones this object, appends it to the owner pOwner and adds an AcDbIdPair record to the idMap. More...
void  | disableUndoRecording (Adesk::Boolean)
Disables or enables the undo recording for the object. More...
Acad::ErrorStatus  | downgradeOpen ()
Sets the open mode for an object opened for write to be opened for read. More...
Acad::ErrorStatus  | downgradeToNotify (Adesk::Boolean)
Sets the open mode for an object opened for write to be opened for notify. More...
virtual AcGiDrawable *  | drawable ()
Retrieves the AcGiDrawable instance of this object. More...
Acad::ErrorStatus  | dwgIn (AcDbDwgFiler *)
Calls the object's dwgInFields function, and reads any XData if present. More...
virtual Acad::ErrorStatus  | dwgInFields (AcDbDwgFiler *)
Reads the object from the DWG filer. More...
Acad::ErrorStatus  | dwgOut (AcDbDwgFiler *) const
Calls the object's dwgOutFields function, and writes any XData if present. More...
virtual Acad::ErrorStatus  | dwgOutFields (AcDbDwgFiler *) const
Writes the object to the DWG filer. More...
Acad::ErrorStatus  | dxfIn (AcDbDxfFiler *)
Calls the object's dxfInFields function, and reads any XData if present. More...
virtual Acad::ErrorStatus  | dxfInFields (AcDbDxfFiler *)
Reads the object from the DXF filer. More...
Acad::ErrorStatus  | dxfOut (AcDbDxfFiler *, Adesk::Boolean, Adesk::uchar *) const
Calls the object's dxfOutFields function, and writes any XData if present. More...
virtual Acad::ErrorStatus  | dxfOutFields (AcDbDxfFiler *) const
Writes the object to the DXF filer. More...
Acad::ErrorStatus  | erase (Adesk::Boolean=Adesk::kTrue)
Sets the bit that indicates that the object is erased. More...
virtual void  | erased (const AcDbObject *, Adesk::Boolean)
A handler function for persistent reactors. More...
AcDbObjectId  | extensionDictionary () const
Returns the object id of the extension dictionary for this object. More...
void  | getAcDbHandle (AcDbHandle &) const
Returns handle of this object. More...
Acad::ErrorStatus  | getBinaryData (const ACHAR *, Adesk::Int32 &, char *&) const
Creates a copy of the binary data stored as chunks of maximum 127 bytes in the resbuf chain of this object's extension dictionary xrecord entry given by entryName. More...
int  | getBrxOpenCount () const
This function returns the number of open BRX instances for this object. More...
int  | getBrxOpenState () const
This function returns the BRX object open state flags as bitfields, for diagnostic purpose. More...
virtual Acad::ErrorStatus  | getClassID (CLSID *) const final
Gets the COM wrapper Class ID for this entity. More...
int  | getCustomObjectState () const
This function returns the custom object status : 1=isCustomObject 2=DifferentialUndoDisabled. More...
Acad::ErrorStatus  | getField (const ACHAR *, AcDbField *&, AcDb::OpenMode) const
Retrieves the specified Field from this object, and opens it in mode. More...
Acad::ErrorStatus  | getField (const ACHAR *, AcDbObjectId &) const
Gets the pszPropName field object from field dictionary of this AcDbObject object, using pszPropName as key. More...
AcDbObjectId  | getFieldDictionary () const
Returns the Field dictionary associated with this object,. More...
Acad::ErrorStatus  | getFieldDictionary (AcDbDictionary *&, AcDb::OpenMode) const
Gets and opens the field dictionary for this. More...
Acad::ErrorStatus  | getObjectBirthVersion (AcDb::AcDbDwgVersion &, AcDb::MaintenanceReleaseVersion &)
This function is currently not supported by the CAD engine, always returns Acad::eOk, and 'kDHL_CURRENT' + 'kMReleaseCurrent' results. More...
virtual Acad::ErrorStatus  | getObjectSaveVersion (const AcDbDwgFiler *, AcDb::AcDbDwgVersion &, AcDb::MaintenanceReleaseVersion &)
Returns the DWG version for saving the object. More...
virtual Acad::ErrorStatus  | getObjectSaveVersion (const AcDbDxfFiler *, AcDb::AcDbDwgVersion &, AcDb::MaintenanceReleaseVersion &)
Returns the DWG version for saving the object. More...
int  | getOdaOpenCount () const
This function returns the number of open ODA instances for this object. More...
int  | getOdaOpenState () const
This function returns the ODA object open state flags as bitfields, for diagnostic purpose. More...
virtual void  | goodbye (const AcDbObject *)
A handler function for persistent reactors. More...
Acad::ErrorStatus  | handOverTo (AcDbObject *, Adesk::Boolean=Adesk::kTrue, Adesk::Boolean=Adesk::kTrue)
Hands over objects identity to another object. More...
bool  | hasFields () const
Return true if this object has single or multiple fields associated with him. More...
bool  | hasPersistentReactor (AcDbObjectId) const
Checks the input objectId in this object reactor list. More...
bool  | hasSaveVersionOverride ()
This function indicates whether this object overrides the filer's save version. More...
virtual AcDbObjectId  | id () const
Returns the database id of this object. More...
Adesk::Boolean  | isAcDbObjectIdsInFlux () const
Checks whether a deep clone operation was completed. More...
Adesk::Boolean  | isAProxy () const
Adesk::Boolean  | isCancelling () const
Adesk::Boolean  | isErased () const
Returns whether this object is erased. More...
Adesk::Boolean  | isEraseStatusToggled () const
Checks whether the object erase status has been toggled. More...
Adesk::Boolean  | isModified () const
Returns whether this object's assertWriteEnabled() has been called since it was opened. More...
Adesk::Boolean  | isModifiedGraphics () const
Checks whether this object graphics will be updated when the object is closed. More...
Adesk::Boolean  | isModifiedXData () const
Checks whether this object's xData was modified. More...
Adesk::Boolean  | isNewObject () const
Returns true if and only if this object has not been closed since it was created. More...
Adesk::Boolean  | isNotifyEnabled () const
Returns whether this object is opened for notify. More...
Adesk::Boolean  | isNotifying () const
virtual Adesk::Boolean  | isPersistent () const
Returns the 'persistent' status of a database object. More...
Adesk::Boolean  | isReadEnabled () const
Returns whether this object is opened for read. More...
 Adesk::Boolean  | isReallyClosing () const
Checks whether the next close call will completely close this object return true if on the next call the object will be completely closed false otherwise.
Adesk::Boolean  | isTransactionResident () const
Gets the object transaction status. More...
Adesk::Boolean  | isUndoing () const
bool  | isUndoRecordingDisabled () const
Returns whether the undo recording for the object is enabled or not. More...
Adesk::Boolean  | isWriteEnabled () const
Returns whether this object is opened for write. More...
virtual AcDb::DuplicateRecordCloning  | mergeStyle () const
Returns the object's merge behavior during cloning. More...
virtual void  | modified (const AcDbObject *)
A handler function for persistent reactors. More...
virtual void  | modifiedGraphics (const AcDbEntity *)
A handler function for persistent reactors. More...
virtual void  | modifiedXData (const AcDbObject *)
A handler function for persistent reactors. More...
virtual void  | modifyUndone (const AcDbObject *)
A handler function for persistent reactors. More...
virtual void  | objectClosed (const AcDbObjectId)
A handler function for persistent reactors. More...
AcDbObjectId  | objectId () const
Returns object id. More...
virtual void  | openedForModify (const AcDbObject *)
A handler function for persistent reactors. More...
AcDbObjectId  | ownerId () const
Returns object id of the owner. More...
AcDbVoidPtrArray *  | reactors ()
Gets the object pointers to reactors. More...
const AcDbVoidPtrArray *  | reactors () const
Gets the object pointers to reactors. More...
virtual void  | reappended (const AcDbObject *)
A handler function for persistent reactors. More...
 virtual void  | recvPropagateModify (const AcDbObject *)
Not implemented yet.
Acad::ErrorStatus  | releaseExtensionDictionary ()
Removes the extension dictionary associated with this object. More...
virtual Acad::ErrorStatus  | removeField (AcDbObjectId)
Removes the Field specified by acFieldId from this object. More...
virtual Acad::ErrorStatus  | removeField (const ACHAR *)
Removes the Field specified by szKeyString from this object. More...
virtual Acad::ErrorStatus  | removeField (const ACHAR *, AcDbObjectId &)
Removes the Field specified by acPszKeyString from this object, and returns its ObjectId value. More...
virtual Acad::ErrorStatus  | removePersistentReactor (AcDbObjectId)
Removes a persistent reactor from this object reactor list. More...
Acad::ErrorStatus  | removeReactor (AcDbObjectReactor *) const
Removes a transient reactor to this object. More...
void  | setAcDbObjectIdsInFlux ()
Call this function to indicate that the object IDs of this object and its sub-objects (if any) are not yet valid. More...
Acad::ErrorStatus  | setBinaryData (const ACHAR *, Adesk::Int32, const char *)
Creates a copy of the binary data, divides it in up to 127 bytes binary chunks and
 sets them as resbufs in the resbuf chain of this object's extension dictionary xrecord entry given by entryName. More...
virtual Acad::ErrorStatus  | setField (const ACHAR *, AcDbField *, AcDbObjectId &)
Adds the pAcField field object to field dictionary of this AcDbObject object, using pKey as key. More...
void  | setHasSaveVersionOverride (bool)
This function can be called to specify that the object has a "save version override". More...
virtual Acad::ErrorStatus  | setOwnerId (AcDbObjectId)
Sets the ownerId data member of the object to be objId. More...
virtual Acad::ErrorStatus  | setXData (const resbuf *)
Sets/removes xData associated with this object. More...
virtual Acad::ErrorStatus  | subCancel ()
Possibility to veto a cancel operation from within custom entities. More...
virtual Acad::ErrorStatus  | subClose ()
virtual Acad::ErrorStatus  | subErase (Adesk::Boolean)
This hook is called during an AcDbObject::erase call, before any actual erase operation is performed. More...
 virtual Acad::ErrorStatus  | subHandOverTo (AcDbObject *)
virtual void  | subObjModified (const AcDbObject *, const AcDbObject *)
A handler function for persistent reactors. More...
 virtual Acad::ErrorStatus  | subOpen (AcDb::OpenMode)
virtual Acad::ErrorStatus  | subSwapIdWith (AcDbObjectId, Adesk::Boolean=Adesk::kFalse, Adesk::Boolean=Adesk::kFalse)
This hook is called during an AcDbObject::swapIdWith() call, before any actual swap operation is performed. More...
Acad::ErrorStatus  | swapIdWith (AcDbObjectId, Adesk::Boolean=Adesk::kFalse, Adesk::Boolean=Adesk::kFalse)
Swaps the object id's between the object identified by param swapId and this object. More...
virtual Acad::ErrorStatus  | swapReferences (const AcDbIdMapping &)
Not implemented yet. More...
virtual void  | unappended (const AcDbObject *)
A handler function for persistent reactors. More...
AcDbDwgFiler *  | undoFiler ()
Gets the undo filer for this object. More...
Acad::ErrorStatus  | upgradeFromNotify (Adesk::Boolean &)
Upgrades the open status of this object to AcDb::kForWrite, if this object is already open (either in AcDb::kForRead, AcDb::kForNotify or AcDb::kForWrite) More...
Acad::ErrorStatus  | upgradeOpen ()
Changes the objects open mode to AcDb::kForWrite and sends notifications. More...
virtual Acad::ErrorStatus  | wblockClone (AcRxObject *, AcDbObject *&, AcDbIdMapping &, Adesk::Boolean=Adesk::kTrue) const final
Clones this object, appends it to the owner pOwner and adds an AcDbIdPair record to the idMap. More...
virtual resbuf *  | xData (const ACHAR *=NULL) const
Returns the xData associated with this object. More...
Acad::ErrorStatus  | xDataTransformBy (const AcGeMatrix3d &)
Transforms the extended data according to parameter transformation matrix. More...
 virtual void  | xmitPropagateModify () const
Not implemented yet.
 virtual  | ~AcDbObject ()
Destructor.
 Public Member Functions inherited from AcGiDrawable
virtual bool  | bounds (AcDbExtents &) const
virtual DrawableType  | drawableType () const
 virtual AcGiDrawStream *  | drawStream () const
 AcGsNode *  | gsNode () const
virtual AcDbObjectId  | id () const =0
virtual Adesk::Boolean  | isPersistent () const =0
virtual Adesk::UInt32  | regenSupportFlags () const final
Returns whether and to which level this object supports MultiThreading. More...
 virtual Adesk::Boolean  | RolloverHit (Adesk::ULongPtr, Adesk::ULongPtr, Adesk::Boolean)
 virtual Adesk::UInt32  | setAttributes (AcGiDrawableTraits *) final
 virtual void  | setDrawStream (AcGiDrawStream *)
 void  | setGsNode (AcGsNode *)
 virtual void  | viewportDraw (AcGiViewportDraw *) final
 virtual Adesk::UInt32  | viewportDrawLogicalFlags (AcGiViewportDraw *) final
 virtual Adesk::Boolean  | worldDraw (AcGiWorldDraw *) final
 Public Member Functions inherited from AcRxObject
virtual AcRxObject *  | clone () const
Exported and implemented. More...
 virtual AcRx::Ordering  | comparedTo (const AcRxObject *) const
Exported and implemented.
virtual Acad::ErrorStatus  | copyFrom (const AcRxObject *)
Exported and implemented. More...
 virtual AcRxClass *  | isA () const
Exported and implemented.
virtual Adesk::Boolean  | isEqualTo (const AcRxObject *) const
Exported and implemented. More...
bool  | isKindOf (const AcRxClass *) const
Checks the object class. More...
AcRxObject *  | queryX (const AcRxClass *) const
returns the protocol extension object assigned to this class or a parent class. More...
AcRxObject *  | x (const AcRxClass *) const
returns the protocol extension object assigned to this class or a parent class. More...
 virtual  | ~AcRxObject ()
Destructor.
 Additional Inherited Members
 Public Types inherited from AcGiDrawable
enum  | DrawableType {
 kGeometry = 0 , kDistantLight , kPointLight , kSpotLight ,
 kAmbientLight , kSolidBackground , kGradientBackground , kImageBackground ,
 kGroundPlaneBackground , kViewport
 }
enum  | SetAttributesFlags {
 kDrawableNone = 0 , kDrawableIsAnEntity = 1 , kDrawableUsesNesting = 2 , kDrawableIsCompoundObject = 4 ,
 kDrawableViewIndependentViewportDraw = 8 , kDrawableIsInvisible = 16 , kDrawableHasAttributes = 32 , kDrawableRegenTypeDependentGeometry = 64 ,
 kDrawableIsDimension = 133 , kDrawableRegenDraw = 256 , kDrawableStandardDisplaySingleLOD = 512 , kDrawableShadedDisplaySingleLOD = 1024 ,
 kDrawableViewDependentViewportDraw = 2048 , kDrawableBlockDependentViewportDraw = 4096 , kDrawableIsExternalReference = 8192 , kDrawableNotPlottable = 16384 ,
 kDrawableNotAllowLCS = 32768 , kDrawableMergeControlOff = 65536 , kThreadedWorldDrawViewportDraw = 131072
 }
 Static Public Member Functions inherited from AcRxObject
 static AcRxObject *  | cast (const AcRxObject *)
 static AcRxClass *  | desc ()
Exported and implemented.
 Static Public Member Functions inherited from AcHeapOperators
 static void  | operator delete (void *)
_
 static void  | operator delete (void *, const char *, int)
 static void  | operator delete (void *, void *)
 static void  | operator delete[] (void *)
_
 static void  | operator delete[] (void *, const char *, int)
 static void *  | operator new (size_t)
_
 static void *  | operator new (size_t, const char *, int)
 static void *  | operator new (size_t, void *p)
 static void *  | operator new[] (size_t)
_
 static void *  | operator new[] (size_t, const char *, int)
 Protected Member Functions inherited from AcDbObject
virtual Acad::ErrorStatus  | subDeepClone (AcDbObject *, AcDbObject *&, AcDbIdMapping &, Adesk::Boolean=true) const
virtual Acad::ErrorStatus  | subGetClassID (CLSID *) const
virtual Adesk::UInt32  | subSetAttributes (AcGiDrawableTraits *)
Sets the values of this object's subentity traits and returns with the calling object's subentity traits. More...
virtual void  | subViewportDraw (AcGiViewportDraw *)
virtual Adesk::UInt32  | subViewportDrawLogicalFlags (AcGiViewportDraw *)
virtual Acad::ErrorStatus  | subWblockClone (AcRxObject *, AcDbObject *&, AcDbIdMapping &, Adesk::Boolean=true) const
virtual Adesk::Boolean  | subWorldDraw (AcGiWorldDraw *)
 Protected Member Functions inherited from AcGiDrawable
virtual Adesk::UInt32  | subRegenSupportFlags () const
Returns whether and to which level this object supports MultiThreading. More...
virtual Adesk::UInt32  | subSetAttributes (AcGiDrawableTraits *)=0
virtual void  | subViewportDraw (AcGiViewportDraw *)=0
 virtual Adesk::UInt32  | subViewportDrawLogicalFlags (AcGiViewportDraw *)
virtual Adesk::Boolean  | subWorldDraw (AcGiWorldDraw *)=0
 Protected Member Functions inherited from AcRxObject
AcRxObject ()
Exported and implemented.
Member Function Documentation
◆ alignment()
 UX_EXPORT_FUNCTION AcDb::CellAlignment AcDbFormattedTableData::alignment  |  ( |  int  |  row,
|  int  |  column
) |   |  const
virtual
Returns the cell alignment of the specified cell.
Parameters
[in] | row | - the row index
[in] | column | - the column index
Returns
the cell alignment of the specified cell
◆ backgroundColor()
 UX_EXPORT_FUNCTION AcCmColor AcDbFormattedTableData::backgroundColor  |  ( |  int  |  row,
|  int  |  column
) |   |  const
virtual
Returns the background colour of the specified cell.
Parameters
[in] | row | - the row index
[in] | column | - the column index
Returns
the background colour of the specified cell
◆ contentColor() [1/2]
 UX_EXPORT_FUNCTION AcCmColor AcDbFormattedTableData::contentColor  |  ( |  int  |  row,
|  int  |  column
) |   |  const
virtual
Returns the colour of the cell at the specified row & column index.
Parameters
[in] | row | - the row index
[in] | column | - the column index
Returns
the colour of the specified cell
◆ contentColor() [2/2]
 UX_EXPORT_FUNCTION AcCmColor AcDbFormattedTableData::contentColor  |  ( |  int  |  row,
|  int  |  column,
|  int  |  ci
) |   |  const
virtual
Returns the colour of the cell at the specified row, column & content index.
Parameters
[in] | row | - the row index
[in] | column | - the column index
[in] | ci | - the content index
Returns
the colour of the specified cell
◆ contentLayout()
 UX_EXPORT_FUNCTION AcDb::CellContentLayout AcDbFormattedTableData::contentLayout  |  ( |  int  |  row,
|  int  |  column
)
virtual
Returns the content layout of the cell at the specified row & column index.
Parameters
[in] | row | - the row index
[in] | column | - the column index
Returns
the content layout of the specified cell
◆ enableMergeAll()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbFormattedTableData::enableMergeAll  |  ( |  int  |  row,
|  int  |  column,
|  bool  |  enable
)
virtual
Enables or disables the Merge All flag for a given row or column.
Parameters
[in] | row | - the row index (use -1 to target entire column)
[in] | column | - the column index (use -1 to target entire row)
[in] | enable | - true to enable merge all; else false to disable
Returns
Acad::eOk if successful, else error status
◆ flowDirection()
 UX_EXPORT_FUNCTION AcDb::FlowDirection AcDbFormattedTableData::flowDirection  |  ( |   | ) |   const
virtual
Returns the flow direction for the table (Top-to-Bottom / Bottom-to-Top)
Returns
enum describing flow direction for the table
◆ getGridProperty()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbFormattedTableData::getGridProperty  |  ( |  int  |  row,
|  int  |  column,
|  AcDb::GridLineType  |  lineType,
|  AcGridProperty &  |  gridProperty
) |   |  const
virtual
Obtains the grid properties for the cell at the specified row & column index.
Parameters
[in] | row | - row index (use -1 for entire column)
[in] | column | - column index (use -1 for entire row)
[in] | lineType | - grid line type (single AcDb::GridLineType enum)
Returns
Acad::eOk if successful; else error status
Date
2023-06-23 leem implemented
◆ getMergeRange()
 UX_EXPORT_FUNCTION AcCellRange AcDbFormattedTableData::getMergeRange  |  ( |  int  |  row,
|  int  |  column
) |   |  const
virtual
Returns a cell range representing the range of merged cells containing the given row & column index; an invalid cell range is returned if the supplied cell is not part of a merged range.
Parameters
[in] | row | - row index
[in] | column | - column index
Returns
cell range representing range of merge cells containing the specified cell
Date
2023-06-23 leem implemented
◆ getOverride() [1/2]
 UX_EXPORT_FUNCTION AcDb::GridProperty AcDbFormattedTableData::getOverride  |  ( |  int  |  row,
|  int  |  column,
|  AcDb::GridLineType  |  lineType
) |   |  const
virtual
Returns a GridProperty enum describing overrides applied to the specified grid line type for the row, column, or cell at the given index.
Parameters
[in] | row | - row index (use -1 for entire column)
[in] | column | - column index (use -1 for entire row)
[in] | lineType | - grid line type (single AcDb::GridLineType enum)
Returns
AcDb::GridProperty enum successful; else AcDb::kGridPropInvalid
Date
2023-06-23 leem implemented
◆ getOverride() [2/2]
 UX_EXPORT_FUNCTION AcDb::CellProperty AcDbFormattedTableData::getOverride  |  ( |  int  |  row,
|  int  |  column,
|  int  |  ci
) |   |  const
virtual
Returns a CellProperty enum describing overrides applied to the row, column, cell or content index at the given index.
Parameters
[in] | row | - row index (use -1 for entire column)
[in] | column | - column index (use -1 for entire row)
[in] | ci | - content index (use -1 for entire cell, row, or column)
Returns
AcDb::GridProperty enum successful; else AcDb::kGridPropInvalid
Date
2023-06-26 leem implemented
◆ gridColor()
 UX_EXPORT_FUNCTION AcCmColor AcDbFormattedTableData::gridColor  |  ( |  int  |  row,
|  int  |  column,
|  AcDb::GridLineType  |  lineType
) |   |  const
virtual
Returns the colour of the given grid line type surrounding the row, column, or cell at the given index.
Parameters
[in] | row | - row index (use -1 for entire column)
[in] | column | - column index (use -1 for entire row)
[in] | lineType | - grid line type (single AcDb::GridLineType enum)
Returns
AcCmColor object describing grid line colour
Date
2023-06-26 leem implemented
◆ gridDoubleLineSpacing()
 UX_EXPORT_FUNCTION double AcDbFormattedTableData::gridDoubleLineSpacing  |  ( |  int  |  row,
|  int  |  column,
|  AcDb::GridLineType  |  lineType
) |   |  const
virtual
Returns the double-line spacing applied to a grid line type surrounding a cell.
Parameters
[in] | row | - row index (use -1 for entire column)
[in] | column | - column index (use -1 for entire row)
[in] | lineType | - grid line type (single AcDb::GridLineType enum)
Returns
Double-line spacing for the given grid line type surrounding the cell
◆ gridLineStyle()
 UX_EXPORT_FUNCTION AcDb::GridLineStyle AcDbFormattedTableData::gridLineStyle  |  ( |  int  |  row,
|  int  |  column,
|  AcDb::GridLineType  |  lineType
) |   |  const
virtual
Returns the grid line style for a single cell or an entire row or column.
Parameters
[in] | row | - row index (use -1 for entire column)
[in] | column | - column index (use -1 for entire row)
[in] | lineType | - grid line type (single AcDb::GridLineType enum)
Returns
AcDb::GridLineStyle for the given cell/row/column
◆ gridLinetype()
 UX_EXPORT_FUNCTION AcDbObjectId AcDbFormattedTableData::gridLinetype  |  ( |  int  |  row,
|  int  |  column,
|  AcDb::GridLineType  |  lineType
) |   |  const
virtual
Returns the linetype applied to a grid line type surrounding a row, column, or cell.
Parameters
[in] | row | - row index (use -1 for entire column)
[in] | column | - column index (use -1 for entire row)
[in] | lineType | - grid line type (single AcDb::GridLineType enum)
Returns
ObjectId of the linetype; else null ObjectId if unsuccessful
◆ gridLineWeight()
 UX_EXPORT_FUNCTION AcDb::LineWeight AcDbFormattedTableData::gridLineWeight  |  ( |  int  |  row,
|  int  |  column,
|  AcDb::GridLineType  |  lineType
) |   |  const
virtual
Returns the lineweight applied to the grid line type surrounding a row, column, or cell.
Parameters
[in] | row | - row index (use -1 for entire column)
[in] | column | - column index (use -1 for entire row)
[in] | lineType | - grid line type (single AcDb::GridLineType enum)
Returns
AcDb::LineWeight enum describing lineweight applied to the grid line type surrounding the row, column, or cell
◆ gridVisibility()
 UX_EXPORT_FUNCTION AcDb::Visibility AcDbFormattedTableData::gridVisibility  |  ( |  int  |  row,
|  int  |  column,
|  AcDb::GridLineType  |  lineType
) |   |  const
virtual
Returns the visibility of the grid line type surrounding a row, column, or cell.
Parameters
[in] | row | - row index (use -1 for entire column)
[in] | column | - column index (use -1 for entire row)
[in] | lineType | - grid line type (single AcDb::GridLineType enum)
Returns
AcDb::Visibility enum describing the visibility of the grid line type surrounding a row, column, or cell
◆ insertColumnAndInherit()
 UX_EXPORT_FUNCTION int AcDbFormattedTableData::insertColumnAndInherit  |  ( |  int  |  atColumn,
|  int  |  fromColumn,
|  int  |  numColumns
)
virtual
Inserts one or more columns at the given index, inheriting column properties from a given column index.
Parameters
[in] | atColumn | - index at which to insert the new column(s)
[in] | fromColumn | - index of column from which to inherit properties
[in] | numColumns | - number of columns to be inserted
Returns
integer representing the lowest index of the newly inserted columns
◆ insertRowAndInherit()
 UX_EXPORT_FUNCTION int AcDbFormattedTableData::insertRowAndInherit  |  ( |  int  |  atRow,
|  int  |  fromRow,
|  int  |  numRows
)
virtual
Inserts one or more rows at the given index, inheriting row properties from a given row index.
Parameters
[in] | atRow | - index at which to insert the new row(s)
[in] | fromRow | - index of row from which to inherit properties
[in] | numRows | - number of rows to be inserted
Returns
integer representing the lowest index of the newly inserted rows
◆ isAutoScale() [1/2]
 UX_EXPORT_FUNCTION bool AcDbFormattedTableData::isAutoScale  |  ( |  int  |  row,
|  int  |  column
) |   |  const
virtual
Returns true if auto-scaling is enabled for the first block in the cell at the given row & column index.
Parameters
[in] | row | - the row index
[in] | column | - the column index
Returns
true is auto-scaling is enabled; else false
◆ isAutoScale() [2/2]
 UX_EXPORT_FUNCTION bool AcDbFormattedTableData::isAutoScale  |  ( |  int  |  row,
|  int  |  column,
|  int  |  ci
) |   |  const
virtual
Returns true if auto-scaling is enabled for the block in the cell at the given row, column, & content index.
Parameters
[in] | row | - the row index
[in] | column | - the column index
[in] | ci | - the content index
Returns
true is auto-scaling is enabled; else false
◆ isFormatEditable()
 UX_EXPORT_FUNCTION bool AcDbFormattedTableData::isFormatEditable  |  ( |  int  |  row,
|  int  |  column
) |   |  const
virtual
Checks if the cell format can be modified at the given row & column index.
Parameters
[in] | row | - the row index
[in] | column | - the column index
Returns
true if cell format can be modified; else false
◆ isMergeAllEnabled()
 UX_EXPORT_FUNCTION bool AcDbFormattedTableData::isMergeAllEnabled  |  ( |  int  |  row,
|  int  |  column
) |   |  const
virtual
Returns true if merge all is enabled for the given row, column, or cell.
Parameters
[in] | row | - the row index (use -1 for entire column)
[in] | column | - the column index (use -1 for entire row)
Returns
true if merge all is enabled for the given row, column, or cell
◆ isMerged()
 UX_EXPORT_FUNCTION bool AcDbFormattedTableData::isMerged  |  ( |  int  |  row,
|  int  |  column
) |   |  const
virtual
Returns true if the cell at the given row & column index is part of a merged range.
Parameters
[in] | row | - the row index
[in] | column | - the column index
Returns
true if the cell is part of a merged range; else false
◆ margin()
 UX_EXPORT_FUNCTION double AcDbFormattedTableData::margin  |  ( |  int  |  row,
|  int  |  column,
|  AcDb::CellMargin  |  marginType
) |   |  const
virtual
Returns the size of the given margin type, for a given row, column, or cell.
Parameters
[in] | row | - the row index (use -1 for entire column)
[in] | column | - the column index (use -1 for entire row)
[in] | marginType | - AcDb::CellMargin enum describing the margin to return
Returns
size of the given margin type, for the given row, column, or cell
◆ merge()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbFormattedTableData::merge  |  ( |  const AcCellRange &  |  cellRange | )
virtual
Merges the cells in the given cell range.
Parameters
[in] | cellRange | - AcCellRange describing range of cells to be merged
Returns
Acad::eOk if successful; else error status
◆ removeAllOverrides()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbFormattedTableData::removeAllOverrides  |  ( |  int  |  row,
|  int  |  column
)
virtual
Removes all property overrides from the row, column, or cell at the given index.
Parameters
[in] | row | - the row index (use -1 for entire column)
[in] | column | - the column index (use -1 for entire row)
Returns
Acad::eOk if successful; else error status
◆ rotation() [1/2]
 UX_EXPORT_FUNCTION double AcDbFormattedTableData::rotation  |  ( |  int  |  row,
|  int  |  column
) |   |  const
virtual
Returns the rotation (in radians) of the first content in the cell at the given row & column index.
Parameters
[in] | row | - the row index
[in] | column | - the column index
Returns
rotation (in radians) of the first content in the cell at the given row & column index
◆ rotation() [2/2]
 UX_EXPORT_FUNCTION double AcDbFormattedTableData::rotation  |  ( |  int  |  row,
|  int  |  column,
|  int  |  ci
) |   |  const
virtual
Returns the rotation (in radians) of the content in the cell at the given row, column, & content index.
Parameters
[in] | row | - the row index
[in] | column | - the column index
[in] | ci | - the content index
Returns
rotation (in radians) of the content in the cell at the given row, column, & content index
◆ scale() [1/2]
 UX_EXPORT_FUNCTION double AcDbFormattedTableData::scale  |  ( |  int  |  row,
|  int  |  column
) |   |  const
virtual
Returns the scale of the first content in the cell at the given row & column index.
Parameters
[in] | row | - the row index
[in] | column | - the column index
Returns
scale of the first content in the cell at the given row & column index
◆ scale() [2/2]
 UX_EXPORT_FUNCTION double AcDbFormattedTableData::scale  |  ( |  int  |  row,
|  int  |  column,
|  int  |  ci
) |   |  const
virtual
Returns the scale of the content in the cell at the given row, column, & content index.
Parameters
[in] | row | - the row index
[in] | column | - the column index
[in] | ci | - the content index
Returns
scale of the content in the cell at the given row, column, & content index
◆ setAlignment()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbFormattedTableData::setAlignment  |  ( |  int  |  row,
|  int  |  column,
|  AcDb::CellAlignment  |  cellAlign
)
virtual
Sets the alignment of the content held by the cell at the given row & column index.
Parameters
[in] | row | - the row index
[in] | column | - the column index
[in] | cellAlign | - AcDb::CellAlignment enum representing new cell alignment
Returns
Acad::eOk if successful; else error status
◆ setAutoScale() [1/2]
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbFormattedTableData::setAutoScale  |  ( |  int  |  row,
|  int  |  column,
|  bool  |  enable
)
virtual
Enables/disables auto-scaling for the first block within the content of the cell at the given row & column index.
Parameters
[in] | row | - the row index
[in] | column | - the column index
[in] | enable | - true to enable auto-scaling; else false
Returns
Acad::eOk if successful; else error status
◆ setAutoScale() [2/2]
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbFormattedTableData::setAutoScale  |  ( |  int  |  row,
|  int  |  column,
|  int  |  ci,
|  bool  |  enable
)
virtual
Enables/disables auto-scaling for the block at the given row, column, & content index.
Parameters
[in] | row | - the row index
[in] | column | - the column index
[in] | ci | - the content index
[in] | enable | - true to enable auto-scaling; else false
Returns
Acad::eOk if successful; else error status
◆ setBackgroundColor()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbFormattedTableData::setBackgroundColor  |  ( |  int  |  row,
|  int  |  column,
|  const AcCmColor &  |  colour
)
virtual
Sets the background colour for the row, column, or cell at the given index.
Parameters
[in] | row | - the row index (use -1 for entire column)
[in] | column | - the column index (use -1 for entire row)
[in] | colour | - AcCmColor describing new background colour for cells
Returns
Acad::eOk if successful; else error status
◆ setContentColor() [1/2]
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbFormattedTableData::setContentColor  |  ( |  int  |  row,
|  int  |  column,
|  const AcCmColor &  |  color
)
virtual
Sets the colour of the first content found in the cell at the given row & column index.
Parameters
[in] | row | - the row index
[in] | column | - the column index
[in] | colour | - AcCmColor describing new content colour
Returns
Acad::eOk if successful; else error status
◆ setContentColor() [2/2]
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbFormattedTableData::setContentColor  |  ( |  int  |  row,
|  int  |  column,
|  int  |  ci,
|  const AcCmColor &  |  color
)
virtual
Sets the colour of the content found in the cell at the given row, column, & content index.
Parameters
[in] | row | - the row index
[in] | column | - the column index
[in] | ci | - the content index
[in] | colour | - AcCmColor describing new content colour
Returns
Acad::eOk if successful; else error status
◆ setContentLayout()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbFormattedTableData::setContentLayout  |  ( |  int  |  row,
|  int  |  column,
|  AcDb::CellContentLayout  |  contentLayout
)
virtual
Sets the layout of the first content found in the cell at the given row & column index.
Parameters
[in] | row | - the row index
[in] | column | - the column index
[in] | contentLayout | - AcDb::CellContentLayout enum describing new content layout
Returns
Acad::eOk if successful; else error status
◆ setFieldId() [1/2]
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbFormattedTableData::setFieldId  |  ( |  int  |  row,
|  int  |  column,
|  const AcDbObjectId &  |  fieldId,
|  AcDb::CellOption  |  option
)
virtual
Assigns an AcDbField object to the cell at the given row & column index.
Parameters
[in] | row | - the row index
[in] | column | - the column index
[in] | fieldId | - the AcDbField object to be assigned to the cell
[in] | option | - AcDb::CellOption enum controlling whether or not cell formatting should be inherited
Returns
Acad::eOk if successful; else error status
◆ setFieldId() [2/2]
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbFormattedTableData::setFieldId  |  ( |  int  |  row,
|  int  |  column,
|  int  |  ci,
|  const AcDbObjectId &  |  fieldId,
|  AcDb::CellOption  |  option
)
virtual
Assigns an AcDbField object to the cell at the given row, column, & content index.
Parameters
[in] | row | - the row index
[in] | column | - the column index
[in] | ci | - the content index
[in] | fieldId | - the AcDbField object to be assigned to the cell
[in] | option | - AcDb::CellOption enum controlling whether or not cell formatting should be inherited
Returns
Acad::eOk if successful; else error status
◆ setFlowDirection()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbFormattedTableData::setFlowDirection  |  ( |  AcDb::FlowDirection  |  flowDirection | )
virtual
Sets the table flow direction (top-to-bottom or bottom-to-top)
Parameters
[in] | flowDirection | - AcDb::FlowDirection enum
Returns
Acad::eOk if successful; else error status
◆ setGridColor()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbFormattedTableData::setGridColor  |  ( |  int  |  row,
|  int  |  column,
|  AcDb::GridLineType  |  lineTypes,
|  const AcCmColor &  |  colour
)
virtual
Sets the colour of the grid line type surrounding the row, column, or cell at the given index.
Parameters
[in] | row | - the row index (use -1 for entire column)
[in] | column | - the column index (use -1 for entire row)
[in] | lineTypes | - grid line types (single or combination of AcDb::GridLineType enums)
[in] | colour | - AcCmColor object describing colour to apply to specified grid lines
Returns
Acad::eOk if successful; else error status
◆ setGridDoubleLineSpacing()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbFormattedTableData::setGridDoubleLineSpacing  |  ( |  int  |  row,
|  int  |  column,
|  AcDb::GridLineType  |  lineTypes,
|  double  |  spacing
)
virtual
Sets the double-line spacing for one or more grid line type surrounding a cell.
Parameters
[in] | row | - row index (use -1 for entire column)
[in] | column | - column index (use -1 for entire row)
[in] | lineTypes | - grid line types (single or combination of AcDb::GridLineType enums)
[in] | spacing | - double-line spacing
Returns
Acad::eOk if successful; else error status
◆ setGridLineStyle()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbFormattedTableData::setGridLineStyle  |  ( |  int  |  row,
|  int  |  column,
|  AcDb::GridLineType  |  lineTypes,
|  AcDb::GridLineStyle  |  lineStyle
)
virtual
Sets the grid line style for a row, column, or cell at the given index.
Parameters
[in] | row | - row index (use -1 for entire column)
[in] | column | - column index (use -1 for entire row)
[in] | lineTypes | - grid line types (single or combination of AcDb::GridLineType enums)
[in] | lineStyle | - AcDb::GridLineStyle enum describing grid line style to set
Returns
Acad::eOk if successful, else error status
◆ setGridLinetype()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbFormattedTableData::setGridLinetype  |  ( |  int  |  row,
|  int  |  column,
|  AcDb::GridLineType  |  lineTypes,
|  const AcDbObjectId &  |  lineTypeId
)
virtual
Sets the linetype for one or more grid line types surrounding a row, column, or cell.
Parameters
[in] | row | - row index (use -1 for entire column)
[in] | column | - column index (use -1 for entire row)
[in] | lineTypes | - grid line types (single or combination of AcDb::GridLineType enums)
[in] | lineTypeId | - object id of linetype to set
Returns
Acad::eOk if successful, else error status
◆ setGridLineWeight()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbFormattedTableData::setGridLineWeight  |  ( |  int  |  row,
|  int  |  column,
|  AcDb::GridLineType  |  lineTypes,
|  AcDb::LineWeight  |  lineWeight
)
virtual
Sets the lineweight for one or more grid line types surrounding a row, column, or cell.
Parameters
[in] | row | - row index (use -1 for entire column)
[in] | column | - column index (use -1 for entire row)
[in] | lineTypes | - grid line types (single or combination of AcDb::GridLineType enums)
[in] | lineWeight | - AcDb::LineWeight enum representing new lineweight
Returns
Acad::eOk if successful, else error status
◆ setGridProperty() [1/2]
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbFormattedTableData::setGridProperty  |  ( |  const AcCellRange &  |  cellRange,
|  AcDb::GridLineType  |  lineTypes,
|  const AcGridProperty &  |  gridProp
)
virtual
Sets the grid properties for a given cell range.
Parameters
[in] | cellRange | - range of cells for which to apply grid properties
[in] | lineTypes | - grid line types (single or combination of AcDb::GridLineType enums)
[in] | gridProp | - AcGridProperty object determining properties & values to set
Returns
Acad::eOk if successful; else error status
Date
2023-06-26 leem implemented
◆ setGridProperty() [2/2]
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbFormattedTableData::setGridProperty  |  ( |  int  |  row,
|  int  |  column,
|  AcDb::GridLineType  |  lineTypes,
|  const AcGridProperty &  |  gridProp
)
virtual
Sets the grid properties for a row, column, or cell at a given index.
Parameters
[in] | row | - the row index (use -1 for entire column)
[in] | column | - the column index (use -1 for entire row)
[in] | lineTypes | - grid line types (single or combination of AcDb::GridLineType enums)
[in] | gridProp | - AcGridProperty object determining properties & values to set
Returns
Acad::eOk if successful; else error status
Date
2023-06-26 leem implemented
◆ setGridVisibility()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbFormattedTableData::setGridVisibility  |  ( |  int  |  row,
|  int  |  column,
|  AcDb::GridLineType  |  lineTypes,
|  AcDb::Visibility  |  visibility
)
virtual
Sets the visibility of the grid line type surrounding a row, column, or cell.
Parameters
[in] | row | - row index (use -1 for entire column)
[in] | column | - column index (use -1 for entire row)
[in] | lineType | - grid line type (single AcDb::GridLineType enum)
[in] | visibility | - AcDb::Visibility enum describing new grid line visibility
Returns
Acad::eOk if successful; else error status
◆ setMargin()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbFormattedTableData::setMargin  |  ( |  int  |  row,
|  int  |  column,
|  AcDb::CellMargin  |  marginType,
|  double  |  margin
)
virtual
Sets the size of the given margin type(s), for a given row, column, or cell.
Parameters
[in] | row | - the row index (use -1 for entire column)
[in] | column | - the column index (use -1 for entire row)
[in] | marginType | - AcDb::CellMargin enum describing the margin to return
[in] | margin | - new margin size
Returns
Acad::eOk if successful; else error status
◆ setOverride() [1/2]
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbFormattedTableData::setOverride  |  ( |  int  |  row,
|  int  |  column,
|  AcDb::GridLineType  |  lineTypes,
|  AcDb::GridProperty  |  gridProps
)
virtual
Overrides properties for one or more grid line types surrounding a row, column, or cell at a given index.
Parameters
[in] | row | - the row index (use -1 for entire column)
[in] | column | - the column index (use -1 for entire row)
[in] | lineTypes | - grid line types (single or combination of AcDb::GridLineType enums)
[in] | gridProps | - AcDb::GridProperty enum describing properties to override
Returns
Acad::eOk if successful; else error status
◆ setOverride() [2/2]
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbFormattedTableData::setOverride  |  ( |  int  |  row,
|  int  |  column,
|  int  |  ci,
|  AcDb::CellProperty  |  cellProps
)
virtual
Overrides cell properties for content at a given row, column, and content index.
Parameters
[in] | row | - the row index (use -1 for entire column)
[in] | column | - the column index (use -1 for entire row)
[in] | ci | - the content index (use -1 for entire cell, row, or column)
[in] | cellProps | - AcDb::CellProperty enum describing properties to override
Returns
Acad::eOk if successful; else error status
◆ setRotation() [1/2]
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbFormattedTableData::setRotation  |  ( |  int  |  row,
|  int  |  column,
|  double  |  rotation
)
virtual
Sets the rotation (in radians) of the first content in the cell at the given row & column index.
Parameters
[in] | row | - the row index
[in] | column | - the column index
[in] | rotation | - the new rotation angle (in radians) for the content
Returns
Acad::eOk if successful; else error status
◆ setRotation() [2/2]
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbFormattedTableData::setRotation  |  ( |  int  |  row,
|  int  |  column,
|  int  |  ci,
|  double  |  rotation
)
virtual
Sets the rotation (in radians) of the content in the cell at the given row, column, & content index.
Parameters
[in] | row | - the row index
[in] | column | - the column index
[in] | ci | - the content index
[in] | rotation | - the new rotation angle (in radians) for the content
Returns
Acad::eOk if successful; else error status
◆ setScale() [1/2]
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbFormattedTableData::setScale  |  ( |  int  |  row,
|  int  |  column,
|  double  |  scale
)
virtual
Sets the scale of the first content in the cell at the given row & column index.
Parameters
[in] | row | - the row index
[in] | column | - the column index
[in] | scale | - the new scale for the content
Returns
Acad::eOk if successful; else error status
◆ setScale() [2/2]
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbFormattedTableData::setScale  |  ( |  int  |  row,
|  int  |  column,
|  int  |  ci,
|  double  |  scale
)
virtual
Sets the scale of the content in the cell at the given row, column, & content index.
Parameters
[in] | row | - the row index
[in] | column | - the column index
[in] | ci | - the content index
[in] | scale | - the new scale for the content
Returns
Acad::eOk if successful; else error status
◆ setTextHeight() [1/2]
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbFormattedTableData::setTextHeight  |  ( |  int  |  row,
|  int  |  column,
|  double  |  height
)
virtual
Sets the text height of the first content in the cell at the given row & column index.
Parameters
[in] | row | - the row index
[in] | column | - the column index
[in] | height | - the new text height for the content
Returns
Acad::eOk if successful; else error status
◆ setTextHeight() [2/2]
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbFormattedTableData::setTextHeight  |  ( |  int  |  row,
|  int  |  column,
|  int  |  ci,
|  double  |  height
)
virtual
Sets the text height of the content in the cell at the given row, column, & content index.
Parameters
[in] | row | - the row index
[in] | column | - the column index
[in] | ci | - the content index
[in] | height | - the new text height for the content
Returns
Acad::eOk if successful; else error status
◆ setTextStyle() [1/2]
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbFormattedTableData::setTextStyle  |  ( |  int  |  row,
|  int  |  column,
|  const AcDbObjectId &  |  styleId
)
virtual
Sets the text style of the first content in the cell at the given row & column index.
Parameters
[in] | row | - the row index
[in] | column | - the column index
[in] | styleId | - the ObjectId of the new text style for the content
Returns
Acad::eOk if successful; else error status
◆ setTextStyle() [2/2]
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbFormattedTableData::setTextStyle  |  ( |  int  |  row,
|  int  |  column,
|  int  |  ci,
|  const AcDbObjectId &  |  styleId
)
virtual
Sets the text style of the content in the cell at the given row, column, & content index.
Parameters
[in] | row | - the row index
[in] | column | - the column index
[in] | ci | - the content index
[in] | styleId | - the ObjectId of the new text style for the content
Returns
Acad::eOk if successful; else error status
◆ textHeight() [1/2]
 UX_EXPORT_FUNCTION double AcDbFormattedTableData::textHeight  |  ( |  int  |  row,
|  int  |  column
) |   |  const
virtual
Returns the text height of the first content in the cell at the given row & column index.
Parameters
[in] | row | - the row index
[in] | column | - the column index
Returns
text height of the first content in the cell at the given row & column index
◆ textHeight() [2/2]
 UX_EXPORT_FUNCTION double AcDbFormattedTableData::textHeight  |  ( |  int  |  row,
|  int  |  column,
|  int  |  ci
) |   |  const
virtual
Returns the text height of the content in the cell at the given row, column, & content index.
Parameters
[in] | row | - the row index
[in] | column | - the column index
[in] | ci | - the content index
Returns
text height of the content in the cell at the given row, column, & content index
◆ textStyle() [1/2]
 UX_EXPORT_FUNCTION AcDbObjectId AcDbFormattedTableData::textStyle  |  ( |  int  |  row,
|  int  |  column
) |   |  const
virtual
Returns the ObjectId of the text style of the first content in the cell at the given row & column index.
Parameters
[in] | row | - the row index
[in] | column | - the column index
Returns
ObjectId of the text style of the first content in the cell at the given row & column index
◆ textStyle() [2/2]
 UX_EXPORT_FUNCTION AcDbObjectId AcDbFormattedTableData::textStyle  |  ( |  int  |  row,
|  int  |  column,
|  int  |  ci
) |   |  const
virtual
Returns the ObjectId of the text style of the content in the cell at the given row, column, & content index.
Parameters
[in] | row | - the row index
[in] | column | - the column index
[in] | ci | - the content index
Returns
ObjectId of the text style of the content in the cell at the given row, column, & content index
◆ unmerge()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbFormattedTableData::unmerge  |  ( |  const AcCellRange &  |  cellRange | )
virtual
Unmerges cells in the given cell range.
Parameters
[in] | cellRange | - AcCellRange object describing range of cells to unmerge
Returns
Acad::eOk if successful; else error status