Public Member Functions | List of all members
AcDbLongTransWorkSetIterator Class Referenceabstract
_ More...
#include <AcDbLongTransWorkSetIterator.h>
 Public Member Functions
 virtual bool  | curObjectIsErased () const =0
 virtual bool  | curObjectIsPrimary () const =0
 virtual bool  | curObjectIsRemoved () const =0
 virtual bool  | done ()=0
This function returns true if the iterator is after the last position of the list return false if the iterator is until or on the last position of the list.
virtual AcDbObjectId  | objectId () const =0
This function get the AcDbObjectId id, where the iterator is now. More...
virtual void  | start (bool=false, bool=false)=0
the function set the iterator on the first position on the list More...
 virtual void  | step ()=0
This function move the iterator forward one step.
 Public Member Functions inherited from AcRxObject
virtual AcRxObject *  | clone () const
Exported and implemented. More...
 virtual AcRx::Ordering  | comparedTo (const AcRxObject *) const
Exported and implemented.
virtual Acad::ErrorStatus  | copyFrom (const AcRxObject *)
Exported and implemented. More...
 virtual AcRxClass *  | isA () const
Exported and implemented.
virtual Adesk::Boolean  | isEqualTo (const AcRxObject *) const
Exported and implemented. More...
bool  | isKindOf (const AcRxClass *) const
Checks the object class. More...
AcRxObject *  | queryX (const AcRxClass *) const
returns the protocol extension object assigned to this class or a parent class. More...
AcRxObject *  | x (const AcRxClass *) const
returns the protocol extension object assigned to this class or a parent class. More...
 virtual  | ~AcRxObject ()
Destructor.
 Additional Inherited Members
 Static Public Member Functions inherited from AcRxObject
 static AcRxObject *  | cast (const AcRxObject *)
 static AcRxClass *  | desc ()
Exported and implemented.
 Protected Member Functions inherited from AcRxObject
AcRxObject ()
Exported and implemented.
Detailed Description
_
Member Function Documentation
◆ objectId()
 AcDbObjectId AcDbLongTransWorkSetIterator::objectId  |  ( |   | ) |   const
pure virtual
This function get the AcDbObjectId id, where the iterator is now.
Parameters
[out] | return | the AcDbObjectId Id of object where the iterator is
◆ start()
 void AcDbLongTransWorkSetIterator::start  |  ( |  bool  |  incDeleteObjs = false,
|  bool  |  incSecondaryObjs = false
)
pure virtual
the function set the iterator on the first position on the list
Parameters
[in] | incRemovedObjs | input Boolean if delete objects or no
[in] | incSecondObjs | Input Boolean if include or not seconday object