Public Types | Public Member Functions | Public Attributes | List of all members
AcDbPlotSettings Class Reference
_ More...
#include <AcDbPlotSettings.h>
 Public Types
enum  | PlotPaperUnits { kInches = 0 , kMillimeters , kPixels }
enum  | PlotRotation { k0degrees = 0 , k90degrees , k180degrees , k270degrees }
enum  | PlotType {
 kDisplay = 0 , kExtents , kLimits , kView ,
 kWindow , kLayout
 }
enum  | ShadePlotResLevel {
 kDraft = 0 , kPreview , kNormal , kPresentation ,
 kMaximum , kCustom
 }
enum  | ShadePlotType {
 kAsDisplayed = 0 , kWireframe , kHidden , kRendered ,
 kVisualStyle , kRenderPreset
 }
enum  | StdScaleType {
 kScaleToFit = 0 , k1_128in_1ft , k1_64in_1ft , k1_32in_1ft ,
 k1_16in_1ft , k3_32in_1ft , k1_8in_1ft , k3_16in_1ft ,
 k1_4in_1ft , k3_8in_1ft , k1_2in_1ft , k3_4in_1ft ,
 k1in_1ft , k3in_1ft , k6in_1ft , k1ft_1ft ,
 k1_1 , k1_2 , k1_4 , k1_5 ,
 k1_8 , k1_10 , k1_16 , k1_20 ,
 k1_30 , k1_40 , k1_50 , k1_100 ,
 k2_1 , k4_1 , k8_1 , k10_1 ,
 k100_1 , k1000_1 , k1and1_2in_1ft
 }
 Public Types inherited from AcGiDrawable
enum  | DrawableType {
 kGeometry = 0 , kDistantLight , kPointLight , kSpotLight ,
 kAmbientLight , kSolidBackground , kGradientBackground , kImageBackground ,
 kGroundPlaneBackground , kViewport
 }
enum  | SetAttributesFlags {
 kDrawableNone = 0 , kDrawableIsAnEntity = 1 , kDrawableUsesNesting = 2 , kDrawableIsCompoundObject = 4 ,
 kDrawableViewIndependentViewportDraw = 8 , kDrawableIsInvisible = 16 , kDrawableHasAttributes = 32 , kDrawableRegenTypeDependentGeometry = 64 ,
 kDrawableIsDimension = 133 , kDrawableRegenDraw = 256 , kDrawableStandardDisplaySingleLOD = 512 , kDrawableShadedDisplaySingleLOD = 1024 ,
 kDrawableViewDependentViewportDraw = 2048 , kDrawableBlockDependentViewportDraw = 4096 , kDrawableIsExternalReference = 8192 , kDrawableNotPlottable = 16384 ,
 kDrawableNotAllowLCS = 32768 , kDrawableMergeControlOff = 65536 , kThreadedWorldDrawViewportDraw = 131072
 }
 Public Member Functions
AcDbPlotSettings (bool)
Acad::ErrorStatus  | addToPlotSettingsDict (AcDbDatabase *)
Adds this PlotSettings object to the specified database. More...
Acad::ErrorStatus  | copyFrom (AcDbPlotSettings *)
Copies the source contents into this pointer. More...
Adesk::Boolean  | drawViewportsFirst () const
Returns whether viewports are drawn before paperspace or not. More...
Acad::ErrorStatus  | getCanonicalMediaName (const ACHAR *&) const
Returns the canonical (locale-independent) name of the currently configured paper. More...
Acad::ErrorStatus  | getCurrentStyleSheet (const ACHAR *&) const
Returns the name of the current style sheet. More...
Acad::ErrorStatus  | getCustomPrintScale (double &, double &) const
Returns the custom scale i.e. More...
Acad::ErrorStatus  | getPlotCfgName (const ACHAR *&) const
Returns the plot configuration file name. More...
Acad::ErrorStatus  | getPlotOrigin (double &, double &) const
Returns the plot origin offset. More...
Acad::ErrorStatus  | getPlotPaperMargins (double &, double &, double &, double &) const
Returns the margins of the configured paper. More...
Acad::ErrorStatus  | getPlotPaperSize (double &, double &) const
Returns the physical width and height of the entire paper area (including the non printable area). More...
Acad::ErrorStatus  | getPlotSettingsName (ACHAR *&) const
Gets the plot settings name. More...
Acad::ErrorStatus  | getPlotSettingsName (const ACHAR *&) const
Gets the plot settings name. More...
Acad::ErrorStatus  | getPlotViewName (const ACHAR *&) const
Returns the plot name of the layout portion to plot. More...
Acad::ErrorStatus  | getPlotWindowArea (double &, double &, double &, double &) const
Returns the lower-left and upper-right corners of the plot area. More...
Acad::ErrorStatus  | getStdScale (double &) const
Returns the standard scale for this PlotSettings object. More...
Adesk::Boolean  | modelType () const
Gets the plot setup type. More...
bool  | plotAsRaster () const
Returns whether the viewport is plotted as raster or not (depending on shade plot settings). More...
Adesk::Boolean  | plotCentered () const
Returns true if the plot will be centered. More...
Adesk::Boolean  | plotHidden () const
Returns true if the hidden line removal algorithm is to be applied to the objects in paperspace. More...
PlotPaperUnits  | plotPaperUnits () const
Returns the units used for plotting . More...
Adesk::Boolean  | plotPlotStyles () const
Informs whether plot styles are to be plotted, or displayed only. More...
PlotRotation  | plotRotation () const
Returns the plot rotation. More...
PlotType  | plotType () const
Returns the information about the portion of paperspace to be plotted. More...
Adesk::Boolean  | plotViewportBorders () const
Informs whether the viewport borders are to be plotted. More...
bool  | plotWireframe () const
Returns whether the viewport is plotted as vectors or not (depending on shade plot settings). More...
Adesk::Boolean  | printLineweights () const
Informs whether line weights will get printed. More...
Adesk::Boolean  | scaleLineweights () const
Informs whether line weights will get scaled along with the print scale. More...
void  | setDrawViewportsFirst (Adesk::Boolean)
Specifies whether viewports are drawn before paperspace or not. More...
void  | setPlotHidden (Adesk::Boolean)
Specifies whether or not to apply the hidden line removal algorithm to the objects in paperspace. More...
void  | setPlotPlotStyles (Adesk::Boolean)
Specifies whether plot styles are to be plotted, or displayed only. More...
Acad::ErrorStatus  | setPlotSettingsName (const ACHAR *)
Sets the plot settings name. More...
void  | setPlotViewportBorders (Adesk::Boolean)
Specifies whether the viewport borders are to be plotted. More...
void  | setPrintLineweights (Adesk::Boolean)
Defines whether or not to plot line weights. More...
void  | setScaleLineweights (Adesk::Boolean)
Specifies whether or not to scale line weights along with the print scale. More...
Acad::ErrorStatus  | setShadePlot (const ShadePlotType, const AcDbObjectId)
Configures this PlotSettings object for shaded or rendered mode. More...
Acad::ErrorStatus  | setShadePlot (ShadePlotType)
Sets the shade plot type for shaded or rendered plotting. More...
Acad::ErrorStatus  | setShadePlotCustomDPI (Adesk::Int16)
Sets the shade plot custom DPI. More...
Acad::ErrorStatus  | setShadePlotResLevel (ShadePlotResLevel)
Sets the shade plot resolution level. More...
void  | setShowPlotStyles (Adesk::Boolean)
Specifies whether the object plot style is showed during layout mode. More...
ShadePlotType  | shadePlot () const
Returns the shade plot type for shaded or rendered plotting. More...
Adesk::Int16  | shadePlotCustomDPI () const
Returns the shade plot custom DPI. More...
 AcDbObjectId  | shadePlotId () const
ShadePlotResLevel  | shadePlotResLevel () const
Returns the shade plot resolution level. More...
Adesk::Boolean  | showPlotStyles () const
Informs whether the object plot style is showed during layout mode. More...
StdScaleType  | stdScaleType () const
Returns the type of the standard scale. More...
Adesk::Boolean  | useStandardScale () const
Indicates whether the this PlotSettings object uses a standard scale to calculate the current plot scale. More...
 virtual  | ~AcDbPlotSettings ()
Destructor.
 Public Member Functions inherited from AcDbObject
virtual Acad::ErrorStatus  | addPersistentReactor (AcDbObjectId)
Adds a persistent reactor to this object reactor list. More...
Acad::ErrorStatus  | addReactor (AcDbObjectReactor *) const
Adds a transient reactor to this object. More...
virtual Acad::ErrorStatus  | applyPartialUndo (AcDbDwgFiler *, AcRxClass *)
This function is called during Undo operations on objects, that use the 'Partial Undo meachanism'; this is, this object is opened with assertWriteEnabled(Adesk::kFalse) to indicate that custom Undo filing is used rather than the default Undo filing. More...
 void  | assertNotifyEnabled () const
 void  | assertReadEnabled () const
 void  | assertWriteEnabled (Adesk::Boolean=Adesk::kTrue, Adesk::Boolean=Adesk::kTrue)
virtual Acad::ErrorStatus  | audit (AcDbAuditInfo *)
Performs the audit operation for this object. More...
Acad::ErrorStatus  | cancel ()
Reverts all changes since the object had been opened and closes the object. More...
virtual void  | cancelled (const AcDbObject *)
A handler function for persistent reactors. More...
virtual AcRxObject *  | clone () const
Creates a shallow clone of this object. More...
Acad::ErrorStatus  | close ()
Closes the object. More...
Acad::ErrorStatus  | closeAndPage (Adesk::Boolean=Adesk::kTrue)
Closes the object. More...
virtual Acad::ErrorStatus  | composeForLoad (AcDb::OdaSaveType, AcDb::AcDbDwgVersion)
This function is intended for future MT file loading support. More...
virtual void  | copied (const AcDbObject *, const AcDbObject *)
A handler function for persistent reactors. More...
virtual Acad::ErrorStatus  | copyFrom (const AcRxObject *)
Copies the pSrc object information in this object. More...
Acad::ErrorStatus  | createExtensionDictionary ()
Creates a dictionary as extension dictionary for this object. More...
AcDbDatabase *  | database () const
Returns the database that contains this object. More...
virtual Acad::ErrorStatus  | decomposeForSave (AcDb::AcDbDwgVersion, AcDbObject *&, AcDbObjectId &, Adesk::Boolean &)
This function is called during dwg and dxf output, to allow a custom object to decompose itself, due to provided dwg/dxf target file version. More...
virtual Acad::ErrorStatus  | deepClone (AcDbObject *, AcDbObject *&, AcDbIdMapping &, Adesk::Boolean=Adesk::kTrue) const final
Clones this object, appends it to the owner pOwner and adds an AcDbIdPair record to the idMap. More...
void  | disableUndoRecording (Adesk::Boolean)
Disables or enables the undo recording for the object. More...
Acad::ErrorStatus  | downgradeOpen ()
Sets the open mode for an object opened for write to be opened for read. More...
Acad::ErrorStatus  | downgradeToNotify (Adesk::Boolean)
Sets the open mode for an object opened for write to be opened for notify. More...
virtual AcGiDrawable *  | drawable ()
Retrieves the AcGiDrawable instance of this object. More...
Acad::ErrorStatus  | dwgIn (AcDbDwgFiler *)
Calls the object's dwgInFields function, and reads any XData if present. More...
virtual Acad::ErrorStatus  | dwgInFields (AcDbDwgFiler *)
Reads the object from the DWG filer. More...
Acad::ErrorStatus  | dwgOut (AcDbDwgFiler *) const
Calls the object's dwgOutFields function, and writes any XData if present. More...
virtual Acad::ErrorStatus  | dwgOutFields (AcDbDwgFiler *) const
Writes the object to the DWG filer. More...
Acad::ErrorStatus  | dxfIn (AcDbDxfFiler *)
Calls the object's dxfInFields function, and reads any XData if present. More...
virtual Acad::ErrorStatus  | dxfInFields (AcDbDxfFiler *)
Reads the object from the DXF filer. More...
Acad::ErrorStatus  | dxfOut (AcDbDxfFiler *, Adesk::Boolean, Adesk::uchar *) const
Calls the object's dxfOutFields function, and writes any XData if present. More...
virtual Acad::ErrorStatus  | dxfOutFields (AcDbDxfFiler *) const
Writes the object to the DXF filer. More...
Acad::ErrorStatus  | erase (Adesk::Boolean=Adesk::kTrue)
Sets the bit that indicates that the object is erased. More...
virtual void  | erased (const AcDbObject *, Adesk::Boolean)
A handler function for persistent reactors. More...
AcDbObjectId  | extensionDictionary () const
Returns the object id of the extension dictionary for this object. More...
void  | getAcDbHandle (AcDbHandle &) const
Returns handle of this object. More...
Acad::ErrorStatus  | getBinaryData (const ACHAR *, Adesk::Int32 &, char *&) const
Creates a copy of the binary data stored as chunks of maximum 127 bytes in the resbuf chain of this object's extension dictionary xrecord entry given by entryName. More...
int  | getBrxOpenCount () const
This function returns the number of open BRX instances for this object. More...
int  | getBrxOpenState () const
This function returns the BRX object open state flags as bitfields, for diagnostic purpose. More...
virtual Acad::ErrorStatus  | getClassID (CLSID *) const final
Gets the COM wrapper Class ID for this entity. More...
int  | getCustomObjectState () const
This function returns the custom object status : 1=isCustomObject 2=DifferentialUndoDisabled. More...
Acad::ErrorStatus  | getField (const ACHAR *, AcDbField *&, AcDb::OpenMode) const
Retrieves the specified Field from this object, and opens it in mode. More...
Acad::ErrorStatus  | getField (const ACHAR *, AcDbObjectId &) const
Gets the pszPropName field object from field dictionary of this AcDbObject object, using pszPropName as key. More...
AcDbObjectId  | getFieldDictionary () const
Returns the Field dictionary associated with this object,. More...
Acad::ErrorStatus  | getFieldDictionary (AcDbDictionary *&, AcDb::OpenMode) const
Gets and opens the field dictionary for this. More...
Acad::ErrorStatus  | getObjectBirthVersion (AcDb::AcDbDwgVersion &, AcDb::MaintenanceReleaseVersion &)
This function is currently not supported by the CAD engine, always returns Acad::eOk, and 'kDHL_CURRENT' + 'kMReleaseCurrent' results. More...
virtual Acad::ErrorStatus  | getObjectSaveVersion (const AcDbDwgFiler *, AcDb::AcDbDwgVersion &, AcDb::MaintenanceReleaseVersion &)
Returns the DWG version for saving the object. More...
virtual Acad::ErrorStatus  | getObjectSaveVersion (const AcDbDxfFiler *, AcDb::AcDbDwgVersion &, AcDb::MaintenanceReleaseVersion &)
Returns the DWG version for saving the object. More...
int  | getOdaOpenCount () const
This function returns the number of open ODA instances for this object. More...
int  | getOdaOpenState () const
This function returns the ODA object open state flags as bitfields, for diagnostic purpose. More...
virtual void  | goodbye (const AcDbObject *)
A handler function for persistent reactors. More...
Acad::ErrorStatus  | handOverTo (AcDbObject *, Adesk::Boolean=Adesk::kTrue, Adesk::Boolean=Adesk::kTrue)
Hands over objects identity to another object. More...
bool  | hasFields () const
Return true if this object has single or multiple fields associated with him. More...
bool  | hasPersistentReactor (AcDbObjectId) const
Checks the input objectId in this object reactor list. More...
bool  | hasSaveVersionOverride ()
This function indicates whether this object overrides the filer's save version. More...
virtual AcDbObjectId  | id () const
Returns the database id of this object. More...
Adesk::Boolean  | isAcDbObjectIdsInFlux () const
Checks whether a deep clone operation was completed. More...
Adesk::Boolean  | isAProxy () const
Adesk::Boolean  | isCancelling () const
Adesk::Boolean  | isErased () const
Returns whether this object is erased. More...
Adesk::Boolean  | isEraseStatusToggled () const
Checks whether the object erase status has been toggled. More...
Adesk::Boolean  | isModified () const
Returns whether this object's assertWriteEnabled() has been called since it was opened. More...
Adesk::Boolean  | isModifiedGraphics () const
Checks whether this object graphics will be updated when the object is closed. More...
Adesk::Boolean  | isModifiedXData () const
Checks whether this object's xData was modified. More...
Adesk::Boolean  | isNewObject () const
Returns true if and only if this object has not been closed since it was created. More...
Adesk::Boolean  | isNotifyEnabled () const
Returns whether this object is opened for notify. More...
Adesk::Boolean  | isNotifying () const
virtual Adesk::Boolean  | isPersistent () const
Returns the 'persistent' status of a database object. More...
Adesk::Boolean  | isReadEnabled () const
Returns whether this object is opened for read. More...
 Adesk::Boolean  | isReallyClosing () const
Checks whether the next close call will completely close this object return true if on the next call the object will be completely closed false otherwise.
Adesk::Boolean  | isTransactionResident () const
Gets the object transaction status. More...
Adesk::Boolean  | isUndoing () const
bool  | isUndoRecordingDisabled () const
Returns whether the undo recording for the object is enabled or not. More...
Adesk::Boolean  | isWriteEnabled () const
Returns whether this object is opened for write. More...
virtual AcDb::DuplicateRecordCloning  | mergeStyle () const
Returns the object's merge behavior during cloning. More...
virtual void  | modified (const AcDbObject *)
A handler function for persistent reactors. More...
virtual void  | modifiedGraphics (const AcDbEntity *)
A handler function for persistent reactors. More...
virtual void  | modifiedXData (const AcDbObject *)
A handler function for persistent reactors. More...
virtual void  | modifyUndone (const AcDbObject *)
A handler function for persistent reactors. More...
virtual void  | objectClosed (const AcDbObjectId)
A handler function for persistent reactors. More...
AcDbObjectId  | objectId () const
Returns object id. More...
virtual void  | openedForModify (const AcDbObject *)
A handler function for persistent reactors. More...
AcDbObjectId  | ownerId () const
Returns object id of the owner. More...
AcDbVoidPtrArray *  | reactors ()
Gets the object pointers to reactors. More...
const AcDbVoidPtrArray *  | reactors () const
Gets the object pointers to reactors. More...
virtual void  | reappended (const AcDbObject *)
A handler function for persistent reactors. More...
 virtual void  | recvPropagateModify (const AcDbObject *)
Not implemented yet.
Acad::ErrorStatus  | releaseExtensionDictionary ()
Removes the extension dictionary associated with this object. More...
virtual Acad::ErrorStatus  | removeField (AcDbObjectId)
Removes the Field specified by acFieldId from this object. More...
virtual Acad::ErrorStatus  | removeField (const ACHAR *)
Removes the Field specified by szKeyString from this object. More...
virtual Acad::ErrorStatus  | removeField (const ACHAR *, AcDbObjectId &)
Removes the Field specified by acPszKeyString from this object, and returns its ObjectId value. More...
virtual Acad::ErrorStatus  | removePersistentReactor (AcDbObjectId)
Removes a persistent reactor from this object reactor list. More...
Acad::ErrorStatus  | removeReactor (AcDbObjectReactor *) const
Removes a transient reactor to this object. More...
void  | setAcDbObjectIdsInFlux ()
Call this function to indicate that the object IDs of this object and its sub-objects (if any) are not yet valid. More...
Acad::ErrorStatus  | setBinaryData (const ACHAR *, Adesk::Int32, const char *)
Creates a copy of the binary data, divides it in up to 127 bytes binary chunks and
 sets them as resbufs in the resbuf chain of this object's extension dictionary xrecord entry given by entryName. More...
virtual Acad::ErrorStatus  | setField (const ACHAR *, AcDbField *, AcDbObjectId &)
Adds the pAcField field object to field dictionary of this AcDbObject object, using pKey as key. More...
void  | setHasSaveVersionOverride (bool)
This function can be called to specify that the object has a "save version override". More...
virtual Acad::ErrorStatus  | setOwnerId (AcDbObjectId)
Sets the ownerId data member of the object to be objId. More...
virtual Acad::ErrorStatus  | setXData (const resbuf *)
Sets/removes xData associated with this object. More...
virtual Acad::ErrorStatus  | subCancel ()
Possibility to veto a cancel operation from within custom entities. More...
virtual Acad::ErrorStatus  | subClose ()
virtual Acad::ErrorStatus  | subErase (Adesk::Boolean)
This hook is called during an AcDbObject::erase call, before any actual erase operation is performed. More...
 virtual Acad::ErrorStatus  | subHandOverTo (AcDbObject *)
virtual void  | subObjModified (const AcDbObject *, const AcDbObject *)
A handler function for persistent reactors. More...
 virtual Acad::ErrorStatus  | subOpen (AcDb::OpenMode)
virtual Acad::ErrorStatus  | subSwapIdWith (AcDbObjectId, Adesk::Boolean=Adesk::kFalse, Adesk::Boolean=Adesk::kFalse)
This hook is called during an AcDbObject::swapIdWith() call, before any actual swap operation is performed. More...
Acad::ErrorStatus  | swapIdWith (AcDbObjectId, Adesk::Boolean=Adesk::kFalse, Adesk::Boolean=Adesk::kFalse)
Swaps the object id's between the object identified by param swapId and this object. More...
virtual Acad::ErrorStatus  | swapReferences (const AcDbIdMapping &)
Not implemented yet. More...
virtual void  | unappended (const AcDbObject *)
A handler function for persistent reactors. More...
AcDbDwgFiler *  | undoFiler ()
Gets the undo filer for this object. More...
Acad::ErrorStatus  | upgradeFromNotify (Adesk::Boolean &)
Upgrades the open status of this object to AcDb::kForWrite, if this object is already open (either in AcDb::kForRead, AcDb::kForNotify or AcDb::kForWrite) More...
Acad::ErrorStatus  | upgradeOpen ()
Changes the objects open mode to AcDb::kForWrite and sends notifications. More...
virtual Acad::ErrorStatus  | wblockClone (AcRxObject *, AcDbObject *&, AcDbIdMapping &, Adesk::Boolean=Adesk::kTrue) const final
Clones this object, appends it to the owner pOwner and adds an AcDbIdPair record to the idMap. More...
virtual resbuf *  | xData (const ACHAR *=NULL) const
Returns the xData associated with this object. More...
Acad::ErrorStatus  | xDataTransformBy (const AcGeMatrix3d &)
Transforms the extended data according to parameter transformation matrix. More...
 virtual void  | xmitPropagateModify () const
Not implemented yet.
 virtual  | ~AcDbObject ()
Destructor.
 Public Member Functions inherited from AcGiDrawable
virtual bool  | bounds (AcDbExtents &) const
virtual DrawableType  | drawableType () const
 virtual AcGiDrawStream *  | drawStream () const
 AcGsNode *  | gsNode () const
virtual AcDbObjectId  | id () const =0
virtual Adesk::Boolean  | isPersistent () const =0
virtual Adesk::UInt32  | regenSupportFlags () const final
Returns whether and to which level this object supports MultiThreading. More...
 virtual Adesk::Boolean  | RolloverHit (Adesk::ULongPtr, Adesk::ULongPtr, Adesk::Boolean)
 virtual Adesk::UInt32  | setAttributes (AcGiDrawableTraits *) final
 virtual void  | setDrawStream (AcGiDrawStream *)
 void  | setGsNode (AcGsNode *)
 virtual void  | viewportDraw (AcGiViewportDraw *) final
 virtual Adesk::UInt32  | viewportDrawLogicalFlags (AcGiViewportDraw *) final
 virtual Adesk::Boolean  | worldDraw (AcGiWorldDraw *) final
 Public Member Functions inherited from AcRxObject
virtual AcRxObject *  | clone () const
Exported and implemented. More...
 virtual AcRx::Ordering  | comparedTo (const AcRxObject *) const
Exported and implemented.
virtual Acad::ErrorStatus  | copyFrom (const AcRxObject *)
Exported and implemented. More...
 virtual AcRxClass *  | isA () const
Exported and implemented.
virtual Adesk::Boolean  | isEqualTo (const AcRxObject *) const
Exported and implemented. More...
bool  | isKindOf (const AcRxClass *) const
Checks the object class. More...
AcRxObject *  | queryX (const AcRxClass *) const
returns the protocol extension object assigned to this class or a parent class. More...
AcRxObject *  | x (const AcRxClass *) const
returns the protocol extension object assigned to this class or a parent class. More...
 virtual  | ~AcRxObject ()
Destructor.
 Public Attributes
AcDbPlotSettings
Constructor. More...
 Additional Inherited Members
 Static Public Member Functions inherited from AcRxObject
 static AcRxObject *  | cast (const AcRxObject *)
 static AcRxClass *  | desc ()
Exported and implemented.
 Static Public Member Functions inherited from AcHeapOperators
 static void  | operator delete (void *)
_
 static void  | operator delete (void *, const char *, int)
 static void  | operator delete (void *, void *)
 static void  | operator delete[] (void *)
_
 static void  | operator delete[] (void *, const char *, int)
 static void *  | operator new (size_t)
_
 static void *  | operator new (size_t, const char *, int)
 static void *  | operator new (size_t, void *p)
 static void *  | operator new[] (size_t)
_
 static void *  | operator new[] (size_t, const char *, int)
 Protected Member Functions inherited from AcDbObject
virtual Acad::ErrorStatus  | subDeepClone (AcDbObject *, AcDbObject *&, AcDbIdMapping &, Adesk::Boolean=true) const
virtual Acad::ErrorStatus  | subGetClassID (CLSID *) const
virtual Adesk::UInt32  | subSetAttributes (AcGiDrawableTraits *)
Sets the values of this object's subentity traits and returns with the calling object's subentity traits. More...
virtual void  | subViewportDraw (AcGiViewportDraw *)
virtual Adesk::UInt32  | subViewportDrawLogicalFlags (AcGiViewportDraw *)
virtual Acad::ErrorStatus  | subWblockClone (AcRxObject *, AcDbObject *&, AcDbIdMapping &, Adesk::Boolean=true) const
virtual Adesk::Boolean  | subWorldDraw (AcGiWorldDraw *)
 Protected Member Functions inherited from AcGiDrawable
virtual Adesk::UInt32  | subRegenSupportFlags () const
Returns whether and to which level this object supports MultiThreading. More...
virtual Adesk::UInt32  | subSetAttributes (AcGiDrawableTraits *)=0
virtual void  | subViewportDraw (AcGiViewportDraw *)=0
 virtual Adesk::UInt32  | subViewportDrawLogicalFlags (AcGiViewportDraw *)
virtual Adesk::Boolean  | subWorldDraw (AcGiWorldDraw *)=0
 Protected Member Functions inherited from AcRxObject
AcRxObject ()
Exported and implemented.
Detailed Description
_
Member Function Documentation
◆ addToPlotSettingsDict()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbPlotSettings::addToPlotSettingsDict  |  ( |  AcDbDatabase *  |  pDb | )
Adds this PlotSettings object to the specified database.
Parameters
[in] | pDb | - the database to add this PlotSettings object to
Returns
Acad::eOk if successfull, error status otherwise
◆ copyFrom()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbPlotSettings::copyFrom  |  ( |  AcDbPlotSettings *  |  plotSrc | )
Copies the source contents into this pointer.
Parameters
[in] | AcDbPlotSettings | plotSrc to be copied
Returns
Acad::eOk if the copy was successful,
 Acad::eWrongObjectType if trying to copy between paper space and model space plot settings
◆ drawViewportsFirst()
 UX_EXPORT_FUNCTION Adesk::Boolean AcDbPlotSettings::drawViewportsFirst  |  ( |   | ) |   const
Returns whether viewports are drawn before paperspace or not.
Returns
Adesk::kTrue or Adesk::kFalse
◆ getCanonicalMediaName()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbPlotSettings::getCanonicalMediaName  |  ( |  const ACHAR *&  |  name | ) |   const
Returns the canonical (locale-independent) name of the currently configured paper.
Parameters
[in] | name | canonical of the media
Returns
Acad::eOk
◆ getCurrentStyleSheet()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbPlotSettings::getCurrentStyleSheet  |  ( |  const ACHAR *&  |  curStyleSheet | ) |   const
Returns the name of the current style sheet.
Parameters
[out] | curStyleSheet | name of the current style sheet
Returns
Acad::eOk
◆ getCustomPrintScale()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbPlotSettings::getCustomPrintScale  |  ( |  double &  |  paperspace,
|  double &  |  media
) |   |  const
Returns the custom scale i.e.
a ratio of paperspace units to media units. This custom print scale always reflects the scale that will be used to plot.
Parameters
[out] | paperspace | units
[out] | media | units
Returns
Acad::eOk
Remarks
scale = paperspace / media
◆ getPlotCfgName()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbPlotSettings::getPlotCfgName  |  ( |  const ACHAR *&  |  name | ) |   const
Returns the plot configuration file name.
Parameters
[in] | name | of the plot configuration file
Returns
Acad::eOk
◆ getPlotOrigin()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbPlotSettings::getPlotOrigin  |  ( |  double &  |  xCoord,
|  double &  |  yCoord
) |   |  const
Returns the plot origin offset.
Parameters
[out] | xCoord | x origin offset
[out] | yCoord | y origin offset
Returns
Acad::eOk
◆ getPlotPaperMargins()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbPlotSettings::getPlotPaperMargins  |  ( |  double &  |  left,
|  double &  |  bottom,
|  double &  |  right,
|  double &  |  top
) |   |  const
Returns the margins of the configured paper.
Parameters
[out] | left | margin
[out] | bottom | margin
[out] | right | margin
[out] | top | margin
Returns
Acad::eOk
Remarks
All values are returned in millimeters, regardless of the current drawing units. They are independent of the plot rotation or scaling.
◆ getPlotPaperSize()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbPlotSettings::getPlotPaperSize  |  ( |  double &  |  width,
|  double &  |  height
) |   |  const
Returns the physical width and height of the entire paper area (including the non printable area).
Parameters
[out] | width | physical width of the paper
[out] | height | physical height of the paper
Returns
Acad::eOk
Remarks
Both values are returned in millimeters, regardless of the current drawing units.
◆ getPlotSettingsName() [1/2]
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbPlotSettings::getPlotSettingsName  |  ( |  ACHAR *&  |  name | ) |   const
Gets the plot settings name.
Parameters
[out] | name | plot settings name
Returns
Acad::eOk if the name was successful retrieved,
 error code otherwise
Remarks
returns NULL as name if plot settings name was not set
◆ getPlotSettingsName() [2/2]
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbPlotSettings::getPlotSettingsName  |  ( |  const ACHAR *&  |  name | ) |   const
Gets the plot settings name.
Parameters
[out] | name | pointer to the settings name
Returns
Acad::eOk if the name was successful retrieved,
 error code otherwise
Remarks
returns NULL as name if plot settings name was not set
◆ getPlotViewName()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbPlotSettings::getPlotViewName  |  ( |  const ACHAR *&  |  pViewName | ) |   const
Returns the plot name of the layout portion to plot.
Parameters
[out] | pViewName | the name of the plot view
Returns
Acad::eOk
◆ getPlotWindowArea()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbPlotSettings::getPlotWindowArea  |  ( |  double &  |  minX,
|  double &  |  minY,
|  double &  |  maxX,
|  double &  |  maxY
) |   |  const
Returns the lower-left and upper-right corners of the plot area.
Parameters
[out] | minX | X-coordinate of the lower-left corner
[out] | minY | Y-coordinate of the lower-left corner
[out] | maxX | X-coordinate of the upper-right corner
[out] | maxY | Y-coordinate of the upper-right corner
Returns
Acad::eOk
Remarks
Used only if if plotType == kWindow.
◆ getStdScale()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbPlotSettings::getStdScale  |  ( |  double &  |  scaleValue | ) |   const
Returns the standard scale for this PlotSettings object.
Parameters
[out] | scaleValue | of the standard scale
Returns
Acad::eOk
Remarks
Standard scale is used if and only if useStandardScale returns true.
◆ modelType()
 UX_EXPORT_FUNCTION Adesk::Boolean AcDbPlotSettings::modelType  |  ( |   | ) |   const
Gets the plot setup type.
Returns
plot setup type if true is model space if false is paper space
◆ plotAsRaster()
 UX_EXPORT_FUNCTION bool AcDbPlotSettings::plotAsRaster  |  ( |   | ) |   const
Returns whether the viewport is plotted as raster or not (depending on shade plot settings).
Returns
true for raster plot
◆ plotCentered()
 UX_EXPORT_FUNCTION Adesk::Boolean AcDbPlotSettings::plotCentered  |  ( |   | ) |   const
Returns true if the plot will be centered.
If plot is to be centered, then paper margins are automatically calculated to position the plot in the center of the sheet.
Returns
true if centered, false if not
◆ plotHidden()
 UX_EXPORT_FUNCTION Adesk::Boolean AcDbPlotSettings::plotHidden  |  ( |   | ) |   const
Returns true if the hidden line removal algorithm is to be applied to the objects in paperspace.
Returns
true/false
◆ plotPaperUnits()
 UX_EXPORT_FUNCTION AcDbPlotSettings::PlotPaperUnits AcDbPlotSettings::plotPaperUnits  |  ( |   | ) |   const
Returns the units used for plotting .
Returns
current plot units
◆ plotPlotStyles()
 UX_EXPORT_FUNCTION Adesk::Boolean AcDbPlotSettings::plotPlotStyles  |  ( |   | ) |   const
Informs whether plot styles are to be plotted, or displayed only.
Returns
true if plotted and displayed, false if displayed but not plotted
◆ plotRotation()
 UX_EXPORT_FUNCTION AcDbPlotSettings::PlotRotation AcDbPlotSettings::plotRotation  |  ( |   | ) |   const
Returns the plot rotation.
Returns
current value of the plot rotation
◆ plotType()
 UX_EXPORT_FUNCTION AcDbPlotSettings::PlotType AcDbPlotSettings::plotType  |  ( |   | ) |   const
Returns the information about the portion of paperspace to be plotted.
Returns
current value of the plotting type
◆ plotViewportBorders()
 UX_EXPORT_FUNCTION Adesk::Boolean AcDbPlotSettings::plotViewportBorders  |  ( |   | ) |   const
Informs whether the viewport borders are to be plotted.
Returns
true/false for yes/no
◆ plotWireframe()
 UX_EXPORT_FUNCTION bool AcDbPlotSettings::plotWireframe  |  ( |   | ) |   const
Returns whether the viewport is plotted as vectors or not (depending on shade plot settings).
Returns
true for wireframe plot
◆ printLineweights()
 UX_EXPORT_FUNCTION Adesk::Boolean AcDbPlotSettings::printLineweights  |  ( |   | ) |   const
Informs whether line weights will get printed.
Returns
true/false for yes/no
◆ scaleLineweights()
 UX_EXPORT_FUNCTION Adesk::Boolean AcDbPlotSettings::scaleLineweights  |  ( |   | ) |   const
Informs whether line weights will get scaled along with the print scale.
Returns
true/false for yes/no
◆ setDrawViewportsFirst()
 UX_EXPORT_FUNCTION void AcDbPlotSettings::setDrawViewportsFirst  |  ( |  Adesk::Boolean  |  viewportsFirst | )
Specifies whether viewports are drawn before paperspace or not.
Parameters
[in] | viewportsFirst | - specifies whether viewports are first drawn (true) or not (false)
◆ setPlotHidden()
 UX_EXPORT_FUNCTION void AcDbPlotSettings::setPlotHidden  |  ( |  Adesk::Boolean  |  newVal | )
Specifies whether or not to apply the hidden line removal algorithm to the objects in paperspace.
Parameters
[in] | newVal | pass kTrue to use hidden line removal, kFalse if not use
Remarks
Setting plot hidden to kTrue switches ShadePlotType to kHidden. Setting it to kFalse switches ShadePlotType to kWireframe.
◆ setPlotPlotStyles()
 UX_EXPORT_FUNCTION void AcDbPlotSettings::setPlotPlotStyles  |  ( |  Adesk::Boolean  |  newVal | )
Specifies whether plot styles are to be plotted, or displayed only.
Parameters
[in] | newVal | pass kTrue if plotted, kFalse if not plotted
◆ setPlotSettingsName()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbPlotSettings::setPlotSettingsName  |  ( |  const ACHAR *  |  name | )
Sets the plot settings name.
Parameters
[in] | plot | settings name
Returns
Acad::eOk if the name was successful set,
 error code otherwise
◆ setPlotViewportBorders()
 UX_EXPORT_FUNCTION void AcDbPlotSettings::setPlotViewportBorders  |  ( |  Adesk::Boolean  |  newVal | )
Specifies whether the viewport borders are to be plotted.
Parameters
[in] | newVal | pass kTrue if plotted, kFalse if not plotted
◆ setPrintLineweights()
 UX_EXPORT_FUNCTION void AcDbPlotSettings::setPrintLineweights  |  ( |  Adesk::Boolean  |  newVal | )
Defines whether or not to plot line weights.
Parameters
[in] | newVal | true/false for yes/no
◆ setScaleLineweights()
 UX_EXPORT_FUNCTION void AcDbPlotSettings::setScaleLineweights  |  ( |  Adesk::Boolean  |  newVal | )
Specifies whether or not to scale line weights along with the print scale.
Parameters
[in] | newVal | true/false for yes/no
◆ setShadePlot() [1/2]
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbPlotSettings::setShadePlot  |  ( |  const  |  ShadePlotType,
|  const AcDbObjectId  |  shPlotId
)
Configures this PlotSettings object for shaded or rendered mode.
Parameters
[in] | shPlotType
[in] | shPlotId
Returns
Acad::eOk
◆ setShadePlot() [2/2]
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbPlotSettings::setShadePlot  |  ( |  AcDbPlotSettings::ShadePlotType  |  shPlotType | )
Sets the shade plot type for shaded or rendered plotting.
Parameters
[in] | shPlotType | new value for the shade plot type
Returns
Acad::eOk, if successful,
 Acad::eInvalidInput, if value shPlotType == kVisualStyle or shPlotType == kRenderPreset
Remarks
Use the overloaded two parameters version of setShadePlot() to set shade plot type to kVisualStyle or kRenderPreset.
 kHidden has the same meaning as calling setPlotHidden(kTrue).
◆ setShadePlotCustomDPI()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbPlotSettings::setShadePlotCustomDPI  |  ( |  Adesk::Int16  |  newValue | )
Sets the shade plot custom DPI.
This value specifies the user-defined resolution at which shaded and vectorized viewports will be plotted. It should be used if an only if the shade plot resolution level is set to ShadePlotResLevel::kCustom.
Parameters
[in] | newValue | of the shade plot custom DPI
Returns
Acad::eOk, if successful,
 Acad::eInvalidInput, if value is outside of the allowed range,
 Acad::eNotApplicable, if the shade plot resolution level is not set to ShadePlotResLevel::kCustom
Remarks
Minimum acceptable value is 100.
◆ setShadePlotResLevel()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbPlotSettings::setShadePlotResLevel  |  ( |  AcDbPlotSettings::ShadePlotResLevel  |  newLevel | )
Sets the shade plot resolution level.
This value specifies the resolution at which shaded and vectorized viewports will be plotted.
Parameters
[in] | newLevel | new value of the shade plot resolution level
Returns
Acad::eOk
◆ setShowPlotStyles()
 UX_EXPORT_FUNCTION void AcDbPlotSettings::setShowPlotStyles  |  ( |  Adesk::Boolean  |  newVal | )
Specifies whether the object plot style is showed during layout mode.
Parameters
[in] | newVal | pass kTrue to show plot style, kFalse to not show
◆ shadePlot()
 UX_EXPORT_FUNCTION AcDbPlotSettings::ShadePlotType AcDbPlotSettings::shadePlot  |  ( |   | ) |   const
Returns the shade plot type for shaded or rendered plotting.
Returns
current value of the shade plot type
◆ shadePlotCustomDPI()
 UX_EXPORT_FUNCTION Adesk::Int16 AcDbPlotSettings::shadePlotCustomDPI  |  ( |   | ) |   const
Returns the shade plot custom DPI.
This value specifies the user-defined resolution at which shaded and vectorized viewports will be plotted. It should be used if an only if the shade plot resolution level is set to ShadePlotResLevel::kCustom.
Returns
current value of the shade plot custom DPI
◆ shadePlotResLevel()
 UX_EXPORT_FUNCTION AcDbPlotSettings::ShadePlotResLevel AcDbPlotSettings::shadePlotResLevel  |  ( |   | ) |   const
Returns the shade plot resolution level.
This value specifies the resolution at which shaded and vectorized viewports will be plotted.
Returns
current value of the shade plot resolution level
◆ showPlotStyles()
 UX_EXPORT_FUNCTION Adesk::Boolean AcDbPlotSettings::showPlotStyles  |  ( |   | ) |   const
Informs whether the object plot style is showed during layout mode.
Returns
true/false for yes/no
◆ stdScaleType()
 UX_EXPORT_FUNCTION AcDbPlotSettings::StdScaleType AcDbPlotSettings::stdScaleType  |  ( |   | ) |   const
Returns the type of the standard scale.
Returns
standard scale as a value from enumerated type StdScaleType
◆ useStandardScale()
 UX_EXPORT_FUNCTION Adesk::Boolean AcDbPlotSettings::useStandardScale  |  ( |   | ) |   const
Indicates whether the this PlotSettings object uses a standard scale to calculate the current plot scale.
False means that the customPrintScale was specified directly by the user. True means that the standard scale was used to calculate the final customPrintScale.
Returns
true/false
Member Data Documentation
◆ AcDbPlotSettings
 UX_EXPORT_FUNCTION AcDbPlotSettings::AcDbPlotSettings
Constructor.
Plot setup type constructor.
Parameters
[in] | bSetupType | plot setup type - if true then model space
if false = paper space