Public Member Functions | List of all members
AcDbGroupIterator Class Referenceabstract
_ More...
#include <AcDbGroupIterator.h>
 Public Member Functions
virtual bool  | done () const =0
Returns true or false depending on the location of this Iterator within the group. More...
virtual Acad::ErrorStatus  | getObject (AcDbObject *&, AcDb::OpenMode)=0
Opens the object referenced by this Iterator object. More...
virtual bool  | next ()=0
Moves the iterator on the next object. More...
virtual AcDbObjectId  | objectId () const =0
Returns the Object ID of the group entry currently referenced by this Iterator object. More...
 Public Member Functions inherited from AcRxObject
virtual AcRxObject *  | clone () const
Exported and implemented. More...
 virtual AcRx::Ordering  | comparedTo (const AcRxObject *) const
Exported and implemented.
virtual Acad::ErrorStatus  | copyFrom (const AcRxObject *)
Exported and implemented. More...
 virtual AcRxClass *  | isA () const
Exported and implemented.
virtual Adesk::Boolean  | isEqualTo (const AcRxObject *) const
Exported and implemented. More...
bool  | isKindOf (const AcRxClass *) const
Checks the object class. More...
AcRxObject *  | queryX (const AcRxClass *) const
returns the protocol extension object assigned to this class or a parent class. More...
AcRxObject *  | x (const AcRxClass *) const
returns the protocol extension object assigned to this class or a parent class. More...
 virtual  | ~AcRxObject ()
Destructor.
 Additional Inherited Members
 Static Public Member Functions inherited from AcRxObject
 static AcRxObject *  | cast (const AcRxObject *)
 static AcRxClass *  | desc ()
Exported and implemented.
 Protected Member Functions inherited from AcRxObject
AcRxObject ()
Exported and implemented.
Detailed Description
_
Member Function Documentation
◆ done()
 bool AcDbGroupIterator::done  |  ( |   | ) |   const
pure virtual
Returns true or false depending on the location of this Iterator within the group.
Returns
true if this Iterator object is past the end of the group or the group is empty
◆ getObject()
 Acad::ErrorStatus AcDbGroupIterator::getObject  |  ( |  AcDbObject *&  |  pObj,
|  AcDb::OpenMode  |  openMode
)
pure virtual
Opens the object referenced by this Iterator object.
Parameters
[out] | pObj | pointer to opened object or NULL if there was an open error
[in] | openMode | mode to open object
Returns
Acad::eOk if the object is opened error code otherwise
◆ next()
 bool AcDbGroupIterator::next  |  ( |   | )
pure virtual
Moves the iterator on the next object.
Returns
true if this Iterator is not done false otherwise
◆ objectId()
 AcDbObjectId AcDbGroupIterator::objectId  |  ( |   | ) |   const
pure virtual
Returns the Object ID of the group entry currently referenced by this Iterator object.
Returns
objectId of the currently referenced entity