Public Types | Public Member Functions | Public Attributes | Protected Member Functions | List of all members
AcDbLinetypeTableRecord Class Reference
_ More...
#include <AcDbLinetypeTableRecord.h>
 Public Types
 typedef AcDbLinetypeTable  | TableType
 Public Types inherited from AcDbSymbolTableRecord
 typedef AcDbSymbolTable  | TableType
 Public Types inherited from AcGiDrawable
enum  | DrawableType {
 kGeometry = 0 , kDistantLight , kPointLight , kSpotLight ,
 kAmbientLight , kSolidBackground , kGradientBackground , kImageBackground ,
 kGroundPlaneBackground , kViewport
 }
enum  | SetAttributesFlags {
 kDrawableNone = 0 , kDrawableIsAnEntity = 1 , kDrawableUsesNesting = 2 , kDrawableIsCompoundObject = 4 ,
 kDrawableViewIndependentViewportDraw = 8 , kDrawableIsInvisible = 16 , kDrawableHasAttributes = 32 , kDrawableRegenTypeDependentGeometry = 64 ,
 kDrawableIsDimension = 133 , kDrawableRegenDraw = 256 , kDrawableStandardDisplaySingleLOD = 512 , kDrawableShadedDisplaySingleLOD = 1024 ,
 kDrawableViewDependentViewportDraw = 2048 , kDrawableBlockDependentViewportDraw = 4096 , kDrawableIsExternalReference = 8192 , kDrawableNotPlottable = 16384 ,
 kDrawableNotAllowLCS = 32768 , kDrawableMergeControlOff = 65536 , kThreadedWorldDrawViewportDraw = 131072
 }
 Public Member Functions
 Acad::ErrorStatus  | asciiDescription (ACHAR *&) const
 Acad::ErrorStatus  | asciiDescription (const ACHAR *&) const
Acad::ErrorStatus  | comments (ACHAR *&) const
Returns the simple ASCII description of this Linetype (DXF 3). More...
Acad::ErrorStatus  | comments (const ACHAR *&) const
Returns the simple ASCII description of this Linetype (DXF 3). More...
double  | dashLengthAt (int) const
Returns the length of the dash at the specified index (DXF 49). More...
AcGiDrawable *  | drawable ()
Not implemented yet. More...
bool  | isScaledToFit () const
Returns the alignment type for this Linetype (DXF 72). More...
int  | numDashes () const
Returns the number of dashes in this Linetype (DXF 73). More...
double  | patternLength () const
Returns the length of this Linetype pattern (DXF 40). More...
 Acad::ErrorStatus  | setAsciiDescription (const ACHAR *)
Acad::ErrorStatus  | setComments (const ACHAR *)
Sets the simple ASCII description for this Linetype (DXF 3). More...
Acad::ErrorStatus  | setDashLengthAt (int, double)
Sets the length of the dash at the specified index (DXF 49). More...
void  | setIsScaledToFit (bool)
Sets the LinetypeTableRecord alignement type. More...
Acad::ErrorStatus  | setNumDashes (int)
Sets the number of dashes for this Linetype (DXF 73). More...
Acad::ErrorStatus  | setPatternLength (double)
Sets the length of this Linetype pattern (DXF 40). More...
Acad::ErrorStatus  | setShapeIsUcsOrientedAt (int, bool)
Sets the shape(string) orientation for the object at the specified index. More...
Acad::ErrorStatus  | setShapeIsUprightAt (int, bool)
Sets the Upright orientation of the inclusion (text or shape) inside the dash at the specified index (DXF 74, bit 0x08). More...
Acad::ErrorStatus  | setShapeNumberAt (int, int)
Sets the shape number of the shape at the specified index (DXF 75). More...
Acad::ErrorStatus  | setShapeOffsetAt (int, const AcGeVector2d &)
Sets the shape offset of the shape or text string at the specified index (DXF 44, 45). More...
Acad::ErrorStatus  | setShapeRotationAt (int, double)
Sets the rotation angle (in radians) of the shape or text string at the specified index (DXF 50). More...
Acad::ErrorStatus  | setShapeScaleAt (int, double)
Sets the scale of the shape or text string at the specified index (DXF 46). More...
Acad::ErrorStatus  | setShapeStyleAt (int, AcDbObjectId)
Sets the Object ID of the TextStyleTableRecord of the shape or TextStyle for the specified index (DXF 340). More...
Acad::ErrorStatus  | setTextAt (int, const ACHAR *)
Sets the text string at the specified index (DXF 9). More...
bool  | shapeIsUcsOrientedAt (int) const
Returns the UcsOriented flag for the shape or text string at the specified index (DXF 74, bit 0x01). More...
bool  | shapeIsUprightAt (int) const
Determines whether the inclusion (text or shape) is Upright-oriented inside the dash at the specified index (DXF 74, bit 0x08) More...
int  | shapeNumberAt (int) const
Returns the shape number of the shape at the specified index (DXF 75);. More...
AcGeVector2d  | shapeOffsetAt (int) const
Returns the shape offset of the shape or text string at the specified index (DXF 44, 45). More...
double  | shapeRotationAt (int) const
Returns the rotation angle of the shape or text string at the specified index (DXF 50). More...
double  | shapeScaleAt (int) const
Returns the scale of the shape or text string at the specified index (DXF 46). More...
AcDbObjectId  | shapeStyleAt (int) const
Returns the Object ID of the TextStyleTableRecord of the shape or TextStyle at the specified index (DXF 340). More...
Acad::ErrorStatus  | textAt (int, ACHAR *&) const
Returns the text string at the specified index (DXF 9). More...
Acad::ErrorStatus  | textAt (int, const ACHAR *&) const
Returns the text string at the specified index (DXF 9). More...
 virtual  | ~AcDbLinetypeTableRecord ()
Destructor.
 Public Member Functions inherited from AcDbSymbolTableRecord
Acad::ErrorStatus  | getName (ACHAR *&) const
getName. More...
Acad::ErrorStatus  | getName (AcString &) const
getName. More...
Acad::ErrorStatus  | getName (const ACHAR *&) const
getName. More...
bool  | isDependent () const
Returns whether this AcDbSymbolTableRecord is dependending on xref database. More...
bool  | isResolved () const
Returns whether this AcDbSymbolTableRecord is dependending on xref database. More...
Acad::ErrorStatus  | setName (const ACHAR *)
setName. More...
 virtual  | ~AcDbSymbolTableRecord ()
destructor.
 Public Member Functions inherited from AcDbObject
virtual Acad::ErrorStatus  | addPersistentReactor (AcDbObjectId)
Adds a persistent reactor to this object reactor list. More...
Acad::ErrorStatus  | addReactor (AcDbObjectReactor *) const
Adds a transient reactor to this object. More...
virtual Acad::ErrorStatus  | applyPartialUndo (AcDbDwgFiler *, AcRxClass *)
This function is called during Undo operations on objects, that use the 'Partial Undo meachanism'; this is, this object is opened with assertWriteEnabled(Adesk::kFalse) to indicate that custom Undo filing is used rather than the default Undo filing. More...
 void  | assertNotifyEnabled () const
 void  | assertReadEnabled () const
 void  | assertWriteEnabled (Adesk::Boolean=Adesk::kTrue, Adesk::Boolean=Adesk::kTrue)
virtual Acad::ErrorStatus  | audit (AcDbAuditInfo *)
Performs the audit operation for this object. More...
Acad::ErrorStatus  | cancel ()
Reverts all changes since the object had been opened and closes the object. More...
virtual void  | cancelled (const AcDbObject *)
A handler function for persistent reactors. More...
virtual AcRxObject *  | clone () const
Creates a shallow clone of this object. More...
Acad::ErrorStatus  | close ()
Closes the object. More...
Acad::ErrorStatus  | closeAndPage (Adesk::Boolean=Adesk::kTrue)
Closes the object. More...
virtual Acad::ErrorStatus  | composeForLoad (AcDb::OdaSaveType, AcDb::AcDbDwgVersion)
This function is intended for future MT file loading support. More...
virtual void  | copied (const AcDbObject *, const AcDbObject *)
A handler function for persistent reactors. More...
virtual Acad::ErrorStatus  | copyFrom (const AcRxObject *)
Copies the pSrc object information in this object. More...
Acad::ErrorStatus  | createExtensionDictionary ()
Creates a dictionary as extension dictionary for this object. More...
AcDbDatabase *  | database () const
Returns the database that contains this object. More...
virtual Acad::ErrorStatus  | decomposeForSave (AcDb::AcDbDwgVersion, AcDbObject *&, AcDbObjectId &, Adesk::Boolean &)
This function is called during dwg and dxf output, to allow a custom object to decompose itself, due to provided dwg/dxf target file version. More...
virtual Acad::ErrorStatus  | deepClone (AcDbObject *, AcDbObject *&, AcDbIdMapping &, Adesk::Boolean=Adesk::kTrue) const final
Clones this object, appends it to the owner pOwner and adds an AcDbIdPair record to the idMap. More...
void  | disableUndoRecording (Adesk::Boolean)
Disables or enables the undo recording for the object. More...
Acad::ErrorStatus  | downgradeOpen ()
Sets the open mode for an object opened for write to be opened for read. More...
Acad::ErrorStatus  | downgradeToNotify (Adesk::Boolean)
Sets the open mode for an object opened for write to be opened for notify. More...
virtual AcGiDrawable *  | drawable ()
Retrieves the AcGiDrawable instance of this object. More...
Acad::ErrorStatus  | dwgIn (AcDbDwgFiler *)
Calls the object's dwgInFields function, and reads any XData if present. More...
virtual Acad::ErrorStatus  | dwgInFields (AcDbDwgFiler *)
Reads the object from the DWG filer. More...
Acad::ErrorStatus  | dwgOut (AcDbDwgFiler *) const
Calls the object's dwgOutFields function, and writes any XData if present. More...
virtual Acad::ErrorStatus  | dwgOutFields (AcDbDwgFiler *) const
Writes the object to the DWG filer. More...
Acad::ErrorStatus  | dxfIn (AcDbDxfFiler *)
Calls the object's dxfInFields function, and reads any XData if present. More...
virtual Acad::ErrorStatus  | dxfInFields (AcDbDxfFiler *)
Reads the object from the DXF filer. More...
Acad::ErrorStatus  | dxfOut (AcDbDxfFiler *, Adesk::Boolean, Adesk::uchar *) const
Calls the object's dxfOutFields function, and writes any XData if present. More...
virtual Acad::ErrorStatus  | dxfOutFields (AcDbDxfFiler *) const
Writes the object to the DXF filer. More...
Acad::ErrorStatus  | erase (Adesk::Boolean=Adesk::kTrue)
Sets the bit that indicates that the object is erased. More...
virtual void  | erased (const AcDbObject *, Adesk::Boolean)
A handler function for persistent reactors. More...
AcDbObjectId  | extensionDictionary () const
Returns the object id of the extension dictionary for this object. More...
void  | getAcDbHandle (AcDbHandle &) const
Returns handle of this object. More...
Acad::ErrorStatus  | getBinaryData (const ACHAR *, Adesk::Int32 &, char *&) const
Creates a copy of the binary data stored as chunks of maximum 127 bytes in the resbuf chain of this object's extension dictionary xrecord entry given by entryName. More...
int  | getBrxOpenCount () const
This function returns the number of open BRX instances for this object. More...
int  | getBrxOpenState () const
This function returns the BRX object open state flags as bitfields, for diagnostic purpose. More...
virtual Acad::ErrorStatus  | getClassID (CLSID *) const final
Gets the COM wrapper Class ID for this entity. More...
int  | getCustomObjectState () const
This function returns the custom object status : 1=isCustomObject 2=DifferentialUndoDisabled. More...
Acad::ErrorStatus  | getField (const ACHAR *, AcDbField *&, AcDb::OpenMode) const
Retrieves the specified Field from this object, and opens it in mode. More...
Acad::ErrorStatus  | getField (const ACHAR *, AcDbObjectId &) const
Gets the pszPropName field object from field dictionary of this AcDbObject object, using pszPropName as key. More...
AcDbObjectId  | getFieldDictionary () const
Returns the Field dictionary associated with this object,. More...
Acad::ErrorStatus  | getFieldDictionary (AcDbDictionary *&, AcDb::OpenMode) const
Gets and opens the field dictionary for this. More...
Acad::ErrorStatus  | getObjectBirthVersion (AcDb::AcDbDwgVersion &, AcDb::MaintenanceReleaseVersion &)
This function is currently not supported by the CAD engine, always returns Acad::eOk, and 'kDHL_CURRENT' + 'kMReleaseCurrent' results. More...
virtual Acad::ErrorStatus  | getObjectSaveVersion (const AcDbDwgFiler *, AcDb::AcDbDwgVersion &, AcDb::MaintenanceReleaseVersion &)
Returns the DWG version for saving the object. More...
virtual Acad::ErrorStatus  | getObjectSaveVersion (const AcDbDxfFiler *, AcDb::AcDbDwgVersion &, AcDb::MaintenanceReleaseVersion &)
Returns the DWG version for saving the object. More...
int  | getOdaOpenCount () const
This function returns the number of open ODA instances for this object. More...
int  | getOdaOpenState () const
This function returns the ODA object open state flags as bitfields, for diagnostic purpose. More...
virtual void  | goodbye (const AcDbObject *)
A handler function for persistent reactors. More...
Acad::ErrorStatus  | handOverTo (AcDbObject *, Adesk::Boolean=Adesk::kTrue, Adesk::Boolean=Adesk::kTrue)
Hands over objects identity to another object. More...
bool  | hasFields () const
Return true if this object has single or multiple fields associated with him. More...
bool  | hasPersistentReactor (AcDbObjectId) const
Checks the input objectId in this object reactor list. More...
bool  | hasSaveVersionOverride ()
This function indicates whether this object overrides the filer's save version. More...
virtual AcDbObjectId  | id () const
Returns the database id of this object. More...
Adesk::Boolean  | isAcDbObjectIdsInFlux () const
Checks whether a deep clone operation was completed. More...
Adesk::Boolean  | isAProxy () const
Adesk::Boolean  | isCancelling () const
Adesk::Boolean  | isErased () const
Returns whether this object is erased. More...
Adesk::Boolean  | isEraseStatusToggled () const
Checks whether the object erase status has been toggled. More...
Adesk::Boolean  | isModified () const
Returns whether this object's assertWriteEnabled() has been called since it was opened. More...
Adesk::Boolean  | isModifiedGraphics () const
Checks whether this object graphics will be updated when the object is closed. More...
Adesk::Boolean  | isModifiedXData () const
Checks whether this object's xData was modified. More...
Adesk::Boolean  | isNewObject () const
Returns true if and only if this object has not been closed since it was created. More...
Adesk::Boolean  | isNotifyEnabled () const
Returns whether this object is opened for notify. More...
Adesk::Boolean  | isNotifying () const
virtual Adesk::Boolean  | isPersistent () const
Returns the 'persistent' status of a database object. More...
Adesk::Boolean  | isReadEnabled () const
Returns whether this object is opened for read. More...
 Adesk::Boolean  | isReallyClosing () const
Checks whether the next close call will completely close this object return true if on the next call the object will be completely closed false otherwise.
Adesk::Boolean  | isTransactionResident () const
Gets the object transaction status. More...
Adesk::Boolean  | isUndoing () const
bool  | isUndoRecordingDisabled () const
Returns whether the undo recording for the object is enabled or not. More...
Adesk::Boolean  | isWriteEnabled () const
Returns whether this object is opened for write. More...
virtual AcDb::DuplicateRecordCloning  | mergeStyle () const
Returns the object's merge behavior during cloning. More...
virtual void  | modified (const AcDbObject *)
A handler function for persistent reactors. More...
virtual void  | modifiedGraphics (const AcDbEntity *)
A handler function for persistent reactors. More...
virtual void  | modifiedXData (const AcDbObject *)
A handler function for persistent reactors. More...
virtual void  | modifyUndone (const AcDbObject *)
A handler function for persistent reactors. More...
virtual void  | objectClosed (const AcDbObjectId)
A handler function for persistent reactors. More...
AcDbObjectId  | objectId () const
Returns object id. More...
virtual void  | openedForModify (const AcDbObject *)
A handler function for persistent reactors. More...
AcDbObjectId  | ownerId () const
Returns object id of the owner. More...
AcDbVoidPtrArray *  | reactors ()
Gets the object pointers to reactors. More...
const AcDbVoidPtrArray *  | reactors () const
Gets the object pointers to reactors. More...
virtual void  | reappended (const AcDbObject *)
A handler function for persistent reactors. More...
 virtual void  | recvPropagateModify (const AcDbObject *)
Not implemented yet.
Acad::ErrorStatus  | releaseExtensionDictionary ()
Removes the extension dictionary associated with this object. More...
virtual Acad::ErrorStatus  | removeField (AcDbObjectId)
Removes the Field specified by acFieldId from this object. More...
virtual Acad::ErrorStatus  | removeField (const ACHAR *)
Removes the Field specified by szKeyString from this object. More...
virtual Acad::ErrorStatus  | removeField (const ACHAR *, AcDbObjectId &)
Removes the Field specified by acPszKeyString from this object, and returns its ObjectId value. More...
virtual Acad::ErrorStatus  | removePersistentReactor (AcDbObjectId)
Removes a persistent reactor from this object reactor list. More...
Acad::ErrorStatus  | removeReactor (AcDbObjectReactor *) const
Removes a transient reactor to this object. More...
void  | setAcDbObjectIdsInFlux ()
Call this function to indicate that the object IDs of this object and its sub-objects (if any) are not yet valid. More...
Acad::ErrorStatus  | setBinaryData (const ACHAR *, Adesk::Int32, const char *)
Creates a copy of the binary data, divides it in up to 127 bytes binary chunks and
 sets them as resbufs in the resbuf chain of this object's extension dictionary xrecord entry given by entryName. More...
virtual Acad::ErrorStatus  | setField (const ACHAR *, AcDbField *, AcDbObjectId &)
Adds the pAcField field object to field dictionary of this AcDbObject object, using pKey as key. More...
void  | setHasSaveVersionOverride (bool)
This function can be called to specify that the object has a "save version override". More...
virtual Acad::ErrorStatus  | setOwnerId (AcDbObjectId)
Sets the ownerId data member of the object to be objId. More...
virtual Acad::ErrorStatus  | setXData (const resbuf *)
Sets/removes xData associated with this object. More...
virtual Acad::ErrorStatus  | subCancel ()
Possibility to veto a cancel operation from within custom entities. More...
virtual Acad::ErrorStatus  | subClose ()
virtual Acad::ErrorStatus  | subErase (Adesk::Boolean)
This hook is called during an AcDbObject::erase call, before any actual erase operation is performed. More...
 virtual Acad::ErrorStatus  | subHandOverTo (AcDbObject *)
virtual void  | subObjModified (const AcDbObject *, const AcDbObject *)
A handler function for persistent reactors. More...
 virtual Acad::ErrorStatus  | subOpen (AcDb::OpenMode)
virtual Acad::ErrorStatus  | subSwapIdWith (AcDbObjectId, Adesk::Boolean=Adesk::kFalse, Adesk::Boolean=Adesk::kFalse)
This hook is called during an AcDbObject::swapIdWith() call, before any actual swap operation is performed. More...
Acad::ErrorStatus  | swapIdWith (AcDbObjectId, Adesk::Boolean=Adesk::kFalse, Adesk::Boolean=Adesk::kFalse)
Swaps the object id's between the object identified by param swapId and this object. More...
virtual Acad::ErrorStatus  | swapReferences (const AcDbIdMapping &)
Not implemented yet. More...
virtual void  | unappended (const AcDbObject *)
A handler function for persistent reactors. More...
AcDbDwgFiler *  | undoFiler ()
Gets the undo filer for this object. More...
Acad::ErrorStatus  | upgradeFromNotify (Adesk::Boolean &)
Upgrades the open status of this object to AcDb::kForWrite, if this object is already open (either in AcDb::kForRead, AcDb::kForNotify or AcDb::kForWrite) More...
Acad::ErrorStatus  | upgradeOpen ()
Changes the objects open mode to AcDb::kForWrite and sends notifications. More...
virtual Acad::ErrorStatus  | wblockClone (AcRxObject *, AcDbObject *&, AcDbIdMapping &, Adesk::Boolean=Adesk::kTrue) const final
Clones this object, appends it to the owner pOwner and adds an AcDbIdPair record to the idMap. More...
virtual resbuf *  | xData (const ACHAR *=NULL) const
Returns the xData associated with this object. More...
Acad::ErrorStatus  | xDataTransformBy (const AcGeMatrix3d &)
Transforms the extended data according to parameter transformation matrix. More...
 virtual void  | xmitPropagateModify () const
Not implemented yet.
 virtual  | ~AcDbObject ()
Destructor.
 Public Member Functions inherited from AcGiDrawable
virtual bool  | bounds (AcDbExtents &) const
virtual DrawableType  | drawableType () const
 virtual AcGiDrawStream *  | drawStream () const
 AcGsNode *  | gsNode () const
virtual AcDbObjectId  | id () const =0
virtual Adesk::Boolean  | isPersistent () const =0
virtual Adesk::UInt32  | regenSupportFlags () const final
Returns whether and to which level this object supports MultiThreading. More...
 virtual Adesk::Boolean  | RolloverHit (Adesk::ULongPtr, Adesk::ULongPtr, Adesk::Boolean)
 virtual Adesk::UInt32  | setAttributes (AcGiDrawableTraits *) final
 virtual void  | setDrawStream (AcGiDrawStream *)
 void  | setGsNode (AcGsNode *)
 virtual void  | viewportDraw (AcGiViewportDraw *) final
 virtual Adesk::UInt32  | viewportDrawLogicalFlags (AcGiViewportDraw *) final
 virtual Adesk::Boolean  | worldDraw (AcGiWorldDraw *) final
 Public Member Functions inherited from AcRxObject
virtual AcRxObject *  | clone () const
Exported and implemented. More...
 virtual AcRx::Ordering  | comparedTo (const AcRxObject *) const
Exported and implemented.
virtual Acad::ErrorStatus  | copyFrom (const AcRxObject *)
Exported and implemented. More...
 virtual AcRxClass *  | isA () const
Exported and implemented.
virtual Adesk::Boolean  | isEqualTo (const AcRxObject *) const
Exported and implemented. More...
bool  | isKindOf (const AcRxClass *) const
Checks the object class. More...
AcRxObject *  | queryX (const AcRxClass *) const
returns the protocol extension object assigned to this class or a parent class. More...
AcRxObject *  | x (const AcRxClass *) const
returns the protocol extension object assigned to this class or a parent class. More...
 virtual  | ~AcRxObject ()
Destructor.
 Public Attributes
AcDbLinetypeTableRecord
Default constructor.
 Public Attributes inherited from AcDbSymbolTableRecord
AcDbSymbolTableRecord
only derived constructors are used.
 Protected Member Functions
virtual Adesk::UInt32  | subSetAttributes (AcGiDrawableTraits *)
Not implemented yet. More...
virtual void  | subViewportDraw (AcGiViewportDraw *)
Creates a viewport-dependent graphical representation of this object. More...
virtual Adesk::Boolean  | subWorldDraw (AcGiWorldDraw *)
Creates a viewport-independent graphical representation of the object. More...
 Protected Member Functions inherited from AcDbObject
virtual Acad::ErrorStatus  | subDeepClone (AcDbObject *, AcDbObject *&, AcDbIdMapping &, Adesk::Boolean=true) const
virtual Acad::ErrorStatus  | subGetClassID (CLSID *) const
virtual Adesk::UInt32  | subSetAttributes (AcGiDrawableTraits *)
Sets the values of this object's subentity traits and returns with the calling object's subentity traits. More...
virtual void  | subViewportDraw (AcGiViewportDraw *)
virtual Adesk::UInt32  | subViewportDrawLogicalFlags (AcGiViewportDraw *)
virtual Acad::ErrorStatus  | subWblockClone (AcRxObject *, AcDbObject *&, AcDbIdMapping &, Adesk::Boolean=true) const
virtual Adesk::Boolean  | subWorldDraw (AcGiWorldDraw *)
 Protected Member Functions inherited from AcGiDrawable
virtual Adesk::UInt32  | subRegenSupportFlags () const
Returns whether and to which level this object supports MultiThreading. More...
virtual Adesk::UInt32  | subSetAttributes (AcGiDrawableTraits *)=0
virtual void  | subViewportDraw (AcGiViewportDraw *)=0
 virtual Adesk::UInt32  | subViewportDrawLogicalFlags (AcGiViewportDraw *)
virtual Adesk::Boolean  | subWorldDraw (AcGiWorldDraw *)=0
 Protected Member Functions inherited from AcRxObject
AcRxObject ()
Exported and implemented.
 Additional Inherited Members
 Static Public Member Functions inherited from AcRxObject
 static AcRxObject *  | cast (const AcRxObject *)
 static AcRxClass *  | desc ()
Exported and implemented.
 Static Public Member Functions inherited from AcHeapOperators
 static void  | operator delete (void *)
_
 static void  | operator delete (void *, const char *, int)
 static void  | operator delete (void *, void *)
 static void  | operator delete[] (void *)
_
 static void  | operator delete[] (void *, const char *, int)
 static void *  | operator new (size_t)
_
 static void *  | operator new (size_t, const char *, int)
 static void *  | operator new (size_t, void *p)
 static void *  | operator new[] (size_t)
_
 static void *  | operator new[] (size_t, const char *, int)
Detailed Description
_
Member Function Documentation
◆ comments() [1/2]
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbLinetypeTableRecord::comments  |  ( |  ACHAR *&  |  pValue | ) |   const
Returns the simple ASCII description of this Linetype (DXF 3).
Parameters
[out] | pValue | pointer to internal ASCII description or empty string, if none set
 calling routine will free the memory allocated
Returns
Acad::eOk
◆ comments() [2/2]
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbLinetypeTableRecord::comments  |  ( |  const ACHAR *&  |  pValue | ) |   const
Returns the simple ASCII description of this Linetype (DXF 3).
Parameters
[out] | pValue | pointer to internal ASCII description or empty string, if none set.
Returns
Acad::eOk
◆ dashLengthAt()
 UX_EXPORT_FUNCTION double AcDbLinetypeTableRecord::dashLengthAt  |  ( |  int  |  cardinal | ) |   const
Returns the length of the dash at the specified index (DXF 49).
Parameters
[in] | cardinal | Dash index. Has to be zero or greater and lower than the result of numDashes(). Index is zero based.
Returns
length of dash at position index.
◆ drawable()
 UX_EXPORT_FUNCTION AcGiDrawable * AcDbLinetypeTableRecord::drawable  |  ( |   | )
virtual
Not implemented yet.
Returns
Reimplemented from AcDbObject.
◆ isScaledToFit()
 UX_EXPORT_FUNCTION bool AcDbLinetypeTableRecord::isScaledToFit  |  ( |   | ) |   const
Returns the alignment type for this Linetype (DXF 72).
In the linetype definition in the alignement field there is a 'S' if linetype is scaled to fit, otherwise there is an 'A'.
◆ numDashes()
 UX_EXPORT_FUNCTION int AcDbLinetypeTableRecord::numDashes  |  ( |  void  |   | ) |   const
Returns the number of dashes in this Linetype (DXF 73).
Returns
number of dashes.
◆ patternLength()
 UX_EXPORT_FUNCTION double AcDbLinetypeTableRecord::patternLength  |  ( |  void  |   | ) |   const
Returns the length of this Linetype pattern (DXF 40).
patternLength is the total length in drawing units of all the dashes in this Linetype pattern.
Returns
patternlength
◆ setComments()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbLinetypeTableRecord::setComments  |  ( |  const ACHAR *  |  pValue | )
Sets the simple ASCII description for this Linetype (DXF 3).
The ascii description is just a comment.
Parameters
[in] | pValue | comments to set for this linetype.
Returns
Acad::eOutOfMemory, if the pString can not be copied because of too less memory
 Acad::eNotOpenForWrite, if record is not write enabled
 Acad::eOk, if successful.
Remarks
other CAD platforms may crash, if object is not write enabled. BRX returns Acad::eNotOpenForWrite.
◆ setDashLengthAt()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbLinetypeTableRecord::setDashLengthAt  |  ( |  int  |  dashIndex,
|  double  |  dashesLength
)
Sets the length of the dash at the specified index (DXF 49).
Parameters
[in] | dashIndex | has to be zero or greater and lower than the result of numDashes(). Index is zero based.
[in] | dashesLength | length of dash at position index.
Remarks
In other CAD libraries it may be allowed to set numDashes to 1 or to a value greater than 12. In BRX and DwgDirect it isn't.
Returns
Acad::eInvalidInput, if dash index is out of range Acad::eNotOpenForWrite, if record is not write enabled Acad::eOk otherwise
◆ setIsScaledToFit()
 UX_EXPORT_FUNCTION void AcDbLinetypeTableRecord::setIsScaledToFit  |  ( |  bool  |  bFit | )
Sets the LinetypeTableRecord alignement type.
Parameters
[in] | bFit | if true then alignement is scaled to fit
◆ setNumDashes()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbLinetypeTableRecord::setNumDashes  |  ( |  int  |  dashesNr | )
Sets the number of dashes for this Linetype (DXF 73).
Setting the number of dashes results in said number of zero-length dashes with no shape or text string associated with them. All previous existing dashes and associated information is erased.
Parameters
[in] | dashesNr | number of dashes to set
Returns
Acad::eInvalidInput, correspondent ARX API method silently empties array of dashes if count > 127 and crashes AutoCAD (2010) if count < 0 (#8972). Acad::eNotOpenForWrite, if record is not write enabled Acad::eOk otherwise
◆ setPatternLength()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbLinetypeTableRecord::setPatternLength  |  ( |  double  |  patLength | )
Sets the length of this Linetype pattern (DXF 40).
patternLength is the total length in drawing units of all the dashes in this Linetype pattern.
Parameters
[in] | patLength | patternLength to set
Returns
Acad::eNotOpenForWrite, if record is not write enabled
 Acad::eOk, if successful.
Remarks
setting a patternLength value of 0 to a linetype which has pattern with length is invalid. A following patternLength call will return the actual length of the dashes.
◆ setShapeIsUcsOrientedAt()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbLinetypeTableRecord::setShapeIsUcsOrientedAt  |  ( |  int  |  dashIndex,
|  bool  |  bUcsOriented
)
Sets the shape(string) orientation for the object at the specified index.
Parameters
[in] | dashIndex | position in the LinetypeTableRecord
[in] | bUcsOriented | if true shape will be UCS oriented if false shape will be oriented according to the line
Returns
Acad::eInvalidInput, if dash index is out of range Acad::eNotOpenForWrite, if record is not write enabled Acad::eOk otherwise
◆ setShapeIsUprightAt()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbLinetypeTableRecord::setShapeIsUprightAt  |  ( |  int  |  dashIndex,
|  bool  |  isUpright
)
Sets the Upright orientation of the inclusion (text or shape) inside the dash at the specified index (DXF 74, bit 0x08).
The initial value is False by default.
Parameters
[in] | dashIndex | dash index as an Integer value in range [0 <= dashIndex < numDashes].
[in] | isUpright | if True - to orient the inclusion Upright.
Returns
Acad::eInvalidInput, if dash index is out of range Acad::eNotOpenForWrite, if record is not write enabled Acad::eOk otherwise
◆ setShapeNumberAt()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbLinetypeTableRecord::setShapeNumberAt  |  ( |  int  |  dashIndex,
|  int  |  shapeCardinal
)
Sets the shape number of the shape at the specified index (DXF 75).
The shapeNumber is the shapes Number from its shape file. If at index no shape is set, shapeNumber should be 0.
Parameters
[in] | dashIndex; | has to be zero or greater and lower than the result of numDashes(). Index is zero based.
[in] | shapeCardinal | shape number at position index.
Returns
Acad::eInvalidInput, if dash index is out of range Acad::eNotOpenForWrite, if record is not write enabled Acad::eOk otherwise
◆ setShapeOffsetAt()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbLinetypeTableRecord::setShapeOffsetAt  |  ( |  int  |  dashIndex,
|  const AcGeVector2d &  |  offset
)
Sets the shape offset of the shape or text string at the specified index (DXF 44, 45).
If at index no shape is set, offset should be 0.0 .
Parameters
[in] | dashIndex | has to be zero or greater and lower than the result of numDashes(). Index is zero based.
[in] | offset | shape offset at position index.
Returns
Acad::eInvalidInput, if dash index is out of range Acad::eNotOpenForWrite, if record is not write enabled Acad::eOk otherwise
◆ setShapeRotationAt()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbLinetypeTableRecord::setShapeRotationAt  |  ( |  int  |  dashIndex,
|  double  |  rotation
)
Sets the rotation angle (in radians) of the shape or text string at the specified index (DXF 50).
Parameters
[in] | dashIndex | : has to be zero or greater and lower than the result of numDashes(). Index is zero based.
[in] | rotation | rotation angle at position index.
Returns
Acad::eInvalidInput, if dash index is out of range Acad::eNotOpenForWrite, if record is not write enabled Acad::eOk otherwise
◆ setShapeScaleAt()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbLinetypeTableRecord::setShapeScaleAt  |  ( |  int  |  dashIndex,
|  double  |  scale
)
Sets the scale of the shape or text string at the specified index (DXF 46).
If at index no shape is set, scale should be 1.0 .
Parameters
[in] | dashIndex | has to be zero or greater and lower than the result of numDashes(). Index is zero based.
[in] | scale | shape scale of shape at position index or 1.0.
Returns
Acad::eInvalidInput, if dash index is out of range Acad::eNotOpenForWrite, if record is not write enabled Acad::eOk otherwise
◆ setShapeStyleAt()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbLinetypeTableRecord::setShapeStyleAt  |  ( |  int  |  dashIndex,
|  AcDbObjectId  |  textStyleId
)
Sets the Object ID of the TextStyleTableRecord of the shape or TextStyle for the specified index (DXF 340).
If at position index there should be no shape or text then id should be AcDbObjectId::kNull.
Parameters
[in] | dashIndex | has to be zero or greater and lower than the result of numDashes(). Index is zero based.
[in] | textStyleId | objectid of the AcDbTextStyleTableRecord or of TextStyle at position index.
Returns
Acad::eInvalidInput, if dash index is out of range Acad::eNotOpenForWrite, if record is not write enabled Acad::eOk otherwise
◆ setTextAt()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbLinetypeTableRecord::setTextAt  |  ( |  int  |  dashIndex,
|  const ACHAR *  |  text
)
Sets the text string at the specified index (DXF 9).
Parameters
[in] | dashIndex | has to be zero or greater and lower than the result of numDashes(). Index is zero based.
[in] | text | textstring at position index.
Returns
Acad::eStringTooLong, if text is too long
 Acad::eInvalidInput, if index is out of range
 Acad::eNotOpenForWrite, if record is not write enabled
 Acad::eOk otherwise
◆ shapeIsUcsOrientedAt()
 UX_EXPORT_FUNCTION bool AcDbLinetypeTableRecord::shapeIsUcsOrientedAt  |  ( |  int  |  cardinal | ) |   const
Returns the UcsOriented flag for the shape or text string at the specified index (DXF 74, bit 0x01).
Parameters
[in] | cardinal | Dash index. Has to be zero or greater and lower than the result of numDashes(). Index is zero based.
Returns
true, if shape or text at position index is ucsoriented, false otherwise.
◆ shapeIsUprightAt()
 UX_EXPORT_FUNCTION bool AcDbLinetypeTableRecord::shapeIsUprightAt  |  ( |  int  |  dashIndex | ) |   const
Determines whether the inclusion (text or shape) is Upright-oriented inside the dash at the specified index (DXF 74, bit 0x08)
Parameters
[in] | dashIndex | Dash index as an Integer value in range [0 <= dashIndex < numDashes].
Returns
true, if the inclusion (text or shape) is oriented upright
◆ shapeNumberAt()
 UX_EXPORT_FUNCTION int AcDbLinetypeTableRecord::shapeNumberAt  |  ( |  int  |  cardinal | ) |   const
Returns the shape number of the shape at the specified index (DXF 75);.
Parameters
[in] | cardinal | Dash index. Has to be zero or greater and lower than the result of numDashes(). Index is zero based.
Returns
shape number at position index.
◆ shapeOffsetAt()
 UX_EXPORT_FUNCTION AcGeVector2d AcDbLinetypeTableRecord::shapeOffsetAt  |  ( |  int  |  cardinal | ) |   const
Returns the shape offset of the shape or text string at the specified index (DXF 44, 45).
Parameters
[in] | cardinal | Dash index. Has to be zero or greater and lower than the result of numDashes(). Index is zero based.
Returns
shape offset at position index.
◆ shapeRotationAt()
 UX_EXPORT_FUNCTION double AcDbLinetypeTableRecord::shapeRotationAt  |  ( |  int  |  cardinal | ) |   const
Returns the rotation angle of the shape or text string at the specified index (DXF 50).
If shape (or text) at position index is ucs oriented, than the angle is relative to the current UCS, otherwise it is relative to to the lines directrion.
Parameters
[in] | cardinal | Dash index. Has to be zero or greater and lower than the result of numDashes(). Index is zero based.
Returns
rotation angle at position index.
◆ shapeScaleAt()
 UX_EXPORT_FUNCTION double AcDbLinetypeTableRecord::shapeScaleAt  |  ( |  int  |  cardinal | ) |   const
Returns the scale of the shape or text string at the specified index (DXF 46).
If there is no shape at the index, 1.0 is returned.
Parameters
[in] | cardinal | Dash index. Has to be zero or greater and lower than the result of numDashes(). Index is zero based.
Returns
shape scale of shape at position index or 1.0.
◆ shapeStyleAt()
 UX_EXPORT_FUNCTION AcDbObjectId AcDbLinetypeTableRecord::shapeStyleAt  |  ( |  int  |  cardinal | ) |   const
Returns the Object ID of the TextStyleTableRecord of the shape or TextStyle at the specified index (DXF 340).
Parameters
[in] | cardinal | Dash index. Has to be zero or greater and lower than the result of numDashes(). Index is zero based.
Returns
objectid of the AcDbTextStyleTableRecord or of TextStyle at position index.
◆ subSetAttributes()
 UX_EXPORT_FUNCTION Adesk::UInt32 AcDbLinetypeTableRecord::subSetAttributes  |  ( |  AcGiDrawableTraits *  |  pFeatures | )
protectedvirtual
Not implemented yet.
Parameters
[in] | pFeatures | notyetdocumented
Returns
Remarks
exported but not yet implemented.
Reimplemented from AcDbObject.
◆ subViewportDraw()
 UX_EXPORT_FUNCTION void AcDbLinetypeTableRecord::subViewportDraw  |  ( |  AcGiViewportDraw *  |  pVd | )
protectedvirtual
Creates a viewport-dependent graphical representation of this object.
This function is called for every viewport, if the object's worldDraw returns false. param[in] pVd pointer to initialized AcGiViewportDraw interface
Reimplemented from AcDbObject.
◆ subWorldDraw()
 UX_EXPORT_FUNCTION Adesk::Boolean AcDbLinetypeTableRecord::subWorldDraw  |  ( |  AcGiWorldDraw *  |  pWd | )
protectedvirtual
Creates a viewport-independent graphical representation of the object.
Parameters
[in] | pWd | Pointer to initialized AcGiWorldDraw interface
Returns
if false, viewportDraw() must be called,
 if true, the graphical representation is viewport-independent
Reimplemented from AcDbObject.
◆ textAt() [1/2]
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbLinetypeTableRecord::textAt  |  ( |  int  |  cardinal,
|  ACHAR *&  |  text
) |   |  const
Returns the text string at the specified index (DXF 9).
Parameters
[in] | cardinal | Dash index. Has to be zero or greater and lower than the result of numDashes(). Index is zero based.
[out] | text | textstring at position index. Calling routine will free the memory allocated
Returns
Acad::eNotApplicable, if index is out ouf range or there is no text
 at position index
 Acad::eOk otherwise
◆ textAt() [2/2]
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbLinetypeTableRecord::textAt  |  ( |  int  |  cardinal,
|  const ACHAR *&  |  text
) |   |  const
Returns the text string at the specified index (DXF 9).
Parameters
[in] | cardinal | Dash index. Has to be zero or greater and lower than the result of numDashes(). Index is zero based.
[out] | text | textstring at position index.
Returns
Acad::eNotApplicable, if index is out ouf range or there is no text
 at position index
 Acad::eOk otherwise