Public Member Functions | List of all members
AcDbExtents Class Reference
_ More...
#include <AcDbExtents.h>
 Public Member Functions
AcDbExtents ()
Default constructor. More...
AcDbExtents (const AcDbExtents &)
Copy constructor. More...
AcDbExtents (const AcGePoint3d &, const AcGePoint3d &)
Constructor. More...
Acad::ErrorStatus  | addBlockExt (AcDbBlockTableRecord *)
Adds extents of all non-deleted entities given in block table record. More...
void  | addExt (const AcDbExtents &)
Updates the extents of this Extents object with the specified Extents object, so that the extents inputExt is contained in the new computed extents. More...
void  | addPoint (const AcGePoint3d &)
Updates the extents of this Extents object with the specified point, so that point is contained in the new computed extents. More...
void  | expandBy (const AcGeVector3d &)
Expand this box by the amount in the input vector. More...
AcGePoint3d  | maxPoint () const
Returns the maximum point as AcGePoint3d. More...
AcGePoint3d  | minPoint () const
Returns the minimum point as AcGePoint3d. More...
bool  | operator== (const AcDbExtents &)
Equality operator, compares this AcDbExtents with the other AcDbExtents. More...
Acad::ErrorStatus  | set (const AcGePoint3d &, const AcGePoint3d &)
Sets m_min to minPoint and m_max to maxPoint, but only if minPoint.x<=maxPoint.x and minPoint.y<=maxPoint.y and minPoint.z<=maxPoint.z. More...
void  | transformBy (const AcGeMatrix3d &)
Transforms the extents limits. More...
 Additional Inherited Members
 Static Public Member Functions inherited from AcHeapOperators
 static void  | operator delete (void *)
_
 static void  | operator delete (void *, const char *, int)
 static void  | operator delete (void *, void *)
 static void  | operator delete[] (void *)
_
 static void  | operator delete[] (void *, const char *, int)
 static void *  | operator new (size_t)
_
 static void *  | operator new (size_t, const char *, int)
 static void *  | operator new (size_t, void *p)
 static void *  | operator new[] (size_t)
_
 static void *  | operator new[] (size_t, const char *, int)
Detailed Description
_
Constructor & Destructor Documentation
◆ AcDbExtents() [1/3]
 UX_EXPORT_FUNCTION AcDbExtents::AcDbExtents  |  ( |   | )
Default constructor.
Initializes m_min to a very large value and m_max to a very small value. The object is in an invalid state.
◆ AcDbExtents() [2/3]
 UX_EXPORT_FUNCTION AcDbExtents::AcDbExtents  |  ( |  const AcGePoint3d &  |  minPoint,
|  const AcGePoint3d &  |  maxPoint
)
Constructor.
Sets m_min to minPoint and m_max to maxPoint, but only if minPoint.x<=maxPoint.x and minPoint.y<=maxPoint.y and minPoint.z<=maxPoint.z. If not, it behaves like the default constructor.
Parameters
[in] | minPoint | lower point of the extents (lower in all coordinates)
[in] | maxPoint | upper point of the extents
◆ AcDbExtents() [3/3]
 UX_EXPORT_FUNCTION AcDbExtents::AcDbExtents  |  ( |  const AcDbExtents &  |  source | )
Copy constructor.
Sets the values m_min and m_max to the same values as the corresponding points in src.
Parameters
[in] | source | Source to copy points from
Member Function Documentation
◆ addBlockExt()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbExtents::addBlockExt  |  ( |  AcDbBlockTableRecord *  |  pBlkTblRec | )
Adds extents of all non-deleted entities given in block table record.
Parameters
[in] | pBlkTblRec | pointer to Block Table Record
Returns
Acad::eOk if successful
◆ addExt()
 UX_EXPORT_FUNCTION void AcDbExtents::addExt  |  ( |  const AcDbExtents &  |  inputExt | )
Updates the extents of this Extents object with the specified Extents object, so that the extents inputExt is contained in the new computed extents.
Parameters
[in] | inputExt | extents to be additionally covered by this extents
◆ addPoint()
 UX_EXPORT_FUNCTION void AcDbExtents::addPoint  |  ( |  const AcGePoint3d &  |  point | )
Updates the extents of this Extents object with the specified point, so that point is contained in the new computed extents.
Parameters
[in] | point | point to be additionally covered by this extents
◆ expandBy()
 UX_EXPORT_FUNCTION void AcDbExtents::expandBy  |  ( |  const AcGeVector3d &  |  vector | )
Expand this box by the amount in the input vector.
Parameters
[in] | vector | - input vector
◆ maxPoint()
 UX_EXPORT_FUNCTION AcGePoint3d AcDbExtents::maxPoint  |  ( |   | ) |   const
Returns the maximum point as AcGePoint3d.
Returns
maximum point for this AcDbExtents
◆ minPoint()
 UX_EXPORT_FUNCTION AcGePoint3d AcDbExtents::minPoint  |  ( |   | ) |   const
Returns the minimum point as AcGePoint3d.
Returns
minimum point for this AcDbExtents
◆ operator==()
 UX_EXPORT_FUNCTION bool AcDbExtents::operator==  |  ( |  const AcDbExtents &  |  other | )
Equality operator, compares this AcDbExtents with the other AcDbExtents.
Parameters
[in] | other | AcDbExtents to compare with
Returns
true or false
◆ set()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbExtents::set  |  ( |  const AcGePoint3d &  |  minPoint,
|  const AcGePoint3d &  |  maxPoint
)
Sets m_min to minPoint and m_max to maxPoint, but only if minPoint.x<=maxPoint.x and minPoint.y<=maxPoint.y and minPoint.z<=maxPoint.z.
Parameters
[in] | minPoint | lower point of the extents (lower in all coordinates)
[in] | maxPoint | upper point of the extents
Returns
Acad::eInvalidInput, if one of the minPoint values is greater than the
 corresponding maxPoint value
 Acad::eOk, else
◆ transformBy()
 UX_EXPORT_FUNCTION void AcDbExtents::transformBy  |  ( |  const AcGeMatrix3d &  |  matrix | )
Transforms the extents limits.
Parameters
[in] | matrix | transformation matrix