Public Types | Public Member Functions | Public Attributes | List of all members
AcDbField Class Reference
_ More...
#include <AcDbField.h>
 Public Types
enum  | EvalContext {
 kOpen = 1 , kSave = 2 , kPlot = 4 , kEtransmit = 8 ,
 kRegen = 16 , kDemand = 32 , kPreview = 64 , kPlotPreview = 128
 }
enum  | EvalOption {
 kDisable = 0 , kOnOpen = 1 , kOnSave = 2 , kOnPlot = 4 ,
 kOnEtransmit = 8 , kOnRegen = 16 , kOnDemand = 32 , kAutomatic = 63
 }
enum  | EvalStatus {
 kNotYetEvaluated = 1 , kSuccess = 2 , kEvaluatorNotFound = 4 , kSyntaxError = 8 ,
 kInvalidCode = 16 , kInvalidContext = 32 , kOtherError = 64
 }
enum  | FieldCodeFlag {
 kFieldCode = 1 , kEvaluatedText = 2 , kEvaluatedChildren = 4 , kObjectReference = 8 ,
 kAddMarkers = 16 , kEscapeBackslash = 32 , kStripOptions = 64 , kPreserveFields = 128 ,
 kTextField = 256
 }
enum  | FilingOption { kSkipFilingResult = 1 }
enum  | State {
 kInitialized = 1 , kCompiled = 2 , kModified = 4 , kEvaluated = 8 ,
 kHasCache = 16
 }
 Public Types inherited from AcGiDrawable
enum  | DrawableType {
 kGeometry = 0 , kDistantLight , kPointLight , kSpotLight ,
 kAmbientLight , kSolidBackground , kGradientBackground , kImageBackground ,
 kGroundPlaneBackground , kViewport
 }
enum  | SetAttributesFlags {
 kDrawableNone = 0 , kDrawableIsAnEntity = 1 , kDrawableUsesNesting = 2 , kDrawableIsCompoundObject = 4 ,
 kDrawableViewIndependentViewportDraw = 8 , kDrawableIsInvisible = 16 , kDrawableHasAttributes = 32 , kDrawableRegenTypeDependentGeometry = 64 ,
 kDrawableIsDimension = 133 , kDrawableRegenDraw = 256 , kDrawableStandardDisplaySingleLOD = 512 , kDrawableShadedDisplaySingleLOD = 1024 ,
 kDrawableViewDependentViewportDraw = 2048 , kDrawableBlockDependentViewportDraw = 4096 , kDrawableIsExternalReference = 8192 , kDrawableNotPlottable = 16384 ,
 kDrawableNotAllowLCS = 32768 , kDrawableMergeControlOff = 65536 , kThreadedWorldDrawViewportDraw = 131072
 }
 Public Member Functions
AcDbField (const ACHAR *, bool=false)
int  | childCount () const
Counts the children for the current field. More...
 Acad::ErrorStatus  | convertToTextField ()
 AcValue::DataType  | dataType () const
virtual Acad::ErrorStatus  | dwgInFields (AcDbDwgFiler *)
virtual Acad::ErrorStatus  | dwgOutFields (AcDbDwgFiler *) const
virtual Acad::ErrorStatus  | dxfInFields (AcDbDxfFiler *)
virtual Acad::ErrorStatus  | dxfOutFields (AcDbDxfFiler *) const
Acad::ErrorStatus  | evaluate (int, AcDbDatabase *, int *=NULL, int *=NULL)
Evaluates the field. More...
EvalOption  | evaluationOption () const
Gets the evaluation option. More...
EvalStatus  | evaluationStatus (int *=NULL, ACHAR **=NULL) const
Gets the evaluation status. More...
const ACHAR *  | evaluatorId () const
Gets the evaluator. More...
 FilingOption  | filingOption () const
Acad::ErrorStatus  | getChild (int, AcDbField *&, AcDb::OpenMode)
Returns the child field specified by childIndex. More...
Acad::ErrorStatus  | getData (const ACHAR *, AcValue *) const
Gets data under the key pKey in pData from this field. More...
Acad::ErrorStatus  | getFieldCode (ACHAR *&, FieldCodeFlag, AcArray< AcDbField * > *=NULL, AcDb::OpenMode=AcDb::kForRead) const
Returns the field code for the current field object as a pointer to dynamically allocated string; the caller is responsible to release the returned string by acutDelString(). More...
const ACHAR *  | getFieldCode (FieldCodeFlag, AcArray< AcDbField * > *=NULL, AcDb::OpenMode=AcDb::kForRead) const
Returns the field code for the current field object as a pointer to a const char. More...
const ACHAR *  | getFormat () const
Gets the format string of this field. More...
 Acad::ErrorStatus  | getFormat (ACHAR *&) const
 Acad::ErrorStatus  | getHyperlink (ACHAR **, ACHAR **, ACHAR **, ACHAR **, long *) const
 Acad::ErrorStatus  | getHyperlink (AcHyperlink &) const
const ACHAR *  | getValue () const
Returns the formatted field value. More...
Acad::ErrorStatus  | getValue (AcFdFieldValue &) const
Gets the value of this field. More...
Acad::ErrorStatus  | getValue (ACHAR *&) const
Gets the value of this field. More...
Acad::ErrorStatus  | getValue (AcValue &) const
Gets the value of this field. More...
 bool  | hasHyperlink () const
 bool  | isTextField () const
Return true if this object is a text field or it has at least 1 child.
Acad::ErrorStatus  | postInDatabase (AcDbDatabase *)
Posts the field to the database pDb. More...
 Acad::ErrorStatus  | removeHyperlink ()
Acad::ErrorStatus  | setData (const ACHAR *, const AcValue *)
Sets data in pData under pKey to this field. More...
 Acad::ErrorStatus  | setData (const ACHAR *, const AcValue *, bool)
Acad::ErrorStatus  | setEvaluationOption (EvalOption)
Sets the evaluation option. More...
Acad::ErrorStatus  | setEvaluatorId (const ACHAR *)
Sets the evaluator id for this field. More...
Acad::ErrorStatus  | setFieldCode (const ACHAR *, FieldCodeFlag=(FieldCodeFlag) 0, AcDbFieldArray *=NULL)
This method sets the field code for the current field object. More...
 Acad::ErrorStatus  | setFilingOption (FilingOption)
Acad::ErrorStatus  | setFormat (const ACHAR *)
Sets the format string of this field. More...
 Acad::ErrorStatus  | setHyperlink (const ACHAR *, const ACHAR *, const ACHAR *, long)
 Acad::ErrorStatus  | setHyperlink (const ACHAR *, const ACHAR *, const ACHAR *=NULL)
 Acad::ErrorStatus  | setHyperlink (const AcHyperlink &)
 Acad::ErrorStatus  | setInObject (AcDbObject *, const ACHAR *)
State  | state () const
Gets the current field state. More...
virtual Acad::ErrorStatus  | subClose ()
~AcDbField ()
Destructor.
 Public Member Functions inherited from AcDbObject
virtual Acad::ErrorStatus  | addPersistentReactor (AcDbObjectId)
Adds a persistent reactor to this object reactor list. More...
Acad::ErrorStatus  | addReactor (AcDbObjectReactor *) const
Adds a transient reactor to this object. More...
virtual Acad::ErrorStatus  | applyPartialUndo (AcDbDwgFiler *, AcRxClass *)
This function is called during Undo operations on objects, that use the 'Partial Undo meachanism'; this is, this object is opened with assertWriteEnabled(Adesk::kFalse) to indicate that custom Undo filing is used rather than the default Undo filing. More...
 void  | assertNotifyEnabled () const
 void  | assertReadEnabled () const
 void  | assertWriteEnabled (Adesk::Boolean=Adesk::kTrue, Adesk::Boolean=Adesk::kTrue)
virtual Acad::ErrorStatus  | audit (AcDbAuditInfo *)
Performs the audit operation for this object. More...
Acad::ErrorStatus  | cancel ()
Reverts all changes since the object had been opened and closes the object. More...
virtual void  | cancelled (const AcDbObject *)
A handler function for persistent reactors. More...
virtual AcRxObject *  | clone () const
Creates a shallow clone of this object. More...
Acad::ErrorStatus  | close ()
Closes the object. More...
Acad::ErrorStatus  | closeAndPage (Adesk::Boolean=Adesk::kTrue)
Closes the object. More...
virtual Acad::ErrorStatus  | composeForLoad (AcDb::OdaSaveType, AcDb::AcDbDwgVersion)
This function is intended for future MT file loading support. More...
virtual void  | copied (const AcDbObject *, const AcDbObject *)
A handler function for persistent reactors. More...
virtual Acad::ErrorStatus  | copyFrom (const AcRxObject *)
Copies the pSrc object information in this object. More...
Acad::ErrorStatus  | createExtensionDictionary ()
Creates a dictionary as extension dictionary for this object. More...
AcDbDatabase *  | database () const
Returns the database that contains this object. More...
virtual Acad::ErrorStatus  | decomposeForSave (AcDb::AcDbDwgVersion, AcDbObject *&, AcDbObjectId &, Adesk::Boolean &)
This function is called during dwg and dxf output, to allow a custom object to decompose itself, due to provided dwg/dxf target file version. More...
virtual Acad::ErrorStatus  | deepClone (AcDbObject *, AcDbObject *&, AcDbIdMapping &, Adesk::Boolean=Adesk::kTrue) const final
Clones this object, appends it to the owner pOwner and adds an AcDbIdPair record to the idMap. More...
void  | disableUndoRecording (Adesk::Boolean)
Disables or enables the undo recording for the object. More...
Acad::ErrorStatus  | downgradeOpen ()
Sets the open mode for an object opened for write to be opened for read. More...
Acad::ErrorStatus  | downgradeToNotify (Adesk::Boolean)
Sets the open mode for an object opened for write to be opened for notify. More...
virtual AcGiDrawable *  | drawable ()
Retrieves the AcGiDrawable instance of this object. More...
Acad::ErrorStatus  | dwgIn (AcDbDwgFiler *)
Calls the object's dwgInFields function, and reads any XData if present. More...
virtual Acad::ErrorStatus  | dwgInFields (AcDbDwgFiler *)
Reads the object from the DWG filer. More...
Acad::ErrorStatus  | dwgOut (AcDbDwgFiler *) const
Calls the object's dwgOutFields function, and writes any XData if present. More...
virtual Acad::ErrorStatus  | dwgOutFields (AcDbDwgFiler *) const
Writes the object to the DWG filer. More...
Acad::ErrorStatus  | dxfIn (AcDbDxfFiler *)
Calls the object's dxfInFields function, and reads any XData if present. More...
virtual Acad::ErrorStatus  | dxfInFields (AcDbDxfFiler *)
Reads the object from the DXF filer. More...
Acad::ErrorStatus  | dxfOut (AcDbDxfFiler *, Adesk::Boolean, Adesk::uchar *) const
Calls the object's dxfOutFields function, and writes any XData if present. More...
virtual Acad::ErrorStatus  | dxfOutFields (AcDbDxfFiler *) const
Writes the object to the DXF filer. More...
Acad::ErrorStatus  | erase (Adesk::Boolean=Adesk::kTrue)
Sets the bit that indicates that the object is erased. More...
virtual void  | erased (const AcDbObject *, Adesk::Boolean)
A handler function for persistent reactors. More...
AcDbObjectId  | extensionDictionary () const
Returns the object id of the extension dictionary for this object. More...
void  | getAcDbHandle (AcDbHandle &) const
Returns handle of this object. More...
Acad::ErrorStatus  | getBinaryData (const ACHAR *, Adesk::Int32 &, char *&) const
Creates a copy of the binary data stored as chunks of maximum 127 bytes in the resbuf chain of this object's extension dictionary xrecord entry given by entryName. More...
int  | getBrxOpenCount () const
This function returns the number of open BRX instances for this object. More...
int  | getBrxOpenState () const
This function returns the BRX object open state flags as bitfields, for diagnostic purpose. More...
virtual Acad::ErrorStatus  | getClassID (CLSID *) const final
Gets the COM wrapper Class ID for this entity. More...
int  | getCustomObjectState () const
This function returns the custom object status : 1=isCustomObject 2=DifferentialUndoDisabled. More...
Acad::ErrorStatus  | getField (const ACHAR *, AcDbField *&, AcDb::OpenMode) const
Retrieves the specified Field from this object, and opens it in mode. More...
Acad::ErrorStatus  | getField (const ACHAR *, AcDbObjectId &) const
Gets the pszPropName field object from field dictionary of this AcDbObject object, using pszPropName as key. More...
AcDbObjectId  | getFieldDictionary () const
Returns the Field dictionary associated with this object,. More...
Acad::ErrorStatus  | getFieldDictionary (AcDbDictionary *&, AcDb::OpenMode) const
Gets and opens the field dictionary for this. More...
Acad::ErrorStatus  | getObjectBirthVersion (AcDb::AcDbDwgVersion &, AcDb::MaintenanceReleaseVersion &)
This function is currently not supported by the CAD engine, always returns Acad::eOk, and 'kDHL_CURRENT' + 'kMReleaseCurrent' results. More...
virtual Acad::ErrorStatus  | getObjectSaveVersion (const AcDbDwgFiler *, AcDb::AcDbDwgVersion &, AcDb::MaintenanceReleaseVersion &)
Returns the DWG version for saving the object. More...
virtual Acad::ErrorStatus  | getObjectSaveVersion (const AcDbDxfFiler *, AcDb::AcDbDwgVersion &, AcDb::MaintenanceReleaseVersion &)
Returns the DWG version for saving the object. More...
int  | getOdaOpenCount () const
This function returns the number of open ODA instances for this object. More...
int  | getOdaOpenState () const
This function returns the ODA object open state flags as bitfields, for diagnostic purpose. More...
virtual void  | goodbye (const AcDbObject *)
A handler function for persistent reactors. More...
Acad::ErrorStatus  | handOverTo (AcDbObject *, Adesk::Boolean=Adesk::kTrue, Adesk::Boolean=Adesk::kTrue)
Hands over objects identity to another object. More...
bool  | hasFields () const
Return true if this object has single or multiple fields associated with him. More...
bool  | hasPersistentReactor (AcDbObjectId) const
Checks the input objectId in this object reactor list. More...
bool  | hasSaveVersionOverride ()
This function indicates whether this object overrides the filer's save version. More...
virtual AcDbObjectId  | id () const
Returns the database id of this object. More...
Adesk::Boolean  | isAcDbObjectIdsInFlux () const
Checks whether a deep clone operation was completed. More...
Adesk::Boolean  | isAProxy () const
Adesk::Boolean  | isCancelling () const
Adesk::Boolean  | isErased () const
Returns whether this object is erased. More...
Adesk::Boolean  | isEraseStatusToggled () const
Checks whether the object erase status has been toggled. More...
Adesk::Boolean  | isModified () const
Returns whether this object's assertWriteEnabled() has been called since it was opened. More...
Adesk::Boolean  | isModifiedGraphics () const
Checks whether this object graphics will be updated when the object is closed. More...
Adesk::Boolean  | isModifiedXData () const
Checks whether this object's xData was modified. More...
Adesk::Boolean  | isNewObject () const
Returns true if and only if this object has not been closed since it was created. More...
Adesk::Boolean  | isNotifyEnabled () const
Returns whether this object is opened for notify. More...
Adesk::Boolean  | isNotifying () const
virtual Adesk::Boolean  | isPersistent () const
Returns the 'persistent' status of a database object. More...
Adesk::Boolean  | isReadEnabled () const
Returns whether this object is opened for read. More...
 Adesk::Boolean  | isReallyClosing () const
Checks whether the next close call will completely close this object return true if on the next call the object will be completely closed false otherwise.
Adesk::Boolean  | isTransactionResident () const
Gets the object transaction status. More...
Adesk::Boolean  | isUndoing () const
bool  | isUndoRecordingDisabled () const
Returns whether the undo recording for the object is enabled or not. More...
Adesk::Boolean  | isWriteEnabled () const
Returns whether this object is opened for write. More...
virtual AcDb::DuplicateRecordCloning  | mergeStyle () const
Returns the object's merge behavior during cloning. More...
virtual void  | modified (const AcDbObject *)
A handler function for persistent reactors. More...
virtual void  | modifiedGraphics (const AcDbEntity *)
A handler function for persistent reactors. More...
virtual void  | modifiedXData (const AcDbObject *)
A handler function for persistent reactors. More...
virtual void  | modifyUndone (const AcDbObject *)
A handler function for persistent reactors. More...
virtual void  | objectClosed (const AcDbObjectId)
A handler function for persistent reactors. More...
AcDbObjectId  | objectId () const
Returns object id. More...
virtual void  | openedForModify (const AcDbObject *)
A handler function for persistent reactors. More...
AcDbObjectId  | ownerId () const
Returns object id of the owner. More...
AcDbVoidPtrArray *  | reactors ()
Gets the object pointers to reactors. More...
const AcDbVoidPtrArray *  | reactors () const
Gets the object pointers to reactors. More...
virtual void  | reappended (const AcDbObject *)
A handler function for persistent reactors. More...
 virtual void  | recvPropagateModify (const AcDbObject *)
Not implemented yet.
Acad::ErrorStatus  | releaseExtensionDictionary ()
Removes the extension dictionary associated with this object. More...
virtual Acad::ErrorStatus  | removeField (AcDbObjectId)
Removes the Field specified by acFieldId from this object. More...
virtual Acad::ErrorStatus  | removeField (const ACHAR *)
Removes the Field specified by szKeyString from this object. More...
virtual Acad::ErrorStatus  | removeField (const ACHAR *, AcDbObjectId &)
Removes the Field specified by acPszKeyString from this object, and returns its ObjectId value. More...
virtual Acad::ErrorStatus  | removePersistentReactor (AcDbObjectId)
Removes a persistent reactor from this object reactor list. More...
Acad::ErrorStatus  | removeReactor (AcDbObjectReactor *) const
Removes a transient reactor to this object. More...
void  | setAcDbObjectIdsInFlux ()
Call this function to indicate that the object IDs of this object and its sub-objects (if any) are not yet valid. More...
Acad::ErrorStatus  | setBinaryData (const ACHAR *, Adesk::Int32, const char *)
Creates a copy of the binary data, divides it in up to 127 bytes binary chunks and
 sets them as resbufs in the resbuf chain of this object's extension dictionary xrecord entry given by entryName. More...
virtual Acad::ErrorStatus  | setField (const ACHAR *, AcDbField *, AcDbObjectId &)
Adds the pAcField field object to field dictionary of this AcDbObject object, using pKey as key. More...
void  | setHasSaveVersionOverride (bool)
This function can be called to specify that the object has a "save version override". More...
virtual Acad::ErrorStatus  | setOwnerId (AcDbObjectId)
Sets the ownerId data member of the object to be objId. More...
virtual Acad::ErrorStatus  | setXData (const resbuf *)
Sets/removes xData associated with this object. More...
virtual Acad::ErrorStatus  | subCancel ()
Possibility to veto a cancel operation from within custom entities. More...
virtual Acad::ErrorStatus  | subClose ()
virtual Acad::ErrorStatus  | subErase (Adesk::Boolean)
This hook is called during an AcDbObject::erase call, before any actual erase operation is performed. More...
 virtual Acad::ErrorStatus  | subHandOverTo (AcDbObject *)
virtual void  | subObjModified (const AcDbObject *, const AcDbObject *)
A handler function for persistent reactors. More...
 virtual Acad::ErrorStatus  | subOpen (AcDb::OpenMode)
virtual Acad::ErrorStatus  | subSwapIdWith (AcDbObjectId, Adesk::Boolean=Adesk::kFalse, Adesk::Boolean=Adesk::kFalse)
This hook is called during an AcDbObject::swapIdWith() call, before any actual swap operation is performed. More...
Acad::ErrorStatus  | swapIdWith (AcDbObjectId, Adesk::Boolean=Adesk::kFalse, Adesk::Boolean=Adesk::kFalse)
Swaps the object id's between the object identified by param swapId and this object. More...
virtual Acad::ErrorStatus  | swapReferences (const AcDbIdMapping &)
Not implemented yet. More...
virtual void  | unappended (const AcDbObject *)
A handler function for persistent reactors. More...
AcDbDwgFiler *  | undoFiler ()
Gets the undo filer for this object. More...
Acad::ErrorStatus  | upgradeFromNotify (Adesk::Boolean &)
Upgrades the open status of this object to AcDb::kForWrite, if this object is already open (either in AcDb::kForRead, AcDb::kForNotify or AcDb::kForWrite) More...
Acad::ErrorStatus  | upgradeOpen ()
Changes the objects open mode to AcDb::kForWrite and sends notifications. More...
virtual Acad::ErrorStatus  | wblockClone (AcRxObject *, AcDbObject *&, AcDbIdMapping &, Adesk::Boolean=Adesk::kTrue) const final
Clones this object, appends it to the owner pOwner and adds an AcDbIdPair record to the idMap. More...
virtual resbuf *  | xData (const ACHAR *=NULL) const
Returns the xData associated with this object. More...
Acad::ErrorStatus  | xDataTransformBy (const AcGeMatrix3d &)
Transforms the extended data according to parameter transformation matrix. More...
 virtual void  | xmitPropagateModify () const
Not implemented yet.
 virtual  | ~AcDbObject ()
Destructor.
 Public Member Functions inherited from AcGiDrawable
virtual bool  | bounds (AcDbExtents &) const
virtual DrawableType  | drawableType () const
 virtual AcGiDrawStream *  | drawStream () const
 AcGsNode *  | gsNode () const
virtual AcDbObjectId  | id () const =0
virtual Adesk::Boolean  | isPersistent () const =0
virtual Adesk::UInt32  | regenSupportFlags () const final
Returns whether and to which level this object supports MultiThreading. More...
 virtual Adesk::Boolean  | RolloverHit (Adesk::ULongPtr, Adesk::ULongPtr, Adesk::Boolean)
 virtual Adesk::UInt32  | setAttributes (AcGiDrawableTraits *) final
 virtual void  | setDrawStream (AcGiDrawStream *)
 void  | setGsNode (AcGsNode *)
 virtual void  | viewportDraw (AcGiViewportDraw *) final
 virtual Adesk::UInt32  | viewportDrawLogicalFlags (AcGiViewportDraw *) final
 virtual Adesk::Boolean  | worldDraw (AcGiWorldDraw *) final
 Public Member Functions inherited from AcRxObject
virtual AcRxObject *  | clone () const
Exported and implemented. More...
 virtual AcRx::Ordering  | comparedTo (const AcRxObject *) const
Exported and implemented.
virtual Acad::ErrorStatus  | copyFrom (const AcRxObject *)
Exported and implemented. More...
 virtual AcRxClass *  | isA () const
Exported and implemented.
virtual Adesk::Boolean  | isEqualTo (const AcRxObject *) const
Exported and implemented. More...
bool  | isKindOf (const AcRxClass *) const
Checks the object class. More...
AcRxObject *  | queryX (const AcRxClass *) const
returns the protocol extension object assigned to this class or a parent class. More...
AcRxObject *  | x (const AcRxClass *) const
returns the protocol extension object assigned to this class or a parent class. More...
 virtual  | ~AcRxObject ()
Destructor.
 Public Attributes
AcDbField
Default constructor. More...
 Additional Inherited Members
 Static Public Member Functions inherited from AcRxObject
 static AcRxObject *  | cast (const AcRxObject *)
 static AcRxClass *  | desc ()
Exported and implemented.
 Static Public Member Functions inherited from AcHeapOperators
 static void  | operator delete (void *)
_
 static void  | operator delete (void *, const char *, int)
 static void  | operator delete (void *, void *)
 static void  | operator delete[] (void *)
_
 static void  | operator delete[] (void *, const char *, int)
 static void *  | operator new (size_t)
_
 static void *  | operator new (size_t, const char *, int)
 static void *  | operator new (size_t, void *p)
 static void *  | operator new[] (size_t)
_
 static void *  | operator new[] (size_t, const char *, int)
 Protected Member Functions inherited from AcDbObject
virtual Acad::ErrorStatus  | subDeepClone (AcDbObject *, AcDbObject *&, AcDbIdMapping &, Adesk::Boolean=true) const
virtual Acad::ErrorStatus  | subGetClassID (CLSID *) const
virtual Adesk::UInt32  | subSetAttributes (AcGiDrawableTraits *)
Sets the values of this object's subentity traits and returns with the calling object's subentity traits. More...
virtual void  | subViewportDraw (AcGiViewportDraw *)
virtual Adesk::UInt32  | subViewportDrawLogicalFlags (AcGiViewportDraw *)
virtual Acad::ErrorStatus  | subWblockClone (AcRxObject *, AcDbObject *&, AcDbIdMapping &, Adesk::Boolean=true) const
virtual Adesk::Boolean  | subWorldDraw (AcGiWorldDraw *)
 Protected Member Functions inherited from AcGiDrawable
virtual Adesk::UInt32  | subRegenSupportFlags () const
Returns whether and to which level this object supports MultiThreading. More...
virtual Adesk::UInt32  | subSetAttributes (AcGiDrawableTraits *)=0
virtual void  | subViewportDraw (AcGiViewportDraw *)=0
 virtual Adesk::UInt32  | subViewportDrawLogicalFlags (AcGiViewportDraw *)
virtual Adesk::Boolean  | subWorldDraw (AcGiWorldDraw *)=0
 Protected Member Functions inherited from AcRxObject
AcRxObject ()
Exported and implemented.
Detailed Description
_
Member Function Documentation
◆ childCount()
 UX_EXPORT_FUNCTION int AcDbField::childCount  |  ( |   | ) |   const
Counts the children for the current field.
Returns
the number of children for the current field object
◆ dwgInFields()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbField::dwgInFields  |  ( |  AcDbDwgFiler *  |  dwgFiler | )
virtual
See also
AcDbObject::dwgInFields(AcDbDwgFiler*)
Reimplemented from AcDbObject.
◆ dwgOutFields()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbField::dwgOutFields  |  ( |  AcDbDwgFiler *  |  dwgFiler | ) |   const
virtual
See also
AcDbObject::dwgOutFields(AcDbDwgFiler*)
Reimplemented from AcDbObject.
◆ dxfInFields()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbField::dxfInFields  |  ( |  AcDbDxfFiler *  |  dxfFiler | )
virtual
See also
AcDbObject::dxfInFields(AcDbDxfFiler*)
Reimplemented from AcDbObject.
◆ dxfOutFields()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbField::dxfOutFields  |  ( |  AcDbDxfFiler *  |  dxfFiler | ) |   const
virtual
See also
AcDbObject::dxfOutFields(AcDbDxfFiler*)
Reimplemented from AcDbObject.
◆ evaluate()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbField::evaluate  |  ( |  int  |  context,
|  AcDbDatabase *  |  pDb,
|  int *  |  pNums = NULL,
|  int *  |  pNumsEval = NULL
)
Evaluates the field.
Parameters
[in] | context | context in which the field is evaluated. This can be user defined or one of the predefined AcDbField::EvalContext flags
[in] | pDb | database to use for evaluation. If pDb is NULL, the fields database is used.
[out] | pNums | receives the number of found fields. Can be NULL.
[out] | pNumsEval | receives the number of evaluated fields. Can be NULL.
Returns
Acad::eOk if successful, appropriate error code on failure
◆ evaluationOption()
 UX_EXPORT_FUNCTION AcDbField::EvalOption AcDbField::evaluationOption  |  ( |   | ) |   const
Gets the evaluation option.
Returns
Evaluation option of this field
◆ evaluationStatus()
 UX_EXPORT_FUNCTION AcDbField::EvalStatus AcDbField::evaluationStatus  |  ( |  int *  |  pErrCode = NULL,
|  ACHAR **  |  pErrMsg = NULL
) |   |  const
Gets the evaluation status.
Returns
Evaluation status of this field
◆ evaluatorId()
 UX_EXPORT_FUNCTION const ACHAR * AcDbField::evaluatorId  |  ( |   | ) |   const
Gets the evaluator.
Returns
Evaluator name
◆ getChild()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbField::getChild  |  ( |  int  |  childIndex,
|  AcDbField *&  |  pChildField,
|  AcDb::OpenMode  |  openMode
)
Returns the child field specified by childIndex.
Parameters
[in] | childIndex | 0 based index indicating the child field to be retrieved
[out] | pChildField | output reference to the child field indicated by childIndex
[in] | openMode | input mode to open the child field object
Returns
Acad::eOk if successful, eInvalidInput otherwise
◆ getData()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbField::getData  |  ( |  const ACHAR *  |  pKey,
|  AcValue *  |  pData
) |   |  const
Gets data under the key pKey in pData from this field.
Parameters
[in] | pKey | name under which the data is stored
[out] | pData | retrieved data
Returns
Acad::eOk if successful, appropriate error code on failure
◆ getFieldCode() [1/2]
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbField::getFieldCode  |  ( |  ACHAR *&  |  fieldCodeString,
|  FieldCodeFlag  |  fieldFlags,
|  AcArray< AcDbField * > *  |  childFields = NULL,
|  AcDb::OpenMode  |  childsOpenMode = AcDb::kForRead
) |   |  const
Returns the field code for the current field object as a pointer to dynamically allocated string; the caller is responsible to release the returned string by acutDelString().
Parameters
[out] | fieldCodeString | - input flag of type AcDbField::FieldCodeFlag
[in] | fieldFlags | - input flag of type AcDbField::FieldCodeFlag
[out] | childFields | - output pointer to an array containing child fields, can be NULL
[in] | childsOpenMode | - input mode to open the child fields
Returns
Acad::eOk if successfull, error code otherwise
◆ getFieldCode() [2/2]
 UX_EXPORT_FUNCTION const ACHAR * AcDbField::getFieldCode  |  ( |  AcDbField::FieldCodeFlag  |  fieldFlag,
|  AcArray< AcDbField * > *  |  pChildren = NULL,
|  AcDb::OpenMode  |  openMode = AcDb::kForRead
) |   |  const
Returns the field code for the current field object as a pointer to a const char.
Parameters
[in] | fieldFlag | input flag of type AcDbField::FieldCodeFlag
[out] | pChildren | output pointer to an array containing child fields
[in] | openMode | input mode to open the child fields
Returns
the pointer to string that is the field code
◆ getFormat()
 UX_EXPORT_FUNCTION const ACHAR * AcDbField::getFormat  |  ( |   | ) |   const
Gets the format string of this field.
Returns
format string
◆ getValue() [1/4]
 UX_EXPORT_FUNCTION const ACHAR * AcDbField::getValue  |  ( |   | ) |   const
Returns the formatted field value.
Returns
field value as string
◆ getValue() [2/4]
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbField::getValue  |  ( |  AcFdFieldValue &  |  val | ) |   const
Gets the value of this field.
Parameters
[out] | val | field value
Returns
Acad::eOk if successful, appropriate error code on failure
◆ getValue() [3/4]
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbField::getValue  |  ( |  ACHAR *&  |  val | ) |   const
Gets the value of this field.
Parameters
[out] | val | field value as string
Returns
Acad::eOk if successful, appropriate error code on failure
◆ getValue() [4/4]
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbField::getValue  |  ( |  AcValue &  |  val | ) |   const
Gets the value of this field.
Parameters
[out] | val | field value
Returns
Acad::eOk if successful, appropriate error code on failure
◆ postInDatabase()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbField::postInDatabase  |  ( |  AcDbDatabase *  |  pDb | )
Posts the field to the database pDb.
Until the field has no owner, it will not be saved with the database, even if added to it with this function.
Parameters
[in] | pDb | Database to post the field to.
Returns
Acad::eOk if successful, appropriate error code on failure
◆ setData()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbField::setData  |  ( |  const ACHAR *  |  pKey,
|  const AcValue *  |  pData
)
Sets data in pData under pKey to this field.
Parameters
[in] | pKey | name under which to store the data
[in] | pData | data to set
Returns
Acad::eOk if successful, appropriate error code on failure
◆ setEvaluationOption()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbField::setEvaluationOption  |  ( |  AcDbField::EvalOption  |  eo | )
Sets the evaluation option.
Parameters
[in] | eo | evaluation option to set
Returns
Acad::eOk if successful, appropriate error code on failure
◆ setEvaluatorId()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbField::setEvaluatorId  |  ( |  const ACHAR *  |  id | )
Sets the evaluator id for this field.
Returns
Acad::eOk if successful, appropriate error code on failure
◆ setFieldCode()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbField::setFieldCode  |  ( |  const ACHAR *  |  pFieldCode,
|  AcDbField::FieldCodeFlag  |  fieldCodeFlag = (FieldCodeFlag) 0,
|  AcDbFieldArray *  |  pChildren = NULL
)
This method sets the field code for the current field object.
Parameters
[in] | pFieldCode | input field code
[in] | fieldCodeFlag | input flag of type AcDbField::FieldCodeFlag
[in] | pChildren | input pointer to an array of fields that will be added as children to the current field
Returns
Acad::eOk if successful, error status otherwise
◆ setFormat()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbField::setFormat  |  ( |  const ACHAR *  |  format | )
Sets the format string of this field.
Parameters
[in] | format | format string
Returns
Acad::eOk if successful, appropriate error code on failure
◆ state()
 UX_EXPORT_FUNCTION AcDbField::State AcDbField::state  |  ( |   | ) |   const
Gets the current field state.
Returns
field state flags
◆ subClose()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbField::subClose  |  ( |   | )
virtual
See also
AcDbObject::subClose()
Reimplemented from AcDbObject.
Member Data Documentation
◆ AcDbField
 UX_EXPORT_FUNCTION AcDbField::AcDbField
Default constructor.
Parametrized constructor.
Parameters
[in] | fieldCode | represent the field code to set
[in] | isTextField | represent boolean value to set as text field or not