Public Member Functions | Public Attributes | List of all members
AcDbEdgeRef Class Reference
_ More...
#include <AcDbEdgeRef.h>
 Public Member Functions
AcDbEdgeRef (const AcDbCompoundObjectId &, const AcDbSubentId &=kNullSubentId, const AcDbSubentId &=kNullSubentId, const AcGeCurve3d *=NULL)
AcDbEdgeRef (const AcDbEdgeRef &)
AcDbEdgeRef (const AcDbEntity *)
AcDbEdgeRef (const AcDbFullSubentPath &)
AcDbEdgeRef (const AcGeCurve3d *)
virtual Acad::ErrorStatus  | copyFrom (const AcRxObject *)
Initializes this reference using a given object. More...
virtual AcDbEntity *  | createEntity () const
Creates an entity using the edge reference. More...
const AcGeCurve3d *  | curve () const
Returns the AcDbEdgeRef three-dimensional curve. More...
virtual Acad::ErrorStatus  | evaluateAndCacheGeometry ()
Evaluates and caches the geometry. More...
virtual Acad::ErrorStatus  | evaluateCurve (AcGeCurve3d *&) const
Evaluates the curve. More...
AcDbSubentId  | faceSubentId () const
Returns the face subentity Id. More...
virtual bool  | isEmpty () const
Returns boolean value indicating if the AcDbEdgeRef is empty. More...
virtual bool  | isValid () const
Returns boolean value indicating if the AcDbEdgeRef is valid. More...
 AcDbEdgeRef &  | operator= (const AcDbEdgeRef &)
virtual void  | reset ()
Resets this edge reference. More...
void  | setFaceSubentity (const AcDbSubentId &)
The subent ID of a face subentity can be used as the edge reference. More...
 Public Member Functions inherited from AcDbSubentRef
AcDbSubentRef (const AcDbCompoundObjectId &, const AcDbSubentId &=kNullSubentId)
virtual Acad::ErrorStatus  | copyFrom (const AcRxObject *)
Initializes this reference using a given object. More...
virtual AcDbEntity *  | createEntity () const
Creates an entity using this subent reference. More...
virtual const AcDbCompoundObjectId &  | entity () const
Returns an object ID of the compounded entity. More...
virtual Acad::ErrorStatus  | evaluateAndCacheGeometry ()
Evaluates and caches the geometry. More...
virtual bool  | isEmpty () const
Returns boolean value indicating if the AcDbSubentRef is empty. More...
virtual bool  | isValid () const
Returns boolean value indicating if the AcDbSubentRef is valid. More...
AcDbSubentRef &  | operator= (const AcDbSubentRef &)
Creates AcDbSubentRef using other AcDbSubentRef. More...
virtual void  | reset ()
Resets this subent reference. More...
virtual AcDbSubentId  | subentId () const
Returns an subent ID. More...
virtual AcDbEntity *  | createEntity () const =0
virtual Acad::ErrorStatus  | evaluateAndCacheGeometry ()=0
virtual bool  | isEmpty () const =0
virtual bool  | isValid () const =0
virtual void  | reset ()=0
 Public Member Functions inherited from AcRxObject
virtual AcRxObject *  | clone () const
Exported and implemented. More...
 virtual AcRx::Ordering  | comparedTo (const AcRxObject *) const
Exported and implemented.
virtual Acad::ErrorStatus  | copyFrom (const AcRxObject *)
Exported and implemented. More...
 virtual AcRxClass *  | isA () const
Exported and implemented.
virtual Adesk::Boolean  | isEqualTo (const AcRxObject *) const
Exported and implemented. More...
bool  | isKindOf (const AcRxClass *) const
Checks the object class. More...
AcRxObject *  | queryX (const AcRxClass *) const
returns the protocol extension object assigned to this class or a parent class. More...
AcRxObject *  | x (const AcRxClass *) const
returns the protocol extension object assigned to this class or a parent class. More...
 virtual  | ~AcRxObject ()
Destructor.
 Public Attributes
AcDbEdgeRef
Default constructor. More...
 Public Attributes inherited from AcDbSubentRef
AcDbSubentRef
Default constructor. More...
 Additional Inherited Members
 Static Public Member Functions inherited from AcRxObject
 static AcRxObject *  | cast (const AcRxObject *)
 static AcRxClass *  | desc ()
Exported and implemented.
 Protected Member Functions inherited from AcDbSubentRef
void  | setEntity (const AcDbCompoundObjectId &)
Sets the compounded entity using an object ID. More...
void  | setFromSubentPath (const AcDbFullSubentPath &)
Sets the AcDbCompoundObjectId and AcDbSubentId parameters of this entity from AcDbFullSubentPath. More...
void  | setSubent (const AcDbSubentId &)
Sets an subent ID. More...
 Protected Member Functions inherited from AcRxObject
AcRxObject ()
Exported and implemented.
Detailed Description
_
Member Function Documentation
◆ copyFrom()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbEdgeRef::copyFrom  |  ( |  const AcRxObject *  |  pAcSource | )
virtual
Initializes this reference using a given object.
Parameters
[in] | pAcSource | - edge reference that will be copied.
Returns
Acad::eOk for success, error status otherwise
Reimplemented from AcDbSubentRef.
◆ createEntity()
 UX_EXPORT_FUNCTION AcDbEntity * AcDbEdgeRef::createEntity  |  ( |   | ) |   const
virtual
Creates an entity using the edge reference.
Returns
created entity.
Reimplemented from AcDbSubentRef.
◆ curve()
 UX_EXPORT_FUNCTION const AcGeCurve3d * AcDbEdgeRef::curve  |  ( |   | ) |   const
Returns the AcDbEdgeRef three-dimensional curve.
Returns
AcGeCurve3d enitity.
◆ evaluateAndCacheGeometry()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbEdgeRef::evaluateAndCacheGeometry  |  ( |   | )
virtual
Evaluates and caches the geometry.
Returns
Acad::eOk for success, error status otherwise
Reimplemented from AcDbSubentRef.
◆ evaluateCurve()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbEdgeRef::evaluateCurve  |  ( |  AcGeCurve3d *&  |  curve | ) |   const
virtual
Evaluates the curve.
Parameters
[out] | curve | - evaluated curve
Returns
Acad::eOk for success, error status otherwise
◆ faceSubentId()
 UX_EXPORT_FUNCTION AcDbSubentId AcDbEdgeRef::faceSubentId  |  ( |   | ) |   const
Returns the face subentity Id.
Returns
an AcDbSubentId entity.
◆ isEmpty()
 UX_EXPORT_FUNCTION bool AcDbEdgeRef::isEmpty  |  ( |   | ) |   const
virtual
Returns boolean value indicating if the AcDbEdgeRef is empty.
Returns
true if empty, false otherwise
Reimplemented from AcDbSubentRef.
◆ isValid()
 UX_EXPORT_FUNCTION bool AcDbEdgeRef::isValid  |  ( |   | ) |   const
virtual
Returns boolean value indicating if the AcDbEdgeRef is valid.
Returns
true if empty, false otherwise
Reimplemented from AcDbSubentRef.
◆ reset()
 UX_EXPORT_FUNCTION void AcDbEdgeRef::reset  |  ( |   | )
virtual
Resets this edge reference.
Reimplemented from AcDbSubentRef.
◆ setFaceSubentity()
 UX_EXPORT_FUNCTION void AcDbEdgeRef::setFaceSubentity  |  ( |  const AcDbSubentId &  |  faceId | )
The subent ID of a face subentity can be used as the edge reference.
The face entity is used to restrict the referenced edge subentity.
Parameters
[in] | faceId | - input AcDbSubentId face subentity id reference.
Returns
an AcDbSubentId entity.
Member Data Documentation
◆ AcDbEdgeRef
 UX_EXPORT_FUNCTION AcDbEdgeRef::AcDbEdgeRef
Default constructor.
Parameter constructor.
param[in] source - AcDbEdgeRef reference that will be copied.
param[in] compoundId - AcDbCompoundObjectId reference that will be copied. param[in] edgeId - AcDbSubentId edge subentity reference that will be copied. param[in] faceId - AcDbSubentId face subentity reference that will be copied. param[in] pGeCurve - AcGeCurve3d curve geometry pointer that will be copied.
param[in] pGeCurve - AcGeCurve3d curve geometry pointer that will be copied.
param[in] pInputEnt - AcDbEntity enitity pointer that will be copied.
param[in] subEntPath - AcDbFullSubentPath reference that will be copied.