Public Types | Public Member Functions | Public Attributes | Protected Member Functions | List of all members
AcDbSection Class Reference
_ More...
#include <AcDbSection.h>
 Public Types
enum  | Height { kHeightAboveSectionLine = 1 , kHeightBelowSectionLine }
enum  | State { kPlane = 1 , kBoundary = 2 , kVolume = 4 }
enum  | SubItem {
 kNone = 0 , kSectionLine = 1 , kSectionLineTop = 2 , kSectionLineBottom = 4 ,
 kBackLine = 8 , kBackLineTop = 16 , kBackLineBottom = 32 , kVerticalLineTop = 64 ,
 kVerticalLineBottom = 128
 }
 Public Types inherited from AcDbEntity
enum  | VisualStyleType { kFullVisualStyle = 0 , kFaceVisualStyle = 1 , kEdgeVisualStyle = 2 }
 Public Types inherited from AcGiDrawable
enum  | DrawableType {
 kGeometry = 0 , kDistantLight , kPointLight , kSpotLight ,
 kAmbientLight , kSolidBackground , kGradientBackground , kImageBackground ,
 kGroundPlaneBackground , kViewport
 }
enum  | SetAttributesFlags {
 kDrawableNone = 0 , kDrawableIsAnEntity = 1 , kDrawableUsesNesting = 2 , kDrawableIsCompoundObject = 4 ,
 kDrawableViewIndependentViewportDraw = 8 , kDrawableIsInvisible = 16 , kDrawableHasAttributes = 32 , kDrawableRegenTypeDependentGeometry = 64 ,
 kDrawableIsDimension = 133 , kDrawableRegenDraw = 256 , kDrawableStandardDisplaySingleLOD = 512 , kDrawableShadedDisplaySingleLOD = 1024 ,
 kDrawableViewDependentViewportDraw = 2048 , kDrawableBlockDependentViewportDraw = 4096 , kDrawableIsExternalReference = 8192 , kDrawableNotPlottable = 16384 ,
 kDrawableNotAllowLCS = 32768 , kDrawableMergeControlOff = 65536 , kThreadedWorldDrawViewportDraw = 131072
 }
 Public Member Functions
AcDbSection (const AcGePoint3dArray &, const AcGeVector3d &)
AcDbSection (const AcGePoint3dArray &, const AcGeVector3d &, const AcGeVector3d &)
Acad::ErrorStatus  | addVertex (int, const AcGePoint3d &)
Inserts (or adds) the specified vertex at the given index; if index is less than zero, or higher than the number of actual vertices, then the vertex is added at the end of the verices array. More...
double  | bottomPlane () const
Returns the bottom plane distance. More...
Acad::ErrorStatus  | createJog (const AcGePoint3d &)
Creates a section plane jog at the position specified by @jogPoint. More...
virtual Acad::ErrorStatus  | dwgInFields (AcDbDwgFiler *)
virtual Acad::ErrorStatus  | dwgOutFields (AcDbDwgFiler *) const
virtual Acad::ErrorStatus  | dxfInFields (AcDbDxfFiler *)
virtual Acad::ErrorStatus  | dxfOutFields (AcDbDxfFiler *) const
double  | elevation () const
Returns the elevation of this AcDbSectionentity. More...
Acad::ErrorStatus  | enableLiveSection (bool)
Enables or diables the "Live Section" status for this AcDbSection entity. More...
Acad::ErrorStatus  | generateSectionGeometry (AcDbEntity *, AcArray< AcDbEntity * > &, AcArray< AcDbEntity * > &, AcArray< AcDbEntity * > &, AcArray< AcDbEntity * > &, AcArray< AcDbEntity * > &) const
Creates the section entities when sectioning the specified input entity. More...
Acad::ErrorStatus  | generateSectionGeometry (const AcArray< AcDbEntity * > &, AcArray< AcDbEntity * > &, AcArray< AcDbEntity * > &, AcArray< AcDbEntity * > &, AcArray< AcDbEntity * > &, AcArray< AcDbEntity * > &) const
Creates the section entities when sectioning the specified set of input entiies. More...
 Acad::ErrorStatus  | generateSectionGeometry (const AcDbVoidPtrArray &, const AcDbIntArray &, const AcArray< AcGeMatrix3d > &, const AcArray< AcRxClass * > &, AcArray< AcDbEntity * > &, AcArray< AcDbEntity * > &, AcArray< AcDbEntity * > &, AcArray< AcDbEntity * > &, AcArray< AcDbEntity * > &, AcDbSectionGeometryMap *=NULL) const
const ACHAR *  | getName () const
Returns the name of this AcDbSection entity. More...
Acad::ErrorStatus  | getName (ACHAR *&) const
Returns the name of this AcDbSection entity. More...
Acad::ErrorStatus  | getName (AcString &) const
Returns the name of this AcDbSection entity. More...
AcDbObjectId  | getSettings () const
Returns the ObjectId of the settings object for this section. More...
Acad::ErrorStatus  | getSettings (AcDbSectionSettings *&, AcDb::OpenMode) const
Returns the opened settings object for this section. More...
Acad::ErrorStatus  | getVertex (int, AcGePoint3d &) const
Returns the position at the specified index. More...
Acad::ErrorStatus  | getVertices (AcGePoint3dArray &) const
Returns the array of vertices. More...
bool  | hasJogs () const
Verifies whether this section plane uses one or more jogs. More...
double  | height (Height) const
Returns the section's height value for specified height type. More...
 bool  | hitTest (const AcGePoint3d &, int *, AcGePoint3d *, SubItem *) const
AcCmColor  | indicatorFillColor () const
Returns the indicator fill color for this section. More...
int  | indicatorTransparency () const
Returns the indicator transparency percentage for this section. More...
bool  | isLiveSectionEnabled () const
Verifies whether this AcDbSection entity is defined as a "Live Section". More...
bool  | isSlice () const
Returns whether this AcDbSection is defined as a slicing section (kBoundary, no jogs) More...
AcGeVector3d  | normal () const
Returns the normal vector for this AcDbSection entity. More...
int  | numVertices () const
Returns the number of actual vertices, used by this AcDbSectionentity. More...
Acad::ErrorStatus  | plane (AcGeVector3d &, AcGeVector3d &) const
Returns the section plane by its X/Y vectors, from first section segment. More...
Acad::ErrorStatus  | removeVertex (int)
Removes the specified vertex from the vertices array; @idx must be larger than 0 and less then the number of vertices. More...
double  | sectionPlaneOffset () const
Return the offset of the section plane at the first segment (distance between section plane to the parallel plane passing through the WCS origin). More...
Acad::ErrorStatus  | setBottomPlane (double)
Assigns the bottom plane distance. More...
Acad::ErrorStatus  | setElevation (double)
Assigns the elevation value for this AcDbSection entity. More...
Acad::ErrorStatus  | setHeight (Height, double)
Sets the sections' height value for the specified height type. More...
Acad::ErrorStatus  | setIndicatorFillColor (const AcCmColor &)
Sets the indicator fill color for this section. More...
Acad::ErrorStatus  | setIndicatorTransparency (int)
Sets the indicator transparency percentage for this section. More...
Acad::ErrorStatus  | setIsSlice (bool)
Defines this AcDbSection to be a slicing section (kBoundary, no jogs) More...
Acad::ErrorStatus  | setName (const ACHAR *)
Assigns the specified name to this AcDbSection entity. More...
Acad::ErrorStatus  | setSectionPlaneOffset (double)
Assigns the offset of the section plane at the first segment (distance between section plane to the parallel plane passing through the WCS origin). More...
Acad::ErrorStatus  | setState (State)
Sets this section's state. More...
Acad::ErrorStatus  | setThicknessDepth (double)
Assigns the thickness depth for this AcDbSection entity (valid for "slicing" [kBoundary] type). More...
Acad::ErrorStatus  | setTopPlane (double)
Assigns the top plane distance. More...
Acad::ErrorStatus  | setVertex (int, const AcGePoint3d &)
Specifies the position at the specified index. More...
Acad::ErrorStatus  | setVerticalDirection (const AcGeVector3d &)
Assigns the vertical direction for this section. More...
Acad::ErrorStatus  | setVertices (const AcGePoint3dArray &)
Assigns the entire array of vertices to this AcDbSection entity. More...
Acad::ErrorStatus  | setViewingDirection (const AcGeVector3d &)
Assigns the viewing direction for this section. More...
State  | state () const
Gets this section's state. More...
virtual Acad::ErrorStatus  | subClose ()
double  | thicknessDepth () const
Return the thickness depth for this AcDbSection entity (valid for "slicing" [kBoundary] type). More...
double  | topPlane () const
Returns the top plane distance. More...
AcGeVector3d  | verticalDirection () const
Returns the vertical direction for this section. More...
AcGeVector3d  | viewingDirection () const
Returns the viewing direction for this section. More...
~AcDbSection ()
Destructor.
 Public Member Functions inherited from AcDbEntity
 virtual Acad::ErrorStatus  | addSubentPaths (const AcDbFullSubentPathArray &) final
virtual Acad::ErrorStatus  | applyPartialUndo (AcDbDwgFiler *, AcRxClass *)
virtual Acad::ErrorStatus  | audit (AcDbAuditInfo *)
AcDbObjectId  | blockId () const
Returns the Object ID of the BlockTableRecord that owns this entity. More...
Acad::ErrorStatus  | boundingBoxIntersectWith (const AcDbEntity *, AcDb::Intersect, AcGePoint3dArray &, Adesk::GsMarker, Adesk::GsMarker) const
Finds the intersection between the edges of the bounding box for this entity and the pOhter entity. More...
Acad::ErrorStatus  | boundingBoxIntersectWith (const AcDbEntity *, AcDb::Intersect, const AcGePlane &, AcGePoint3dArray &, Adesk::GsMarker, Adesk::GsMarker) const
First, the function projects the other entity and the bounding box of this entity on plane specified by plane. More...
virtual bool  | bounds (AcDbExtents &) const
Returns the extents of this entity as AcDbExtents. More...
virtual bool  | castShadows () const
Checks if this entity is able to cast shadows. More...
virtual Adesk::Boolean  | cloneMeForDragging () final
Checks if a clone will be created for this entity in case of a drag operation. More...
 virtual AcDb::CollisionType  | collisionType () const
AcCmColor  | color () const
Returns the true color information of the entity. More...
Adesk::UInt16  | colorIndex () const
Returns the color number in a range from 0 to 256. More...
 virtual Acad::ErrorStatus  | deleteSubentPaths (const AcDbFullSubentPathArray &) final
virtual void  | dragStatus (const AcDb::DragStat)
Acad::ErrorStatus  | draw ()
Draws or redraws the entity on screen. More...
virtual AcGiDrawable *  | drawable ()
virtual Acad::ErrorStatus  | dwgInFields (AcDbDwgFiler *)
virtual Acad::ErrorStatus  | dwgOutFields (AcDbDwgFiler *) const
virtual Acad::ErrorStatus  | dxfInFields (AcDbDxfFiler *)
virtual Acad::ErrorStatus  | dxfOutFields (AcDbDxfFiler *) const
AcCmEntityColor  | entityColor () const
Returns the lightweight color information of the entity. More...
virtual Acad::ErrorStatus  | explode (AcDbVoidPtrArray &) const final
virtual Acad::ErrorStatus  | getCompoundObjectTransform (AcGeMatrix3d &) const final
It is used for object without geometry like AcDbMleader. More...
virtual void  | getEcs (AcGeMatrix3d &) const
Returns the transformation matrix from OCS (Object Coordinate System) to WCS (World Coordinate System). More...
virtual Acad::ErrorStatus  | getGeomExtents (AcDbExtents &) const final
Returns extents of this entity. More...
 virtual Acad::ErrorStatus  | getGripEntityUCS (const void *, AcGeVector3d &, AcGePoint3d &, AcGeVector3d &) const final
 virtual Acad::ErrorStatus  | getGripPoints (AcDbGripDataPtrArray &, const double, const int, const AcGeVector3d &, const int) const final
virtual Acad::ErrorStatus  | getGripPoints (AcGePoint3dArray &, AcDbIntArray &, AcDbIntArray &) const final
Append grip points to the specified array. More...
 virtual Acad::ErrorStatus  | getGripPointsAtSubentPath (const AcDbFullSubentPath &, AcDbGripDataPtrArray &, const double, const int, const AcGeVector3d &, const int) const final
virtual Acad::ErrorStatus  | getGsMarkersAtSubentPath (const AcDbFullSubentPath &, AcArray< Adesk::GsMarker > &) const final
virtual Acad::ErrorStatus  | getMaterialMapper (AcGiMapper &) const
virtual Acad::ErrorStatus  | getOsnapPoints (AcDb::OsnapMode, Adesk::GsMarker, const AcGePoint3d &, const AcGePoint3d &, const AcGeMatrix3d &, AcGePoint3dArray &, AcDbIntArray &) const final
Gets the entity osnap points. More...
virtual Acad::ErrorStatus  | getOsnapPoints (AcDb::OsnapMode, Adesk::GsMarker, const AcGePoint3d &, const AcGePoint3d &, const AcGeMatrix3d &, AcGePoint3dArray &, AcDbIntArray &, const AcGeMatrix3d &) const final
Gets the entity osnap points. More...
virtual Acad::ErrorStatus  | getPlane (AcGePlane &, AcDb::Planarity &) const
Returns the plane that contains this entity. More...
AcDb::PlotStyleNameType  | getPlotStyleNameId (AcDbObjectId &) const
Returns the plot style name type and its associated id. More...
virtual Acad::ErrorStatus  | getStretchPoints (AcGePoint3dArray &) const final
Append stretch points to the specified array. More...
 virtual Acad::ErrorStatus  | getSubentClassId (const AcDbFullSubentPath &, CLSID *) const final
 virtual Acad::ErrorStatus  | getSubentPathGeomExtents (const AcDbFullSubentPath &, AcDbExtents &) const final
virtual Acad::ErrorStatus  | getSubentPathsAtGsMarker (AcDb::SubentType, Adesk::GsMarker, const AcGePoint3d &, const AcGeMatrix3d &, int &, AcDbFullSubentPath *&, int=0, AcDbObjectId *=NULL) const final
Gets the subentity paths appropriate for the passed in gs marker. More...
virtual Acad::ErrorStatus  | getTransformedCopy (const AcGeMatrix3d &, AcDbEntity *&) const final
Creates a copy of the current entity applying the transformation matrix. More...
 virtual void  | gripStatus (const AcDb::GripStat) final
 virtual bool  | hideMeForDragging () const final
virtual Acad::ErrorStatus  | highlight (const AcDbFullSubentPath &=kNullSubent, const Adesk::Boolean=Adesk::kFalse) const final
Highlights part of, or entire entity. More...
virtual Acad::ErrorStatus  | intersectWith (const AcDbEntity *, AcDb::Intersect, AcGePoint3dArray &, Adesk::GsMarker=0, Adesk::GsMarker=0) const final
Finds the intersection between this entity and the pOhter entity. More...
virtual Acad::ErrorStatus  | intersectWith (const AcDbEntity *, AcDb::Intersect, const AcGePlane &, AcGePoint3dArray &, Adesk::GsMarker=0, Adesk::GsMarker=0) const final
Projects this entity and the pOhter entity on plane, finds the intersection points between these projections and then projects back the points onto the caller entity. More...
 virtual bool  | isContentSnappable () const final
virtual Adesk::Boolean  | isPlanar () const
ACHAR *  | layer () const
Returns the layername. More...
AcDbObjectId  | layerId () const
Returns the Object ID of the LayerTableRecord referenced by this entity. More...
ACHAR *  | linetype () const
Gets the linetype value. More...
AcDbObjectId  | linetypeId () const
Gets the linetypeId value. More...
 double  | linetypeScale () const
returns the linetype scale factor for the entity
AcDb::LineWeight  | lineWeight () const
Gets the entity line weight. More...
virtual void  | list () const final
Prints the properties in drawing window. More...
ACHAR *  | material () const
Gets the material assigned to this entity. More...
AcDbObjectId  | materialId () const
Gets the AcDbObjectId of the material assigned to this entity. More...
virtual Acad::ErrorStatus  | moveGripPointsAt (const AcDbIntArray &, const AcGeVector3d &) final
Move the grip points pointed by the indexes specified in indexArray using the translationVector param direction and length Override this method in custom entities to define your own behaviour. More...
 virtual Acad::ErrorStatus  | moveGripPointsAt (const AcDbVoidPtrArray &, const AcGeVector3d &, const int) final
 virtual Acad::ErrorStatus  | moveGripPointsAtSubentPaths (const AcDbFullSubentPathArray &, const AcDbVoidPtrArray &, const AcGeVector3d &, const int) final
virtual Acad::ErrorStatus  | moveStretchPointsAt (const AcDbIntArray &, const AcGeVector3d &) final
Move the stretch points pointed by the indexes specified in indexArray with the offest specified by translationVector Override this method in custom entities to define your own behaviour. More...
ACHAR *  | plotStyleName () const
Returns the name of the plotStyleName string associated with this entity (DXF 390). More...
virtual bool  | receiveShadows () const
Checks if this entity is able to receive shadows. More...
void  | recordGraphicsModified (Adesk::Boolean=Adesk::kTrue)
Controls the entity display update when closing it Entities not updated when closed are updated at the first regen. More...
virtual void  | saveAs (AcGiWorldDraw *, AcDb::SaveType)
Generates the graphics primitives when a DWG save requiring proxy graphics to be saved is made. More...
virtual void  | setCastShadows (bool)
Sets this entity's flag regarding casting shadows. More...
virtual Acad::ErrorStatus  | setColor (const AcCmColor &, Adesk::Boolean=Adesk::kTrue)
Sets the color information of this entity from an AcCmColor instance. More...
virtual Acad::ErrorStatus  | setColor (const AcCmColor &, bool, AcDbDatabase *)
Sets the color property of this entity from an AcCmColor instance. More...
virtual Acad::ErrorStatus  | setColorIndex (Adesk::UInt16, Adesk::Boolean=Adesk::kTrue)
Sets the color index of this entity (DXF 62). More...
void  | setDatabaseDefaults ()
Applies the default properties of the entities database to this entity. More...
void  | setDatabaseDefaults (AcDbDatabase *)
Applies the default properties of the specified database to this entity. More...
virtual Acad::ErrorStatus  | setLayer (AcDbObjectId, Adesk::Boolean=Adesk::kTrue, bool=false)
Sets the layer to be referenced by this entity (DXF 8). More...
virtual Acad::ErrorStatus  | setLayer (const ACHAR *, Adesk::Boolean=Adesk::kTrue, bool=false)
Sets the layer to be referenced by this entity (DXF 8). More...
virtual Acad::ErrorStatus  | setLinetype (AcDbObjectId, Adesk::Boolean=Adesk::kTrue)
Sets the entities linetype to ltypeObjectId. More...
virtual Acad::ErrorStatus  | setLinetype (const ACHAR *, Adesk::Boolean=Adesk::kTrue)
Sets the entities linetype to the linetpye referenced by layerName. More...
virtual Acad::ErrorStatus  | setLinetypeScale (double, Adesk::Boolean=Adesk::kTrue)
sets value as entity linetype scale factor More...
virtual Acad::ErrorStatus  | setLineWeight (AcDb::LineWeight, Adesk::Boolean=Adesk::kTrue)
Sets the entity line weight. More...
virtual Acad::ErrorStatus  | setMaterial (AcDbObjectId, Adesk::Boolean=Adesk::kTrue)
Not implemented yet. More...
virtual Acad::ErrorStatus  | setMaterial (const ACHAR *, Adesk::Boolean=Adesk::kTrue)
Assigns the material to the entity. More...
virtual Acad::ErrorStatus  | setMaterialMapper (const AcGiMapper &, Adesk::Boolean=Adesk::kTrue)
It is used for apply material (scale, rotation, projection, mode overrides) to an identity.If it is used AcGiMapper::kIdentity it will apply for entity a default mapper. More...
virtual Acad::ErrorStatus  | setPlotStyleName (AcDb::PlotStyleNameType, AcDbObjectId=AcDbObjectId::kNull, Adesk::Boolean=Adesk::kTrue)
Sets the plot style of this entity. More...
virtual Acad::ErrorStatus  | setPlotStyleName (const ACHAR *, Adesk::Boolean=Adesk::kTrue)
Sets the plot style of this entity. More...
Acad::ErrorStatus  | setPropertiesFrom (const AcDbEntity *, Adesk::Boolean=Adesk::kTrue)
Copies the properties color, layer, linetype, linetypescale and visibility from the source entity pEntity to this entity. More...
virtual void  | setReceiveShadows (bool)
Sets this entity's flag regarding receiving shadows. More...
virtual Acad::ErrorStatus  | setTransparency (const AcCmTransparency &, Adesk::Boolean=Adesk::kTrue)
Sets the transparency setting of this entity, and returns eOk if successful. More...
virtual Acad::ErrorStatus  | setVisibility (AcDb::Visibility, Adesk::Boolean=Adesk::kTrue) final
notyetdocumented. More...
 virtual Acad::ErrorStatus  | setVisualStyle (AcDbObjectId, VisualStyleType=kFullVisualStyle, Adesk::Boolean=true)
 virtual void  | subentGripStatus (const AcDb::GripStat, const AcDbFullSubentPath &) final
virtual AcDbEntity *  | subentPtr (const AcDbFullSubentPath &) const final
Creates an entity as a copy of the subentity given by acSubentPath. More...
virtual void  | subSetDatabaseDefaults (AcDbDatabase *)
This function is called by AcDbEntity::setDatabaseDefaults(), to allow custom entities to set their related sub entities, if any; default implementation does nothing. More...
virtual Acad::ErrorStatus  | transformBy (const AcGeMatrix3d &) final
Applies given transformation (matrix) to the entity. More...
 virtual Acad::ErrorStatus  | transformSubentPathsBy (const AcDbFullSubentPathArray &, const AcGeMatrix3d &) final
 AcCmTransparency  | transparency () const
Returns the transparency setting of this entity.
virtual Acad::ErrorStatus  | unhighlight (const AcDbFullSubentPath &=kNullSubent, const Adesk::Boolean=Adesk::kFalse) const final
Unhighlights previously highlighted part of entity, or entire entity. More...
AcDb::Visibility  | visibility () const
Gets the visibility state. More...
 AcDbObjectId  | visualStyleId (VisualStyleType=kFullVisualStyle) const
 Public Member Functions inherited from AcDbObject
virtual Acad::ErrorStatus  | addPersistentReactor (AcDbObjectId)
Adds a persistent reactor to this object reactor list. More...
Acad::ErrorStatus  | addReactor (AcDbObjectReactor *) const
Adds a transient reactor to this object. More...
virtual Acad::ErrorStatus  | applyPartialUndo (AcDbDwgFiler *, AcRxClass *)
This function is called during Undo operations on objects, that use the 'Partial Undo meachanism'; this is, this object is opened with assertWriteEnabled(Adesk::kFalse) to indicate that custom Undo filing is used rather than the default Undo filing. More...
 void  | assertNotifyEnabled () const
 void  | assertReadEnabled () const
 void  | assertWriteEnabled (Adesk::Boolean=Adesk::kTrue, Adesk::Boolean=Adesk::kTrue)
virtual Acad::ErrorStatus  | audit (AcDbAuditInfo *)
Performs the audit operation for this object. More...
Acad::ErrorStatus  | cancel ()
Reverts all changes since the object had been opened and closes the object. More...
virtual void  | cancelled (const AcDbObject *)
A handler function for persistent reactors. More...
virtual AcRxObject *  | clone () const
Creates a shallow clone of this object. More...
Acad::ErrorStatus  | close ()
Closes the object. More...
Acad::ErrorStatus  | closeAndPage (Adesk::Boolean=Adesk::kTrue)
Closes the object. More...
virtual Acad::ErrorStatus  | composeForLoad (AcDb::OdaSaveType, AcDb::AcDbDwgVersion)
This function is intended for future MT file loading support. More...
virtual void  | copied (const AcDbObject *, const AcDbObject *)
A handler function for persistent reactors. More...
virtual Acad::ErrorStatus  | copyFrom (const AcRxObject *)
Copies the pSrc object information in this object. More...
Acad::ErrorStatus  | createExtensionDictionary ()
Creates a dictionary as extension dictionary for this object. More...
AcDbDatabase *  | database () const
Returns the database that contains this object. More...
virtual Acad::ErrorStatus  | decomposeForSave (AcDb::AcDbDwgVersion, AcDbObject *&, AcDbObjectId &, Adesk::Boolean &)
This function is called during dwg and dxf output, to allow a custom object to decompose itself, due to provided dwg/dxf target file version. More...
virtual Acad::ErrorStatus  | deepClone (AcDbObject *, AcDbObject *&, AcDbIdMapping &, Adesk::Boolean=Adesk::kTrue) const final
Clones this object, appends it to the owner pOwner and adds an AcDbIdPair record to the idMap. More...
void  | disableUndoRecording (Adesk::Boolean)
Disables or enables the undo recording for the object. More...
Acad::ErrorStatus  | downgradeOpen ()
Sets the open mode for an object opened for write to be opened for read. More...
Acad::ErrorStatus  | downgradeToNotify (Adesk::Boolean)
Sets the open mode for an object opened for write to be opened for notify. More...
virtual AcGiDrawable *  | drawable ()
Retrieves the AcGiDrawable instance of this object. More...
Acad::ErrorStatus  | dwgIn (AcDbDwgFiler *)
Calls the object's dwgInFields function, and reads any XData if present. More...
virtual Acad::ErrorStatus  | dwgInFields (AcDbDwgFiler *)
Reads the object from the DWG filer. More...
Acad::ErrorStatus  | dwgOut (AcDbDwgFiler *) const
Calls the object's dwgOutFields function, and writes any XData if present. More...
virtual Acad::ErrorStatus  | dwgOutFields (AcDbDwgFiler *) const
Writes the object to the DWG filer. More...
Acad::ErrorStatus  | dxfIn (AcDbDxfFiler *)
Calls the object's dxfInFields function, and reads any XData if present. More...
virtual Acad::ErrorStatus  | dxfInFields (AcDbDxfFiler *)
Reads the object from the DXF filer. More...
Acad::ErrorStatus  | dxfOut (AcDbDxfFiler *, Adesk::Boolean, Adesk::uchar *) const
Calls the object's dxfOutFields function, and writes any XData if present. More...
virtual Acad::ErrorStatus  | dxfOutFields (AcDbDxfFiler *) const
Writes the object to the DXF filer. More...
Acad::ErrorStatus  | erase (Adesk::Boolean=Adesk::kTrue)
Sets the bit that indicates that the object is erased. More...
virtual void  | erased (const AcDbObject *, Adesk::Boolean)
A handler function for persistent reactors. More...
AcDbObjectId  | extensionDictionary () const
Returns the object id of the extension dictionary for this object. More...
void  | getAcDbHandle (AcDbHandle &) const
Returns handle of this object. More...
Acad::ErrorStatus  | getBinaryData (const ACHAR *, Adesk::Int32 &, char *&) const
Creates a copy of the binary data stored as chunks of maximum 127 bytes in the resbuf chain of this object's extension dictionary xrecord entry given by entryName. More...
int  | getBrxOpenCount () const
This function returns the number of open BRX instances for this object. More...
int  | getBrxOpenState () const
This function returns the BRX object open state flags as bitfields, for diagnostic purpose. More...
virtual Acad::ErrorStatus  | getClassID (CLSID *) const final
Gets the COM wrapper Class ID for this entity. More...
int  | getCustomObjectState () const
This function returns the custom object status : 1=isCustomObject 2=DifferentialUndoDisabled. More...
Acad::ErrorStatus  | getField (const ACHAR *, AcDbField *&, AcDb::OpenMode) const
Retrieves the specified Field from this object, and opens it in mode. More...
Acad::ErrorStatus  | getField (const ACHAR *, AcDbObjectId &) const
Gets the pszPropName field object from field dictionary of this AcDbObject object, using pszPropName as key. More...
AcDbObjectId  | getFieldDictionary () const
Returns the Field dictionary associated with this object,. More...
Acad::ErrorStatus  | getFieldDictionary (AcDbDictionary *&, AcDb::OpenMode) const
Gets and opens the field dictionary for this. More...
Acad::ErrorStatus  | getObjectBirthVersion (AcDb::AcDbDwgVersion &, AcDb::MaintenanceReleaseVersion &)
This function is currently not supported by the CAD engine, always returns Acad::eOk, and 'kDHL_CURRENT' + 'kMReleaseCurrent' results. More...
virtual Acad::ErrorStatus  | getObjectSaveVersion (const AcDbDwgFiler *, AcDb::AcDbDwgVersion &, AcDb::MaintenanceReleaseVersion &)
Returns the DWG version for saving the object. More...
virtual Acad::ErrorStatus  | getObjectSaveVersion (const AcDbDxfFiler *, AcDb::AcDbDwgVersion &, AcDb::MaintenanceReleaseVersion &)
Returns the DWG version for saving the object. More...
int  | getOdaOpenCount () const
This function returns the number of open ODA instances for this object. More...
int  | getOdaOpenState () const
This function returns the ODA object open state flags as bitfields, for diagnostic purpose. More...
virtual void  | goodbye (const AcDbObject *)
A handler function for persistent reactors. More...
Acad::ErrorStatus  | handOverTo (AcDbObject *, Adesk::Boolean=Adesk::kTrue, Adesk::Boolean=Adesk::kTrue)
Hands over objects identity to another object. More...
bool  | hasFields () const
Return true if this object has single or multiple fields associated with him. More...
bool  | hasPersistentReactor (AcDbObjectId) const
Checks the input objectId in this object reactor list. More...
bool  | hasSaveVersionOverride ()
This function indicates whether this object overrides the filer's save version. More...
virtual AcDbObjectId  | id () const
Returns the database id of this object. More...
Adesk::Boolean  | isAcDbObjectIdsInFlux () const
Checks whether a deep clone operation was completed. More...
Adesk::Boolean  | isAProxy () const
Adesk::Boolean  | isCancelling () const
Adesk::Boolean  | isErased () const
Returns whether this object is erased. More...
Adesk::Boolean  | isEraseStatusToggled () const
Checks whether the object erase status has been toggled. More...
Adesk::Boolean  | isModified () const
Returns whether this object's assertWriteEnabled() has been called since it was opened. More...
Adesk::Boolean  | isModifiedGraphics () const
Checks whether this object graphics will be updated when the object is closed. More...
Adesk::Boolean  | isModifiedXData () const
Checks whether this object's xData was modified. More...
Adesk::Boolean  | isNewObject () const
Returns true if and only if this object has not been closed since it was created. More...
Adesk::Boolean  | isNotifyEnabled () const
Returns whether this object is opened for notify. More...
Adesk::Boolean  | isNotifying () const
virtual Adesk::Boolean  | isPersistent () const
Returns the 'persistent' status of a database object. More...
Adesk::Boolean  | isReadEnabled () const
Returns whether this object is opened for read. More...
 Adesk::Boolean  | isReallyClosing () const
Checks whether the next close call will completely close this object return true if on the next call the object will be completely closed false otherwise.
Adesk::Boolean  | isTransactionResident () const
Gets the object transaction status. More...
Adesk::Boolean  | isUndoing () const
bool  | isUndoRecordingDisabled () const
Returns whether the undo recording for the object is enabled or not. More...
Adesk::Boolean  | isWriteEnabled () const
Returns whether this object is opened for write. More...
virtual AcDb::DuplicateRecordCloning  | mergeStyle () const
Returns the object's merge behavior during cloning. More...
virtual void  | modified (const AcDbObject *)
A handler function for persistent reactors. More...
virtual void  | modifiedGraphics (const AcDbEntity *)
A handler function for persistent reactors. More...
virtual void  | modifiedXData (const AcDbObject *)
A handler function for persistent reactors. More...
virtual void  | modifyUndone (const AcDbObject *)
A handler function for persistent reactors. More...
virtual void  | objectClosed (const AcDbObjectId)
A handler function for persistent reactors. More...
AcDbObjectId  | objectId () const
Returns object id. More...
virtual void  | openedForModify (const AcDbObject *)
A handler function for persistent reactors. More...
AcDbObjectId  | ownerId () const
Returns object id of the owner. More...
AcDbVoidPtrArray *  | reactors ()
Gets the object pointers to reactors. More...
const AcDbVoidPtrArray *  | reactors () const
Gets the object pointers to reactors. More...
virtual void  | reappended (const AcDbObject *)
A handler function for persistent reactors. More...
 virtual void  | recvPropagateModify (const AcDbObject *)
Not implemented yet.
Acad::ErrorStatus  | releaseExtensionDictionary ()
Removes the extension dictionary associated with this object. More...
virtual Acad::ErrorStatus  | removeField (AcDbObjectId)
Removes the Field specified by acFieldId from this object. More...
virtual Acad::ErrorStatus  | removeField (const ACHAR *)
Removes the Field specified by szKeyString from this object. More...
virtual Acad::ErrorStatus  | removeField (const ACHAR *, AcDbObjectId &)
Removes the Field specified by acPszKeyString from this object, and returns its ObjectId value. More...
virtual Acad::ErrorStatus  | removePersistentReactor (AcDbObjectId)
Removes a persistent reactor from this object reactor list. More...
Acad::ErrorStatus  | removeReactor (AcDbObjectReactor *) const
Removes a transient reactor to this object. More...
void  | setAcDbObjectIdsInFlux ()
Call this function to indicate that the object IDs of this object and its sub-objects (if any) are not yet valid. More...
Acad::ErrorStatus  | setBinaryData (const ACHAR *, Adesk::Int32, const char *)
Creates a copy of the binary data, divides it in up to 127 bytes binary chunks and
 sets them as resbufs in the resbuf chain of this object's extension dictionary xrecord entry given by entryName. More...
virtual Acad::ErrorStatus  | setField (const ACHAR *, AcDbField *, AcDbObjectId &)
Adds the pAcField field object to field dictionary of this AcDbObject object, using pKey as key. More...
void  | setHasSaveVersionOverride (bool)
This function can be called to specify that the object has a "save version override". More...
virtual Acad::ErrorStatus  | setOwnerId (AcDbObjectId)
Sets the ownerId data member of the object to be objId. More...
virtual Acad::ErrorStatus  | setXData (const resbuf *)
Sets/removes xData associated with this object. More...
virtual Acad::ErrorStatus  | subCancel ()
Possibility to veto a cancel operation from within custom entities. More...
virtual Acad::ErrorStatus  | subClose ()
virtual Acad::ErrorStatus  | subErase (Adesk::Boolean)
This hook is called during an AcDbObject::erase call, before any actual erase operation is performed. More...
 virtual Acad::ErrorStatus  | subHandOverTo (AcDbObject *)
virtual void  | subObjModified (const AcDbObject *, const AcDbObject *)
A handler function for persistent reactors. More...
 virtual Acad::ErrorStatus  | subOpen (AcDb::OpenMode)
virtual Acad::ErrorStatus  | subSwapIdWith (AcDbObjectId, Adesk::Boolean=Adesk::kFalse, Adesk::Boolean=Adesk::kFalse)
This hook is called during an AcDbObject::swapIdWith() call, before any actual swap operation is performed. More...
Acad::ErrorStatus  | swapIdWith (AcDbObjectId, Adesk::Boolean=Adesk::kFalse, Adesk::Boolean=Adesk::kFalse)
Swaps the object id's between the object identified by param swapId and this object. More...
virtual Acad::ErrorStatus  | swapReferences (const AcDbIdMapping &)
Not implemented yet. More...
virtual void  | unappended (const AcDbObject *)
A handler function for persistent reactors. More...
AcDbDwgFiler *  | undoFiler ()
Gets the undo filer for this object. More...
Acad::ErrorStatus  | upgradeFromNotify (Adesk::Boolean &)
Upgrades the open status of this object to AcDb::kForWrite, if this object is already open (either in AcDb::kForRead, AcDb::kForNotify or AcDb::kForWrite) More...
Acad::ErrorStatus  | upgradeOpen ()
Changes the objects open mode to AcDb::kForWrite and sends notifications. More...
virtual Acad::ErrorStatus  | wblockClone (AcRxObject *, AcDbObject *&, AcDbIdMapping &, Adesk::Boolean=Adesk::kTrue) const final
Clones this object, appends it to the owner pOwner and adds an AcDbIdPair record to the idMap. More...
virtual resbuf *  | xData (const ACHAR *=NULL) const
Returns the xData associated with this object. More...
Acad::ErrorStatus  | xDataTransformBy (const AcGeMatrix3d &)
Transforms the extended data according to parameter transformation matrix. More...
 virtual void  | xmitPropagateModify () const
Not implemented yet.
 virtual  | ~AcDbObject ()
Destructor.
 Public Member Functions inherited from AcGiDrawable
virtual bool  | bounds (AcDbExtents &) const
virtual DrawableType  | drawableType () const
 virtual AcGiDrawStream *  | drawStream () const
 AcGsNode *  | gsNode () const
virtual AcDbObjectId  | id () const =0
virtual Adesk::Boolean  | isPersistent () const =0
virtual Adesk::UInt32  | regenSupportFlags () const final
Returns whether and to which level this object supports MultiThreading. More...
 virtual Adesk::Boolean  | RolloverHit (Adesk::ULongPtr, Adesk::ULongPtr, Adesk::Boolean)
 virtual Adesk::UInt32  | setAttributes (AcGiDrawableTraits *) final
 virtual void  | setDrawStream (AcGiDrawStream *)
 void  | setGsNode (AcGsNode *)
 virtual void  | viewportDraw (AcGiViewportDraw *) final
 virtual Adesk::UInt32  | viewportDrawLogicalFlags (AcGiViewportDraw *) final
 virtual Adesk::Boolean  | worldDraw (AcGiWorldDraw *) final
 Public Member Functions inherited from AcRxObject
virtual AcRxObject *  | clone () const
Exported and implemented. More...
 virtual AcRx::Ordering  | comparedTo (const AcRxObject *) const
Exported and implemented.
virtual Acad::ErrorStatus  | copyFrom (const AcRxObject *)
Exported and implemented. More...
 virtual AcRxClass *  | isA () const
Exported and implemented.
virtual Adesk::Boolean  | isEqualTo (const AcRxObject *) const
Exported and implemented. More...
bool  | isKindOf (const AcRxClass *) const
Checks the object class. More...
AcRxObject *  | queryX (const AcRxClass *) const
returns the protocol extension object assigned to this class or a parent class. More...
AcRxObject *  | x (const AcRxClass *) const
returns the protocol extension object assigned to this class or a parent class. More...
 virtual  | ~AcRxObject ()
Destructor.
 Public Attributes
AcDbSection
Default constructor. More...
 Public Attributes inherited from AcDbEntity
AcDbEntity
This protected constructor sets the initial value for color to 257, and for the objectids for layer and linetype to AcDbObjectId::kNull. More...
 Protected Member Functions
virtual Acad::ErrorStatus  | subGetGeomExtents (AcDbExtents &) const
virtual Acad::ErrorStatus  | subGetGripPoints (AcDbGripDataPtrArray &, const double, const int, const AcGeVector3d &, const int) const
virtual Acad::ErrorStatus  | subGetOsnapPoints (AcDb::OsnapMode, Adesk::GsMarker, const AcGePoint3d &, const AcGePoint3d &, const AcGeMatrix3d &, AcGePoint3dArray &, AcDbIntArray &) const
virtual void  | subList () const
virtual Acad::ErrorStatus  | subMoveGripPointsAt (const AcDbVoidPtrArray &, const AcGeVector3d &, const int)
virtual Acad::ErrorStatus  | subTransformBy (const AcGeMatrix3d &)
virtual Adesk::Boolean  | subWorldDraw (AcGiWorldDraw *)
 Protected Member Functions inherited from AcDbEntity
 virtual Acad::ErrorStatus  | subAddSubentPaths (const AcDbFullSubentPathArray &)
 virtual Adesk::Boolean  | subCloneMeForDragging ()
 virtual Acad::ErrorStatus  | subDeleteSubentPaths (const AcDbFullSubentPathArray &)
virtual Acad::ErrorStatus  | subExplode (AcDbVoidPtrArray &) const
 virtual Acad::ErrorStatus  | subGetCompoundObjectTransform (AcGeMatrix3d &) const
virtual Acad::ErrorStatus  | subGetGeomExtents (AcDbExtents &) const
virtual Acad::ErrorStatus  | subGetGripEntityUCS (const void *, AcGeVector3d &, AcGePoint3d &, AcGeVector3d &) const
virtual Acad::ErrorStatus  | subGetGripPoints (AcDbGripDataPtrArray &, const double, const int, const AcGeVector3d &, const int) const
virtual Acad::ErrorStatus  | subGetGripPoints (AcGePoint3dArray &, AcDbIntArray &, AcDbIntArray &) const
 virtual Acad::ErrorStatus  | subGetGripPointsAtSubentPath (const AcDbFullSubentPath &, AcDbGripDataPtrArray &, const double, const int, const AcGeVector3d &, const int) const
virtual Acad::ErrorStatus  | subGetGsMarkersAtSubentPath (const AcDbFullSubentPath &, AcArray< Adesk::GsMarker > &) const
virtual Acad::ErrorStatus  | subGetOsnapPoints (AcDb::OsnapMode, Adesk::GsMarker, const AcGePoint3d &, const AcGePoint3d &, const AcGeMatrix3d &, AcGePoint3dArray &, AcDbIntArray &) const
 virtual Acad::ErrorStatus  | subGetOsnapPoints (AcDb::OsnapMode, Adesk::GsMarker, const AcGePoint3d &, const AcGePoint3d &, const AcGeMatrix3d &, AcGePoint3dArray &, AcDbIntArray &, const AcGeMatrix3d &) const
virtual Acad::ErrorStatus  | subGetStretchPoints (AcGePoint3dArray &) const
 virtual Acad::ErrorStatus  | subGetSubentClassId (const AcDbFullSubentPath &, CLSID *) const
 virtual Acad::ErrorStatus  | subGetSubentPathGeomExtents (const AcDbFullSubentPath &, AcDbExtents &) const
virtual Acad::ErrorStatus  | subGetSubentPathsAtGsMarker (AcDb::SubentType, Adesk::GsMarker, const AcGePoint3d &, const AcGeMatrix3d &, int &, AcDbFullSubentPath *&, int=0, AcDbObjectId *=nullptr) const
virtual Acad::ErrorStatus  | subGetTransformedCopy (const AcGeMatrix3d &, AcDbEntity *&) const
virtual void  | subGripStatus (const AcDb::GripStat)
 virtual bool  | subHideMeForDragging () const
virtual Acad::ErrorStatus  | subHighlight (const AcDbFullSubentPath &=kNullSubent, const Adesk::Boolean=false) const
virtual Acad::ErrorStatus  | subIntersectWith (const AcDbEntity *, AcDb::Intersect, AcGePoint3dArray &, Adesk::GsMarker=0, Adesk::GsMarker=0) const
virtual Acad::ErrorStatus  | subIntersectWith (const AcDbEntity *, AcDb::Intersect, const AcGePlane &, AcGePoint3dArray &, Adesk::GsMarker=0, Adesk::GsMarker=0) const
virtual bool  | subIsContentSnappable () const
virtual void  | subList () const
virtual Acad::ErrorStatus  | subMoveGripPointsAt (const AcDbIntArray &, const AcGeVector3d &)
virtual Acad::ErrorStatus  | subMoveGripPointsAt (const AcDbVoidPtrArray &, const AcGeVector3d &, const int)
 virtual Acad::ErrorStatus  | subMoveGripPointsAtSubentPaths (const AcDbFullSubentPathArray &, const AcDbVoidPtrArray &, const AcGeVector3d &, const int)
virtual Acad::ErrorStatus  | subMoveStretchPointsAt (const AcDbIntArray &, const AcGeVector3d &)
virtual Adesk::UInt32  | subSetAttributes (AcGiDrawableTraits *)
Sets the values of this object's subentity traits and returns with the calling object's subentity traits. More...
virtual Acad::ErrorStatus  | subSetVisibility (AcDb::Visibility, Adesk::Boolean=true)
 virtual void  | subSubentGripStatus (const AcDb::GripStat, const AcDbFullSubentPath &)
virtual AcDbEntity *  | subSubentPtr (const AcDbFullSubentPath &) const
virtual Acad::ErrorStatus  | subTransformBy (const AcGeMatrix3d &)
 virtual Acad::ErrorStatus  | subTransformSubentPathsBy (const AcDbFullSubentPathArray &, const AcGeMatrix3d &)
virtual Acad::ErrorStatus  | subUnhighlight (const AcDbFullSubentPath &=kNullSubent, const Adesk::Boolean=false) const
virtual void  | subViewportDraw (AcGiViewportDraw *)
 virtual AcDb::Visibility  | subVisibility () const
virtual Adesk::Boolean  | subWorldDraw (AcGiWorldDraw *)
 Protected Member Functions inherited from AcDbObject
virtual Acad::ErrorStatus  | subDeepClone (AcDbObject *, AcDbObject *&, AcDbIdMapping &, Adesk::Boolean=true) const
virtual Acad::ErrorStatus  | subGetClassID (CLSID *) const
virtual Adesk::UInt32  | subSetAttributes (AcGiDrawableTraits *)
Sets the values of this object's subentity traits and returns with the calling object's subentity traits. More...
virtual void  | subViewportDraw (AcGiViewportDraw *)
virtual Adesk::UInt32  | subViewportDrawLogicalFlags (AcGiViewportDraw *)
virtual Acad::ErrorStatus  | subWblockClone (AcRxObject *, AcDbObject *&, AcDbIdMapping &, Adesk::Boolean=true) const
virtual Adesk::Boolean  | subWorldDraw (AcGiWorldDraw *)
 Protected Member Functions inherited from AcGiDrawable
virtual Adesk::UInt32  | subRegenSupportFlags () const
Returns whether and to which level this object supports MultiThreading. More...
virtual Adesk::UInt32  | subSetAttributes (AcGiDrawableTraits *)=0
virtual void  | subViewportDraw (AcGiViewportDraw *)=0
 virtual Adesk::UInt32  | subViewportDrawLogicalFlags (AcGiViewportDraw *)
virtual Adesk::Boolean  | subWorldDraw (AcGiWorldDraw *)=0
 Protected Member Functions inherited from AcRxObject
AcRxObject ()
Exported and implemented.
 Additional Inherited Members
 Static Public Member Functions inherited from AcRxObject
 static AcRxObject *  | cast (const AcRxObject *)
 static AcRxClass *  | desc ()
Exported and implemented.
 Static Public Member Functions inherited from AcHeapOperators
 static void  | operator delete (void *)
_
 static void  | operator delete (void *, const char *, int)
 static void  | operator delete (void *, void *)
 static void  | operator delete[] (void *)
_
 static void  | operator delete[] (void *, const char *, int)
 static void *  | operator new (size_t)
_
 static void *  | operator new (size_t, const char *, int)
 static void *  | operator new (size_t, void *p)
 static void *  | operator new[] (size_t)
_
 static void *  | operator new[] (size_t, const char *, int)
Detailed Description
_
Member Function Documentation
◆ addVertex()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbSection::addVertex  |  ( |  int  |  idx,
|  const AcGePoint3d &  |  vtx
)
Inserts (or adds) the specified vertex at the given index; if index is less than zero, or higher than the number of actual vertices, then the vertex is added at the end of the verices array.
Parameters
[in] | idx | - idx, the index to insert the vertex
[in] | vtx | - the vertex point to be inserted
Returns
Acad::ErrorStatus - eOk if successful, error status otherwise
◆ bottomPlane()
 UX_EXPORT_FUNCTION double AcDbSection::bottomPlane  |  ( |   | ) |   const
Returns the bottom plane distance.
Returns
double - the bottom plane distance
◆ createJog()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbSection::createJog  |  ( |  const AcGePoint3d &  |  jogPoint | )
Creates a section plane jog at the position specified by @jogPoint.
Parameters
[in] | jogPoint | - the jog position
Returns
Acad::ErrorStatus - eOk if successful, error status otherwise
◆ dwgInFields()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbSection::dwgInFields  |  ( |  AcDbDwgFiler *  |  dwgFiler | )
virtual
See also
AcDbEntity::dwgInFields(AcDbDwgFiler*)
Reimplemented from AcDbEntity.
◆ dwgOutFields()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbSection::dwgOutFields  |  ( |  AcDbDwgFiler *  |  dwgFiler | ) |   const
virtual
See also
AcDbEntity::dwgOutFields(AcDbDwgFiler*)
Reimplemented from AcDbEntity.
◆ dxfInFields()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbSection::dxfInFields  |  ( |  AcDbDxfFiler *  |  dxfFiler | )
virtual
See also
AcDbEntity::dxfInFields(AcDbDxfFiler*)
Reimplemented from AcDbEntity.
◆ dxfOutFields()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbSection::dxfOutFields  |  ( |  AcDbDxfFiler *  |  dxfFiler | ) |   const
virtual
See also
AcDbEntity::dxfOutFields(AcDbDxfFiler*)
Reimplemented from AcDbEntity.
◆ elevation()
 UX_EXPORT_FUNCTION double AcDbSection::elevation  |  ( |   | ) |   const
Returns the elevation of this AcDbSectionentity.
Returns
double - the section plane elevation
◆ enableLiveSection()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbSection::enableLiveSection  |  ( |  bool  |  enable | )
Enables or diables the "Live Section" status for this AcDbSection entity.
Parameters
[in] | enable | - set this section entity as a "Live Section" or a normal section
Returns
Acad::ErrorStatus - eOk if successful, error status otherwise
◆ generateSectionGeometry() [1/2]
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbSection::generateSectionGeometry  |  ( |  AcDbEntity *  |  entity,
|  AcArray< AcDbEntity * > &  |  boundaries,
|  AcArray< AcDbEntity * > &  |  fillEntities,
|  AcArray< AcDbEntity * > &  |  backgroundEntities,
|  AcArray< AcDbEntity * > &  |  foregroundEntities,
|  AcArray< AcDbEntity * > &  |  tangencyEntities
) |   |  const
Creates the section entities when sectioning the specified input entity.
Parameters
[in] | entity | to be sectioned
[out] | boundaries | array of boundary entities
[out] | fillEntities | array of intersection fill entities
[out] | backgroundEntities | array of background entities
[out] | foregroundEntities | array of foreground entities
[out] | tangencyEntities | array of tangency entities
Returns
Acad::eOk for success, or error status otherwise
◆ generateSectionGeometry() [2/2]
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbSection::generateSectionGeometry  |  ( |  const AcArray< AcDbEntity * > &  |  entitySet,
|  AcArray< AcDbEntity * > &  |  boundaries,
|  AcArray< AcDbEntity * > &  |  fillEntities,
|  AcArray< AcDbEntity * > &  |  backgroundEntities,
|  AcArray< AcDbEntity * > &  |  foregroundEntities,
|  AcArray< AcDbEntity * > &  |  tangencyEntities
) |   |  const
Creates the section entities when sectioning the specified set of input entiies.
Parameters
[in] | entitySet | to be sectioned
[out] | boundaries | array of boundary entities
[out] | fillEntities | array of intersection fill entities
[out] | backgroundEntities | array of background entities
[out] | foregroundEntities | array of foreground entities
[out] | tangencyEntities | array of tangency entities
Returns
Acad::eOk for success, or error status otherwise
◆ getName() [1/3]
 UX_EXPORT_FUNCTION const ACHAR * AcDbSection::getName  |  ( |   | ) |   const
Returns the name of this AcDbSection entity.
Returns
const ACHAR* - returns the name
◆ getName() [2/3]
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbSection::getName  |  ( |  ACHAR *&  |  name | ) |   const
Returns the name of this AcDbSection entity.
Parameters
[out] | name | - returns the name, caller must release the memory using acutDelString()
Returns
Acad::ErrorStatus - eOk if successful, error status otherwise
◆ getName() [3/3]
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbSection::getName  |  ( |  AcString &  |  name | ) |   const
Returns the name of this AcDbSection entity.
Parameters
[out] | name | - returns the name
Returns
Acad::ErrorStatus - eOk if successful, error status otherwise
◆ getSettings() [1/2]
 UX_EXPORT_FUNCTION AcDbObjectId AcDbSection::getSettings  |  ( |   | ) |   const
Returns the ObjectId of the settings object for this section.
Returns
ObjectId of the settings object
◆ getSettings() [2/2]
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbSection::getSettings  |  ( |  AcDbSectionSettings *&  |  settings,
|  AcDb::OpenMode  |  openMode
) |   |  const
Returns the opened settings object for this section.
Parameters
[out] | settings | the opened Settings object, or NULL
[in] | openMode | mode to oprn the settings object
Returns
Acad::eOk for success, or error status otherwise
◆ getVertex()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbSection::getVertex  |  ( |  int  |  idx,
|  AcGePoint3d &  |  vtx
) |   |  const
Returns the position at the specified index.
Parameters
[in] | idx | - idx, the index of the vertex to retrieve the position for
[out] | vtx | - the section point at specified index
Returns
Acad::ErrorStatus - eOk if successful, error status otherwise
◆ getVertices()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbSection::getVertices  |  ( |  AcGePoint3dArray &  |  vertices | ) |   const
Returns the array of vertices.
Parameters
[out] | vertices | - on output, the array of section vertices
Returns
Acad::ErrorStatus - eOk if successful, error status otherwise
◆ hasJogs()
 UX_EXPORT_FUNCTION bool AcDbSection::hasJogs  |  ( |   | ) |   const
Verifies whether this section plane uses one or more jogs.
Returns
bool - true/false
◆ height()
 UX_EXPORT_FUNCTION double AcDbSection::height  |  ( |  AcDbSection::Height  |  type | ) |   const
Returns the section's height value for specified height type.
Parameters
[in] | type | of height
Returns
section height value
◆ indicatorFillColor()
 UX_EXPORT_FUNCTION AcCmColor AcDbSection::indicatorFillColor  |  ( |   | ) |   const
Returns the indicator fill color for this section.
Returns
color
◆ indicatorTransparency()
 UX_EXPORT_FUNCTION int AcDbSection::indicatorTransparency  |  ( |   | ) |   const
Returns the indicator transparency percentage for this section.
Returns
transparency percentage in range 1 to 100 (100 is completely opaque)
◆ isLiveSectionEnabled()
 UX_EXPORT_FUNCTION bool AcDbSection::isLiveSectionEnabled  |  ( |   | ) |   const
Verifies whether this AcDbSection entity is defined as a "Live Section".
Returns
bool - true/false, indicating whether this section entity is set as a "Live Section"
◆ isSlice()
 UX_EXPORT_FUNCTION bool AcDbSection::isSlice  |  ( |   | ) |   const
Returns whether this AcDbSection is defined as a slicing section (kBoundary, no jogs)
Returns
bool - true/false
◆ normal()
 UX_EXPORT_FUNCTION AcGeVector3d AcDbSection::normal  |  ( |   | ) |   const
Returns the normal vector for this AcDbSection entity.
Returns
AcGeVector3d - the normal vector of the section plane (normalised)
◆ numVertices()
 UX_EXPORT_FUNCTION int AcDbSection::numVertices  |  ( |   | ) |   const
Returns the number of actual vertices, used by this AcDbSectionentity.
Returns
int - the number of vertices used
◆ plane()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbSection::plane  |  ( |  AcGeVector3d &  |  xDir,
|  AcGeVector3d &  |  yDir
) |   |  const
Returns the section plane by its X/Y vectors, from first section segment.
Parameters
[out] | xDir | - X direction vector (normalised), at the first vertex
[out] | yDir | - Y direction vector (normalised), at the first vertex
Returns
Acad::ErrorStatus - eOk if successful, error status otherwise
◆ removeVertex()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbSection::removeVertex  |  ( |  int  |  idx | )
Removes the specified vertex from the vertices array; @idx must be larger than 0 and less then the number of vertices.
Parameters
[in] | idx | - idx, the index to insert the vertex
[in] | vtx | - the vertex point to be inserted
Returns
Acad::ErrorStatus - eOk if successful, error status otherwise
◆ sectionPlaneOffset()
 UX_EXPORT_FUNCTION double AcDbSection::sectionPlaneOffset  |  ( |   | ) |   const
Return the offset of the section plane at the first segment (distance between section plane to the parallel plane passing through the WCS origin).
Returns
double - the section plane offset
◆ setBottomPlane()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbSection::setBottomPlane  |  ( |  double  |  bottomDist | )
Assigns the bottom plane distance.
Parameters
[in] | bottomDist | - the bottom plane distance to be assigned
Returns
Acad::ErrorStatus - eOk if successful, error status otherwise
◆ setElevation()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbSection::setElevation  |  ( |  double  |  elev | )
Assigns the elevation value for this AcDbSection entity.
Parameters
[int] | elev - the elevation to be assigned
Returns
Acad::ErrorStatus - eOk if successful, error status otherwise
◆ setHeight()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbSection::setHeight  |  ( |  AcDbSection::Height  |  type,
|  double  |  val
)
Sets the sections' height value for the specified height type.
Parameters
[in] | type | of height
[in] | val | the height value
Returns
Acad::eOk if successful, error status otherwise
◆ setIndicatorFillColor()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbSection::setIndicatorFillColor  |  ( |  const AcCmColor &  |  color | )
Sets the indicator fill color for this section.
Parameters
[in] | color | fill color
Returns
Acad::eOk if successfull, error code otherwise
◆ setIndicatorTransparency()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbSection::setIndicatorTransparency  |  ( |  int  |  transparency | )
Sets the indicator transparency percentage for this section.
Parameters
[in] | transparency | percentage in range 1 to 100 (100 is completely opaque)
Returns
Acad::eOk if successfull, error code otherwise
◆ setIsSlice()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbSection::setIsSlice  |  ( |  bool  |  isSlice | )
Defines this AcDbSection to be a slicing section (kBoundary, no jogs)
Parameters
[in] | isSlice | - true/false
Returns
Acad::ErrorStatus - eOk if successful, error status otherwise
Date
2020-04-09 torstenm created
◆ setName()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbSection::setName  |  ( |  const ACHAR *  |  name | )
Assigns the specified name to this AcDbSection entity.
Parameters
[in] | name | - the name to be assigned
Returns
Acad::ErrorStatus - eOk if successful, error status otherwise
◆ setSectionPlaneOffset()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbSection::setSectionPlaneOffset  |  ( |  double  |  offset | )
Assigns the offset of the section plane at the first segment (distance between section plane to the parallel plane passing through the WCS origin).
Parameters
[in] | offset | - the section plane offset (to parallel plane through WCS origin)
Returns
Acad::ErrorStatus - eOk if successful, error status otherwise
◆ setState()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbSection::setState  |  ( |  State  |  st | )
Sets this section's state.
Parameters
[in] | st | state to set
Returns
Acad::eOk if successful
◆ setThicknessDepth()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbSection::setThicknessDepth  |  ( |  double  |  thickness | )
Assigns the thickness depth for this AcDbSection entity (valid for "slicing" [kBoundary] type).
Parameters
[in] | thickness | - the slicing thickness
Returns
Acad::ErrorStatus - eOk if successful, error status otherwise
Date
2020-04-09 torstenm created
◆ setTopPlane()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbSection::setTopPlane  |  ( |  double  |  topDist | )
Assigns the top plane distance.
Parameters
[in] | topDist | - the top plane distance to be assigned
Returns
Acad::ErrorStatus - eOk if successful, error status otherwise
◆ setVertex()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbSection::setVertex  |  ( |  int  |  idx,
|  const AcGePoint3d &  |  vtx
)
Specifies the position at the specified index.
Parameters
[in] | idx | - idx, the index of the vertex to be assigned
[in] | vtx | - the position for the specified vertex
Returns
Acad::ErrorStatus - eOk if successful, error status otherwise
◆ setVerticalDirection()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbSection::setVerticalDirection  |  ( |  const AcGeVector3d &  |  verticalDir | )
Assigns the vertical direction for this section.
Parameters
[in] | verticalDir | - the vertical direction, should be perpendicular to the section line.
Returns
Acad::eOk if successfull, error code otherwise
◆ setVertices()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbSection::setVertices  |  ( |  const AcGePoint3dArray &  |  vertices | )
Assigns the entire array of vertices to this AcDbSection entity.
Parameters
[in] | vertices | - the array of section vertices to be used
Returns
Acad::ErrorStatus - eOk if successful, error status otherwise
◆ setViewingDirection()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbSection::setViewingDirection  |  ( |  const AcGeVector3d &  |  viewingDir | )
Assigns the viewing direction for this section.
Parameters
[in] | viewingDir | - the viewing direction, should be perpendicular to the plane of the first segment
Returns
Acad::eOk if successfull, error code otherwise
◆ state()
 UX_EXPORT_FUNCTION AcDbSection::State AcDbSection::state  |  ( |   | ) |   const
Gets this section's state.
Returns
section state
◆ subClose()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbSection::subClose  |  ( |   | )
virtual
See also
AcDbEntity::subClose()
Reimplemented from AcDbObject.
◆ subGetGeomExtents()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbSection::subGetGeomExtents  |  ( |  AcDbExtents &  |  resultBox | ) |   const
protectedvirtual
See also
AcDbEntity::getGeomExtents(AcDbExtents&)
Reimplemented from AcDbEntity.
◆ subGetGripPoints()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbSection::subGetGripPoints  |  ( |  AcDbGripDataPtrArray &  |  gripArray,
|  const double  |  sizeOfDrawingUnit,
|  const int  |  pixelSize,
|  const AcGeVector3d &  |  DirectionVector,
|  const int  |  gripBitmap
) |   |  const
protectedvirtual
See also
AcDbEntity::subGetGripPoints(AcDbGripDataPtrArray&, const double, const int, const AcGeVector3d&, const int)
Reimplemented from AcDbEntity.
◆ subGetOsnapPoints()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbSection::subGetOsnapPoints  |  ( |  AcDb::OsnapMode  |  mode,
|  Adesk::GsMarker  |  subEntSelectMarker,
|  const AcGePoint3d &  |  pickedPnt,
|  const AcGePoint3d &  |  lastSelectedPnt,
|  const AcGeMatrix3d &  |  matrix,
|  AcGePoint3dArray &  |  snapIOArray,
|  AcDbIntArray &  |  idArray
) |   |  const
protectedvirtual
See also
AcDbEntity::getOsnapPoints(AcDb::OsnapMode, Adesk::GsMarker, const AcGePoint3d&, const AcGePoint3d&, const AcGeMatrix3d&, AcGePoint3dArray&, AcDbIntArray&)
Reimplemented from AcDbEntity.
◆ subList()
 UX_EXPORT_FUNCTION void AcDbSection::subList  |  ( |   | ) |   const
protectedvirtual
See also
AcDbEntity::list()
Reimplemented from AcDbEntity.
◆ subMoveGripPointsAt()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbSection::subMoveGripPointsAt  |  ( |  const AcDbVoidPtrArray &  |  gripPonterArray,
|  const AcGeVector3d &  |  translationVector,
|  const int  |  bitmap
)
protectedvirtual
See also
AcDbEntity::subMoveGripPointsAt(const AcDbVoidPtrArray&, const AcGeVector3d&, const int)
Reimplemented from AcDbEntity.
◆ subTransformBy()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbSection::subTransformBy  |  ( |  const AcGeMatrix3d &  |  matrix | )
protectedvirtual
See also
AcDbEntity::transformBy(const AcGeMatrix3d&)
Reimplemented from AcDbEntity.
◆ subWorldDraw()
 UX_EXPORT_FUNCTION Adesk::Boolean AcDbSection::subWorldDraw  |  ( |  AcGiWorldDraw *  |  pAcWd | )
protectedvirtual
See also
AcDbEntity::worldDraw(AcGiWorldDraw*)
Reimplemented from AcDbEntity.
◆ thicknessDepth()
 UX_EXPORT_FUNCTION double AcDbSection::thicknessDepth  |  ( |   | ) |   const
Return the thickness depth for this AcDbSection entity (valid for "slicing" [kBoundary] type).
Returns
double - the thickness depth, if this section is of "slicing" type (kBoundary), otherwise 0.0
◆ topPlane()
 UX_EXPORT_FUNCTION double AcDbSection::topPlane  |  ( |   | ) |   const
Returns the top plane distance.
Returns
double - the top plane distance
◆ verticalDirection()
 UX_EXPORT_FUNCTION AcGeVector3d AcDbSection::verticalDirection  |  ( |   | ) |   const
Returns the vertical direction for this section.
Returns
the vertical direction vector if successfull, or AcGeVector3d::kIdentity otherwise
◆ viewingDirection()
 UX_EXPORT_FUNCTION AcGeVector3d AcDbSection::viewingDirection  |  ( |   | ) |   const
Returns the viewing direction for this section.
Returns
the viewing direction vector if successfull, or AcGeVector3d::kIdentity otherwise
Member Data Documentation
◆ AcDbSection
 UX_EXPORT_FUNCTION AcDbSection::AcDbSection
Default constructor.
Constructor, using definition points, normal and view direction.
Constructor, using definition points and normal.