Public Member Functions | List of all members
AcDbCustomOsnapMode Class Referenceabstract
_ More...
#include <AcDbCustomOsnapMode.h>
 Public Member Functions
 virtual const AcRxClass *  | entityOsnapClass () const =0
 virtual const ACHAR *  | globalModeString () const =0
 virtual AcGiGlyph *  | glyph () const =0
 virtual const ACHAR *  | localModeString () const =0
 virtual const ACHAR *  | tooltipString () const =0
Detailed Description
_