Public Member Functions | Static Public Member Functions | List of all members
AcDbAssocDependency Class Reference
 Public Member Functions
 AcDbAssocDependency  | AcDbAssocDependency ()
Default constructor.
Acad::ErrorStatus  | attachToObject (const AcDbCompoundObjectId &)
Attaches this dependency to the given compound object as a previous reactor and inserts it at the position in the list of dependencies, based on the value returned by the order() method. More...
void  | copied (const AcDbObject *, const AcDbObject *) override
Notification callback for OdDbObject::copied(). More...
 AcDbAssocEvaluationCallback *  | currentEvaluationCallback () const
Returns the current evaluation callback set, or NULL if no action evaluation is in progress.
 AcDbObjectId  | dependencyBody () const
Returns an object ID of the associated dependency body object derived object owned by this dependency or kNull if dependencies are not set for this object.
 AcDbObjectId  | dependentOnObject () const
Returns an object ID of the object is attached to this dependency as a persistent reactor.
Acad::ErrorStatus  | dependentOnObjectStatus () const
Returns the current status of the object which is dependent upon this dependency. More...
Acad::ErrorStatus  | detachFromObject ()
Detaches this dependency from an object to which it is currently attached. More...
void  | erased (const AcDbObject *, Adesk::Boolean=true) override
Notification callback for OdDbObject::erased(). More...
void  | evaluate ()
Updates "dirty" dependencies. More...
Acad::ErrorStatus  | getDependentOnCompoundObject (AcDbCompoundObjectId &) const
Gets an object ID of the compound object which is attached to as a persistent reactor. More...
bool  | hasCachedValue () const
Checks whether the dependency has cached the value of the depended-on object. More...
bool  | isActionEvaluationInProgress () const
Checks whether the system is currently evaluating an action or a network of actions. More...
 bool  | isAttachedToObject () const
bool  | isDelegatingToOwningAction () const
Checks whether a dependency method delegates to the action which owns the dependency if the dependency does not have implementation of this method. More...
bool  | isDependentOnCompoundObject () const
Checks whether this dependency is used a compound object to refer to the depended-on object. More...
 bool  | isDependentOnObjectReadOnly () const
 bool  | isDependentOnTheSameThingAs (const AcDbAssocDependency *) const
 bool  | isEqualTo (const AcDbAssocDependency *) const
bool  | isObjectStateDependent () const
Checks whether the action owning this dependency requires the depended-on object to be expected the object state relative to the list of dependencies on the object before the action to be evaluated. More...
bool  | isReadDependency () const
Checks whether the action owning this dependency uses the value of a depended-on object only for reading, that is, the dependency has the read-only status. More...
bool  | isRelevantChange () const
Checks whether the changes are relevant to the depended-on object for this dependency type. More...
bool  | isWriteDependency () const
Checks whether the action owning this dependency modifies the value of a depended-on object, that is, the dependency has the read-write status. More...
void  | modified (const AcDbObject *) override
Notification callback for OdDbObject::modified(). More...
 AcDbObjectId  | nextDependencyOnObject () const
Returns an object ID of the next dependency in the ordered list of attached dependencies.
 Acad::ErrorStatus  | notification (AcDbAssocNotificationData *)
 int  | order () const
Returns the position of the dependency order.
 AcDbObjectId  | owningAction () const
 AcDbObjectId  | prevDependencyOnObject () const
Returns an object ID of the previous dependency in the ordered list of attached dependencies.
Acad::ErrorStatus  | setDependencyBody (const AcDbObjectId &)
Sets the object ID for this dependency body. More...
void  | setDependentOnObject (const AcDbCompoundObjectId &)
Sets the dependent-on object for this dependency using the given compound object. More...
void  | setIsDelegatingToOwningAction (bool)
Switches the option which indicates whether some dependency methods delegate to the action that owns the dependency if the dependency does not have implementation of this method. More...
void  | setIsObjectStateDependent (bool)
Switches the evaluation of the owning action depend on the state of the depended-on object. More...
void  | setIsReadDependency (bool)
Switches the read status for this dependency. More...
void  | setIsWriteDependency (bool)
Switches the write status for this dependency. More...
void  | setOrder (int)
Sets the order for this dependency. More...
Acad::ErrorStatus  | setOwningAction (const AcDbObjectId &)
Sets the owning action for this dependency using the given object ID. More...
Acad::ErrorStatus  | setStatus (AcDbAssocStatus, bool=true)
Sets the status for this dependency. More...
 AcDbAssocStatus  | status () const
Returns the current status of this dependency.
 Acad::ErrorStatus  | transferToObject (const AcDbCompoundObjectId &)
Acad::ErrorStatus  | updateDependentOnObject ()
Updates the object which this dependency depends on, based on the information obtained from the owning action. More...
 Public Member Functions inherited from AcDbObject
virtual Acad::ErrorStatus  | addPersistentReactor (AcDbObjectId)
Adds a persistent reactor to this object reactor list. More...
Acad::ErrorStatus  | addReactor (AcDbObjectReactor *) const
Adds a transient reactor to this object. More...
virtual Acad::ErrorStatus  | applyPartialUndo (AcDbDwgFiler *, AcRxClass *)
This function is called during Undo operations on objects, that use the 'Partial Undo meachanism'; this is, this object is opened with assertWriteEnabled(Adesk::kFalse) to indicate that custom Undo filing is used rather than the default Undo filing. More...
 void  | assertNotifyEnabled () const
 void  | assertReadEnabled () const
 void  | assertWriteEnabled (Adesk::Boolean=Adesk::kTrue, Adesk::Boolean=Adesk::kTrue)
virtual Acad::ErrorStatus  | audit (AcDbAuditInfo *)
Performs the audit operation for this object. More...
Acad::ErrorStatus  | cancel ()
Reverts all changes since the object had been opened and closes the object. More...
virtual void  | cancelled (const AcDbObject *)
A handler function for persistent reactors. More...
virtual AcRxObject *  | clone () const
Creates a shallow clone of this object. More...
Acad::ErrorStatus  | close ()
Closes the object. More...
Acad::ErrorStatus  | closeAndPage (Adesk::Boolean=Adesk::kTrue)
Closes the object. More...
virtual Acad::ErrorStatus  | composeForLoad (AcDb::OdaSaveType, AcDb::AcDbDwgVersion)
This function is intended for future MT file loading support. More...
virtual void  | copied (const AcDbObject *, const AcDbObject *)
A handler function for persistent reactors. More...
virtual Acad::ErrorStatus  | copyFrom (const AcRxObject *)
Copies the pSrc object information in this object. More...
Acad::ErrorStatus  | createExtensionDictionary ()
Creates a dictionary as extension dictionary for this object. More...
AcDbDatabase *  | database () const
Returns the database that contains this object. More...
virtual Acad::ErrorStatus  | decomposeForSave (AcDb::AcDbDwgVersion, AcDbObject *&, AcDbObjectId &, Adesk::Boolean &)
This function is called during dwg and dxf output, to allow a custom object to decompose itself, due to provided dwg/dxf target file version. More...
virtual Acad::ErrorStatus  | deepClone (AcDbObject *, AcDbObject *&, AcDbIdMapping &, Adesk::Boolean=Adesk::kTrue) const final
Clones this object, appends it to the owner pOwner and adds an AcDbIdPair record to the idMap. More...
void  | disableUndoRecording (Adesk::Boolean)
Disables or enables the undo recording for the object. More...
Acad::ErrorStatus  | downgradeOpen ()
Sets the open mode for an object opened for write to be opened for read. More...
Acad::ErrorStatus  | downgradeToNotify (Adesk::Boolean)
Sets the open mode for an object opened for write to be opened for notify. More...
virtual AcGiDrawable *  | drawable ()
Retrieves the AcGiDrawable instance of this object. More...
Acad::ErrorStatus  | dwgIn (AcDbDwgFiler *)
Calls the object's dwgInFields function, and reads any XData if present. More...
virtual Acad::ErrorStatus  | dwgInFields (AcDbDwgFiler *)
Reads the object from the DWG filer. More...
Acad::ErrorStatus  | dwgOut (AcDbDwgFiler *) const
Calls the object's dwgOutFields function, and writes any XData if present. More...
virtual Acad::ErrorStatus  | dwgOutFields (AcDbDwgFiler *) const
Writes the object to the DWG filer. More...
Acad::ErrorStatus  | dxfIn (AcDbDxfFiler *)
Calls the object's dxfInFields function, and reads any XData if present. More...
virtual Acad::ErrorStatus  | dxfInFields (AcDbDxfFiler *)
Reads the object from the DXF filer. More...
Acad::ErrorStatus  | dxfOut (AcDbDxfFiler *, Adesk::Boolean, Adesk::uchar *) const
Calls the object's dxfOutFields function, and writes any XData if present. More...
virtual Acad::ErrorStatus  | dxfOutFields (AcDbDxfFiler *) const
Writes the object to the DXF filer. More...
Acad::ErrorStatus  | erase (Adesk::Boolean=Adesk::kTrue)
Sets the bit that indicates that the object is erased. More...
virtual void  | erased (const AcDbObject *, Adesk::Boolean)
A handler function for persistent reactors. More...
AcDbObjectId  | extensionDictionary () const
Returns the object id of the extension dictionary for this object. More...
void  | getAcDbHandle (AcDbHandle &) const
Returns handle of this object. More...
Acad::ErrorStatus  | getBinaryData (const ACHAR *, Adesk::Int32 &, char *&) const
Creates a copy of the binary data stored as chunks of maximum 127 bytes in the resbuf chain of this object's extension dictionary xrecord entry given by entryName. More...
int  | getBrxOpenCount () const
This function returns the number of open BRX instances for this object. More...
int  | getBrxOpenState () const
This function returns the BRX object open state flags as bitfields, for diagnostic purpose. More...
virtual Acad::ErrorStatus  | getClassID (CLSID *) const final
Gets the COM wrapper Class ID for this entity. More...
int  | getCustomObjectState () const
This function returns the custom object status : 1=isCustomObject 2=DifferentialUndoDisabled. More...
Acad::ErrorStatus  | getField (const ACHAR *, AcDbField *&, AcDb::OpenMode) const
Retrieves the specified Field from this object, and opens it in mode. More...
Acad::ErrorStatus  | getField (const ACHAR *, AcDbObjectId &) const
Gets the pszPropName field object from field dictionary of this AcDbObject object, using pszPropName as key. More...
AcDbObjectId  | getFieldDictionary () const
Returns the Field dictionary associated with this object,. More...
Acad::ErrorStatus  | getFieldDictionary (AcDbDictionary *&, AcDb::OpenMode) const
Gets and opens the field dictionary for this. More...
Acad::ErrorStatus  | getObjectBirthVersion (AcDb::AcDbDwgVersion &, AcDb::MaintenanceReleaseVersion &)
This function is currently not supported by the CAD engine, always returns Acad::eOk, and 'kDHL_CURRENT' + 'kMReleaseCurrent' results. More...
virtual Acad::ErrorStatus  | getObjectSaveVersion (const AcDbDwgFiler *, AcDb::AcDbDwgVersion &, AcDb::MaintenanceReleaseVersion &)
Returns the DWG version for saving the object. More...
virtual Acad::ErrorStatus  | getObjectSaveVersion (const AcDbDxfFiler *, AcDb::AcDbDwgVersion &, AcDb::MaintenanceReleaseVersion &)
Returns the DWG version for saving the object. More...
int  | getOdaOpenCount () const
This function returns the number of open ODA instances for this object. More...
int  | getOdaOpenState () const
This function returns the ODA object open state flags as bitfields, for diagnostic purpose. More...
virtual void  | goodbye (const AcDbObject *)
A handler function for persistent reactors. More...
Acad::ErrorStatus  | handOverTo (AcDbObject *, Adesk::Boolean=Adesk::kTrue, Adesk::Boolean=Adesk::kTrue)
Hands over objects identity to another object. More...
bool  | hasFields () const
Return true if this object has single or multiple fields associated with him. More...
bool  | hasPersistentReactor (AcDbObjectId) const
Checks the input objectId in this object reactor list. More...
bool  | hasSaveVersionOverride ()
This function indicates whether this object overrides the filer's save version. More...
virtual AcDbObjectId  | id () const
Returns the database id of this object. More...
Adesk::Boolean  | isAcDbObjectIdsInFlux () const
Checks whether a deep clone operation was completed. More...
Adesk::Boolean  | isAProxy () const
Adesk::Boolean  | isCancelling () const
Adesk::Boolean  | isErased () const
Returns whether this object is erased. More...
Adesk::Boolean  | isEraseStatusToggled () const
Checks whether the object erase status has been toggled. More...
Adesk::Boolean  | isModified () const
Returns whether this object's assertWriteEnabled() has been called since it was opened. More...
Adesk::Boolean  | isModifiedGraphics () const
Checks whether this object graphics will be updated when the object is closed. More...
Adesk::Boolean  | isModifiedXData () const
Checks whether this object's xData was modified. More...
Adesk::Boolean  | isNewObject () const
Returns true if and only if this object has not been closed since it was created. More...
Adesk::Boolean  | isNotifyEnabled () const
Returns whether this object is opened for notify. More...
Adesk::Boolean  | isNotifying () const
virtual Adesk::Boolean  | isPersistent () const
Returns the 'persistent' status of a database object. More...
Adesk::Boolean  | isReadEnabled () const
Returns whether this object is opened for read. More...
 Adesk::Boolean  | isReallyClosing () const
Checks whether the next close call will completely close this object return true if on the next call the object will be completely closed false otherwise.
Adesk::Boolean  | isTransactionResident () const
Gets the object transaction status. More...
Adesk::Boolean  | isUndoing () const
bool  | isUndoRecordingDisabled () const
Returns whether the undo recording for the object is enabled or not. More...
Adesk::Boolean  | isWriteEnabled () const
Returns whether this object is opened for write. More...
virtual AcDb::DuplicateRecordCloning  | mergeStyle () const
Returns the object's merge behavior during cloning. More...
virtual void  | modified (const AcDbObject *)
A handler function for persistent reactors. More...
virtual void  | modifiedGraphics (const AcDbEntity *)
A handler function for persistent reactors. More...
virtual void  | modifiedXData (const AcDbObject *)
A handler function for persistent reactors. More...
virtual void  | modifyUndone (const AcDbObject *)
A handler function for persistent reactors. More...
virtual void  | objectClosed (const AcDbObjectId)
A handler function for persistent reactors. More...
AcDbObjectId  | objectId () const
Returns object id. More...
virtual void  | openedForModify (const AcDbObject *)
A handler function for persistent reactors. More...
AcDbObjectId  | ownerId () const
Returns object id of the owner. More...
AcDbVoidPtrArray *  | reactors ()
Gets the object pointers to reactors. More...
const AcDbVoidPtrArray *  | reactors () const
Gets the object pointers to reactors. More...
virtual void  | reappended (const AcDbObject *)
A handler function for persistent reactors. More...
 virtual void  | recvPropagateModify (const AcDbObject *)
Not implemented yet.
Acad::ErrorStatus  | releaseExtensionDictionary ()
Removes the extension dictionary associated with this object. More...
virtual Acad::ErrorStatus  | removeField (AcDbObjectId)
Removes the Field specified by acFieldId from this object. More...
virtual Acad::ErrorStatus  | removeField (const ACHAR *)
Removes the Field specified by szKeyString from this object. More...
virtual Acad::ErrorStatus  | removeField (const ACHAR *, AcDbObjectId &)
Removes the Field specified by acPszKeyString from this object, and returns its ObjectId value. More...
virtual Acad::ErrorStatus  | removePersistentReactor (AcDbObjectId)
Removes a persistent reactor from this object reactor list. More...
Acad::ErrorStatus  | removeReactor (AcDbObjectReactor *) const
Removes a transient reactor to this object. More...
void  | setAcDbObjectIdsInFlux ()
Call this function to indicate that the object IDs of this object and its sub-objects (if any) are not yet valid. More...
Acad::ErrorStatus  | setBinaryData (const ACHAR *, Adesk::Int32, const char *)
Creates a copy of the binary data, divides it in up to 127 bytes binary chunks and
 sets them as resbufs in the resbuf chain of this object's extension dictionary xrecord entry given by entryName. More...
virtual Acad::ErrorStatus  | setField (const ACHAR *, AcDbField *, AcDbObjectId &)
Adds the pAcField field object to field dictionary of this AcDbObject object, using pKey as key. More...
void  | setHasSaveVersionOverride (bool)
This function can be called to specify that the object has a "save version override". More...
virtual Acad::ErrorStatus  | setOwnerId (AcDbObjectId)
Sets the ownerId data member of the object to be objId. More...
virtual Acad::ErrorStatus  | setXData (const resbuf *)
Sets/removes xData associated with this object. More...
virtual Acad::ErrorStatus  | subCancel ()
Possibility to veto a cancel operation from within custom entities. More...
virtual Acad::ErrorStatus  | subClose ()
virtual Acad::ErrorStatus  | subErase (Adesk::Boolean)
This hook is called during an AcDbObject::erase call, before any actual erase operation is performed. More...
 virtual Acad::ErrorStatus  | subHandOverTo (AcDbObject *)
virtual void  | subObjModified (const AcDbObject *, const AcDbObject *)
A handler function for persistent reactors. More...
 virtual Acad::ErrorStatus  | subOpen (AcDb::OpenMode)
virtual Acad::ErrorStatus  | subSwapIdWith (AcDbObjectId, Adesk::Boolean=Adesk::kFalse, Adesk::Boolean=Adesk::kFalse)
This hook is called during an AcDbObject::swapIdWith() call, before any actual swap operation is performed. More...
Acad::ErrorStatus  | swapIdWith (AcDbObjectId, Adesk::Boolean=Adesk::kFalse, Adesk::Boolean=Adesk::kFalse)
Swaps the object id's between the object identified by param swapId and this object. More...
virtual Acad::ErrorStatus  | swapReferences (const AcDbIdMapping &)
Not implemented yet. More...
virtual void  | unappended (const AcDbObject *)
A handler function for persistent reactors. More...
AcDbDwgFiler *  | undoFiler ()
Gets the undo filer for this object. More...
Acad::ErrorStatus  | upgradeFromNotify (Adesk::Boolean &)
Upgrades the open status of this object to AcDb::kForWrite, if this object is already open (either in AcDb::kForRead, AcDb::kForNotify or AcDb::kForWrite) More...
Acad::ErrorStatus  | upgradeOpen ()
Changes the objects open mode to AcDb::kForWrite and sends notifications. More...
virtual Acad::ErrorStatus  | wblockClone (AcRxObject *, AcDbObject *&, AcDbIdMapping &, Adesk::Boolean=Adesk::kTrue) const final
Clones this object, appends it to the owner pOwner and adds an AcDbIdPair record to the idMap. More...
virtual resbuf *  | xData (const ACHAR *=NULL) const
Returns the xData associated with this object. More...
Acad::ErrorStatus  | xDataTransformBy (const AcGeMatrix3d &)
Transforms the extended data according to parameter transformation matrix. More...
 virtual void  | xmitPropagateModify () const
Not implemented yet.
 virtual  | ~AcDbObject ()
Destructor.
 Public Member Functions inherited from AcGiDrawable
virtual bool  | bounds (AcDbExtents &) const
virtual DrawableType  | drawableType () const
 virtual AcGiDrawStream *  | drawStream () const
 AcGsNode *  | gsNode () const
virtual AcDbObjectId  | id () const =0
virtual Adesk::Boolean  | isPersistent () const =0
virtual Adesk::UInt32  | regenSupportFlags () const final
Returns whether and to which level this object supports MultiThreading. More...
 virtual Adesk::Boolean  | RolloverHit (Adesk::ULongPtr, Adesk::ULongPtr, Adesk::Boolean)
 virtual Adesk::UInt32  | setAttributes (AcGiDrawableTraits *) final
 virtual void  | setDrawStream (AcGiDrawStream *)
 void  | setGsNode (AcGsNode *)
 virtual void  | viewportDraw (AcGiViewportDraw *) final
 virtual Adesk::UInt32  | viewportDrawLogicalFlags (AcGiViewportDraw *) final
 virtual Adesk::Boolean  | worldDraw (AcGiWorldDraw *) final
 Public Member Functions inherited from AcRxObject
virtual AcRxObject *  | clone () const
Exported and implemented. More...
 virtual AcRx::Ordering  | comparedTo (const AcRxObject *) const
Exported and implemented.
virtual Acad::ErrorStatus  | copyFrom (const AcRxObject *)
Exported and implemented. More...
 virtual AcRxClass *  | isA () const
Exported and implemented.
virtual Adesk::Boolean  | isEqualTo (const AcRxObject *) const
Exported and implemented. More...
bool  | isKindOf (const AcRxClass *) const
Checks the object class. More...
AcRxObject *  | queryX (const AcRxClass *) const
returns the protocol extension object assigned to this class or a parent class. More...
AcRxObject *  | x (const AcRxClass *) const
returns the protocol extension object assigned to this class or a parent class. More...
 virtual  | ~AcRxObject ()
Destructor.
 Static Public Member Functions
static Acad::ErrorStatus  | getDependenciesOnObject (const AcDbObject *, bool, bool, AcDbObjectIdArray &)
Gets all dependency objects that are dependent on the given object. More...
static Acad::ErrorStatus  | getFirstDependencyOnObject (const AcDbObject *, AcDbObjectId &)
Gets an object ID of the dependency object that is first in the list of dependencies attached to the given object. More...
static Acad::ErrorStatus  | notifyDependenciesOnObject (const AcDbObject *, AcDbAssocStatus)
Notifies all dependencies on the given object which has changed by setting the dependency status. More...
 Static Public Member Functions inherited from AcRxObject
 static AcRxObject *  | cast (const AcRxObject *)
 static AcRxClass *  | desc ()
Exported and implemented.
 Static Public Member Functions inherited from AcHeapOperators
 static void  | operator delete (void *)
_
 static void  | operator delete (void *, const char *, int)
 static void  | operator delete (void *, void *)
 static void  | operator delete[] (void *)
_
 static void  | operator delete[] (void *, const char *, int)
 static void *  | operator new (size_t)
_
 static void *  | operator new (size_t, const char *, int)
 static void *  | operator new (size_t, void *p)
 static void *  | operator new[] (size_t)
_
 static void *  | operator new[] (size_t, const char *, int)
 Additional Inherited Members
 Public Types inherited from AcGiDrawable
enum  | DrawableType {
 kGeometry = 0 , kDistantLight , kPointLight , kSpotLight ,
 kAmbientLight , kSolidBackground , kGradientBackground , kImageBackground ,
 kGroundPlaneBackground , kViewport
 }
enum  | SetAttributesFlags {
 kDrawableNone = 0 , kDrawableIsAnEntity = 1 , kDrawableUsesNesting = 2 , kDrawableIsCompoundObject = 4 ,
 kDrawableViewIndependentViewportDraw = 8 , kDrawableIsInvisible = 16 , kDrawableHasAttributes = 32 , kDrawableRegenTypeDependentGeometry = 64 ,
 kDrawableIsDimension = 133 , kDrawableRegenDraw = 256 , kDrawableStandardDisplaySingleLOD = 512 , kDrawableShadedDisplaySingleLOD = 1024 ,
 kDrawableViewDependentViewportDraw = 2048 , kDrawableBlockDependentViewportDraw = 4096 , kDrawableIsExternalReference = 8192 , kDrawableNotPlottable = 16384 ,
 kDrawableNotAllowLCS = 32768 , kDrawableMergeControlOff = 65536 , kThreadedWorldDrawViewportDraw = 131072
 }
 Protected Member Functions inherited from AcDbObject
virtual Acad::ErrorStatus  | subDeepClone (AcDbObject *, AcDbObject *&, AcDbIdMapping &, Adesk::Boolean=true) const
virtual Acad::ErrorStatus  | subGetClassID (CLSID *) const
virtual Adesk::UInt32  | subSetAttributes (AcGiDrawableTraits *)
Sets the values of this object's subentity traits and returns with the calling object's subentity traits. More...
virtual void  | subViewportDraw (AcGiViewportDraw *)
virtual Adesk::UInt32  | subViewportDrawLogicalFlags (AcGiViewportDraw *)
virtual Acad::ErrorStatus  | subWblockClone (AcRxObject *, AcDbObject *&, AcDbIdMapping &, Adesk::Boolean=true) const
virtual Adesk::Boolean  | subWorldDraw (AcGiWorldDraw *)
 Protected Member Functions inherited from AcGiDrawable
virtual Adesk::UInt32  | subRegenSupportFlags () const
Returns whether and to which level this object supports MultiThreading. More...
virtual Adesk::UInt32  | subSetAttributes (AcGiDrawableTraits *)=0
virtual void  | subViewportDraw (AcGiViewportDraw *)=0
 virtual Adesk::UInt32  | subViewportDrawLogicalFlags (AcGiViewportDraw *)
virtual Adesk::Boolean  | subWorldDraw (AcGiWorldDraw *)=0
 Protected Member Functions inherited from AcRxObject
AcRxObject ()
Exported and implemented.
Member Function Documentation
◆ attachToObject()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbAssocDependency::attachToObject  |  ( |  const AcDbCompoundObjectId &  |  idObjectCompound | )
Attaches this dependency to the given compound object as a previous reactor and inserts it at the position in the list of dependencies, based on the value returned by the order() method.
Parameters
[in] | idObjectCompound | - the object id to be attached to the dependency
Returns
Acad::eOk for success, error status otherwise
◆ copied()
 UX_EXPORT_FUNCTION void AcDbAssocDependency::copied  |  ( |  const AcDbObject *  |  pAssocObject,
|  const AcDbObject *  |  pAssocNewObject
)
overridevirtual
Notification callback for OdDbObject::copied().
This method is called when the dependent-on object is copied. Class overriding this callback must call this base implementation in its implementation for proper working of assoc network deep clone operations.
Parameters
[in] | pAssocObject | - the initial object
[in] | pAssocNewObject | - the new copied object
Returns
Reimplemented from AcDbObject.
◆ dependentOnObjectStatus()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbAssocDependency::dependentOnObjectStatus  |  ( |   | ) |   const
Returns the current status of the object which is dependent upon this dependency.
Returns
Acad::eOk for success, error status otherwise
◆ detachFromObject()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbAssocDependency::detachFromObject  |  ( |   | )
Detaches this dependency from an object to which it is currently attached.
This dependency must be currently attached to an object.
Returns
Acad::eOk for success, error status otherwise
◆ erased()
 UX_EXPORT_FUNCTION void AcDbAssocDependency::erased  |  ( |  const AcDbObject *  |  pAssocObject,
|  Adesk::Boolean  |  action = true
)
overridevirtual
Notification callback for OdDbObject::erased().
This method is called when the dependency is erased. This method should not be overridden; it should not be called directly from client code.
Parameters
[in] | pAssocObject | - the object to be evaluated
[in] | action | - true/false to be erased
Returns
Reimplemented from AcDbObject.
◆ evaluate()
 UX_EXPORT_FUNCTION void AcDbAssocDependency::evaluate  |  ( |   | )
Updates "dirty" dependencies.
Returns
◆ getDependenciesOnObject()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbAssocDependency::getDependenciesOnObject  |  ( |  const AcDbObject *  |  pAssocObject,
|  bool  |  readWantedDependencies,
|  bool  |  setWantedDependencies,
|  AcDbObjectIdArray &  |  idDependencies
)
static
Gets all dependency objects that are dependent on the given object.
Parameters
[in] | pAssocObject | - object to be evaluated
[in] | readWantedDependencies | - Wanted dependencies read type
[in] | setWantedDependencies | - Wanted dependencies write type
[out] | idObjectDependency | - object ids of the dependencies
Returns
Acad::eOk for success, error status otherwise
◆ getDependentOnCompoundObject()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbAssocDependency::getDependentOnCompoundObject  |  ( |  AcDbCompoundObjectId &  |  idObjectCompound | ) |   const
Gets an object ID of the compound object which is attached to as a persistent reactor.
Parameters
[in] | idObjectCompound | - AcDbCompoundObjectId object id
Returns
Acad::eOk for success, error status otherwise
◆ getFirstDependencyOnObject()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbAssocDependency::getFirstDependencyOnObject  |  ( |  const AcDbObject *  |  pAssocObject,
|  AcDbObjectId &  |  idObjectDependency
)
static
Gets an object ID of the dependency object that is first in the list of dependencies attached to the given object.
Parameters
[in] | pAssocObject | - object to be evaluated
[out] | idObjectDependency | - object id first dependency
Returns
Acad::eOk for success, error status otherwise
◆ hasCachedValue()
 UX_EXPORT_FUNCTION bool AcDbAssocDependency::hasCachedValue  |  ( |   | ) |   const
Checks whether the dependency has cached the value of the depended-on object.
Returns
true if succeded, false otherwise
◆ isActionEvaluationInProgress()
 UX_EXPORT_FUNCTION bool AcDbAssocDependency::isActionEvaluationInProgress  |  ( |   | ) |   const
Checks whether the system is currently evaluating an action or a network of actions.
Returns
true if succeded, false otherwise
◆ isDelegatingToOwningAction()
 UX_EXPORT_FUNCTION bool AcDbAssocDependency::isDelegatingToOwningAction  |  ( |   | ) |   const
Checks whether a dependency method delegates to the action which owns the dependency if the dependency does not have implementation of this method.
Returns
true if succeded, false otherwise
◆ isDependentOnCompoundObject()
 UX_EXPORT_FUNCTION bool AcDbAssocDependency::isDependentOnCompoundObject  |  ( |   | ) |   const
Checks whether this dependency is used a compound object to refer to the depended-on object.
Returns
true if succeded, false otherwise
◆ isObjectStateDependent()
 UX_EXPORT_FUNCTION bool AcDbAssocDependency::isObjectStateDependent  |  ( |   | ) |   const
Checks whether the action owning this dependency requires the depended-on object to be expected the object state relative to the list of dependencies on the object before the action to be evaluated.
Returns
true if succeded, false otherwise
◆ isReadDependency()
 UX_EXPORT_FUNCTION bool AcDbAssocDependency::isReadDependency  |  ( |   | ) |   const
Checks whether the action owning this dependency uses the value of a depended-on object only for reading, that is, the dependency has the read-only status.
Returns
true if succeded, false otherwise
◆ isRelevantChange()
 UX_EXPORT_FUNCTION bool AcDbAssocDependency::isRelevantChange  |  ( |   | ) |   const
Checks whether the changes are relevant to the depended-on object for this dependency type.
Returns
true if succeded, false otherwise
◆ isWriteDependency()
 UX_EXPORT_FUNCTION bool AcDbAssocDependency::isWriteDependency  |  ( |   | ) |   const
Checks whether the action owning this dependency modifies the value of a depended-on object, that is, the dependency has the read-write status.
Returns
true if succeded, false otherwise
◆ modified()
 UX_EXPORT_FUNCTION void AcDbAssocDependency::modified  |  ( |  const AcDbObject *  |  pAssocObject | )
overridevirtual
Notification callback for OdDbObject::modified().
This method is called when the dependency is modified.
Parameters
[in] | pAssocObject | - the object to be modified
Returns
Reimplemented from AcDbObject.
◆ notifyDependenciesOnObject()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbAssocDependency::notifyDependenciesOnObject  |  ( |  const AcDbObject *  |  pAssocObject,
|  AcDbAssocStatus  |  assocStatus
)
static
Notifies all dependencies on the given object which has changed by setting the dependency status.
Parameters
[in] | pAssocObject | - object dependencies to be notified
[in] | assocStatus | - set the new dependency assoc status
Returns
Acad::eOk for success, error status otherwise
◆ setDependencyBody()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbAssocDependency::setDependencyBody  |  ( |  const AcDbObjectId &  |  idObject | )
Sets the object ID for this dependency body.
Sets the associated dependency body object object owned by this dependency. This object must implement the body of the custom dependency.
Parameters
[in] | idObject | - object id of the dependency object
Returns
Acad::eOk for success, error status otherwise
◆ setDependentOnObject()
 UX_EXPORT_FUNCTION void AcDbAssocDependency::setDependentOnObject  |  ( |  const AcDbCompoundObjectId &  |  idObjectCompound | )
Sets the dependent-on object for this dependency using the given compound object.
Parameters
[in] | idObjectCompound | - the object id whose dependency is taken into account
Returns
◆ setIsDelegatingToOwningAction()
 UX_EXPORT_FUNCTION void AcDbAssocDependency::setIsDelegatingToOwningAction  |  ( |  bool  |  action | )
Switches the option which indicates whether some dependency methods delegate to the action that owns the dependency if the dependency does not have implementation of this method.
Parameters
[in] | action | - true/false to delegate dependencies to the owning actions.
Returns
◆ setIsObjectStateDependent()
 UX_EXPORT_FUNCTION void AcDbAssocDependency::setIsObjectStateDependent  |  ( |  bool  |  action | )
Switches the evaluation of the owning action depend on the state of the depended-on object.
Parameters
[in] | action | - true/false to set the owning action dependent state of the depended-on object.
Returns
◆ setIsReadDependency()
 UX_EXPORT_FUNCTION void AcDbAssocDependency::setIsReadDependency  |  ( |  bool  |  action | )
Switches the read status for this dependency.
Parameters
[in] | action | - true/false to set the read status
Returns
◆ setIsWriteDependency()
 UX_EXPORT_FUNCTION void AcDbAssocDependency::setIsWriteDependency  |  ( |  bool  |  action | )
Switches the write status for this dependency.
Parameters
[in] | action | - true/false to set the write status
Returns
◆ setOrder()
 UX_EXPORT_FUNCTION void AcDbAssocDependency::setOrder  |  ( |  int  |  value | )
Sets the order for this dependency.
Parameters
[in] | value | - sets the value of the order
Returns
◆ setOwningAction()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbAssocDependency::setOwningAction  |  ( |  const AcDbObjectId &  |  idObject | )
Sets the owning action for this dependency using the given object ID.
Parameters
[in] | idObject | - object id of the dependency
Returns
Acad::eOk for success, error status otherwise
◆ setStatus()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbAssocDependency::setStatus  |  ( |  AcDbAssocStatus  |  status,
|  bool  |  action = true
)
Sets the status for this dependency.
If the status equals one of codes indicating that the action owning the dependency will be evaluated.
Parameters
[in] | status | - Set the new dependency assoc status
[in] | action | - if True, notify the owning action
Returns
Acad::eOk for success, error status otherwise
◆ updateDependentOnObject()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbAssocDependency::updateDependentOnObject  |  ( |   | )
Updates the object which this dependency depends on, based on the information obtained from the owning action.
If the dependency owns an dependency body object, its updateDependentOnObject() method is called, otherwise the default implementation of this method does nothing.
Returns
Acad::eOk for success, error status otherwise