Public Member Functions | List of all members
AcDbAssocPersSubentIdPE Class Reference
_ More...
#include <AcDbAssocPersSubentIdPE.h>
 Public Member Functions
 virtual AcDbAssocPersSubentId *  | createNewPersFaceSilhouetteId (AcDbEntity *, AcDbDatabase *, AcRxObject *, const AcDbCompoundObjectId &, const AcDbSubentId &, const AcGeMatrix3d *, AcDbGeometryProjector *, int)
 virtual AcDbAssocPersSubentId *  | createNewPersSubent (AcDbEntity *, AcDbDatabase *, const AcDbCompoundObjectId &, const AcDbSubentId &)
 virtual Acad::ErrorStatus  | getAllSubentities (const AcDbEntity *, AcDb::SubentType, AcDbSubentIdArray &)
 virtual Acad::ErrorStatus  | getAllSubentities (const AcDbEntity *, const AcRxClass *, AcDbSubentIdArray &)
 virtual Acad::ErrorStatus  | getEdgeSubentityGeometry (const AcDbEntity *, const AcDbSubentId &, AcGeCurve3d *&)
 virtual Acad::ErrorStatus  | getEdgeVertexSubentities (const AcDbEntity *, const AcDbSubentId &, AcDbSubentId &, AcDbSubentId &, AcDbSubentIdArray &)
 virtual Acad::ErrorStatus  | getFaceSilhouetteGeometry (AcDbEntity *, AcRxObject *, const AcDbSubentId &, const AcGeMatrix3d *, AcDbGeometryProjector *, AcArray< int > &, AcArray< AcGeCurve3d * > &)
 virtual Acad::ErrorStatus  | getFaceSubentityGeometry (const AcDbEntity *, const AcDbSubentId &, AcGeSurface *&)
 virtual int  | getRigidSetState (const AcDbEntity *)
 virtual Acad::ErrorStatus  | getRigidSetTransform (const AcDbEntity *, AcGeMatrix3d &)
 virtual Acad::ErrorStatus  | getSplineEdgeVertexSubentities (const AcDbEntity *, const AcDbSubentId &, AcDbSubentId &, AcDbSubentId &, AcDbSubentIdArray &, AcDbSubentIdArray &)
 virtual Acad::ErrorStatus  | getSubentGeometryXform (const AcDbEntity *, const AcDbObjectIdArray &, AcGeMatrix3d &) const
 virtual Acad::ErrorStatus  | getSubentityGeometry (const AcDbEntity *, const AcDbSubentId &, AcGeEntity3d *&)
 virtual Acad::ErrorStatus  | getTransientFaceSilhouetteIds (AcDbEntity *, AcDbDatabase *, AcRxObject *, const AcDbSubentId &, const AcGeMatrix3d *, AcDbGeometryProjector *, const AcDbAssocPersSubentId *, AcArray< int > &)
 virtual Acad::ErrorStatus  | getTransientSubentIds (const AcDbEntity *, AcDbDatabase *, const AcDbAssocPersSubentId *, AcDbSubentIdArray &) const
 virtual Acad::ErrorStatus  | getVertexSubentityGeometry (const AcDbEntity *, const AcDbSubentId &, AcGePoint3d &)
 virtual Acad::ErrorStatus  | makePersSubentPurgeable (AcDbEntity *, AcDbDatabase *, const AcDbAssocPersSubentId *, bool)
 virtual Acad::ErrorStatus  | mirrorPersSubent (const AcDbEntity *, AcDbDatabase *, AcDbAssocPersSubentId *)
 virtual Acad::ErrorStatus  | releasePersSubent (AcDbEntity *, AcDbDatabase *, const AcDbAssocPersSubentId *)
 virtual Acad::ErrorStatus  | setEdgeSubentityGeometry (AcDbEntity *, const AcDbSubentId &, const AcGeCurve3d *)
 virtual Acad::ErrorStatus  | setFaceSubentityGeometry (AcDbEntity *, const AcDbSubentId &, const AcGeSurface *)
 virtual Acad::ErrorStatus  | setRigidSetTransform (AcDbEntity *, const AcGeMatrix3d &)
 virtual Acad::ErrorStatus  | setSubentityGeometry (AcDbEntity *, const AcDbSubentId &, const AcGeEntity3d *)
 virtual Acad::ErrorStatus  | setVertexSubentityGeometry (AcDbEntity *, const AcDbSubentId &, const AcGePoint3d &)
 virtual Acad::ErrorStatus  | transferPersSubentToAnotherEntity (AcDbEntity *, AcDbDatabase *, AcDbEntity *, AcDbDatabase *, const AcDbAssocPersSubentId *)
 Public Member Functions inherited from AcRxObject
virtual AcRxObject *  | clone () const
Exported and implemented. More...
 virtual AcRx::Ordering  | comparedTo (const AcRxObject *) const
Exported and implemented.
virtual Acad::ErrorStatus  | copyFrom (const AcRxObject *)
Exported and implemented. More...
 virtual AcRxClass *  | isA () const
Exported and implemented.
virtual Adesk::Boolean  | isEqualTo (const AcRxObject *) const
Exported and implemented. More...
bool  | isKindOf (const AcRxClass *) const
Checks the object class. More...
AcRxObject *  | queryX (const AcRxClass *) const
returns the protocol extension object assigned to this class or a parent class. More...
AcRxObject *  | x (const AcRxClass *) const
returns the protocol extension object assigned to this class or a parent class. More...
 virtual  | ~AcRxObject ()
Destructor.
 Additional Inherited Members
 Static Public Member Functions inherited from AcRxObject
 static AcRxObject *  | cast (const AcRxObject *)
 static AcRxClass *  | desc ()
Exported and implemented.
 Protected Member Functions inherited from AcRxObject
AcRxObject ()
Exported and implemented.
Detailed Description
_