Public Member Functions | List of all members
AcDbGripData Class Reference
_ More...
#include <AcDbGripData.h>
 Public Member Functions
AcDbGripData ()
Default constructor.
AcDbGripData (const AcDbGripData &)
Copy constructor. More...
AcDbGripData (const AcGePoint3d &, void *, AcRxClass *, GripOperationPtr=NULL, GripOperationPtr=NULL, GripRtClkHandler=NULL, GripWorldDrawPtr wd=NULL, GripViewportDrawPtr=NULL, GripOpStatusPtr=NULL, GripToolTipPtr=NULL, GripDimensionPtr=NULL, GripDimensionPtr=NULL, unsigned int=0, AcGePoint3d *=NULL, GripInputPointPtr=NULL)
Constructor with initializers. More...
AcDbGripData (const AcGePoint3d &, void *, GripOperationPtr=NULL, GripOperationPtr=NULL, GripRtClkHandler=NULL, GripWorldDrawPtr=NULL, GripViewportDrawPtr=NULL, GripOpStatusPtr=NULL, GripToolTipPtr=NULL, GripDimensionPtr=NULL, GripDimensionPtr=NULL, unsigned int=0, AcGePoint3d *=NULL, GripInputPointPtr=NULL)
Constructor with initializers. More...
AcGePoint3d *  | alternateBasePoint () const
Gets a pointer to a point to be used as the drag base point for grip edit operations needing a drag base point. More...
void *  | appData () const
Gets the application customized data related to this object. More...
AcRxClass *  | appDataAcRxClass () const
Gets this class AcRxClass object. More...
bool  | areModeKeywordsDisabled () const
Returns boolean value indicating if the grip edit mode keywords like Move, Rotate and Stretch are disabled or not. More...
unsigned int  | bitFlags () const
Gets this grip bit flags. More...
void  | disableModeKeywords (bool)
Disables or enables the display of grip edit mode keywords like Move, Rotate and Stretch. More...
void  | disableRubberBandLine (bool)
This method returns true if the glyph of this grip is drawn at the point of the drag image in a grip edit operation; returns false otherwise. More...
bool  | drawAtDragImageGripPoint () const
decides if the glyph of this grip is drawn at the point of the drag image when it is the only grip involved in a grip edit operation. More...
 bool  | forcedPickOn () const
Gets the kTurnOnForcedPick grip flag.
 bool  | gizmosEnabled () const
Gets the kGizmosEnabled grip flag.
GripOpStatusPtr  | gripOpStatFunc () const
Gets a pointer to the callback function to be called when the grip operation status is changed (abort, start, end) More...
const AcGePoint3d &  | gripPoint () const
Gets the grip point. More...
GripDimensionPtr  | hotGripDimensionFunc () const
Gets a pointer to the callback function to be called when the grip is hot in the scope of retrieving his dynamic dimension. More...
GripOperationPtr  | hotGripFunc () const
Gets the pointer to the callback function to be called when the grip is hot. More...
GripDimensionPtr  | hoverDimensionFunc () const
Gets a pointer to the callback function to be called when the grip's dynamic dimension is hovered. More...
GripOperationPtr  | hoverFunc () const
Gets a pointer to the callback function to be called when the grip is hovered. More...
GripInputPointPtr  | inputPointFunc () const
Gets a pointer to the callback function to be called to process a 3D point input while performing grip edit operations. More...
 bool  | isRubberBandLineDisabled () const
Returns true if, when involved this grip, a rubber-band line will be displayed during drag operations; otherwise it returns false.
 bool  | mapGripHotToRtClk () const
Gets the kMapGripHotToRtClk grip flag.
AcDbGripData &  | operator= (const AcDbGripData &)
Assignment operator. More...
GripRtClkHandler  | rtClk () const
Gets a pointer to the callback function to be called when the grip is selected with the right mouse button. More...
void  | setAllData (const AcGePoint3d &, void *, GripOperationPtr=NULL, GripOperationPtr=NULL, GripRtClkHandler=NULL, GripWorldDrawPtr=NULL, GripViewportDrawPtr=NULL, GripOpStatusPtr=NULL, GripToolTipPtr=NULL, GripDimensionPtr=NULL, GripDimensionPtr=NULL, unsigned int=0, AcGePoint3d *=NULL, GripInputPointPtr=NULL, AcRxClass *=NULL)
Sets all grip related data. More...
void  | setAlternateBasePoint (AcGePoint3d *)
Sets a pointer to a point to be used as the drag base point for grip edit operations needing a drag base point. More...
void  | setAppData (void *)
Sets a pointer to the application customized data. More...
void  | setAppDataAcRxClass (AcRxClass *)
Function used to specify this object's AcRxClass class. More...
void  | setBitFlags (unsigned int)
Sets this grip bit flags. More...
void  | setDrawAtDragImageGripPoint (bool)
decides if the glyph of this grip is drawn at the point of the drag image when it is the only grip involved in a grip edit operation. More...
 void  | setForcedPickOn (bool)
Sets the kTurnOnForcedPick grip flag.
 void  | setGizmosEnabled (bool)
Sets the kGizmosEnabled grip flag.
void  | setGripOpStatFunc (GripOpStatusPtr)
Sets a pointer to the callback function to be called when the grip operation status is changed (abort, start, end) More...
void  | setGripPoint (const AcGePoint3d &)
Grip point setting function. More...
void  | setHotGripDimensionFunc (GripDimensionPtr)
Sets a pointer to the callback function to be called when the grip is hot in the scope of retrieving his dynamic dimension. More...
void  | setHotGripFunc (GripOperationPtr)
Sets a pointer to the callback function to be called when the grip is hot. More...
void  | setHoverDimensionFunc (GripDimensionPtr)
Sets a pointer to the callback function to be called when the grip's dynamic dimension is hovered. More...
void  | setHoverFunc (GripOperationPtr)
Sets a pointer to the callback function to be called when the grip is hovered. More...
void  | setInputPointFunc (GripInputPointPtr)
Sets a pointer to the callback function to be called to process a 3D point input while performing grip edit operations. More...
 void  | setMapGripHotToRtClk (bool)
Sets the kMapGripHotToRtClk grip flag.
void  | setRtClk (GripRtClkHandler)
Sets a pointer to the callback function to be called when the grip is selected with the right mouse button. More...
 void  | setSkipWhenShared (bool)
Sets the kSkipWhenShared grip flag.
void  | setToolTipFunc (GripToolTipPtr)
Sets a pointer to the callback function to be called to retrieve the grip's tooltip string. More...
 void  | setTriggerGrip (bool)
Sets the kTriggerGrip grip flag.
void  | setViewportDraw (GripViewportDrawPtr)
Sets a pointer to the callback function to be called by the grip to draw viewport related graphics. More...
void  | setWorldDraw (GripWorldDrawPtr)
Sets a pointer to the callback function to be called by the grip to draw graphics not related to viewport. More...
 bool  | skipWhenShared () const
Gets the kSkipWhenShared grip flag.
GripToolTipPtr  | toolTipFunc () const
Gets a pointer to the callback function to be called to retrieve the grip's tooltip string. More...
 bool  | triggerGrip () const
Gets the kTriggerGrip grip flag.
GripViewportDrawPtr  | viewportDraw () const
Gets a pointer to the callback function to be called by the grip to draw viewport related graphics. More...
GripWorldDrawPtr  | worldDraw () const
Gets a pointer to the callback function to be called by the grip to draw graphics not related to viewport. More...
~AcDbGripData ()
Destructor.
Detailed Description
_
Constructor & Destructor Documentation
◆ AcDbGripData() [1/3]
 UX_EXPORT_FUNCTION AcDbGripData::AcDbGripData  |  ( |  const AcDbGripData &  |  source | )
Copy constructor.
Parameters
[in] | source | object
◆ AcDbGripData() [2/3]
 UX_EXPORT_FUNCTION AcDbGripData::AcDbGripData  |  ( |  const AcGePoint3d &  |  inputPt,
|  void *  |  gripAppData,
|  GripOperationPtr  |  hotFunction = NULL,
|  GripOperationPtr  |  hoverFunction = NULL,
|  GripRtClkHandler  |  rightButtonFunction = NULL,
|  GripWorldDrawPtr  |  worldDrawFunction = NULL,
|  GripViewportDrawPtr  |  viewportDrawFunction = NULL,
|  GripOpStatusPtr  |  editStatusFunction = NULL,
|  GripToolTipPtr  |  tooltipFunction = NULL,
|  GripDimensionPtr  |  hoverDimensionFunction = NULL,
|  GripDimensionPtr  |  hotDimensionFunction = NULL,
|  unsigned int  |  bitGripFlags = 0,
|  AcGePoint3d *  |  basePoint = NULL,
|  GripInputPointPtr  |  inputPtFunction = NULL
)
Constructor with initializers.
Parameters
[in] | inputPt | grip point
[in] | gripData | user grip data
[in] | hotFunction | pointer to function to be called if grip is hot
[in] | hoverFunction | pointer to function to be called if grip is hovered
[in] | rightButtonFunction | pointer to function to be called if the grip is right button selected
[in] | worldDrawFunction | pointer to function to be called to draw non viewport specific graphics
[in] | viewportDrawFunction | pointer to function to be called to draw viewport specipic graphics
[in] | editStatusFunction | pointer to grip edit status notifying function
[in] | tooltipFunction | pointer to function to retrieve grip tooltip string
[in] | hoverDimensionFunction | pointer to function to be called if grip is hovered to retrieve its dynamic dimensions
[in] | hotDimensionFunction | pointer to function to be called if grip gets hot to retrieve its dynamic dimensions
[in] | bitGripFlags | flags to specify grips further actions
[in] | basePoint | grip edit drag base point
[in] | inputPtFunction | pointer to function to be called to deal with 3d point input when editing grip
◆ AcDbGripData() [3/3]
 UX_EXPORT_FUNCTION AcDbGripData::AcDbGripData  |  ( |  const AcGePoint3d &  |  inputPt,
|  void *  |  gripAppData,
|  AcRxClass *  |  pAppDataClass,
|  GripOperationPtr  |  hotFunction = NULL,
|  GripOperationPtr  |  hoverFunction = NULL,
|  GripRtClkHandler  |  rightButtonFunction = NULL,
|  GripWorldDrawPtr  |  worldDrawFunction = NULL,
|  GripViewportDrawPtr  |  viewportDrawFunction = NULL,
|  GripOpStatusPtr  |  editStatusFunction = NULL,
|  GripToolTipPtr  |  tooltipFunction = NULL,
|  GripDimensionPtr  |  hoverDimensionFunction = NULL,
|  GripDimensionPtr  |  hotDimensionFunction = NULL,
|  unsigned int  |  bitGripFlags = 0,
|  AcGePoint3d *  |  basePoint = NULL,
|  GripInputPointPtr  |  inputPtFunction = NULL
)
Constructor with initializers.
Parameters
[in] | inputPt | grip point
[in] | gripData | user grip data
[in] | pAppDataClass | grip data rx class
[in] | hotFunction | pointer to function to be called if grip is hot
[in] | hoverFunction | pointer to function to be called if grip is hovered
[in] | rightButtonFunction | pointer to function to be called if the grip is right button selected
[in] | worldDrawFunction | pointer to function to be called to draw non viewport specific graphics
[in] | viewportDrawFunction | pointer to function to be called to draw viewport specipic graphics
[in] | editStatusFunction | pointer to grip edit status notifying function
[in] | tooltipFunction | pointer to function to retrieve grip tooltip string
[in] | hoverDimensionFunction | pointer to function to be called if grip is hovered to retrieve its dynamic dimensions
[in] | hotDimensionFunction | pointer to function to be called if grip gets hot to retrieve its dynamic dimensions
[in] | bitGripFlags | flags to specify grips further actions
[in] | basePoint | grip edit drag base point
[in] | inputPtFunction | pointer to function to be called to deal with 3d point input when editing grip
Member Function Documentation
◆ alternateBasePoint()
 UX_EXPORT_FUNCTION AcGePoint3d * AcDbGripData::alternateBasePoint  |  ( |  void  |   | ) |   const
Gets a pointer to a point to be used as the drag base point for grip edit operations needing a drag base point.
Returns
pointer to drag base point
Date
2012-02-29 tiberiuh refactored BrxDbGripDataImp to use OdDbGripData
 2009-01-08 laurentiuv created
◆ appData()
 UX_EXPORT_FUNCTION void * AcDbGripData::appData  |  ( |   | ) |   const
Gets the application customized data related to this object.
Returns
pointer to data
◆ appDataAcRxClass()
 UX_EXPORT_FUNCTION AcRxClass * AcDbGripData::appDataAcRxClass  |  ( |   | ) |   const
Gets this class AcRxClass object.
Returns
pointer to object
◆ areModeKeywordsDisabled()
 UX_EXPORT_FUNCTION bool AcDbGripData::areModeKeywordsDisabled  |  ( |   | ) |   const
Returns boolean value indicating if the grip edit mode keywords like Move, Rotate and Stretch are disabled or not.
Returns
boolean value indicating if the grip edit mode keywords are disabled.
◆ bitFlags()
 UX_EXPORT_FUNCTION unsigned int AcDbGripData::bitFlags  |  ( |  void  |   | ) |   const
Gets this grip bit flags.
Returns
grip bit flags values
◆ disableModeKeywords()
 UX_EXPORT_FUNCTION void AcDbGripData::disableModeKeywords  |  ( |  bool  |  ok | )
Disables or enables the display of grip edit mode keywords like Move, Rotate and Stretch.
Parameters
[in] | ok | if true the mode keywords will be disabled if false the mode keywords will be enabled
◆ disableRubberBandLine()
 UX_EXPORT_FUNCTION void AcDbGripData::disableRubberBandLine  |  ( |  bool  |  ok | )
This method returns true if the glyph of this grip is drawn at the point of the drag image in a grip edit operation; returns false otherwise.
Parameters
[in] | ok | if it's false allows a rubber-band line to be drawn; if true prevents it
◆ drawAtDragImageGripPoint()
 UX_EXPORT_FUNCTION bool AcDbGripData::drawAtDragImageGripPoint  |  ( |   | ) |   const
decides if the glyph of this grip is drawn at the point of the drag image when it is the only grip involved in a grip edit operation.
Parameters
[in] | ok | if it's true, the glyph of the grip is drawn at the point of the drag image; else is drawn normally
◆ gripOpStatFunc()
 UX_EXPORT_FUNCTION GripOpStatusPtr AcDbGripData::gripOpStatFunc  |  ( |   | ) |   const
Gets a pointer to the callback function to be called when the grip operation status is changed (abort, start, end)
Returns
pointer to callback function
◆ gripPoint()
 UX_EXPORT_FUNCTION const AcGePoint3d & AcDbGripData::gripPoint  |  ( |   | ) |   const
Gets the grip point.
Returns
grip point reference
◆ hotGripDimensionFunc()
 UX_EXPORT_FUNCTION GripDimensionPtr AcDbGripData::hotGripDimensionFunc  |  ( |   | ) |   const
Gets a pointer to the callback function to be called when the grip is hot in the scope of retrieving his dynamic dimension.
Returns
pointer to callback function
◆ hotGripFunc()
 UX_EXPORT_FUNCTION GripOperationPtr AcDbGripData::hotGripFunc  |  ( |   | ) |   const
Gets the pointer to the callback function to be called when the grip is hot.
Returns
pointer to callback function
◆ hoverDimensionFunc()
 UX_EXPORT_FUNCTION GripDimensionPtr AcDbGripData::hoverDimensionFunc  |  ( |   | ) |   const
Gets a pointer to the callback function to be called when the grip's dynamic dimension is hovered.
Returns
pointer to callback function
◆ hoverFunc()
 UX_EXPORT_FUNCTION GripOperationPtr AcDbGripData::hoverFunc  |  ( |   | ) |   const
Gets a pointer to the callback function to be called when the grip is hovered.
Returns
pointer to callback function
◆ inputPointFunc()
 UX_EXPORT_FUNCTION GripInputPointPtr AcDbGripData::inputPointFunc  |  ( |   | ) |   const
Gets a pointer to the callback function to be called to process a 3D point input while performing grip edit operations.
Returns
pointer to callback function
◆ operator=()
 UX_EXPORT_FUNCTION AcDbGripData & AcDbGripData::operator=  |  ( |  const AcDbGripData &  |  right | )
Assignment operator.
Parameters
[in] | source | object
◆ rtClk()
 UX_EXPORT_FUNCTION GripRtClkHandler AcDbGripData::rtClk  |  ( |   | ) |   const
Gets a pointer to the callback function to be called when the grip is selected with the right mouse button.
Returns
pointer to callback function
◆ setAllData()
 UX_EXPORT_FUNCTION void AcDbGripData::setAllData  |  ( |  const AcGePoint3d &  |  inputPt,
|  void *  |  gripData,
|  GripOperationPtr  |  hotFunction = NULL,
|  GripOperationPtr  |  hoverFunction = NULL,
|  GripRtClkHandler  |  rightButtonFunction = NULL,
|  GripWorldDrawPtr  |  worldDrawFunction = NULL,
|  GripViewportDrawPtr  |  viewportDrawFunction = NULL,
|  GripOpStatusPtr  |  editStatusFunction = NULL,
|  GripToolTipPtr  |  tooltipFunction = NULL,
|  GripDimensionPtr  |  hoverDimensionFunction = NULL,
|  GripDimensionPtr  |  hotDimensionFunction = NULL,
|  unsigned int  |  bitGripFlags = 0,
|  AcGePoint3d *  |  basePoint = NULL,
|  GripInputPointPtr  |  inputPtFunction = NULL,
|  AcRxClass *  |  dataAcRxClass = NULL
)
Sets all grip related data.
Parameters
[in] | inputPt | grip point
[in] | gripData | user grip data
[in] | hotFunction | pointer to function to be called if grip is hot
[in] | hoverFunction | pointer to function to be called if grip is hovered
[in] | rightButtonFunction | pointer to function to be called if the grip is right button selected
[in] | worldDrawFunction | pointer to function to be called to draw non viewport specific graphics
[in] | viewportDrawFunction | pointer to function to be called to draw viewport specipic graphics
[in] | editStatusFunction | pointer to grip edit status notifying function
[in] | tooltipFunction | pointer to function to retrieve grip tooltip string
[in] | hoverDimensionFunction | pointer to function to be called if grip is hovered to retrieve its dynamic dimensions
[in] | hotDimensionFunction | pointer to function to be called if grip gets hot to retrieve its dynamic dimensions
[in] | bitGripFlags | flags to specify grips further actions
[in] | basePoint | grip edit drag base point
[in] | inputPtFunction | pointer to function to be called to deal with 3d point input when editing grip
[in] | dataAcRxClass | the AcRxClass associated object
◆ setAlternateBasePoint()
 UX_EXPORT_FUNCTION void AcDbGripData::setAlternateBasePoint  |  ( |  AcGePoint3d *  |  basePoint | )
Sets a pointer to a point to be used as the drag base point for grip edit operations needing a drag base point.
Parameters
[in] | pointer | to drag base point
Date
2012-02-29 tiberiuh refactored BrxDbGripDataImp to use OdDbGripData
 2009-01-08 laurentiuv created
◆ setAppData()
 UX_EXPORT_FUNCTION void AcDbGripData::setAppData  |  ( |  void *  |  data | )
Sets a pointer to the application customized data.
Parameters
[in] | pointer | to data
◆ setAppDataAcRxClass()
 UX_EXPORT_FUNCTION void AcDbGripData::setAppDataAcRxClass  |  ( |  AcRxClass *  |  dataAcRxClass | )
Function used to specify this object's AcRxClass class.
Parameters
[in] | pointer | to object
◆ setBitFlags()
 UX_EXPORT_FUNCTION void AcDbGripData::setBitFlags  |  ( |  unsigned int  |  flags | )
Sets this grip bit flags.
Parameters
[in] | grip | bit flags values
◆ setDrawAtDragImageGripPoint()
 UX_EXPORT_FUNCTION void AcDbGripData::setDrawAtDragImageGripPoint  |  ( |  bool  |  ok | )
decides if the glyph of this grip is drawn at the point of the drag image when it is the only grip involved in a grip edit operation.
Parameters
[in] | ok | if it's true, the glyph of the grip is drawn at the point of the drag image; else is drawn normally
◆ setGripOpStatFunc()
 UX_EXPORT_FUNCTION void AcDbGripData::setGripOpStatFunc  |  ( |  GripOpStatusPtr  |  editStatusFunction | )
Sets a pointer to the callback function to be called when the grip operation status is changed (abort, start, end)
Parameters
[in] | pointer | to function
◆ setGripPoint()
 UX_EXPORT_FUNCTION void AcDbGripData::setGripPoint  |  ( |  const AcGePoint3d &  |  inputPoint | )
Grip point setting function.
Parameters
[in] | source | point
◆ setHotGripDimensionFunc()
 UX_EXPORT_FUNCTION void AcDbGripData::setHotGripDimensionFunc  |  ( |  GripDimensionPtr  |  hotDimensionFunction | )
Sets a pointer to the callback function to be called when the grip is hot in the scope of retrieving his dynamic dimension.
Parameters
[in] | pointer | to function
◆ setHotGripFunc()
 UX_EXPORT_FUNCTION void AcDbGripData::setHotGripFunc  |  ( |  GripOperationPtr  |  hotFunction | )
Sets a pointer to the callback function to be called when the grip is hot.
Parameters
[in] | pointer | to function
◆ setHoverDimensionFunc()
 UX_EXPORT_FUNCTION void AcDbGripData::setHoverDimensionFunc  |  ( |  GripDimensionPtr  |  hoverDimensionFunction | )
Sets a pointer to the callback function to be called when the grip's dynamic dimension is hovered.
Parameters
[in] | pointer | to function
◆ setHoverFunc()
 UX_EXPORT_FUNCTION void AcDbGripData::setHoverFunc  |  ( |  GripOperationPtr  |  hoverFunction | )
Sets a pointer to the callback function to be called when the grip is hovered.
Parameters
[in] | pointer | to function
◆ setInputPointFunc()
 UX_EXPORT_FUNCTION void AcDbGripData::setInputPointFunc  |  ( |  GripInputPointPtr  |  inputPtFunction | )
Sets a pointer to the callback function to be called to process a 3D point input while performing grip edit operations.
Parameters
[in] | pointer | to function
◆ setRtClk()
 UX_EXPORT_FUNCTION void AcDbGripData::setRtClk  |  ( |  GripRtClkHandler  |  rightButtonFunction | )
Sets a pointer to the callback function to be called when the grip is selected with the right mouse button.
Parameters
[in] | pointer | to function
◆ setToolTipFunc()
 UX_EXPORT_FUNCTION void AcDbGripData::setToolTipFunc  |  ( |  GripToolTipPtr  |  tooltipFunction | )
Sets a pointer to the callback function to be called to retrieve the grip's tooltip string.
Parameters
[in] | pointer | to function
◆ setViewportDraw()
 UX_EXPORT_FUNCTION void AcDbGripData::setViewportDraw  |  ( |  GripViewportDrawPtr  |  viewportDrawFunction | )
Sets a pointer to the callback function to be called by the grip to draw viewport related graphics.
Parameters
[in] | pointer | to function
◆ setWorldDraw()
 UX_EXPORT_FUNCTION void AcDbGripData::setWorldDraw  |  ( |  GripWorldDrawPtr  |  worldDrawFunction | )
Sets a pointer to the callback function to be called by the grip to draw graphics not related to viewport.
Parameters
[in] | pointer | to function
◆ toolTipFunc()
 UX_EXPORT_FUNCTION GripToolTipPtr AcDbGripData::toolTipFunc  |  ( |   | ) |   const
Gets a pointer to the callback function to be called to retrieve the grip's tooltip string.
Returns
pointer to callback function
◆ viewportDraw()
 UX_EXPORT_FUNCTION GripViewportDrawPtr AcDbGripData::viewportDraw  |  ( |   | ) |   const
Gets a pointer to the callback function to be called by the grip to draw viewport related graphics.
Returns
pointer to callback function
◆ worldDraw()
 UX_EXPORT_FUNCTION GripWorldDrawPtr AcDbGripData::worldDraw  |  ( |   | ) |   const
Gets a pointer to the callback function to be called by the grip to draw graphics not related to viewport.
Returns
pointer to callback function