Public Types | Public Member Functions | Public Attributes | List of all members
AcDbTextStyleTableRecord Class Reference
_ More...
#include <AcDbTextStyleTableRecord.h>
 Public Types
 typedef AcDbTextStyleTable  | TableType
 Public Types inherited from AcDbSymbolTableRecord
 typedef AcDbSymbolTable  | TableType
 Public Types inherited from AcGiDrawable
enum  | DrawableType {
 kGeometry = 0 , kDistantLight , kPointLight , kSpotLight ,
 kAmbientLight , kSolidBackground , kGradientBackground , kImageBackground ,
 kGroundPlaneBackground , kViewport
 }
enum  | SetAttributesFlags {
 kDrawableNone = 0 , kDrawableIsAnEntity = 1 , kDrawableUsesNesting = 2 , kDrawableIsCompoundObject = 4 ,
 kDrawableViewIndependentViewportDraw = 8 , kDrawableIsInvisible = 16 , kDrawableHasAttributes = 32 , kDrawableRegenTypeDependentGeometry = 64 ,
 kDrawableIsDimension = 133 , kDrawableRegenDraw = 256 , kDrawableStandardDisplaySingleLOD = 512 , kDrawableShadedDisplaySingleLOD = 1024 ,
 kDrawableViewDependentViewportDraw = 2048 , kDrawableBlockDependentViewportDraw = 4096 , kDrawableIsExternalReference = 8192 , kDrawableNotPlottable = 16384 ,
 kDrawableNotAllowLCS = 32768 , kDrawableMergeControlOff = 65536 , kThreadedWorldDrawViewportDraw = 131072
 }
 Public Member Functions
Acad::ErrorStatus  | bigFontFileName (ACHAR *&) const
Returns the name of the BigFont file associated with this TextStyle (DXF 4). More...
Acad::ErrorStatus  | bigFontFileName (AcString &) const
Returns the name of the BigFont file associated with this TextStyle (DXF 4). More...
Acad::ErrorStatus  | bigFontFileName (const ACHAR *&) const
Returns the name of the BigFont file associated with this TextStyle (DXF 4). More...
Acad::ErrorStatus  | fileName (ACHAR *&) const
Returns the name of the font file associated with this TextStyle (DXF 3). More...
Acad::ErrorStatus  | fileName (const ACHAR *&) const
Returns the name of the font file associated with this TextStyle (DXF 3). More...
Adesk::UInt8  | flagBits () const
Returns the flag bits for this textstyle (Bit 2 and 3 of DXF 71). More...
Acad::ErrorStatus  | font (ACHAR *&, Adesk::Boolean &, Adesk::Boolean &, Charset &, Bricsys::BRX::PAL::FontUtils::FontPitch &, Bricsys::BRX::PAL::FontUtils::FontFamily &) const
Returns the Windows font characteristics for this TextStyle. More...
Acad::ErrorStatus  | font (ACHAR *&, Adesk::Boolean &, Adesk::Boolean &, int &, int &) const
Returns the Windows font characteristics for this TextStyle. More...
Acad::ErrorStatus  | font (AcString &, Adesk::Boolean &, Adesk::Boolean &, Charset &, Bricsys::BRX::PAL::FontUtils::FontPitch &, Bricsys::BRX::PAL::FontUtils::FontFamily &) const
Returns the Windows font characteristics for this TextStyle. More...
Adesk::Boolean  | isShapeFile () const
Returns true if and only if the text font file for this TextStyle is interpreted as a shape file (DXF 70, bit 1). More...
Adesk::Boolean  | isVertical () const
Returns true if and only if text is drawn vertically with this TextStyle (DXF 70, bit 3). More...
double  | obliquingAngle () const
Returns the obliquing angle for this TextStyle (DXF 50). More...
double  | priorSize () const
Returns the text size of the text most recently created with this TextStyle (DXF 42). More...
Acad::ErrorStatus  | setBigFontFileName (const ACHAR *)
Sets the name of the BigFont file associated with this TextStyle (DXF 4). More...
Acad::ErrorStatus  | setFileName (const ACHAR *)
Sets the name of the font file associated with this TextStyle (DXF 3). More...
void  | setFlagBits (Adesk::UInt8)
Sets the flag bits for this textstyle (Bit 2 and 3 of DXF 71). More...
Acad::ErrorStatus  | setFont (const ACHAR *, Adesk::Boolean, Adesk::Boolean, Charset, Bricsys::BRX::PAL::FontUtils::FontPitch, Bricsys::BRX::PAL::FontUtils::FontFamily, Adesk::Boolean=Adesk::kFalse)
Sets this TextStyle to use the specified Windows font characteristics. More...
Acad::ErrorStatus  | setFont (const ACHAR *, Adesk::Boolean, Adesk::Boolean, int, int)
Sets this TextStyle to use the specified Windows font characteristics. More...
void  | setIsShapeFile (Adesk::Boolean)
Sets the flag which controls if the text font file for this TextStyle is interpreted as a shape file (DXF 70, bit 1). More...
void  | setIsVertical (Adesk::Boolean)
Sets the flag which controls if this TextStyle is drawn vertical (DXF 70, bit 3). More...
Acad::ErrorStatus  | setObliquingAngle (double)
Sets the obliquing angle for this TextStyle (DXF 50). More...
Acad::ErrorStatus  | setPriorSize (double)
Sets the text size of the text most recently created with this TextStyle (DXF 42). More...
Acad::ErrorStatus  | setTextSize (double)
Sets the fixed text size for this TextStyle (DXF 40). More...
Acad::ErrorStatus  | setXScale (double)
Sets the X-scale (width) factor for this TextStyle (DXF 41). More...
double  | textSize () const
Returns the fixed text size for this TextStyle (DXF 40). More...
double  | xScale () const
Returns the X-scale (width) factor for this TextStyle (DXF 41). More...
 virtual  | ~AcDbTextStyleTableRecord ()
Destructor.
 Public Member Functions inherited from AcDbSymbolTableRecord
Acad::ErrorStatus  | getName (ACHAR *&) const
getName. More...
Acad::ErrorStatus  | getName (AcString &) const
getName. More...
Acad::ErrorStatus  | getName (const ACHAR *&) const
getName. More...
bool  | isDependent () const
Returns whether this AcDbSymbolTableRecord is dependending on xref database. More...
bool  | isResolved () const
Returns whether this AcDbSymbolTableRecord is dependending on xref database. More...
Acad::ErrorStatus  | setName (const ACHAR *)
setName. More...
 virtual  | ~AcDbSymbolTableRecord ()
destructor.
 Public Member Functions inherited from AcDbObject
virtual Acad::ErrorStatus  | addPersistentReactor (AcDbObjectId)
Adds a persistent reactor to this object reactor list. More...
Acad::ErrorStatus  | addReactor (AcDbObjectReactor *) const
Adds a transient reactor to this object. More...
virtual Acad::ErrorStatus  | applyPartialUndo (AcDbDwgFiler *, AcRxClass *)
This function is called during Undo operations on objects, that use the 'Partial Undo meachanism'; this is, this object is opened with assertWriteEnabled(Adesk::kFalse) to indicate that custom Undo filing is used rather than the default Undo filing. More...
 void  | assertNotifyEnabled () const
 void  | assertReadEnabled () const
 void  | assertWriteEnabled (Adesk::Boolean=Adesk::kTrue, Adesk::Boolean=Adesk::kTrue)
virtual Acad::ErrorStatus  | audit (AcDbAuditInfo *)
Performs the audit operation for this object. More...
Acad::ErrorStatus  | cancel ()
Reverts all changes since the object had been opened and closes the object. More...
virtual void  | cancelled (const AcDbObject *)
A handler function for persistent reactors. More...
virtual AcRxObject *  | clone () const
Creates a shallow clone of this object. More...
Acad::ErrorStatus  | close ()
Closes the object. More...
Acad::ErrorStatus  | closeAndPage (Adesk::Boolean=Adesk::kTrue)
Closes the object. More...
virtual Acad::ErrorStatus  | composeForLoad (AcDb::OdaSaveType, AcDb::AcDbDwgVersion)
This function is intended for future MT file loading support. More...
virtual void  | copied (const AcDbObject *, const AcDbObject *)
A handler function for persistent reactors. More...
virtual Acad::ErrorStatus  | copyFrom (const AcRxObject *)
Copies the pSrc object information in this object. More...
Acad::ErrorStatus  | createExtensionDictionary ()
Creates a dictionary as extension dictionary for this object. More...
AcDbDatabase *  | database () const
Returns the database that contains this object. More...
virtual Acad::ErrorStatus  | decomposeForSave (AcDb::AcDbDwgVersion, AcDbObject *&, AcDbObjectId &, Adesk::Boolean &)
This function is called during dwg and dxf output, to allow a custom object to decompose itself, due to provided dwg/dxf target file version. More...
virtual Acad::ErrorStatus  | deepClone (AcDbObject *, AcDbObject *&, AcDbIdMapping &, Adesk::Boolean=Adesk::kTrue) const final
Clones this object, appends it to the owner pOwner and adds an AcDbIdPair record to the idMap. More...
void  | disableUndoRecording (Adesk::Boolean)
Disables or enables the undo recording for the object. More...
Acad::ErrorStatus  | downgradeOpen ()
Sets the open mode for an object opened for write to be opened for read. More...
Acad::ErrorStatus  | downgradeToNotify (Adesk::Boolean)
Sets the open mode for an object opened for write to be opened for notify. More...
virtual AcGiDrawable *  | drawable ()
Retrieves the AcGiDrawable instance of this object. More...
Acad::ErrorStatus  | dwgIn (AcDbDwgFiler *)
Calls the object's dwgInFields function, and reads any XData if present. More...
virtual Acad::ErrorStatus  | dwgInFields (AcDbDwgFiler *)
Reads the object from the DWG filer. More...
Acad::ErrorStatus  | dwgOut (AcDbDwgFiler *) const
Calls the object's dwgOutFields function, and writes any XData if present. More...
virtual Acad::ErrorStatus  | dwgOutFields (AcDbDwgFiler *) const
Writes the object to the DWG filer. More...
Acad::ErrorStatus  | dxfIn (AcDbDxfFiler *)
Calls the object's dxfInFields function, and reads any XData if present. More...
virtual Acad::ErrorStatus  | dxfInFields (AcDbDxfFiler *)
Reads the object from the DXF filer. More...
Acad::ErrorStatus  | dxfOut (AcDbDxfFiler *, Adesk::Boolean, Adesk::uchar *) const
Calls the object's dxfOutFields function, and writes any XData if present. More...
virtual Acad::ErrorStatus  | dxfOutFields (AcDbDxfFiler *) const
Writes the object to the DXF filer. More...
Acad::ErrorStatus  | erase (Adesk::Boolean=Adesk::kTrue)
Sets the bit that indicates that the object is erased. More...
virtual void  | erased (const AcDbObject *, Adesk::Boolean)
A handler function for persistent reactors. More...
AcDbObjectId  | extensionDictionary () const
Returns the object id of the extension dictionary for this object. More...
void  | getAcDbHandle (AcDbHandle &) const
Returns handle of this object. More...
Acad::ErrorStatus  | getBinaryData (const ACHAR *, Adesk::Int32 &, char *&) const
Creates a copy of the binary data stored as chunks of maximum 127 bytes in the resbuf chain of this object's extension dictionary xrecord entry given by entryName. More...
int  | getBrxOpenCount () const
This function returns the number of open BRX instances for this object. More...
int  | getBrxOpenState () const
This function returns the BRX object open state flags as bitfields, for diagnostic purpose. More...
virtual Acad::ErrorStatus  | getClassID (CLSID *) const final
Gets the COM wrapper Class ID for this entity. More...
int  | getCustomObjectState () const
This function returns the custom object status : 1=isCustomObject 2=DifferentialUndoDisabled. More...
Acad::ErrorStatus  | getField (const ACHAR *, AcDbField *&, AcDb::OpenMode) const
Retrieves the specified Field from this object, and opens it in mode. More...
Acad::ErrorStatus  | getField (const ACHAR *, AcDbObjectId &) const
Gets the pszPropName field object from field dictionary of this AcDbObject object, using pszPropName as key. More...
AcDbObjectId  | getFieldDictionary () const
Returns the Field dictionary associated with this object,. More...
Acad::ErrorStatus  | getFieldDictionary (AcDbDictionary *&, AcDb::OpenMode) const
Gets and opens the field dictionary for this. More...
Acad::ErrorStatus  | getObjectBirthVersion (AcDb::AcDbDwgVersion &, AcDb::MaintenanceReleaseVersion &)
This function is currently not supported by the CAD engine, always returns Acad::eOk, and 'kDHL_CURRENT' + 'kMReleaseCurrent' results. More...
virtual Acad::ErrorStatus  | getObjectSaveVersion (const AcDbDwgFiler *, AcDb::AcDbDwgVersion &, AcDb::MaintenanceReleaseVersion &)
Returns the DWG version for saving the object. More...
virtual Acad::ErrorStatus  | getObjectSaveVersion (const AcDbDxfFiler *, AcDb::AcDbDwgVersion &, AcDb::MaintenanceReleaseVersion &)
Returns the DWG version for saving the object. More...
int  | getOdaOpenCount () const
This function returns the number of open ODA instances for this object. More...
int  | getOdaOpenState () const
This function returns the ODA object open state flags as bitfields, for diagnostic purpose. More...
virtual void  | goodbye (const AcDbObject *)
A handler function for persistent reactors. More...
Acad::ErrorStatus  | handOverTo (AcDbObject *, Adesk::Boolean=Adesk::kTrue, Adesk::Boolean=Adesk::kTrue)
Hands over objects identity to another object. More...
bool  | hasFields () const
Return true if this object has single or multiple fields associated with him. More...
bool  | hasPersistentReactor (AcDbObjectId) const
Checks the input objectId in this object reactor list. More...
bool  | hasSaveVersionOverride ()
This function indicates whether this object overrides the filer's save version. More...
virtual AcDbObjectId  | id () const
Returns the database id of this object. More...
Adesk::Boolean  | isAcDbObjectIdsInFlux () const
Checks whether a deep clone operation was completed. More...
Adesk::Boolean  | isAProxy () const
Adesk::Boolean  | isCancelling () const
Adesk::Boolean  | isErased () const
Returns whether this object is erased. More...
Adesk::Boolean  | isEraseStatusToggled () const
Checks whether the object erase status has been toggled. More...
Adesk::Boolean  | isModified () const
Returns whether this object's assertWriteEnabled() has been called since it was opened. More...
Adesk::Boolean  | isModifiedGraphics () const
Checks whether this object graphics will be updated when the object is closed. More...
Adesk::Boolean  | isModifiedXData () const
Checks whether this object's xData was modified. More...
Adesk::Boolean  | isNewObject () const
Returns true if and only if this object has not been closed since it was created. More...
Adesk::Boolean  | isNotifyEnabled () const
Returns whether this object is opened for notify. More...
Adesk::Boolean  | isNotifying () const
virtual Adesk::Boolean  | isPersistent () const
Returns the 'persistent' status of a database object. More...
Adesk::Boolean  | isReadEnabled () const
Returns whether this object is opened for read. More...
 Adesk::Boolean  | isReallyClosing () const
Checks whether the next close call will completely close this object return true if on the next call the object will be completely closed false otherwise.
Adesk::Boolean  | isTransactionResident () const
Gets the object transaction status. More...
Adesk::Boolean  | isUndoing () const
bool  | isUndoRecordingDisabled () const
Returns whether the undo recording for the object is enabled or not. More...
Adesk::Boolean  | isWriteEnabled () const
Returns whether this object is opened for write. More...
virtual AcDb::DuplicateRecordCloning  | mergeStyle () const
Returns the object's merge behavior during cloning. More...
virtual void  | modified (const AcDbObject *)
A handler function for persistent reactors. More...
virtual void  | modifiedGraphics (const AcDbEntity *)
A handler function for persistent reactors. More...
virtual void  | modifiedXData (const AcDbObject *)
A handler function for persistent reactors. More...
virtual void  | modifyUndone (const AcDbObject *)
A handler function for persistent reactors. More...
virtual void  | objectClosed (const AcDbObjectId)
A handler function for persistent reactors. More...
AcDbObjectId  | objectId () const
Returns object id. More...
virtual void  | openedForModify (const AcDbObject *)
A handler function for persistent reactors. More...
AcDbObjectId  | ownerId () const
Returns object id of the owner. More...
AcDbVoidPtrArray *  | reactors ()
Gets the object pointers to reactors. More...
const AcDbVoidPtrArray *  | reactors () const
Gets the object pointers to reactors. More...
virtual void  | reappended (const AcDbObject *)
A handler function for persistent reactors. More...
 virtual void  | recvPropagateModify (const AcDbObject *)
Not implemented yet.
Acad::ErrorStatus  | releaseExtensionDictionary ()
Removes the extension dictionary associated with this object. More...
virtual Acad::ErrorStatus  | removeField (AcDbObjectId)
Removes the Field specified by acFieldId from this object. More...
virtual Acad::ErrorStatus  | removeField (const ACHAR *)
Removes the Field specified by szKeyString from this object. More...
virtual Acad::ErrorStatus  | removeField (const ACHAR *, AcDbObjectId &)
Removes the Field specified by acPszKeyString from this object, and returns its ObjectId value. More...
virtual Acad::ErrorStatus  | removePersistentReactor (AcDbObjectId)
Removes a persistent reactor from this object reactor list. More...
Acad::ErrorStatus  | removeReactor (AcDbObjectReactor *) const
Removes a transient reactor to this object. More...
void  | setAcDbObjectIdsInFlux ()
Call this function to indicate that the object IDs of this object and its sub-objects (if any) are not yet valid. More...
Acad::ErrorStatus  | setBinaryData (const ACHAR *, Adesk::Int32, const char *)
Creates a copy of the binary data, divides it in up to 127 bytes binary chunks and
 sets them as resbufs in the resbuf chain of this object's extension dictionary xrecord entry given by entryName. More...
virtual Acad::ErrorStatus  | setField (const ACHAR *, AcDbField *, AcDbObjectId &)
Adds the pAcField field object to field dictionary of this AcDbObject object, using pKey as key. More...
void  | setHasSaveVersionOverride (bool)
This function can be called to specify that the object has a "save version override". More...
virtual Acad::ErrorStatus  | setOwnerId (AcDbObjectId)
Sets the ownerId data member of the object to be objId. More...
virtual Acad::ErrorStatus  | setXData (const resbuf *)
Sets/removes xData associated with this object. More...
virtual Acad::ErrorStatus  | subCancel ()
Possibility to veto a cancel operation from within custom entities. More...
virtual Acad::ErrorStatus  | subClose ()
virtual Acad::ErrorStatus  | subErase (Adesk::Boolean)
This hook is called during an AcDbObject::erase call, before any actual erase operation is performed. More...
 virtual Acad::ErrorStatus  | subHandOverTo (AcDbObject *)
virtual void  | subObjModified (const AcDbObject *, const AcDbObject *)
A handler function for persistent reactors. More...
 virtual Acad::ErrorStatus  | subOpen (AcDb::OpenMode)
virtual Acad::ErrorStatus  | subSwapIdWith (AcDbObjectId, Adesk::Boolean=Adesk::kFalse, Adesk::Boolean=Adesk::kFalse)
This hook is called during an AcDbObject::swapIdWith() call, before any actual swap operation is performed. More...
Acad::ErrorStatus  | swapIdWith (AcDbObjectId, Adesk::Boolean=Adesk::kFalse, Adesk::Boolean=Adesk::kFalse)
Swaps the object id's between the object identified by param swapId and this object. More...
virtual Acad::ErrorStatus  | swapReferences (const AcDbIdMapping &)
Not implemented yet. More...
virtual void  | unappended (const AcDbObject *)
A handler function for persistent reactors. More...
AcDbDwgFiler *  | undoFiler ()
Gets the undo filer for this object. More...
Acad::ErrorStatus  | upgradeFromNotify (Adesk::Boolean &)
Upgrades the open status of this object to AcDb::kForWrite, if this object is already open (either in AcDb::kForRead, AcDb::kForNotify or AcDb::kForWrite) More...
Acad::ErrorStatus  | upgradeOpen ()
Changes the objects open mode to AcDb::kForWrite and sends notifications. More...
virtual Acad::ErrorStatus  | wblockClone (AcRxObject *, AcDbObject *&, AcDbIdMapping &, Adesk::Boolean=Adesk::kTrue) const final
Clones this object, appends it to the owner pOwner and adds an AcDbIdPair record to the idMap. More...
virtual resbuf *  | xData (const ACHAR *=NULL) const
Returns the xData associated with this object. More...
Acad::ErrorStatus  | xDataTransformBy (const AcGeMatrix3d &)
Transforms the extended data according to parameter transformation matrix. More...
 virtual void  | xmitPropagateModify () const
Not implemented yet.
 virtual  | ~AcDbObject ()
Destructor.
 Public Member Functions inherited from AcGiDrawable
virtual bool  | bounds (AcDbExtents &) const
virtual DrawableType  | drawableType () const
 virtual AcGiDrawStream *  | drawStream () const
 AcGsNode *  | gsNode () const
virtual AcDbObjectId  | id () const =0
virtual Adesk::Boolean  | isPersistent () const =0
virtual Adesk::UInt32  | regenSupportFlags () const final
Returns whether and to which level this object supports MultiThreading. More...
 virtual Adesk::Boolean  | RolloverHit (Adesk::ULongPtr, Adesk::ULongPtr, Adesk::Boolean)
 virtual Adesk::UInt32  | setAttributes (AcGiDrawableTraits *) final
 virtual void  | setDrawStream (AcGiDrawStream *)
 void  | setGsNode (AcGsNode *)
 virtual void  | viewportDraw (AcGiViewportDraw *) final
 virtual Adesk::UInt32  | viewportDrawLogicalFlags (AcGiViewportDraw *) final
 virtual Adesk::Boolean  | worldDraw (AcGiWorldDraw *) final
 Public Member Functions inherited from AcRxObject
virtual AcRxObject *  | clone () const
Exported and implemented. More...
 virtual AcRx::Ordering  | comparedTo (const AcRxObject *) const
Exported and implemented.
virtual Acad::ErrorStatus  | copyFrom (const AcRxObject *)
Exported and implemented. More...
 virtual AcRxClass *  | isA () const
Exported and implemented.
virtual Adesk::Boolean  | isEqualTo (const AcRxObject *) const
Exported and implemented. More...
bool  | isKindOf (const AcRxClass *) const
Checks the object class. More...
AcRxObject *  | queryX (const AcRxClass *) const
returns the protocol extension object assigned to this class or a parent class. More...
AcRxObject *  | x (const AcRxClass *) const
returns the protocol extension object assigned to this class or a parent class. More...
 virtual  | ~AcRxObject ()
Destructor.
 Public Attributes
AcDbTextStyleTableRecord
Default constructor.
 Public Attributes inherited from AcDbSymbolTableRecord
AcDbSymbolTableRecord
only derived constructors are used.
 Additional Inherited Members
 Static Public Member Functions inherited from AcRxObject
 static AcRxObject *  | cast (const AcRxObject *)
 static AcRxClass *  | desc ()
Exported and implemented.
 Static Public Member Functions inherited from AcHeapOperators
 static void  | operator delete (void *)
_
 static void  | operator delete (void *, const char *, int)
 static void  | operator delete (void *, void *)
 static void  | operator delete[] (void *)
_
 static void  | operator delete[] (void *, const char *, int)
 static void *  | operator new (size_t)
_
 static void *  | operator new (size_t, const char *, int)
 static void *  | operator new (size_t, void *p)
 static void *  | operator new[] (size_t)
_
 static void *  | operator new[] (size_t, const char *, int)
 Protected Member Functions inherited from AcDbObject
virtual Acad::ErrorStatus  | subDeepClone (AcDbObject *, AcDbObject *&, AcDbIdMapping &, Adesk::Boolean=true) const
virtual Acad::ErrorStatus  | subGetClassID (CLSID *) const
virtual Adesk::UInt32  | subSetAttributes (AcGiDrawableTraits *)
Sets the values of this object's subentity traits and returns with the calling object's subentity traits. More...
virtual void  | subViewportDraw (AcGiViewportDraw *)
virtual Adesk::UInt32  | subViewportDrawLogicalFlags (AcGiViewportDraw *)
virtual Acad::ErrorStatus  | subWblockClone (AcRxObject *, AcDbObject *&, AcDbIdMapping &, Adesk::Boolean=true) const
virtual Adesk::Boolean  | subWorldDraw (AcGiWorldDraw *)
 Protected Member Functions inherited from AcGiDrawable
virtual Adesk::UInt32  | subRegenSupportFlags () const
Returns whether and to which level this object supports MultiThreading. More...
virtual Adesk::UInt32  | subSetAttributes (AcGiDrawableTraits *)=0
virtual void  | subViewportDraw (AcGiViewportDraw *)=0
 virtual Adesk::UInt32  | subViewportDrawLogicalFlags (AcGiViewportDraw *)
virtual Adesk::Boolean  | subWorldDraw (AcGiWorldDraw *)=0
 Protected Member Functions inherited from AcRxObject
AcRxObject ()
Exported and implemented.
Detailed Description
_
Member Function Documentation
◆ bigFontFileName() [1/3]
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbTextStyleTableRecord::bigFontFileName  |  ( |  ACHAR *&  |  fileName | ) |   const
Returns the name of the BigFont file associated with this TextStyle (DXF 4).
Parameters
[out] | fileName | name of the bigfont file, do not delete.
Returns
Acad::eOk
◆ bigFontFileName() [2/3]
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbTextStyleTableRecord::bigFontFileName  |  ( |  AcString &  |  fileName | ) |   const
Returns the name of the BigFont file associated with this TextStyle (DXF 4).
Parameters
[out] | fileName | name of the bigfont file, do not delete.
Returns
Acad::eOk
◆ bigFontFileName() [3/3]
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbTextStyleTableRecord::bigFontFileName  |  ( |  const ACHAR *&  |  fileName | ) |   const
Returns the name of the BigFont file associated with this TextStyle (DXF 4).
Parameters
[out] | fileName | name of the bigfont file, caller has to delete.
Returns
Acad::eOutOfMemory or Acad::eOk,
◆ fileName() [1/2]
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbTextStyleTableRecord::fileName  |  ( |  ACHAR *&  |  fileName | ) |   const
Returns the name of the font file associated with this TextStyle (DXF 3).
Parameters
[out] | fileName | name of the font file, caller has to delete.
Returns
Acad::eOutOfMemory or Acad::eOk,
◆ fileName() [2/2]
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbTextStyleTableRecord::fileName  |  ( |  const ACHAR *&  |  fileName | ) |   const
Returns the name of the font file associated with this TextStyle (DXF 3).
Parameters
[out] | fileName | name of the font file, do not delete.
Returns
Acad::eOk
◆ flagBits()
 UX_EXPORT_FUNCTION Adesk::UInt8 AcDbTextStyleTableRecord::flagBits  |  ( |   | ) |   const
Returns the flag bits for this textstyle (Bit 2 and 3 of DXF 71).
The 2nd bit indicates, that the text ist drawn backwards, the 3rd bit indicates that the text is drawn upside down, the other bits are not used.
Returns
backwards and upside down bit.
0 - neither backwards nor upside down
2 - backwards, not upside down
4 - not backwards, upside down
6 - backwards and upside down
Remarks
In other CAD libraries the other bit values may be stored and returned. In BRX all other bit than bit 2 and bit 3 are ignored.
◆ font() [1/3]
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbTextStyleTableRecord::font  |  ( |  ACHAR *&  |  pTypeface,
|  Adesk::Boolean &  |  bold,
|  Adesk::Boolean &  |  italic,
|  Charset &  |  charset,
|  Bricsys::BRX::PAL::FontUtils::FontPitch &  |  pitch,
|  Bricsys::BRX::PAL::FontUtils::FontFamily &  |  family
) |   |  const
Returns the Windows font characteristics for this TextStyle.
Parameters
[out] | pTypeface | Typeface name of the font, caller has to delete. NULL, if the record uses a SHX font.
[out] | bold | Bold if and only if true. Adesk::kFalse, if the record uses a SHX font.
[out] | italic | Italic if and only if true. Adesk::kFalse, if the record uses a SHX font.
[out] | charset | Windows character set identitier. 0, if the record uses a SHX font.
[out] | pitch | font pitch.
[out] | family | font family identifier.
Returns
Acad::eOutOfMemory or Acad:.eOk
Remarks
For an uninitialized font other CAD libraries may return 1 for charset and BRX returns 0.
◆ font() [2/3]
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbTextStyleTableRecord::font  |  ( |  ACHAR *&  |  pTypeface,
|  Adesk::Boolean &  |  bold,
|  Adesk::Boolean &  |  italic,
|  int &  |  charset,
|  int &  |  pitchAndFamily
) |   |  const
Returns the Windows font characteristics for this TextStyle.
Parameters
[out] | pTypeface | Typeface name of the font, caller has to delete. NULL, if the record uses a SHX font.
[out] | bold | Bold if and only if true. Adesk::kFalse, if the record uses a SHX font.
[out] | italic | Italic if and only if true. Adesk::kFalse, if the record uses a SHX font.
[out] | charset | Windows character set identitier. 0, if the record uses a SHX font.
[out] | pitchAndFamily | Windows pitch and character family identifier. 0, if the record uses a SHX font.
Returns
Acad::eOutOfMemory or Acad:.eOk
Remarks
For an uninitialized font other CAD libraries may return 1 for charset and BRX returns 0.
◆ font() [3/3]
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbTextStyleTableRecord::font  |  ( |  AcString &  |  sTypeface,
|  Adesk::Boolean &  |  bold,
|  Adesk::Boolean &  |  italic,
|  Charset &  |  charset,
|  Bricsys::BRX::PAL::FontUtils::FontPitch &  |  pitch,
|  Bricsys::BRX::PAL::FontUtils::FontFamily &  |  family
) |   |  const
Returns the Windows font characteristics for this TextStyle.
Parameters
[out] | sTypeface | Typeface name of the font. Empty string if the record uses a SHX font.
[out] | bold | Bold if and only if true. Adesk::kFalse, if the record uses a SHX font.
[out] | italic | Italic if and only if true. Adesk::kFalse, if the record uses a SHX font.
[out] | charset | Windows character set identitier. 0, if the record uses a SHX font.
[out] | pitch | font pitch.
[out] | family | font family identifier.
Returns
Acad::eOutOfMemory or Acad:.eOk
Remarks
For an uninitialized font other CAD libraries may return 1 for charset and BRX returns 0.
◆ isShapeFile()
 UX_EXPORT_FUNCTION Adesk::Boolean AcDbTextStyleTableRecord::isShapeFile  |  ( |   | ) |   const
Returns true if and only if the text font file for this TextStyle is interpreted as a shape file (DXF 70, bit 1).
Returns
Adesk::kTrue, if text font is a shape file
 Adesk:kFalse, if text font is no shape file.
◆ isVertical()
 UX_EXPORT_FUNCTION Adesk::Boolean AcDbTextStyleTableRecord::isVertical  |  ( |   | ) |   const
Returns true if and only if text is drawn vertically with this TextStyle (DXF 70, bit 3).
Returns
Adesk::kTrue, if text is vertical
 Adesk:kFalse, if text is not vertical.
◆ obliquingAngle()
 UX_EXPORT_FUNCTION double AcDbTextStyleTableRecord::obliquingAngle  |  ( |   | ) |   const
Returns the obliquing angle for this TextStyle (DXF 50).
The obliquing angle indicates how much the text is "italic". Positiv values create characters canted over forward to the text direction, negative values create characters canted over backwards in respect to the text direction. The range of obliquingAngle is ±1.48335 radians (±85°). Negative angles will have 2PI added to them.
Returns
obliquing angle
◆ priorSize()
 UX_EXPORT_FUNCTION double AcDbTextStyleTableRecord::priorSize  |  ( |   | ) |   const
Returns the text size of the text most recently created with this TextStyle (DXF 42).
Returns
last used size for this TextStyle.
◆ setBigFontFileName()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbTextStyleTableRecord::setBigFontFileName  |  ( |  const ACHAR *  |  fileName | )
Sets the name of the BigFont file associated with this TextStyle (DXF 4).
Parameters
[in] | fileName | name of the bigfont file to set
Returns
Acad::eOutOfMemory or Acad::eOk,
◆ setFileName()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbTextStyleTableRecord::setFileName  |  ( |  const ACHAR *  |  fileName | )
Sets the name of the font file associated with this TextStyle (DXF 3).
Parameters
[in] | fileName | name of the font file to set
Returns
Acad::eOutOfMemory or Acad::eOk,
◆ setFlagBits()
 UX_EXPORT_FUNCTION void AcDbTextStyleTableRecord::setFlagBits  |  ( |  Adesk::UInt8  |  flagBits | )
Sets the flag bits for this textstyle (Bit 2 and 3 of DXF 71).
If the 2nd bit is set, the text will be drawn backwards, if the 3rd bit set the text will be is drawn upside down, the other bits are not used.
Parameters
[in] | flagBits | 00000000 00000100 00000010 00000110
0 - neither backwards nor upside down
2 - backwards, not upside down
4 - not backwards, upside down
6 - backwards and upside down
◆ setFont() [1/2]
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbTextStyleTableRecord::setFont  |  ( |  const ACHAR *  |  pTypeface,
|  Adesk::Boolean  |  bold,
|  Adesk::Boolean  |  italic,
|  Charset  |  charset,
|  Bricsys::BRX::PAL::FontUtils::FontPitch  |  pitch,
|  Bricsys::BRX::PAL::FontUtils::FontFamily  |  family,
|  Adesk::Boolean  |  bAllowMissingFont = Adesk::kFalse
)
Sets this TextStyle to use the specified Windows font characteristics.
If typeface is NULL, the Windows font information is removed from this text style. To set an SHX font, the function setFileName has to be used.
Parameters
[in] | pTypeface | Typeface name of the font.
[in] | bold | Bold if and only if true.
[in] | italic | Italic if and only if true.
[in] | charset | Windows character set identitier.
[in] | pitch | font pitch.
[in] | family | font family identifier.
[in] | bAllowMissingFont | when true, the call succeeds even if the font is not found
Returns
Acad::eInvalidInput if bAllowMissingFont is false and the font is not installed on environment Acad::eOk if successful
◆ setFont() [2/2]
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbTextStyleTableRecord::setFont  |  ( |  const ACHAR *  |  pTypeface,
|  Adesk::Boolean  |  bold,
|  Adesk::Boolean  |  italic,
|  int  |  charset,
|  int  |  pitchAndFamily
)
Sets this TextStyle to use the specified Windows font characteristics.
If typeface is NULL, the Windows font information is removed from this text style. To set an SHX font, the function setFileName has to be used.
Parameters
[in] | pTypeface | Typeface name of the font.
[in] | bold | Bold if and only if true.
[in] | italic | Italic if and only if true.
[in] | charset | Windows character set identitier.
[in] | pitchAndFamily | Windows pitch and character family identifier.
Returns
Acad::eInvalidInput , if the font is not installed on environment Acad::eOk if successful
◆ setIsShapeFile()
 UX_EXPORT_FUNCTION void AcDbTextStyleTableRecord::setIsShapeFile  |  ( |  Adesk::Boolean  |  shape | )
Sets the flag which controls if the text font file for this TextStyle is interpreted as a shape file (DXF 70, bit 1).
Parameters
[in] | shape | flagvalue to set.
◆ setIsVertical()
 UX_EXPORT_FUNCTION void AcDbTextStyleTableRecord::setIsVertical  |  ( |  Adesk::Boolean  |  bVert | )
Sets the flag which controls if this TextStyle is drawn vertical (DXF 70, bit 3).
Parameters
[in] | bVert | flagvalue to set.
◆ setObliquingAngle()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbTextStyleTableRecord::setObliquingAngle  |  ( |  double  |  obliquingAngle | )
Sets the obliquing angle for this TextStyle (DXF 50).
The obliquing angle indicates how much the text is "italic". Positiv values create characters canted over forward to the text direction, negative values create characters canted over backwards in respect to the text direction. The range of obliquingAngle is ±1.48335 radians (±85°). Negative angles will have 2PI added to them.
Parameters
[in] | obliquingAngle | obliquingAngle to set.
Returns
Acad::eInvalidInput, if obliquingAngle not in range of [-1.48335,1.48335] or corresponding value (2PI added)
 Acad::eOk else
◆ setPriorSize()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbTextStyleTableRecord::setPriorSize  |  ( |  double  |  priorSize | )
Sets the text size of the text most recently created with this TextStyle (DXF 42).
Parameters
[in] | priorSize | last used size for this TextStyle
Returns
Acad::eInvalidInput, if priorSize is not greater 0 Acad::eOk, otherwise
◆ setTextSize()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbTextStyleTableRecord::setTextSize  |  ( |  double  |  tSize | )
Sets the fixed text size for this TextStyle (DXF 40).
If the textsize is 0, the commands using thetextstyle (e.g. TEXT) will prompt for a height to create the text.
Parameters
[in] | tSize | textsize to set
Returns
Acad::eInvalidInput, if tSize is negativ
 Acad::eOk else
◆ setXScale()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbTextStyleTableRecord::setXScale  |  ( |  double  |  xScale | )
Sets the X-scale (width) factor for this TextStyle (DXF 41).
E.g. a width factor xScale of 1.25 is 125% of normal text width.
Parameters
[in] | xScale | width factor to set
Returns
Acad::eInvalidInput, if xScale is 0 or negativ
 Acad::eOk else
◆ textSize()
 UX_EXPORT_FUNCTION double AcDbTextStyleTableRecord::textSize  |  ( |   | ) |   const
Returns the fixed text size for this TextStyle (DXF 40).
Returns
textsize
◆ xScale()
 UX_EXPORT_FUNCTION double AcDbTextStyleTableRecord::xScale  |  ( |   | ) |   const
Returns the X-scale (width) factor for this TextStyle (DXF 41).
Returns
width factor