Public Member Functions | Public Attributes | List of all members
AcDbIdMappingIter Class Reference
_ More...
#include <AcDbIdMappingIter.h>
 Public Member Functions
AcDbIdMappingIter (const AcDbIdMapping &)
virtual bool  | done ()
Test for the last entry in the map. More...
virtual bool  | getMap (AcDbIdPair &)
Gets the current idPair. More...
virtual Acad::ErrorStatus  | iterateOn (const AcDbIdMapping &)
Sets an AcDbIdMapping the iterator iterates over. More...
virtual bool  | next ()
Sets the iterator current position to be the next idPair. More...
 virtual void  | start ()
Sets the iterator current position to be at the first idPair entry.
 Public Member Functions inherited from AcRxObject
virtual AcRxObject *  | clone () const
Exported and implemented. More...
 virtual AcRx::Ordering  | comparedTo (const AcRxObject *) const
Exported and implemented.
virtual Acad::ErrorStatus  | copyFrom (const AcRxObject *)
Exported and implemented. More...
 virtual AcRxClass *  | isA () const
Exported and implemented.
virtual Adesk::Boolean  | isEqualTo (const AcRxObject *) const
Exported and implemented. More...
bool  | isKindOf (const AcRxClass *) const
Checks the object class. More...
AcRxObject *  | queryX (const AcRxClass *) const
returns the protocol extension object assigned to this class or a parent class. More...
AcRxObject *  | x (const AcRxClass *) const
returns the protocol extension object assigned to this class or a parent class. More...
 virtual  | ~AcRxObject ()
Destructor.
 Public Attributes
AcDbIdMappingIter
Default constructor.
 Additional Inherited Members
 Static Public Member Functions inherited from AcRxObject
 static AcRxObject *  | cast (const AcRxObject *)
 static AcRxClass *  | desc ()
Exported and implemented.
 Protected Member Functions inherited from AcRxObject
AcRxObject ()
Exported and implemented.
Detailed Description
_
Member Function Documentation
◆ done()
 UX_EXPORT_FUNCTION bool AcDbIdMappingIter::done  |  ( |  void  |   | )
virtual
Test for the last entry in the map.
Returns
true if the current entry is the last one, false otherwise
◆ getMap()
 UX_EXPORT_FUNCTION bool AcDbIdMappingIter::getMap  |  ( |  AcDbIdPair &  |  acPair | )
virtual
Gets the current idPair.
Parameters
[out] | idPair | the current pair
Returns
true if successful, false otherwise
◆ iterateOn()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbIdMappingIter::iterateOn  |  ( |  const AcDbIdMapping &  |  acIdMap | )
virtual
Sets an AcDbIdMapping the iterator iterates over.
Parameters
[in] | acIdMap | map to iterate over
Returns
Acad:eOk
◆ next()
 UX_EXPORT_FUNCTION bool AcDbIdMappingIter::next  |  ( |  void  |   | )
virtual
Sets the iterator current position to be the next idPair.
Returns
true the next pair is the last one, false otherwise