Public Types | Public Member Functions | Public Attributes | Protected Member Functions | List of all members
AcDbViewportTableRecord Class Reference
_ More...
#include <AcDbViewportTableRecord.h>
 Public Types
 typedef AcDbViewportTable  | TableType
 Public Types inherited from AcDbAbstractViewTableRecord
enum  | RenderMode {
 k2DOptimized = 0 , kWireframe , kHiddenLine , kFlatShaded ,
 kGouraudShaded , kFlatShadedWithWireframe , kGouraudShadedWithWireframe
 }
 Public Types inherited from AcDbSymbolTableRecord
 typedef AcDbSymbolTable  | TableType
 Public Types inherited from AcGiDrawable
enum  | DrawableType {
 kGeometry = 0 , kDistantLight , kPointLight , kSpotLight ,
 kAmbientLight , kSolidBackground , kGradientBackground , kImageBackground ,
 kGroundPlaneBackground , kViewport
 }
enum  | SetAttributesFlags {
 kDrawableNone = 0 , kDrawableIsAnEntity = 1 , kDrawableUsesNesting = 2 , kDrawableIsCompoundObject = 4 ,
 kDrawableViewIndependentViewportDraw = 8 , kDrawableIsInvisible = 16 , kDrawableHasAttributes = 32 , kDrawableRegenTypeDependentGeometry = 64 ,
 kDrawableIsDimension = 133 , kDrawableRegenDraw = 256 , kDrawableStandardDisplaySingleLOD = 512 , kDrawableShadedDisplaySingleLOD = 1024 ,
 kDrawableViewDependentViewportDraw = 2048 , kDrawableBlockDependentViewportDraw = 4096 , kDrawableIsExternalReference = 8192 , kDrawableNotPlottable = 16384 ,
 kDrawableNotAllowLCS = 32768 , kDrawableMergeControlOff = 65536 , kThreadedWorldDrawViewportDraw = 131072
 }
 Public Member Functions
Adesk::UInt16  | circleSides () const
gets the ViewportTableRecord circle zoom % More...
AcGiDrawable *  | drawable ()
 bool  | fastZoomsEnabled () const
 Acad::ErrorStatus  | getCategoryName (ACHAR *&) const
 bool  | gridEnabled () const
gets the ViewportTableRecord grid status return true is grid on = grid off
AcGePoint2d  | gridIncrements () const
gets the ViewportTableRecord X any Y grid spacing More...
 Adesk::Int16  | gridMajor () const
AcGsView *  | gsView () const
Gets the gsView of this viewport table record, in case there is one associated to it. More...
 bool  | iconAtOrigin () const
gets the ViewportTableRecord UCS icon orientation in relation with the UCS Origin return true is UCS icon follow Origin = UCS icon do not follow Origin
 bool  | iconEnabled () const
gets the ViewportTableRecord UCS icon status return true is UCS icon on = UCS icon off
 bool  | isGridAdaptive () const
 bool  | isGridBoundToLimits () const
 bool  | isGridFollow () const
 bool  | isGridSubdivisionRestricted () const
 bool  | isometricSnapEnabled () const
gets the ViewportTableRecord snap mode return true is snap isometric = snap standard
bool  | isUcsSavedWithViewport () const
gets the Ucs per Viewport value More...
AcGePoint2d  | lowerLeftCorner () const
gets the ViewportTableRecord lower left corner More...
Adesk::Int16  | number () const
Gets the number of this viewport table record. More...
 Acad::ErrorStatus  | setCategoryName (const ACHAR *)
void  | setCircleSides (Adesk::UInt16)
gets the ViewportTableRecord circle zoom % More...
 void  | setFastZoomsEnabled (bool)
 void  | setGridAdaptive (bool)
 void  | setGridBoundToLimits (bool)
void  | setGridEnabled (bool)
sets the ViewportTableRecord grid status More...
 void  | setGridFollow (bool)
void  | setGridIncrements (const AcGePoint2d &)
sets the ViewportTableRecord X any Y grid spacing More...
 void  | setGridMajor (Adesk::Int16)
 void  | setGridSubdivisionRestricted (bool)
 void  | setGsView (AcGsView *)
void  | setIconAtOrigin (bool)
sets the ViewportTableRecord UCS icon orientation in relation with the UCS Origin More...
void  | setIconEnabled (bool)
sets the ViewportTableRecord UCS icon status More...
void  | setIsometricSnapEnabled (bool)
sets the ViewportTableRecord snap mode More...
void  | setLowerLeftCorner (const AcGePoint2d &)
sets the ViewportTableRecord lower left corner More...
void  | setSnapAngle (double)
sets the ViewportTableRecord snap angle More...
void  | setSnapBase (const AcGePoint2d &)
sets the ViewportTableRecord snap basepoint More...
void  | setSnapEnabled (bool)
sets the ViewportTableRecord snap status More...
void  | setSnapIncrements (const AcGePoint2d &)
sets the ViewportTableRecord X any Y snap grid spacing More...
void  | setSnapPair (Adesk::Int16)
Sets the current iso snap plane. More...
void  | setUcsFollowMode (bool)
sets the ViewportTableRecord UCS follow mode More...
void  | setUcsPerViewport (bool)
sets the Ucs per Viewport value More...
void  | setUpperRightCorner (const AcGePoint2d &)
sets the ViewportTableRecord upper right corner More...
double  | snapAngle () const
gets the ViewportTableRecord snap angle More...
AcGePoint2d  | snapBase () const
gets the ViewportTableRecord snap basepoint More...
 bool  | snapEnabled () const
gets the ViewportTableRecord snap status return true is snap on = snap off
 AcGePoint2d  | snapIncrements () const
gets the ViewportTableRecord snap grid status return true is snap grid on = snap grid off
Adesk::Int16  | snapPair () const
Gets the current iso snap plane. More...
 bool  | ucsFollowMode () const
gets the ViewportTableRecord UCS follow mode return true is a plan view is always displayed if UCS changes = a plan view is not always displayed if UCS changes
AcGePoint2d  | upperRightCorner () const
gets the ViewportTableRecord upper right corner More...
 Public Member Functions inherited from AcDbAbstractViewTableRecord
AcCmColor  | ambientLightColor () const
Returns the color of the ambient light for the viewport. More...
double  | backClipDistance () const
Gets the target - back clip plane distance. More...
bool  | backClipEnabled () const
Gets the back clip status. More...
AcDbObjectId &  | background ()
Returns the AcDbObjectId of assigned background object. More...
const AcDbObjectId &  | background () const
Returns the AcDbObjectId of assigned background object. More...
double  | brightness () const
Gets the brightness for the viewport. More...
AcGePoint2d  | centerPoint () const
Gets the view center point. More...
double  | contrast () const
Gets the contrast for the viewport. More...
AcGiViewportTraits::DefaultLightingType  | defaultLightingType () const
Returns the type of the default lighting for the viewport. More...
double  | elevation () const
Gets the view(port) elevation. More...
bool  | frontClipAtEye () const
Gets the position of the front clip plane. More...
double  | frontClipDistance () const
Gets the target - front clip plane distance. More...
bool  | frontClipEnabled () const
Gets the front clip status. More...
Acad::ErrorStatus  | getUcs (AcGePoint3d &, AcGeVector3d &, AcGeVector3d &) const
Gets the origin, X-axis, and Y-Axis of the UCS associated with this View(port)TableRecord. More...
double  | height () const
Gets the view height. More...
bool  | isDefaultLightingOn () const
Returns the state of the default lighting for the viewport. More...
bool  | isUcsOrthographic (AcDb::OrthographicView &) const
Checks whether the associated coordinate system has an orthographic view with respect to UCSBASE. More...
bool  | isViewOrthographic (AcDb::OrthographicView &) const
Checks whether the view is orthographic with respect to UCSBASE. More...
double  | lensLength () const
Gets the lens length if perspective mode is enabled. More...
bool  | perspectiveEnabled () const
Gets the perspective mode status. More...
RenderMode  | renderMode () const
Gets the render mode. More...
Acad::ErrorStatus  | setAmbientLightColor (const AcCmColor &)
Sets the color of the ambient light for the viewport. More...
void  | setBackClipDistance (double)
Sets the target - back clip plane distance. More...
void  | setBackClipEnabled (bool)
Sets the back clip status. More...
Acad::ErrorStatus  | setBackground (const AcDbObjectId &)
Assigns the AcDbObjectId of a background object to this viewtable record. More...
Acad::ErrorStatus  | setBrightness (double)
Sets the brightness for the viewport. More...
void  | setCenterPoint (const AcGePoint2d &)
The TableRecord will use point parameter as the center of the view. More...
Acad::ErrorStatus  | setContrast (double)
Sets the contrast for the viewport. More...
Acad::ErrorStatus  | setDefaultLightingOn (bool)
Sets default lighting on/off for the viewport. More...
Acad::ErrorStatus  | setDefaultLightingType (AcGiViewportTraits::DefaultLightingType)
Sets default lighting type for the viewport. More...
Acad::ErrorStatus  | setElevation (double)
Sets the view(port) elevation. More...
void  | setFrontClipAtEye (bool)
Sets the position of the front clip plane. More...
void  | setFrontClipDistance (double)
Sets the target - front clip plane distance. More...
void  | setFrontClipEnabled (bool)
Sets the front clip status. More...
void  | setHeight (double)
The TableRecord will use value as the view height in DCS. More...
void  | setLensLength (double)
Sets the lens length if perspective mode is enabled. More...
void  | setPerspectiveEnabled (bool)
Sets the perspective mode status. More...
void  | setRenderMode (RenderMode)
Sets the render mode. More...
Acad::ErrorStatus  | setSun (AcDbObjectId &, AcDbObject *)
The function associates an sun object with this viewport. More...
void  | setTarget (const AcGePoint3d &)
Sets the view target. More...
Acad::ErrorStatus  | setUcs (AcDb::OrthographicView)
Sets the View(port)TableRecord UCS as specified by given OrthographicView. More...
Acad::ErrorStatus  | setUcs (const AcDbObjectId &)
Sets the View(port)TableRecord UCS. More...
Acad::ErrorStatus  | setUcs (const AcGePoint3d &, const AcGeVector3d &, const AcGeVector3d &)
Sets the View(port)TableRecord UCS. More...
Acad::ErrorStatus  | setUcsToWorld ()
The View(port)TableRecord will use the world UCS. More...
Acad::ErrorStatus  | setViewDirection (AcDb::OrthographicView)
Sets the view direction. More...
void  | setViewDirection (const AcGeVector3d &)
Sets the view direction. More...
void  | setViewTwist (double)
Sets the view twist angle. More...
Acad::ErrorStatus  | setVisualStyle (const AcDbObjectId &)
Sets the visual style for the current viewport. More...
void  | setWidth (double)
The TableRecord will use value as the view width in DCS. More...
AcDbObjectId  | sunId () const
The function returns an id.This id was created for associates a sun object with this viewport. More...
AcGePoint3d  | target () const
Gets the view target. More...
AcDbObjectId  | ucsName () const
Gets the AcDbUcsTableRecord object id. More...
AcGeVector3d  | viewDirection () const
Gets the view direction. More...
double  | viewTwist () const
Gets the view twist angle. More...
AcDbObjectId  | visualStyle () const
Returns the ID of the visual style for the viewport. More...
double  | width () const
Gets the view width. More...
 Public Member Functions inherited from AcDbSymbolTableRecord
Acad::ErrorStatus  | getName (ACHAR *&) const
getName. More...
Acad::ErrorStatus  | getName (AcString &) const
getName. More...
Acad::ErrorStatus  | getName (const ACHAR *&) const
getName. More...
bool  | isDependent () const
Returns whether this AcDbSymbolTableRecord is dependending on xref database. More...
bool  | isResolved () const
Returns whether this AcDbSymbolTableRecord is dependending on xref database. More...
Acad::ErrorStatus  | setName (const ACHAR *)
setName. More...
 virtual  | ~AcDbSymbolTableRecord ()
destructor.
 Public Member Functions inherited from AcDbObject
virtual Acad::ErrorStatus  | addPersistentReactor (AcDbObjectId)
Adds a persistent reactor to this object reactor list. More...
Acad::ErrorStatus  | addReactor (AcDbObjectReactor *) const
Adds a transient reactor to this object. More...
virtual Acad::ErrorStatus  | applyPartialUndo (AcDbDwgFiler *, AcRxClass *)
This function is called during Undo operations on objects, that use the 'Partial Undo meachanism'; this is, this object is opened with assertWriteEnabled(Adesk::kFalse) to indicate that custom Undo filing is used rather than the default Undo filing. More...
 void  | assertNotifyEnabled () const
 void  | assertReadEnabled () const
 void  | assertWriteEnabled (Adesk::Boolean=Adesk::kTrue, Adesk::Boolean=Adesk::kTrue)
virtual Acad::ErrorStatus  | audit (AcDbAuditInfo *)
Performs the audit operation for this object. More...
Acad::ErrorStatus  | cancel ()
Reverts all changes since the object had been opened and closes the object. More...
virtual void  | cancelled (const AcDbObject *)
A handler function for persistent reactors. More...
virtual AcRxObject *  | clone () const
Creates a shallow clone of this object. More...
Acad::ErrorStatus  | close ()
Closes the object. More...
Acad::ErrorStatus  | closeAndPage (Adesk::Boolean=Adesk::kTrue)
Closes the object. More...
virtual Acad::ErrorStatus  | composeForLoad (AcDb::OdaSaveType, AcDb::AcDbDwgVersion)
This function is intended for future MT file loading support. More...
virtual void  | copied (const AcDbObject *, const AcDbObject *)
A handler function for persistent reactors. More...
virtual Acad::ErrorStatus  | copyFrom (const AcRxObject *)
Copies the pSrc object information in this object. More...
Acad::ErrorStatus  | createExtensionDictionary ()
Creates a dictionary as extension dictionary for this object. More...
AcDbDatabase *  | database () const
Returns the database that contains this object. More...
virtual Acad::ErrorStatus  | decomposeForSave (AcDb::AcDbDwgVersion, AcDbObject *&, AcDbObjectId &, Adesk::Boolean &)
This function is called during dwg and dxf output, to allow a custom object to decompose itself, due to provided dwg/dxf target file version. More...
virtual Acad::ErrorStatus  | deepClone (AcDbObject *, AcDbObject *&, AcDbIdMapping &, Adesk::Boolean=Adesk::kTrue) const final
Clones this object, appends it to the owner pOwner and adds an AcDbIdPair record to the idMap. More...
void  | disableUndoRecording (Adesk::Boolean)
Disables or enables the undo recording for the object. More...
Acad::ErrorStatus  | downgradeOpen ()
Sets the open mode for an object opened for write to be opened for read. More...
Acad::ErrorStatus  | downgradeToNotify (Adesk::Boolean)
Sets the open mode for an object opened for write to be opened for notify. More...
virtual AcGiDrawable *  | drawable ()
Retrieves the AcGiDrawable instance of this object. More...
Acad::ErrorStatus  | dwgIn (AcDbDwgFiler *)
Calls the object's dwgInFields function, and reads any XData if present. More...
virtual Acad::ErrorStatus  | dwgInFields (AcDbDwgFiler *)
Reads the object from the DWG filer. More...
Acad::ErrorStatus  | dwgOut (AcDbDwgFiler *) const
Calls the object's dwgOutFields function, and writes any XData if present. More...
virtual Acad::ErrorStatus  | dwgOutFields (AcDbDwgFiler *) const
Writes the object to the DWG filer. More...
Acad::ErrorStatus  | dxfIn (AcDbDxfFiler *)
Calls the object's dxfInFields function, and reads any XData if present. More...
virtual Acad::ErrorStatus  | dxfInFields (AcDbDxfFiler *)
Reads the object from the DXF filer. More...
Acad::ErrorStatus  | dxfOut (AcDbDxfFiler *, Adesk::Boolean, Adesk::uchar *) const
Calls the object's dxfOutFields function, and writes any XData if present. More...
virtual Acad::ErrorStatus  | dxfOutFields (AcDbDxfFiler *) const
Writes the object to the DXF filer. More...
Acad::ErrorStatus  | erase (Adesk::Boolean=Adesk::kTrue)
Sets the bit that indicates that the object is erased. More...
virtual void  | erased (const AcDbObject *, Adesk::Boolean)
A handler function for persistent reactors. More...
AcDbObjectId  | extensionDictionary () const
Returns the object id of the extension dictionary for this object. More...
void  | getAcDbHandle (AcDbHandle &) const
Returns handle of this object. More...
Acad::ErrorStatus  | getBinaryData (const ACHAR *, Adesk::Int32 &, char *&) const
Creates a copy of the binary data stored as chunks of maximum 127 bytes in the resbuf chain of this object's extension dictionary xrecord entry given by entryName. More...
int  | getBrxOpenCount () const
This function returns the number of open BRX instances for this object. More...
int  | getBrxOpenState () const
This function returns the BRX object open state flags as bitfields, for diagnostic purpose. More...
virtual Acad::ErrorStatus  | getClassID (CLSID *) const final
Gets the COM wrapper Class ID for this entity. More...
int  | getCustomObjectState () const
This function returns the custom object status : 1=isCustomObject 2=DifferentialUndoDisabled. More...
Acad::ErrorStatus  | getField (const ACHAR *, AcDbField *&, AcDb::OpenMode) const
Retrieves the specified Field from this object, and opens it in mode. More...
Acad::ErrorStatus  | getField (const ACHAR *, AcDbObjectId &) const
Gets the pszPropName field object from field dictionary of this AcDbObject object, using pszPropName as key. More...
AcDbObjectId  | getFieldDictionary () const
Returns the Field dictionary associated with this object,. More...
Acad::ErrorStatus  | getFieldDictionary (AcDbDictionary *&, AcDb::OpenMode) const
Gets and opens the field dictionary for this. More...
Acad::ErrorStatus  | getObjectBirthVersion (AcDb::AcDbDwgVersion &, AcDb::MaintenanceReleaseVersion &)
This function is currently not supported by the CAD engine, always returns Acad::eOk, and 'kDHL_CURRENT' + 'kMReleaseCurrent' results. More...
virtual Acad::ErrorStatus  | getObjectSaveVersion (const AcDbDwgFiler *, AcDb::AcDbDwgVersion &, AcDb::MaintenanceReleaseVersion &)
Returns the DWG version for saving the object. More...
virtual Acad::ErrorStatus  | getObjectSaveVersion (const AcDbDxfFiler *, AcDb::AcDbDwgVersion &, AcDb::MaintenanceReleaseVersion &)
Returns the DWG version for saving the object. More...
int  | getOdaOpenCount () const
This function returns the number of open ODA instances for this object. More...
int  | getOdaOpenState () const
This function returns the ODA object open state flags as bitfields, for diagnostic purpose. More...
virtual void  | goodbye (const AcDbObject *)
A handler function for persistent reactors. More...
Acad::ErrorStatus  | handOverTo (AcDbObject *, Adesk::Boolean=Adesk::kTrue, Adesk::Boolean=Adesk::kTrue)
Hands over objects identity to another object. More...
bool  | hasFields () const
Return true if this object has single or multiple fields associated with him. More...
bool  | hasPersistentReactor (AcDbObjectId) const
Checks the input objectId in this object reactor list. More...
bool  | hasSaveVersionOverride ()
This function indicates whether this object overrides the filer's save version. More...
virtual AcDbObjectId  | id () const
Returns the database id of this object. More...
Adesk::Boolean  | isAcDbObjectIdsInFlux () const
Checks whether a deep clone operation was completed. More...
Adesk::Boolean  | isAProxy () const
Adesk::Boolean  | isCancelling () const
Adesk::Boolean  | isErased () const
Returns whether this object is erased. More...
Adesk::Boolean  | isEraseStatusToggled () const
Checks whether the object erase status has been toggled. More...
Adesk::Boolean  | isModified () const
Returns whether this object's assertWriteEnabled() has been called since it was opened. More...
Adesk::Boolean  | isModifiedGraphics () const
Checks whether this object graphics will be updated when the object is closed. More...
Adesk::Boolean  | isModifiedXData () const
Checks whether this object's xData was modified. More...
Adesk::Boolean  | isNewObject () const
Returns true if and only if this object has not been closed since it was created. More...
Adesk::Boolean  | isNotifyEnabled () const
Returns whether this object is opened for notify. More...
Adesk::Boolean  | isNotifying () const
virtual Adesk::Boolean  | isPersistent () const
Returns the 'persistent' status of a database object. More...
Adesk::Boolean  | isReadEnabled () const
Returns whether this object is opened for read. More...
 Adesk::Boolean  | isReallyClosing () const
Checks whether the next close call will completely close this object return true if on the next call the object will be completely closed false otherwise.
Adesk::Boolean  | isTransactionResident () const
Gets the object transaction status. More...
Adesk::Boolean  | isUndoing () const
bool  | isUndoRecordingDisabled () const
Returns whether the undo recording for the object is enabled or not. More...
Adesk::Boolean  | isWriteEnabled () const
Returns whether this object is opened for write. More...
virtual AcDb::DuplicateRecordCloning  | mergeStyle () const
Returns the object's merge behavior during cloning. More...
virtual void  | modified (const AcDbObject *)
A handler function for persistent reactors. More...
virtual void  | modifiedGraphics (const AcDbEntity *)
A handler function for persistent reactors. More...
virtual void  | modifiedXData (const AcDbObject *)
A handler function for persistent reactors. More...
virtual void  | modifyUndone (const AcDbObject *)
A handler function for persistent reactors. More...
virtual void  | objectClosed (const AcDbObjectId)
A handler function for persistent reactors. More...
AcDbObjectId  | objectId () const
Returns object id. More...
virtual void  | openedForModify (const AcDbObject *)
A handler function for persistent reactors. More...
AcDbObjectId  | ownerId () const
Returns object id of the owner. More...
AcDbVoidPtrArray *  | reactors ()
Gets the object pointers to reactors. More...
const AcDbVoidPtrArray *  | reactors () const
Gets the object pointers to reactors. More...
virtual void  | reappended (const AcDbObject *)
A handler function for persistent reactors. More...
 virtual void  | recvPropagateModify (const AcDbObject *)
Not implemented yet.
Acad::ErrorStatus  | releaseExtensionDictionary ()
Removes the extension dictionary associated with this object. More...
virtual Acad::ErrorStatus  | removeField (AcDbObjectId)
Removes the Field specified by acFieldId from this object. More...
virtual Acad::ErrorStatus  | removeField (const ACHAR *)
Removes the Field specified by szKeyString from this object. More...
virtual Acad::ErrorStatus  | removeField (const ACHAR *, AcDbObjectId &)
Removes the Field specified by acPszKeyString from this object, and returns its ObjectId value. More...
virtual Acad::ErrorStatus  | removePersistentReactor (AcDbObjectId)
Removes a persistent reactor from this object reactor list. More...
Acad::ErrorStatus  | removeReactor (AcDbObjectReactor *) const
Removes a transient reactor to this object. More...
void  | setAcDbObjectIdsInFlux ()
Call this function to indicate that the object IDs of this object and its sub-objects (if any) are not yet valid. More...
Acad::ErrorStatus  | setBinaryData (const ACHAR *, Adesk::Int32, const char *)
Creates a copy of the binary data, divides it in up to 127 bytes binary chunks and
 sets them as resbufs in the resbuf chain of this object's extension dictionary xrecord entry given by entryName. More...
virtual Acad::ErrorStatus  | setField (const ACHAR *, AcDbField *, AcDbObjectId &)
Adds the pAcField field object to field dictionary of this AcDbObject object, using pKey as key. More...
void  | setHasSaveVersionOverride (bool)
This function can be called to specify that the object has a "save version override". More...
virtual Acad::ErrorStatus  | setOwnerId (AcDbObjectId)
Sets the ownerId data member of the object to be objId. More...
virtual Acad::ErrorStatus  | setXData (const resbuf *)
Sets/removes xData associated with this object. More...
virtual Acad::ErrorStatus  | subCancel ()
Possibility to veto a cancel operation from within custom entities. More...
virtual Acad::ErrorStatus  | subClose ()
virtual Acad::ErrorStatus  | subErase (Adesk::Boolean)
This hook is called during an AcDbObject::erase call, before any actual erase operation is performed. More...
 virtual Acad::ErrorStatus  | subHandOverTo (AcDbObject *)
virtual void  | subObjModified (const AcDbObject *, const AcDbObject *)
A handler function for persistent reactors. More...
 virtual Acad::ErrorStatus  | subOpen (AcDb::OpenMode)
virtual Acad::ErrorStatus  | subSwapIdWith (AcDbObjectId, Adesk::Boolean=Adesk::kFalse, Adesk::Boolean=Adesk::kFalse)
This hook is called during an AcDbObject::swapIdWith() call, before any actual swap operation is performed. More...
Acad::ErrorStatus  | swapIdWith (AcDbObjectId, Adesk::Boolean=Adesk::kFalse, Adesk::Boolean=Adesk::kFalse)
Swaps the object id's between the object identified by param swapId and this object. More...
virtual Acad::ErrorStatus  | swapReferences (const AcDbIdMapping &)
Not implemented yet. More...
virtual void  | unappended (const AcDbObject *)
A handler function for persistent reactors. More...
AcDbDwgFiler *  | undoFiler ()
Gets the undo filer for this object. More...
Acad::ErrorStatus  | upgradeFromNotify (Adesk::Boolean &)
Upgrades the open status of this object to AcDb::kForWrite, if this object is already open (either in AcDb::kForRead, AcDb::kForNotify or AcDb::kForWrite) More...
Acad::ErrorStatus  | upgradeOpen ()
Changes the objects open mode to AcDb::kForWrite and sends notifications. More...
virtual Acad::ErrorStatus  | wblockClone (AcRxObject *, AcDbObject *&, AcDbIdMapping &, Adesk::Boolean=Adesk::kTrue) const final
Clones this object, appends it to the owner pOwner and adds an AcDbIdPair record to the idMap. More...
virtual resbuf *  | xData (const ACHAR *=NULL) const
Returns the xData associated with this object. More...
Acad::ErrorStatus  | xDataTransformBy (const AcGeMatrix3d &)
Transforms the extended data according to parameter transformation matrix. More...
 virtual void  | xmitPropagateModify () const
Not implemented yet.
 virtual  | ~AcDbObject ()
Destructor.
 Public Member Functions inherited from AcGiDrawable
virtual bool  | bounds (AcDbExtents &) const
virtual DrawableType  | drawableType () const
 virtual AcGiDrawStream *  | drawStream () const
 AcGsNode *  | gsNode () const
virtual AcDbObjectId  | id () const =0
virtual Adesk::Boolean  | isPersistent () const =0
virtual Adesk::UInt32  | regenSupportFlags () const final
Returns whether and to which level this object supports MultiThreading. More...
 virtual Adesk::Boolean  | RolloverHit (Adesk::ULongPtr, Adesk::ULongPtr, Adesk::Boolean)
 virtual Adesk::UInt32  | setAttributes (AcGiDrawableTraits *) final
 virtual void  | setDrawStream (AcGiDrawStream *)
 void  | setGsNode (AcGsNode *)
 virtual void  | viewportDraw (AcGiViewportDraw *) final
 virtual Adesk::UInt32  | viewportDrawLogicalFlags (AcGiViewportDraw *) final
 virtual Adesk::Boolean  | worldDraw (AcGiWorldDraw *) final
 Public Member Functions inherited from AcRxObject
virtual AcRxObject *  | clone () const
Exported and implemented. More...
 virtual AcRx::Ordering  | comparedTo (const AcRxObject *) const
Exported and implemented.
virtual Acad::ErrorStatus  | copyFrom (const AcRxObject *)
Exported and implemented. More...
 virtual AcRxClass *  | isA () const
Exported and implemented.
virtual Adesk::Boolean  | isEqualTo (const AcRxObject *) const
Exported and implemented. More...
bool  | isKindOf (const AcRxClass *) const
Checks the object class. More...
AcRxObject *  | queryX (const AcRxClass *) const
returns the protocol extension object assigned to this class or a parent class. More...
AcRxObject *  | x (const AcRxClass *) const
returns the protocol extension object assigned to this class or a parent class. More...
 virtual  | ~AcRxObject ()
Destructor.
 Public Attributes
AcDbViewportTableRecord
default constructor
 Public Attributes inherited from AcDbAbstractViewTableRecord
AcDbAbstractViewTableRecord
AcDbAbstractViewTableRecord class default constructor. More...
 Public Attributes inherited from AcDbSymbolTableRecord
AcDbSymbolTableRecord
only derived constructors are used.
 Protected Member Functions
virtual Adesk::UInt32  | subSetAttributes (AcGiDrawableTraits *)
virtual Adesk::Boolean  | subWorldDraw (AcGiWorldDraw *)
Creates a viewport-independent graphical representation of the object. More...
 Protected Member Functions inherited from AcDbObject
virtual Acad::ErrorStatus  | subDeepClone (AcDbObject *, AcDbObject *&, AcDbIdMapping &, Adesk::Boolean=true) const
virtual Acad::ErrorStatus  | subGetClassID (CLSID *) const
virtual Adesk::UInt32  | subSetAttributes (AcGiDrawableTraits *)
Sets the values of this object's subentity traits and returns with the calling object's subentity traits. More...
virtual void  | subViewportDraw (AcGiViewportDraw *)
virtual Adesk::UInt32  | subViewportDrawLogicalFlags (AcGiViewportDraw *)
virtual Acad::ErrorStatus  | subWblockClone (AcRxObject *, AcDbObject *&, AcDbIdMapping &, Adesk::Boolean=true) const
virtual Adesk::Boolean  | subWorldDraw (AcGiWorldDraw *)
 Protected Member Functions inherited from AcGiDrawable
virtual Adesk::UInt32  | subRegenSupportFlags () const
Returns whether and to which level this object supports MultiThreading. More...
virtual Adesk::UInt32  | subSetAttributes (AcGiDrawableTraits *)=0
virtual void  | subViewportDraw (AcGiViewportDraw *)=0
 virtual Adesk::UInt32  | subViewportDrawLogicalFlags (AcGiViewportDraw *)
virtual Adesk::Boolean  | subWorldDraw (AcGiWorldDraw *)=0
 Protected Member Functions inherited from AcRxObject
AcRxObject ()
Exported and implemented.
 Additional Inherited Members
 Static Public Member Functions inherited from AcRxObject
 static AcRxObject *  | cast (const AcRxObject *)
 static AcRxClass *  | desc ()
Exported and implemented.
 Static Public Member Functions inherited from AcHeapOperators
 static void  | operator delete (void *)
_
 static void  | operator delete (void *, const char *, int)
 static void  | operator delete (void *, void *)
 static void  | operator delete[] (void *)
_
 static void  | operator delete[] (void *, const char *, int)
 static void *  | operator new (size_t)
_
 static void *  | operator new (size_t, const char *, int)
 static void *  | operator new (size_t, void *p)
 static void *  | operator new[] (size_t)
_
 static void *  | operator new[] (size_t, const char *, int)
Detailed Description
_
Member Function Documentation
◆ circleSides()
 UX_EXPORT_FUNCTION Adesk::UInt16 AcDbViewportTableRecord::circleSides  |  ( |   | ) |   const
gets the ViewportTableRecord circle zoom %
Returns
circle zoom percent
◆ drawable()
 UX_EXPORT_FUNCTION AcGiDrawable * AcDbViewportTableRecord::drawable  |  ( |   | )
virtual
See also
AcDbAbstractViewTableRecord::drawable()
Reimplemented from AcDbObject.
◆ gridIncrements()
 UX_EXPORT_FUNCTION AcGePoint2d AcDbViewportTableRecord::gridIncrements  |  ( |   | ) |   const
gets the ViewportTableRecord X any Y grid spacing
Returns
x coordinate is X grid spacing
 y coordinate is Y grid spacing
◆ gsView()
 UX_EXPORT_FUNCTION AcGsView * AcDbViewportTableRecord::gsView  |  ( |   | ) |   const
Gets the gsView of this viewport table record, in case there is one associated to it.
Returns
pointer to the associated AcGsView or NULL in case there is no associated gsView
◆ isUcsSavedWithViewport()
 UX_EXPORT_FUNCTION bool AcDbViewportTableRecord::isUcsSavedWithViewport  |  ( |   | ) |   const
gets the Ucs per Viewport value
Returns
true is UCS will be active toghether with the viweport false is UCS will not be active toghether with the viweport
◆ lowerLeftCorner()
 UX_EXPORT_FUNCTION AcGePoint2d AcDbViewportTableRecord::lowerLeftCorner  |  ( |   | ) |   const
gets the ViewportTableRecord lower left corner
Returns
lower left corner
◆ number()
 UX_EXPORT_FUNCTION Adesk::Int16 AcDbViewportTableRecord::number  |  ( |   | ) |   const
Gets the number of this viewport table record.
Returns
viewport number
◆ setCircleSides()
 UX_EXPORT_FUNCTION void AcDbViewportTableRecord::setCircleSides  |  ( |  Adesk::UInt16  |  sides | )
gets the ViewportTableRecord circle zoom %
Parameters
[in] | sides | circle zoom percent
◆ setGridEnabled()
 UX_EXPORT_FUNCTION void AcDbViewportTableRecord::setGridEnabled  |  ( |  bool  |  bGrid | )
sets the ViewportTableRecord grid status
Parameters
[in] | bSnap | true is grid on false is grid off
◆ setGridIncrements()
 UX_EXPORT_FUNCTION void AcDbViewportTableRecord::setGridIncrements  |  ( |  const AcGePoint2d &  |  xyValue | )
sets the ViewportTableRecord X any Y grid spacing
Parameters
[in] | xyValue | x coordinate is X grid spacing
 y coordinate is Y grid spacing
◆ setIconAtOrigin()
 UX_EXPORT_FUNCTION void AcDbViewportTableRecord::setIconAtOrigin  |  ( |  bool  |  bOriginIcon | )
sets the ViewportTableRecord UCS icon orientation in relation with the UCS Origin
Parameters
[in] | bSnap | true is UCS icon follow Origin false is UCS icon is in the viewport lower left corner
◆ setIconEnabled()
 UX_EXPORT_FUNCTION void AcDbViewportTableRecord::setIconEnabled  |  ( |  bool  |  bIcon | )
sets the ViewportTableRecord UCS icon status
Parameters
[in] | bSnap | true is UCS icon on false is UCS icon off
◆ setIsometricSnapEnabled()
 UX_EXPORT_FUNCTION void AcDbViewportTableRecord::setIsometricSnapEnabled  |  ( |  bool  |  bIsometricSnap | )
sets the ViewportTableRecord snap mode
Parameters
[in] | bSnap | true is snap isometric false is snap standard
◆ setLowerLeftCorner()
 UX_EXPORT_FUNCTION void AcDbViewportTableRecord::setLowerLeftCorner  |  ( |  const AcGePoint2d &  |  Corner | )
sets the ViewportTableRecord lower left corner
Parameters
[in] | Corner | lower left corner
◆ setSnapAngle()
 UX_EXPORT_FUNCTION void AcDbViewportTableRecord::setSnapAngle  |  ( |  double  |  angle | )
sets the ViewportTableRecord snap angle
Parameters
[in] | angle | snap angle
◆ setSnapBase()
 UX_EXPORT_FUNCTION void AcDbViewportTableRecord::setSnapBase  |  ( |  const AcGePoint2d &  |  Point | )
sets the ViewportTableRecord snap basepoint
Parameters
[in] | Point | snap basepoint
◆ setSnapEnabled()
 UX_EXPORT_FUNCTION void AcDbViewportTableRecord::setSnapEnabled  |  ( |  bool  |  bSnap | )
sets the ViewportTableRecord snap status
Parameters
[in] | bSnap | true is snap on false is snap off
◆ setSnapIncrements()
 UX_EXPORT_FUNCTION void AcDbViewportTableRecord::setSnapIncrements  |  ( |  const AcGePoint2d &  |  xyValue | )
sets the ViewportTableRecord X any Y snap grid spacing
Parameters
[in] | xyValue | x coordinate is X snap grid spacing
 y coordinate is Y snap grid spacing
◆ setSnapPair()
 UX_EXPORT_FUNCTION void AcDbViewportTableRecord::setSnapPair  |  ( |  Adesk::Int16  |  isoPlane | )
Sets the current iso snap plane.
Parameters
[in] | isoPlane | new iso snap plane (0 = left, 1 = top, 2 = right)
◆ setUcsFollowMode()
 UX_EXPORT_FUNCTION void AcDbViewportTableRecord::setUcsFollowMode  |  ( |  bool  |  mode | )
sets the ViewportTableRecord UCS follow mode
Parameters
[in] | bSnap | true is UCS follow mode on false is UCS follow mode off
◆ setUcsPerViewport()
 UX_EXPORT_FUNCTION void AcDbViewportTableRecord::setUcsPerViewport  |  ( |  bool  |  value | )
sets the Ucs per Viewport value
Parameters
[in] | value | true is UCS will be active toghether with the viweport false is UCS will not be active toghether with the viweport
◆ setUpperRightCorner()
 UX_EXPORT_FUNCTION void AcDbViewportTableRecord::setUpperRightCorner  |  ( |  const AcGePoint2d &  |  Corner | )
sets the ViewportTableRecord upper right corner
Parameters
[in] | Corner | upper right corner
◆ snapAngle()
 UX_EXPORT_FUNCTION double AcDbViewportTableRecord::snapAngle  |  ( |   | ) |   const
gets the ViewportTableRecord snap angle
Returns
snap angle
◆ snapBase()
 UX_EXPORT_FUNCTION AcGePoint2d AcDbViewportTableRecord::snapBase  |  ( |   | ) |   const
gets the ViewportTableRecord snap basepoint
Returns
snap basepoint
◆ snapPair()
 UX_EXPORT_FUNCTION Adesk::Int16 AcDbViewportTableRecord::snapPair  |  ( |   | ) |   const
Gets the current iso snap plane.
Returns
current iso snap plane (0 = left, 1 = top, 2 = right)
◆ subSetAttributes()
 UX_EXPORT_FUNCTION Adesk::UInt32 AcDbViewportTableRecord::subSetAttributes  |  ( |  AcGiDrawableTraits *  |  pTraits | )
protectedvirtual
See also
AcDbViewportTableRecord::setAttributes(AcGiDrawableTraits*)
Reimplemented from AcDbObject.
◆ subWorldDraw()
 UX_EXPORT_FUNCTION Adesk::Boolean AcDbViewportTableRecord::subWorldDraw  |  ( |  AcGiWorldDraw *  |  pWd | )
protectedvirtual
Creates a viewport-independent graphical representation of the object.
Parameters
[in] | pWd | pointer to initialized AcGiWorldDraw interface
Returns
if false, viewportDraw() must be called,
 if true, the graphical representation is viewport-independent
Reimplemented from AcDbObject.
◆ upperRightCorner()
 UX_EXPORT_FUNCTION AcGePoint2d AcDbViewportTableRecord::upperRightCorner  |  ( |   | ) |   const
gets the ViewportTableRecord upper right corner
Returns
upper right corner