Public Types | Public Member Functions | Public Attributes | List of all members
AcDbHatch Class Reference
_ More...
#include <AcDbHatch.h>
 Public Types
enum  | GradientPatternType { kPreDefinedGradient = 0 , kUserDefinedGradient }
enum  | HatchEdgeType { kLine = 1 , kCirArc , kEllArc , kSpline }
enum  | HatchLoopType {
 kDefault = 0 , kExternal = 1 , kPolyline = 2 , kDerived = 4 ,
 kTextbox = 8 , kOutermost = 16 , kNotClosed = 32 , kSelfIntersecting = 64 ,
 kTextIsland = 128 , kDuplicate = 256
 }
enum  | HatchObjectType { kHatchObject = 0 , kGradientObject }
enum  | HatchPatternType { kUserDefined = 0 , kPreDefined , kCustomDefined }
enum  | HatchStyle { kNormal = 0 , kOuter , kIgnore }
 Public Types inherited from AcDbEntity
enum  | VisualStyleType { kFullVisualStyle = 0 , kFaceVisualStyle = 1 , kEdgeVisualStyle = 2 }
 Public Types inherited from AcGiDrawable
enum  | DrawableType {
 kGeometry = 0 , kDistantLight , kPointLight , kSpotLight ,
 kAmbientLight , kSolidBackground , kGradientBackground , kImageBackground ,
 kGroundPlaneBackground , kViewport
 }
enum  | SetAttributesFlags {
 kDrawableNone = 0 , kDrawableIsAnEntity = 1 , kDrawableUsesNesting = 2 , kDrawableIsCompoundObject = 4 ,
 kDrawableViewIndependentViewportDraw = 8 , kDrawableIsInvisible = 16 , kDrawableHasAttributes = 32 , kDrawableRegenTypeDependentGeometry = 64 ,
 kDrawableIsDimension = 133 , kDrawableRegenDraw = 256 , kDrawableStandardDisplaySingleLOD = 512 , kDrawableShadedDisplaySingleLOD = 1024 ,
 kDrawableViewDependentViewportDraw = 2048 , kDrawableBlockDependentViewportDraw = 4096 , kDrawableIsExternalReference = 8192 , kDrawableNotPlottable = 16384 ,
 kDrawableNotAllowLCS = 32768 , kDrawableMergeControlOff = 65536 , kThreadedWorldDrawViewportDraw = 131072
 }
 Public Member Functions
Acad::ErrorStatus  | appendLoop (Adesk::Int32, const AcDbObjectIdArray &)
Appends a loop to the hatch. More...
Acad::ErrorStatus  | appendLoop (Adesk::Int32, const AcGePoint2dArray &, const AcGeDoubleArray &)
Appends a new polyline loop to the hatch entity loop. More...
Acad::ErrorStatus  | appendLoop (Adesk::Int32, const AcGeVoidPointerArray &, const AcGeIntArray &)
Appends a new non polyline loop to the hatch entity loop. More...
 bool  | associative () const
Gets the the hatch entity associativity flag.
AcCmColor  | backgroundColor () const
The function returns for the hatch entity the background's color. More...
virtual bool  | castShadows () const
See AcDbEntity::castShadows() . More...
 double  | elevation () const
Gets the hatch entity elevation.
 Acad::ErrorStatus  | evaluateGradientColorAt (float, AcCmColor &)
Acad::ErrorStatus  | evaluateHatch (bool=false)
Evaluates the hatch. More...
Acad::ErrorStatus  | getArea (double &) const
Evaluate the area of the hatch object. More...
Acad::ErrorStatus  | getAssocObjIds (AcDbObjectIdArray &) const
Returns objectIds of associative boundary entities. More...
Acad::ErrorStatus  | getAssocObjIdsAt (int, AcDbObjectIdArray &) const
Gets the identifiers associated to the loop at the given index. More...
Acad::ErrorStatus  | getGradientColors (unsigned int &, AcCmColor *&, float *&)
Returns the hatch entity gradient colors. More...
Adesk::Boolean  | getGradientOneColorMode () const
The gradient hatch is transitioning from a start to a stop color or to have the same color luminance version. More...
Acad::ErrorStatus  | getHatchLineDataAt (int, AcGePoint2d &, AcGePoint2d &) const
Get start and end points for the hatch line at index acIndex. More...
Acad::ErrorStatus  | getHatchLinesData (AcGePoint2dArray &, AcGePoint2dArray &) const
Get start and end points for all the hatch lines; the arrays should have the same length; acStartPoints[idx] and acEndPoint[idx] represent the 'idx' line of the hatch. More...
Acad::ErrorStatus  | getLoopAt (int, Adesk::Int32 &, AcGePoint2dArray &, AcGeDoubleArray &) const
Gets the hatch entity loop definition data for a polyline boundary. More...
Acad::ErrorStatus  | getLoopAt (int, Adesk::Int32 &, AcGeVoidPointerArray &, AcGeIntArray &) const
Gets the hatch entity loop definition data for a non polyline boundary. More...
Acad::ErrorStatus  | getPatternDefinitionAt (int, double &, double &, double &, double &, double &, AcGeDoubleArray &) const
Returns the pattern definition line for this hatch. More...
virtual Acad::ErrorStatus  | getPlane (AcGePlane &, AcDb::Planarity &) const
AcDbRegion *  | getRegionArea () const
This function creates a region representing the hatch area from the boundary loops of the hatch. More...
float  | getShadeTintValue () const
The function returns the tint shade value in the range of 0.0 to 1.0. More...
double  | gradientAngle () const
The function returns the angle of current gradient. More...
const ACHAR *  | gradientName () const
Gets the hatch entity gradient name. More...
float  | gradientShift () const
The function returns the diference between value of the gradient definition's default and shifted value. More...
 GradientPatternType  | gradientType () const
Gets the hatch entity gradient type.
HatchObjectType  | hatchObjectType () const
Returns object type of the hatch. More...
HatchStyle  | hatchStyle () const
Gets the style of this hatch. More...
Acad::ErrorStatus  | insertLoopAt (int, Adesk::Int32, const AcDbObjectIdArray &)
Inserts a new boundary loop to the hatch entity. More...
Acad::ErrorStatus  | insertLoopAt (int, Adesk::Int32, const AcGePoint2dArray &, const AcGeDoubleArray &)
Inserts a new loop into the boundary loop list of the hatch entity. More...
Acad::ErrorStatus  | insertLoopAt (int, Adesk::Int32, const AcGeVoidPointerArray &, const AcGeIntArray &)
Inserts a new loop into the hatch boundary loop list. More...
virtual Adesk::Boolean  | isGradient () const
Check whether this hatch object uses a gradient pattern fill. More...
virtual Adesk::Boolean  | isHatch () const
Check whether this hatch object uses a hatched pattern fill. More...
virtual Adesk::Boolean  | isPlanar () const
bool  | isSolidFill () const
Gets the hatch entity fill type. More...
 bool  | lineGenerationEnabled () const
Adesk::Int32  | loopTypeAt (int) const
Gets the hatch entity loop type. More...
virtual void  | modifiedGraphics (const AcDbEntity *)
AcGeVector3d  | normal () const
Gets the normal vector for the hatch entity internal. More...
int  | numHatchLines () const
Get the number of lines created by a hatch after applying evaluateHatch() More...
int  | numLoops () const
Gets the hatch entity number of boundary loops. More...
int  | numPatternDefinitions () const
Gets the number of pattern definition lines for this hatch. More...
 AcGePoint2d  | originPoint () const
Gets the hatch entity origin point.
 double  | patternAngle () const
Gets pattern angle for a hatch entity.
bool  | patternDouble () const
Returns whether this pattern is double hatched (cross hatched). More...
 const ACHAR *  | patternName () const
Gets the hatch entity pattern name.
 double  | patternScale () const
Gets the hatch entity pattern scale.
double  | patternSpace () const
Returns the space for the pattern. More...
HatchPatternType  | patternType () const
Returns type of the pattern. More...
virtual bool  | receiveShadows () const
See AcDbEntity::receiveShadows() . More...
Acad::ErrorStatus  | removeAssocObjIds ()
Removes the associated boundary object ids with the hatch. More...
void  | removeHatchLines ()
Clears the hatch line cache of non-solid and non-gradient hatch object. More...
Acad::ErrorStatus  | removeLoopAt (int)
Removes the loop at given position @idx from the hatch. More...
 Acad::ErrorStatus  | setAssociative (bool)
Sets the the hatch entity associativity flag.
Acad::ErrorStatus  | setBackgroundColor (const AcCmColor &)
The hatch,s background color is set by this function. More...
virtual void  | setCastShadows (bool)
See AcDbEntity::setCastShadows(bool) . More...
 Acad::ErrorStatus  | setElevation (double)
Sets the hatch entity elevation.
Acad::ErrorStatus  | setGradient (GradientPatternType, const ACHAR *)
Sets the hatch entity gradient type and gradient name. More...
Acad::ErrorStatus  | setGradientAngle (double)
Sets the angle for the gradient hatch pattern. More...
Acad::ErrorStatus  | setGradientColors (unsigned int, AcCmColor *, float *)
Sets the hatch entity gradient colors. More...
Acad::ErrorStatus  | setGradientOneColorMode (Adesk::Boolean)
Sets the hatch entity gradient If is it false than the transition will be from a start color to the stop color If is it true than It will adjust the luminance version of the same color. More...
Acad::ErrorStatus  | setGradientShift (float)
The diference beetween the shifted values and the gradient definition default is set by this function. More...
Acad::ErrorStatus  | setHatchObjectType (HatchObjectType)
Sets object type of the hatch. More...
 Acad::ErrorStatus  | setHatchStyle (HatchStyle)
Sets the hatch entity hatch hatchStyle.
 bool  | setLineGenerationEnabled (bool)
 Acad::ErrorStatus  | setNormal (const AcGeVector3d &)
Sets the normal vector for the hatch entity.
 Acad::ErrorStatus  | setOriginPoint (const AcGePoint2d &)
Sets the hatch entity origin point.
Acad::ErrorStatus  | setPattern (HatchPatternType, const ACHAR *)
Sets both pattern type and pattern name for a hatch entity. More...
 Acad::ErrorStatus  | setPatternAngle (double)
Sets the hatch entity pattern angle.
Acad::ErrorStatus  | setPatternDouble (bool)
Sets whether this pattern is double hatched (cross hatched). More...
Acad::ErrorStatus  | setPatternScale (double)
Sets the hatch entity pattern scale internal. More...
Acad::ErrorStatus  | setPatternSpace (double)
Sets the space for the pattern. More...
virtual void  | setReceiveShadows (bool)
See AcDbEntity::setReceiveShadows(bool) . More...
Acad::ErrorStatus  | setShadeTintValue (float)
The tint shade value is set according to the first color if the gradient is using one-color mode. More...
Acad::ErrorStatus  | setShadeTintValueAndColor2 (float)
The tint shade value and second gradient color are set according to the first color if the gradient is using one-color mode. More...
virtual Acad::ErrorStatus  | subSwapIdWith (AcDbObjectId, Adesk::Boolean=Adesk::kFalse, Adesk::Boolean=Adesk::kFalse)
virtual Acad::ErrorStatus  | swapReferences (const AcDbIdMapping &)
 Public Member Functions inherited from AcDbEntity
 virtual Acad::ErrorStatus  | addSubentPaths (const AcDbFullSubentPathArray &) final
virtual Acad::ErrorStatus  | applyPartialUndo (AcDbDwgFiler *, AcRxClass *)
virtual Acad::ErrorStatus  | audit (AcDbAuditInfo *)
AcDbObjectId  | blockId () const
Returns the Object ID of the BlockTableRecord that owns this entity. More...
Acad::ErrorStatus  | boundingBoxIntersectWith (const AcDbEntity *, AcDb::Intersect, AcGePoint3dArray &, Adesk::GsMarker, Adesk::GsMarker) const
Finds the intersection between the edges of the bounding box for this entity and the pOhter entity. More...
Acad::ErrorStatus  | boundingBoxIntersectWith (const AcDbEntity *, AcDb::Intersect, const AcGePlane &, AcGePoint3dArray &, Adesk::GsMarker, Adesk::GsMarker) const
First, the function projects the other entity and the bounding box of this entity on plane specified by plane. More...
virtual bool  | bounds (AcDbExtents &) const
Returns the extents of this entity as AcDbExtents. More...
virtual bool  | castShadows () const
Checks if this entity is able to cast shadows. More...
virtual Adesk::Boolean  | cloneMeForDragging () final
Checks if a clone will be created for this entity in case of a drag operation. More...
 virtual AcDb::CollisionType  | collisionType () const
AcCmColor  | color () const
Returns the true color information of the entity. More...
Adesk::UInt16  | colorIndex () const
Returns the color number in a range from 0 to 256. More...
 virtual Acad::ErrorStatus  | deleteSubentPaths (const AcDbFullSubentPathArray &) final
virtual void  | dragStatus (const AcDb::DragStat)
Acad::ErrorStatus  | draw ()
Draws or redraws the entity on screen. More...
virtual AcGiDrawable *  | drawable ()
virtual Acad::ErrorStatus  | dwgInFields (AcDbDwgFiler *)
virtual Acad::ErrorStatus  | dwgOutFields (AcDbDwgFiler *) const
virtual Acad::ErrorStatus  | dxfInFields (AcDbDxfFiler *)
virtual Acad::ErrorStatus  | dxfOutFields (AcDbDxfFiler *) const
AcCmEntityColor  | entityColor () const
Returns the lightweight color information of the entity. More...
virtual Acad::ErrorStatus  | explode (AcDbVoidPtrArray &) const final
virtual Acad::ErrorStatus  | getCompoundObjectTransform (AcGeMatrix3d &) const final
It is used for object without geometry like AcDbMleader. More...
virtual void  | getEcs (AcGeMatrix3d &) const
Returns the transformation matrix from OCS (Object Coordinate System) to WCS (World Coordinate System). More...
virtual Acad::ErrorStatus  | getGeomExtents (AcDbExtents &) const final
Returns extents of this entity. More...
 virtual Acad::ErrorStatus  | getGripEntityUCS (const void *, AcGeVector3d &, AcGePoint3d &, AcGeVector3d &) const final
 virtual Acad::ErrorStatus  | getGripPoints (AcDbGripDataPtrArray &, const double, const int, const AcGeVector3d &, const int) const final
virtual Acad::ErrorStatus  | getGripPoints (AcGePoint3dArray &, AcDbIntArray &, AcDbIntArray &) const final
Append grip points to the specified array. More...
 virtual Acad::ErrorStatus  | getGripPointsAtSubentPath (const AcDbFullSubentPath &, AcDbGripDataPtrArray &, const double, const int, const AcGeVector3d &, const int) const final
virtual Acad::ErrorStatus  | getGsMarkersAtSubentPath (const AcDbFullSubentPath &, AcArray< Adesk::GsMarker > &) const final
virtual Acad::ErrorStatus  | getMaterialMapper (AcGiMapper &) const
virtual Acad::ErrorStatus  | getOsnapPoints (AcDb::OsnapMode, Adesk::GsMarker, const AcGePoint3d &, const AcGePoint3d &, const AcGeMatrix3d &, AcGePoint3dArray &, AcDbIntArray &) const final
Gets the entity osnap points. More...
virtual Acad::ErrorStatus  | getOsnapPoints (AcDb::OsnapMode, Adesk::GsMarker, const AcGePoint3d &, const AcGePoint3d &, const AcGeMatrix3d &, AcGePoint3dArray &, AcDbIntArray &, const AcGeMatrix3d &) const final
Gets the entity osnap points. More...
virtual Acad::ErrorStatus  | getPlane (AcGePlane &, AcDb::Planarity &) const
Returns the plane that contains this entity. More...
AcDb::PlotStyleNameType  | getPlotStyleNameId (AcDbObjectId &) const
Returns the plot style name type and its associated id. More...
virtual Acad::ErrorStatus  | getStretchPoints (AcGePoint3dArray &) const final
Append stretch points to the specified array. More...
 virtual Acad::ErrorStatus  | getSubentClassId (const AcDbFullSubentPath &, CLSID *) const final
 virtual Acad::ErrorStatus  | getSubentPathGeomExtents (const AcDbFullSubentPath &, AcDbExtents &) const final
virtual Acad::ErrorStatus  | getSubentPathsAtGsMarker (AcDb::SubentType, Adesk::GsMarker, const AcGePoint3d &, const AcGeMatrix3d &, int &, AcDbFullSubentPath *&, int=0, AcDbObjectId *=NULL) const final
Gets the subentity paths appropriate for the passed in gs marker. More...
virtual Acad::ErrorStatus  | getTransformedCopy (const AcGeMatrix3d &, AcDbEntity *&) const final
Creates a copy of the current entity applying the transformation matrix. More...
 virtual void  | gripStatus (const AcDb::GripStat) final
 virtual bool  | hideMeForDragging () const final
virtual Acad::ErrorStatus  | highlight (const AcDbFullSubentPath &=kNullSubent, const Adesk::Boolean=Adesk::kFalse) const final
Highlights part of, or entire entity. More...
virtual Acad::ErrorStatus  | intersectWith (const AcDbEntity *, AcDb::Intersect, AcGePoint3dArray &, Adesk::GsMarker=0, Adesk::GsMarker=0) const final
Finds the intersection between this entity and the pOhter entity. More...
virtual Acad::ErrorStatus  | intersectWith (const AcDbEntity *, AcDb::Intersect, const AcGePlane &, AcGePoint3dArray &, Adesk::GsMarker=0, Adesk::GsMarker=0) const final
Projects this entity and the pOhter entity on plane, finds the intersection points between these projections and then projects back the points onto the caller entity. More...
 virtual bool  | isContentSnappable () const final
virtual Adesk::Boolean  | isPlanar () const
ACHAR *  | layer () const
Returns the layername. More...
AcDbObjectId  | layerId () const
Returns the Object ID of the LayerTableRecord referenced by this entity. More...
ACHAR *  | linetype () const
Gets the linetype value. More...
AcDbObjectId  | linetypeId () const
Gets the linetypeId value. More...
 double  | linetypeScale () const
returns the linetype scale factor for the entity
AcDb::LineWeight  | lineWeight () const
Gets the entity line weight. More...
virtual void  | list () const final
Prints the properties in drawing window. More...
ACHAR *  | material () const
Gets the material assigned to this entity. More...
AcDbObjectId  | materialId () const
Gets the AcDbObjectId of the material assigned to this entity. More...
virtual Acad::ErrorStatus  | moveGripPointsAt (const AcDbIntArray &, const AcGeVector3d &) final
Move the grip points pointed by the indexes specified in indexArray using the translationVector param direction and length Override this method in custom entities to define your own behaviour. More...
 virtual Acad::ErrorStatus  | moveGripPointsAt (const AcDbVoidPtrArray &, const AcGeVector3d &, const int) final
 virtual Acad::ErrorStatus  | moveGripPointsAtSubentPaths (const AcDbFullSubentPathArray &, const AcDbVoidPtrArray &, const AcGeVector3d &, const int) final
virtual Acad::ErrorStatus  | moveStretchPointsAt (const AcDbIntArray &, const AcGeVector3d &) final
Move the stretch points pointed by the indexes specified in indexArray with the offest specified by translationVector Override this method in custom entities to define your own behaviour. More...
ACHAR *  | plotStyleName () const
Returns the name of the plotStyleName string associated with this entity (DXF 390). More...
virtual bool  | receiveShadows () const
Checks if this entity is able to receive shadows. More...
void  | recordGraphicsModified (Adesk::Boolean=Adesk::kTrue)
Controls the entity display update when closing it Entities not updated when closed are updated at the first regen. More...
virtual void  | saveAs (AcGiWorldDraw *, AcDb::SaveType)
Generates the graphics primitives when a DWG save requiring proxy graphics to be saved is made. More...
virtual void  | setCastShadows (bool)
Sets this entity's flag regarding casting shadows. More...
virtual Acad::ErrorStatus  | setColor (const AcCmColor &, Adesk::Boolean=Adesk::kTrue)
Sets the color information of this entity from an AcCmColor instance. More...
virtual Acad::ErrorStatus  | setColor (const AcCmColor &, bool, AcDbDatabase *)
Sets the color property of this entity from an AcCmColor instance. More...
virtual Acad::ErrorStatus  | setColorIndex (Adesk::UInt16, Adesk::Boolean=Adesk::kTrue)
Sets the color index of this entity (DXF 62). More...
void  | setDatabaseDefaults ()
Applies the default properties of the entities database to this entity. More...
void  | setDatabaseDefaults (AcDbDatabase *)
Applies the default properties of the specified database to this entity. More...
virtual Acad::ErrorStatus  | setLayer (AcDbObjectId, Adesk::Boolean=Adesk::kTrue, bool=false)
Sets the layer to be referenced by this entity (DXF 8). More...
virtual Acad::ErrorStatus  | setLayer (const ACHAR *, Adesk::Boolean=Adesk::kTrue, bool=false)
Sets the layer to be referenced by this entity (DXF 8). More...
virtual Acad::ErrorStatus  | setLinetype (AcDbObjectId, Adesk::Boolean=Adesk::kTrue)
Sets the entities linetype to ltypeObjectId. More...
virtual Acad::ErrorStatus  | setLinetype (const ACHAR *, Adesk::Boolean=Adesk::kTrue)
Sets the entities linetype to the linetpye referenced by layerName. More...
virtual Acad::ErrorStatus  | setLinetypeScale (double, Adesk::Boolean=Adesk::kTrue)
sets value as entity linetype scale factor More...
virtual Acad::ErrorStatus  | setLineWeight (AcDb::LineWeight, Adesk::Boolean=Adesk::kTrue)
Sets the entity line weight. More...
virtual Acad::ErrorStatus  | setMaterial (AcDbObjectId, Adesk::Boolean=Adesk::kTrue)
Not implemented yet. More...
virtual Acad::ErrorStatus  | setMaterial (const ACHAR *, Adesk::Boolean=Adesk::kTrue)
Assigns the material to the entity. More...
virtual Acad::ErrorStatus  | setMaterialMapper (const AcGiMapper &, Adesk::Boolean=Adesk::kTrue)
It is used for apply material (scale, rotation, projection, mode overrides) to an identity.If it is used AcGiMapper::kIdentity it will apply for entity a default mapper. More...
virtual Acad::ErrorStatus  | setPlotStyleName (AcDb::PlotStyleNameType, AcDbObjectId=AcDbObjectId::kNull, Adesk::Boolean=Adesk::kTrue)
Sets the plot style of this entity. More...
virtual Acad::ErrorStatus  | setPlotStyleName (const ACHAR *, Adesk::Boolean=Adesk::kTrue)
Sets the plot style of this entity. More...
Acad::ErrorStatus  | setPropertiesFrom (const AcDbEntity *, Adesk::Boolean=Adesk::kTrue)
Copies the properties color, layer, linetype, linetypescale and visibility from the source entity pEntity to this entity. More...
virtual void  | setReceiveShadows (bool)
Sets this entity's flag regarding receiving shadows. More...
virtual Acad::ErrorStatus  | setTransparency (const AcCmTransparency &, Adesk::Boolean=Adesk::kTrue)
Sets the transparency setting of this entity, and returns eOk if successful. More...
virtual Acad::ErrorStatus  | setVisibility (AcDb::Visibility, Adesk::Boolean=Adesk::kTrue) final
notyetdocumented. More...
 virtual Acad::ErrorStatus  | setVisualStyle (AcDbObjectId, VisualStyleType=kFullVisualStyle, Adesk::Boolean=true)
 virtual void  | subentGripStatus (const AcDb::GripStat, const AcDbFullSubentPath &) final
virtual AcDbEntity *  | subentPtr (const AcDbFullSubentPath &) const final
Creates an entity as a copy of the subentity given by acSubentPath. More...
virtual void  | subSetDatabaseDefaults (AcDbDatabase *)
This function is called by AcDbEntity::setDatabaseDefaults(), to allow custom entities to set their related sub entities, if any; default implementation does nothing. More...
virtual Acad::ErrorStatus  | transformBy (const AcGeMatrix3d &) final
Applies given transformation (matrix) to the entity. More...
 virtual Acad::ErrorStatus  | transformSubentPathsBy (const AcDbFullSubentPathArray &, const AcGeMatrix3d &) final
 AcCmTransparency  | transparency () const
Returns the transparency setting of this entity.
virtual Acad::ErrorStatus  | unhighlight (const AcDbFullSubentPath &=kNullSubent, const Adesk::Boolean=Adesk::kFalse) const final
Unhighlights previously highlighted part of entity, or entire entity. More...
AcDb::Visibility  | visibility () const
Gets the visibility state. More...
 AcDbObjectId  | visualStyleId (VisualStyleType=kFullVisualStyle) const
 Public Member Functions inherited from AcDbObject
virtual Acad::ErrorStatus  | addPersistentReactor (AcDbObjectId)
Adds a persistent reactor to this object reactor list. More...
Acad::ErrorStatus  | addReactor (AcDbObjectReactor *) const
Adds a transient reactor to this object. More...
virtual Acad::ErrorStatus  | applyPartialUndo (AcDbDwgFiler *, AcRxClass *)
This function is called during Undo operations on objects, that use the 'Partial Undo meachanism'; this is, this object is opened with assertWriteEnabled(Adesk::kFalse) to indicate that custom Undo filing is used rather than the default Undo filing. More...
 void  | assertNotifyEnabled () const
 void  | assertReadEnabled () const
 void  | assertWriteEnabled (Adesk::Boolean=Adesk::kTrue, Adesk::Boolean=Adesk::kTrue)
virtual Acad::ErrorStatus  | audit (AcDbAuditInfo *)
Performs the audit operation for this object. More...
Acad::ErrorStatus  | cancel ()
Reverts all changes since the object had been opened and closes the object. More...
virtual void  | cancelled (const AcDbObject *)
A handler function for persistent reactors. More...
virtual AcRxObject *  | clone () const
Creates a shallow clone of this object. More...
Acad::ErrorStatus  | close ()
Closes the object. More...
Acad::ErrorStatus  | closeAndPage (Adesk::Boolean=Adesk::kTrue)
Closes the object. More...
virtual Acad::ErrorStatus  | composeForLoad (AcDb::OdaSaveType, AcDb::AcDbDwgVersion)
This function is intended for future MT file loading support. More...
virtual void  | copied (const AcDbObject *, const AcDbObject *)
A handler function for persistent reactors. More...
virtual Acad::ErrorStatus  | copyFrom (const AcRxObject *)
Copies the pSrc object information in this object. More...
Acad::ErrorStatus  | createExtensionDictionary ()
Creates a dictionary as extension dictionary for this object. More...
AcDbDatabase *  | database () const
Returns the database that contains this object. More...
virtual Acad::ErrorStatus  | decomposeForSave (AcDb::AcDbDwgVersion, AcDbObject *&, AcDbObjectId &, Adesk::Boolean &)
This function is called during dwg and dxf output, to allow a custom object to decompose itself, due to provided dwg/dxf target file version. More...
virtual Acad::ErrorStatus  | deepClone (AcDbObject *, AcDbObject *&, AcDbIdMapping &, Adesk::Boolean=Adesk::kTrue) const final
Clones this object, appends it to the owner pOwner and adds an AcDbIdPair record to the idMap. More...
void  | disableUndoRecording (Adesk::Boolean)
Disables or enables the undo recording for the object. More...
Acad::ErrorStatus  | downgradeOpen ()
Sets the open mode for an object opened for write to be opened for read. More...
Acad::ErrorStatus  | downgradeToNotify (Adesk::Boolean)
Sets the open mode for an object opened for write to be opened for notify. More...
virtual AcGiDrawable *  | drawable ()
Retrieves the AcGiDrawable instance of this object. More...
Acad::ErrorStatus  | dwgIn (AcDbDwgFiler *)
Calls the object's dwgInFields function, and reads any XData if present. More...
virtual Acad::ErrorStatus  | dwgInFields (AcDbDwgFiler *)
Reads the object from the DWG filer. More...
Acad::ErrorStatus  | dwgOut (AcDbDwgFiler *) const
Calls the object's dwgOutFields function, and writes any XData if present. More...
virtual Acad::ErrorStatus  | dwgOutFields (AcDbDwgFiler *) const
Writes the object to the DWG filer. More...
Acad::ErrorStatus  | dxfIn (AcDbDxfFiler *)
Calls the object's dxfInFields function, and reads any XData if present. More...
virtual Acad::ErrorStatus  | dxfInFields (AcDbDxfFiler *)
Reads the object from the DXF filer. More...
Acad::ErrorStatus  | dxfOut (AcDbDxfFiler *, Adesk::Boolean, Adesk::uchar *) const
Calls the object's dxfOutFields function, and writes any XData if present. More...
virtual Acad::ErrorStatus  | dxfOutFields (AcDbDxfFiler *) const
Writes the object to the DXF filer. More...
Acad::ErrorStatus  | erase (Adesk::Boolean=Adesk::kTrue)
Sets the bit that indicates that the object is erased. More...
virtual void  | erased (const AcDbObject *, Adesk::Boolean)
A handler function for persistent reactors. More...
AcDbObjectId  | extensionDictionary () const
Returns the object id of the extension dictionary for this object. More...
void  | getAcDbHandle (AcDbHandle &) const
Returns handle of this object. More...
Acad::ErrorStatus  | getBinaryData (const ACHAR *, Adesk::Int32 &, char *&) const
Creates a copy of the binary data stored as chunks of maximum 127 bytes in the resbuf chain of this object's extension dictionary xrecord entry given by entryName. More...
int  | getBrxOpenCount () const
This function returns the number of open BRX instances for this object. More...
int  | getBrxOpenState () const
This function returns the BRX object open state flags as bitfields, for diagnostic purpose. More...
virtual Acad::ErrorStatus  | getClassID (CLSID *) const final
Gets the COM wrapper Class ID for this entity. More...
int  | getCustomObjectState () const
This function returns the custom object status : 1=isCustomObject 2=DifferentialUndoDisabled. More...
Acad::ErrorStatus  | getField (const ACHAR *, AcDbField *&, AcDb::OpenMode) const
Retrieves the specified Field from this object, and opens it in mode. More...
Acad::ErrorStatus  | getField (const ACHAR *, AcDbObjectId &) const
Gets the pszPropName field object from field dictionary of this AcDbObject object, using pszPropName as key. More...
AcDbObjectId  | getFieldDictionary () const
Returns the Field dictionary associated with this object,. More...
Acad::ErrorStatus  | getFieldDictionary (AcDbDictionary *&, AcDb::OpenMode) const
Gets and opens the field dictionary for this. More...
Acad::ErrorStatus  | getObjectBirthVersion (AcDb::AcDbDwgVersion &, AcDb::MaintenanceReleaseVersion &)
This function is currently not supported by the CAD engine, always returns Acad::eOk, and 'kDHL_CURRENT' + 'kMReleaseCurrent' results. More...
virtual Acad::ErrorStatus  | getObjectSaveVersion (const AcDbDwgFiler *, AcDb::AcDbDwgVersion &, AcDb::MaintenanceReleaseVersion &)
Returns the DWG version for saving the object. More...
virtual Acad::ErrorStatus  | getObjectSaveVersion (const AcDbDxfFiler *, AcDb::AcDbDwgVersion &, AcDb::MaintenanceReleaseVersion &)
Returns the DWG version for saving the object. More...
int  | getOdaOpenCount () const
This function returns the number of open ODA instances for this object. More...
int  | getOdaOpenState () const
This function returns the ODA object open state flags as bitfields, for diagnostic purpose. More...
virtual void  | goodbye (const AcDbObject *)
A handler function for persistent reactors. More...
Acad::ErrorStatus  | handOverTo (AcDbObject *, Adesk::Boolean=Adesk::kTrue, Adesk::Boolean=Adesk::kTrue)
Hands over objects identity to another object. More...
bool  | hasFields () const
Return true if this object has single or multiple fields associated with him. More...
bool  | hasPersistentReactor (AcDbObjectId) const
Checks the input objectId in this object reactor list. More...
bool  | hasSaveVersionOverride ()
This function indicates whether this object overrides the filer's save version. More...
virtual AcDbObjectId  | id () const
Returns the database id of this object. More...
Adesk::Boolean  | isAcDbObjectIdsInFlux () const
Checks whether a deep clone operation was completed. More...
Adesk::Boolean  | isAProxy () const
Adesk::Boolean  | isCancelling () const
Adesk::Boolean  | isErased () const
Returns whether this object is erased. More...
Adesk::Boolean  | isEraseStatusToggled () const
Checks whether the object erase status has been toggled. More...
Adesk::Boolean  | isModified () const
Returns whether this object's assertWriteEnabled() has been called since it was opened. More...
Adesk::Boolean  | isModifiedGraphics () const
Checks whether this object graphics will be updated when the object is closed. More...
Adesk::Boolean  | isModifiedXData () const
Checks whether this object's xData was modified. More...
Adesk::Boolean  | isNewObject () const
Returns true if and only if this object has not been closed since it was created. More...
Adesk::Boolean  | isNotifyEnabled () const
Returns whether this object is opened for notify. More...
Adesk::Boolean  | isNotifying () const
virtual Adesk::Boolean  | isPersistent () const
Returns the 'persistent' status of a database object. More...
Adesk::Boolean  | isReadEnabled () const
Returns whether this object is opened for read. More...
 Adesk::Boolean  | isReallyClosing () const
Checks whether the next close call will completely close this object return true if on the next call the object will be completely closed false otherwise.
Adesk::Boolean  | isTransactionResident () const
Gets the object transaction status. More...
Adesk::Boolean  | isUndoing () const
bool  | isUndoRecordingDisabled () const
Returns whether the undo recording for the object is enabled or not. More...
Adesk::Boolean  | isWriteEnabled () const
Returns whether this object is opened for write. More...
virtual AcDb::DuplicateRecordCloning  | mergeStyle () const
Returns the object's merge behavior during cloning. More...
virtual void  | modified (const AcDbObject *)
A handler function for persistent reactors. More...
virtual void  | modifiedGraphics (const AcDbEntity *)
A handler function for persistent reactors. More...
virtual void  | modifiedXData (const AcDbObject *)
A handler function for persistent reactors. More...
virtual void  | modifyUndone (const AcDbObject *)
A handler function for persistent reactors. More...
virtual void  | objectClosed (const AcDbObjectId)
A handler function for persistent reactors. More...
AcDbObjectId  | objectId () const
Returns object id. More...
virtual void  | openedForModify (const AcDbObject *)
A handler function for persistent reactors. More...
AcDbObjectId  | ownerId () const
Returns object id of the owner. More...
AcDbVoidPtrArray *  | reactors ()
Gets the object pointers to reactors. More...
const AcDbVoidPtrArray *  | reactors () const
Gets the object pointers to reactors. More...
virtual void  | reappended (const AcDbObject *)
A handler function for persistent reactors. More...
 virtual void  | recvPropagateModify (const AcDbObject *)
Not implemented yet.
Acad::ErrorStatus  | releaseExtensionDictionary ()
Removes the extension dictionary associated with this object. More...
virtual Acad::ErrorStatus  | removeField (AcDbObjectId)
Removes the Field specified by acFieldId from this object. More...
virtual Acad::ErrorStatus  | removeField (const ACHAR *)
Removes the Field specified by szKeyString from this object. More...
virtual Acad::ErrorStatus  | removeField (const ACHAR *, AcDbObjectId &)
Removes the Field specified by acPszKeyString from this object, and returns its ObjectId value. More...
virtual Acad::ErrorStatus  | removePersistentReactor (AcDbObjectId)
Removes a persistent reactor from this object reactor list. More...
Acad::ErrorStatus  | removeReactor (AcDbObjectReactor *) const
Removes a transient reactor to this object. More...
void  | setAcDbObjectIdsInFlux ()
Call this function to indicate that the object IDs of this object and its sub-objects (if any) are not yet valid. More...
Acad::ErrorStatus  | setBinaryData (const ACHAR *, Adesk::Int32, const char *)
Creates a copy of the binary data, divides it in up to 127 bytes binary chunks and
 sets them as resbufs in the resbuf chain of this object's extension dictionary xrecord entry given by entryName. More...
virtual Acad::ErrorStatus  | setField (const ACHAR *, AcDbField *, AcDbObjectId &)
Adds the pAcField field object to field dictionary of this AcDbObject object, using pKey as key. More...
void  | setHasSaveVersionOverride (bool)
This function can be called to specify that the object has a "save version override". More...
virtual Acad::ErrorStatus  | setOwnerId (AcDbObjectId)
Sets the ownerId data member of the object to be objId. More...
virtual Acad::ErrorStatus  | setXData (const resbuf *)
Sets/removes xData associated with this object. More...
virtual Acad::ErrorStatus  | subCancel ()
Possibility to veto a cancel operation from within custom entities. More...
virtual Acad::ErrorStatus  | subClose ()
virtual Acad::ErrorStatus  | subErase (Adesk::Boolean)
This hook is called during an AcDbObject::erase call, before any actual erase operation is performed. More...
 virtual Acad::ErrorStatus  | subHandOverTo (AcDbObject *)
virtual void  | subObjModified (const AcDbObject *, const AcDbObject *)
A handler function for persistent reactors. More...
 virtual Acad::ErrorStatus  | subOpen (AcDb::OpenMode)
virtual Acad::ErrorStatus  | subSwapIdWith (AcDbObjectId, Adesk::Boolean=Adesk::kFalse, Adesk::Boolean=Adesk::kFalse)
This hook is called during an AcDbObject::swapIdWith() call, before any actual swap operation is performed. More...
Acad::ErrorStatus  | swapIdWith (AcDbObjectId, Adesk::Boolean=Adesk::kFalse, Adesk::Boolean=Adesk::kFalse)
Swaps the object id's between the object identified by param swapId and this object. More...
virtual Acad::ErrorStatus  | swapReferences (const AcDbIdMapping &)
Not implemented yet. More...
virtual void  | unappended (const AcDbObject *)
A handler function for persistent reactors. More...
AcDbDwgFiler *  | undoFiler ()
Gets the undo filer for this object. More...
Acad::ErrorStatus  | upgradeFromNotify (Adesk::Boolean &)
Upgrades the open status of this object to AcDb::kForWrite, if this object is already open (either in AcDb::kForRead, AcDb::kForNotify or AcDb::kForWrite) More...
Acad::ErrorStatus  | upgradeOpen ()
Changes the objects open mode to AcDb::kForWrite and sends notifications. More...
virtual Acad::ErrorStatus  | wblockClone (AcRxObject *, AcDbObject *&, AcDbIdMapping &, Adesk::Boolean=Adesk::kTrue) const final
Clones this object, appends it to the owner pOwner and adds an AcDbIdPair record to the idMap. More...
virtual resbuf *  | xData (const ACHAR *=NULL) const
Returns the xData associated with this object. More...
Acad::ErrorStatus  | xDataTransformBy (const AcGeMatrix3d &)
Transforms the extended data according to parameter transformation matrix. More...
 virtual void  | xmitPropagateModify () const
Not implemented yet.
 virtual  | ~AcDbObject ()
Destructor.
 Public Member Functions inherited from AcGiDrawable
virtual bool  | bounds (AcDbExtents &) const
virtual DrawableType  | drawableType () const
 virtual AcGiDrawStream *  | drawStream () const
 AcGsNode *  | gsNode () const
virtual AcDbObjectId  | id () const =0
virtual Adesk::Boolean  | isPersistent () const =0
virtual Adesk::UInt32  | regenSupportFlags () const final
Returns whether and to which level this object supports MultiThreading. More...
 virtual Adesk::Boolean  | RolloverHit (Adesk::ULongPtr, Adesk::ULongPtr, Adesk::Boolean)
 virtual Adesk::UInt32  | setAttributes (AcGiDrawableTraits *) final
 virtual void  | setDrawStream (AcGiDrawStream *)
 void  | setGsNode (AcGsNode *)
 virtual void  | viewportDraw (AcGiViewportDraw *) final
 virtual Adesk::UInt32  | viewportDrawLogicalFlags (AcGiViewportDraw *) final
 virtual Adesk::Boolean  | worldDraw (AcGiWorldDraw *) final
 Public Member Functions inherited from AcRxObject
virtual AcRxObject *  | clone () const
Exported and implemented. More...
 virtual AcRx::Ordering  | comparedTo (const AcRxObject *) const
Exported and implemented.
virtual Acad::ErrorStatus  | copyFrom (const AcRxObject *)
Exported and implemented. More...
 virtual AcRxClass *  | isA () const
Exported and implemented.
virtual Adesk::Boolean  | isEqualTo (const AcRxObject *) const
Exported and implemented. More...
bool  | isKindOf (const AcRxClass *) const
Checks the object class. More...
AcRxObject *  | queryX (const AcRxClass *) const
returns the protocol extension object assigned to this class or a parent class. More...
AcRxObject *  | x (const AcRxClass *) const
returns the protocol extension object assigned to this class or a parent class. More...
 virtual  | ~AcRxObject ()
Destructor.
 Public Attributes
AcDbHatch
Default constructor.
 Public Attributes inherited from AcDbEntity
AcDbEntity
This protected constructor sets the initial value for color to 257, and for the objectids for layer and linetype to AcDbObjectId::kNull. More...
 Additional Inherited Members
 Static Public Member Functions inherited from AcRxObject
 static AcRxObject *  | cast (const AcRxObject *)
 static AcRxClass *  | desc ()
Exported and implemented.
 Static Public Member Functions inherited from AcHeapOperators
 static void  | operator delete (void *)
_
 static void  | operator delete (void *, const char *, int)
 static void  | operator delete (void *, void *)
 static void  | operator delete[] (void *)
_
 static void  | operator delete[] (void *, const char *, int)
 static void *  | operator new (size_t)
_
 static void *  | operator new (size_t, const char *, int)
 static void *  | operator new (size_t, void *p)
 static void *  | operator new[] (size_t)
_
 static void *  | operator new[] (size_t, const char *, int)
 Protected Member Functions inherited from AcDbEntity
 virtual Acad::ErrorStatus  | subAddSubentPaths (const AcDbFullSubentPathArray &)
 virtual Adesk::Boolean  | subCloneMeForDragging ()
 virtual Acad::ErrorStatus  | subDeleteSubentPaths (const AcDbFullSubentPathArray &)
virtual Acad::ErrorStatus  | subExplode (AcDbVoidPtrArray &) const
 virtual Acad::ErrorStatus  | subGetCompoundObjectTransform (AcGeMatrix3d &) const
virtual Acad::ErrorStatus  | subGetGeomExtents (AcDbExtents &) const
virtual Acad::ErrorStatus  | subGetGripEntityUCS (const void *, AcGeVector3d &, AcGePoint3d &, AcGeVector3d &) const
virtual Acad::ErrorStatus  | subGetGripPoints (AcDbGripDataPtrArray &, const double, const int, const AcGeVector3d &, const int) const
virtual Acad::ErrorStatus  | subGetGripPoints (AcGePoint3dArray &, AcDbIntArray &, AcDbIntArray &) const
 virtual Acad::ErrorStatus  | subGetGripPointsAtSubentPath (const AcDbFullSubentPath &, AcDbGripDataPtrArray &, const double, const int, const AcGeVector3d &, const int) const
virtual Acad::ErrorStatus  | subGetGsMarkersAtSubentPath (const AcDbFullSubentPath &, AcArray< Adesk::GsMarker > &) const
virtual Acad::ErrorStatus  | subGetOsnapPoints (AcDb::OsnapMode, Adesk::GsMarker, const AcGePoint3d &, const AcGePoint3d &, const AcGeMatrix3d &, AcGePoint3dArray &, AcDbIntArray &) const
 virtual Acad::ErrorStatus  | subGetOsnapPoints (AcDb::OsnapMode, Adesk::GsMarker, const AcGePoint3d &, const AcGePoint3d &, const AcGeMatrix3d &, AcGePoint3dArray &, AcDbIntArray &, const AcGeMatrix3d &) const
virtual Acad::ErrorStatus  | subGetStretchPoints (AcGePoint3dArray &) const
 virtual Acad::ErrorStatus  | subGetSubentClassId (const AcDbFullSubentPath &, CLSID *) const
 virtual Acad::ErrorStatus  | subGetSubentPathGeomExtents (const AcDbFullSubentPath &, AcDbExtents &) const
virtual Acad::ErrorStatus  | subGetSubentPathsAtGsMarker (AcDb::SubentType, Adesk::GsMarker, const AcGePoint3d &, const AcGeMatrix3d &, int &, AcDbFullSubentPath *&, int=0, AcDbObjectId *=nullptr) const
virtual Acad::ErrorStatus  | subGetTransformedCopy (const AcGeMatrix3d &, AcDbEntity *&) const
virtual void  | subGripStatus (const AcDb::GripStat)
 virtual bool  | subHideMeForDragging () const
virtual Acad::ErrorStatus  | subHighlight (const AcDbFullSubentPath &=kNullSubent, const Adesk::Boolean=false) const
virtual Acad::ErrorStatus  | subIntersectWith (const AcDbEntity *, AcDb::Intersect, AcGePoint3dArray &, Adesk::GsMarker=0, Adesk::GsMarker=0) const
virtual Acad::ErrorStatus  | subIntersectWith (const AcDbEntity *, AcDb::Intersect, const AcGePlane &, AcGePoint3dArray &, Adesk::GsMarker=0, Adesk::GsMarker=0) const
virtual bool  | subIsContentSnappable () const
virtual void  | subList () const
virtual Acad::ErrorStatus  | subMoveGripPointsAt (const AcDbIntArray &, const AcGeVector3d &)
virtual Acad::ErrorStatus  | subMoveGripPointsAt (const AcDbVoidPtrArray &, const AcGeVector3d &, const int)
 virtual Acad::ErrorStatus  | subMoveGripPointsAtSubentPaths (const AcDbFullSubentPathArray &, const AcDbVoidPtrArray &, const AcGeVector3d &, const int)
virtual Acad::ErrorStatus  | subMoveStretchPointsAt (const AcDbIntArray &, const AcGeVector3d &)
virtual Adesk::UInt32  | subSetAttributes (AcGiDrawableTraits *)
Sets the values of this object's subentity traits and returns with the calling object's subentity traits. More...
virtual Acad::ErrorStatus  | subSetVisibility (AcDb::Visibility, Adesk::Boolean=true)
 virtual void  | subSubentGripStatus (const AcDb::GripStat, const AcDbFullSubentPath &)
virtual AcDbEntity *  | subSubentPtr (const AcDbFullSubentPath &) const
virtual Acad::ErrorStatus  | subTransformBy (const AcGeMatrix3d &)
 virtual Acad::ErrorStatus  | subTransformSubentPathsBy (const AcDbFullSubentPathArray &, const AcGeMatrix3d &)
virtual Acad::ErrorStatus  | subUnhighlight (const AcDbFullSubentPath &=kNullSubent, const Adesk::Boolean=false) const
virtual void  | subViewportDraw (AcGiViewportDraw *)
 virtual AcDb::Visibility  | subVisibility () const
virtual Adesk::Boolean  | subWorldDraw (AcGiWorldDraw *)
 Protected Member Functions inherited from AcDbObject
virtual Acad::ErrorStatus  | subDeepClone (AcDbObject *, AcDbObject *&, AcDbIdMapping &, Adesk::Boolean=true) const
virtual Acad::ErrorStatus  | subGetClassID (CLSID *) const
virtual Adesk::UInt32  | subSetAttributes (AcGiDrawableTraits *)
Sets the values of this object's subentity traits and returns with the calling object's subentity traits. More...
virtual void  | subViewportDraw (AcGiViewportDraw *)
virtual Adesk::UInt32  | subViewportDrawLogicalFlags (AcGiViewportDraw *)
virtual Acad::ErrorStatus  | subWblockClone (AcRxObject *, AcDbObject *&, AcDbIdMapping &, Adesk::Boolean=true) const
virtual Adesk::Boolean  | subWorldDraw (AcGiWorldDraw *)
 Protected Member Functions inherited from AcGiDrawable
virtual Adesk::UInt32  | subRegenSupportFlags () const
Returns whether and to which level this object supports MultiThreading. More...
virtual Adesk::UInt32  | subSetAttributes (AcGiDrawableTraits *)=0
virtual void  | subViewportDraw (AcGiViewportDraw *)=0
 virtual Adesk::UInt32  | subViewportDrawLogicalFlags (AcGiViewportDraw *)
virtual Adesk::Boolean  | subWorldDraw (AcGiWorldDraw *)=0
 Protected Member Functions inherited from AcRxObject
AcRxObject ()
Exported and implemented.
Detailed Description
_
Member Function Documentation
◆ appendLoop() [1/3]
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbHatch::appendLoop  |  ( |  Adesk::Int32  |  type,
|  const AcDbObjectIdArray &  |  idArr
)
Appends a loop to the hatch.
Parameters
[in] | type | kDefault or kExternal
[in] | idArr | objectIds of the entities of the loop to append.
Returns
one of Acad::eOk, Acad::eInvalidInput
◆ appendLoop() [2/3]
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbHatch::appendLoop  |  ( |  Adesk::Int32  |  type,
|  const AcGePoint2dArray &  |  vertexArr,
|  const AcGeDoubleArray &  |  bulgeArr
)
Appends a new polyline loop to the hatch entity loop.
Parameters
[in] | type | loop type: kDefault, kExternal, kPolyline, kDerived, kTextbox
 or bitwise combinations
[in] | vertexArr | polyline points array
[oin] | bulgeArr polyline bulgeArr array
Returns
Acad::eOk if succesfull Acad::eNotApplicable if loop type (boundary) is not a polyline Acad::eInvalidInput otherwise
◆ appendLoop() [3/3]
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbHatch::appendLoop  |  ( |  Adesk::Int32  |  type,
|  const AcGeVoidPointerArray &  |  edges,
|  const AcGeIntArray &  |  typeArray
)
Appends a new non polyline loop to the hatch entity loop.
Parameters
[in] | type | loop type: kDefault, kExternal, kPolyline, kDerived, kTextbox
 or bitwise combinations
[in] | edges | void AcGeCurve pointers
[in] | typeArray | AcGeCurve pointers type, related to engePointers
Returns
Acad::eOk if succesfull Acad::eNotApplicable if loop type (boundary) is a polyline Acad::eInvalidInput otherwise
◆ backgroundColor()
 UX_EXPORT_FUNCTION AcCmColor AcDbHatch::backgroundColor  |  ( |   | ) |   const
The function returns for the hatch entity the background's color.
Returns
background color
◆ castShadows()
 UX_EXPORT_FUNCTION bool AcDbHatch::castShadows  |  ( |   | ) |   const
virtual
See AcDbEntity::castShadows() .
Returns
always false for this type
Reimplemented from AcDbEntity.
◆ evaluateHatch()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbHatch::evaluateHatch  |  ( |  bool  |  bEstimate = false | )
Evaluates the hatch.
setPattern() had to be called before, to get the display updated.
Parameters
[in] | bEstimate | abort, if the number of patterns exceeds 100.000.
Returns
one of: Acad::eOk, Acad::eHatchTooDense, Acad::eInvalidInput, Acad::eAmbiguousOutput.
◆ getArea()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbHatch::getArea  |  ( |  double &  |  area | ) |   const
Evaluate the area of the hatch object.
Parameters
[out] | area | value of the area evaluation
Returns
Acad::eOk if successful Acad::eInvalidInput if the area cannot be evaluated
◆ getAssocObjIds()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbHatch::getAssocObjIds  |  ( |  AcDbObjectIdArray &  |  idArr | ) |   const
Returns objectIds of associative boundary entities.
If the hatch is not associative, the resulting array is empty.
Parameters
[out] | idArr | all objectIds of associative boundary entities.
Returns
Acad::eOk
◆ getAssocObjIdsAt()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbHatch::getAssocObjIdsAt  |  ( |  int  |  index,
|  AcDbObjectIdArray &  |  acIdArray
) |   |  const
Gets the identifiers associated to the loop at the given index.
Parameters
[in] | index | the index of the loop
[out] | acIdArray | the identifiers of the loop
Returns
Acad::eOk if successful Acad::eInvalidInput otherwise
◆ getGradientColors()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbHatch::getGradientColors  |  ( |  unsigned int &  |  numColors,
|  AcCmColor *&  |  arColors,
|  float *&  |  arValues
)
Returns the hatch entity gradient colors.
Parameters
[out] | numColors | number of colors used (actually always 2)
[out] | arColors | array of AcCmColor colors
[out] | arValues | array of interpolation values
Returns
Acad::eOk if successful, or error status The caller should copy the returned array if needed later
◆ getGradientOneColorMode()
 Adesk::Boolean AcDbHatch::getGradientOneColorMode  |  ( |   | ) |   const
The gradient hatch is transitioning from a start to a stop color or to have the same color luminance version.
Returns
true for one color or false otherwise
◆ getHatchLineDataAt()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbHatch::getHatchLineDataAt  |  ( |  int  |  acIndex,
|  AcGePoint2d &  |  acStartPoint,
|  AcGePoint2d &  |  acEndPoint
) |   |  const
Get start and end points for the hatch line at index acIndex.
Parameters
[in] | acIndex | index of the hatch line for which we will get start and end points.
[out] | acStartPoint | start point of hatch line
[out] | acEndPoints | end point of hatch line
Returns
Acad::eNotApplicable if the hatch has gradient pattern fill or solid fill @ Acad::eOk otherwise
◆ getHatchLinesData()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbHatch::getHatchLinesData  |  ( |  AcGePoint2dArray &  |  acStartPoints,
|  AcGePoint2dArray &  |  acEndPoints
) |   |  const
Get start and end points for all the hatch lines; the arrays should have the same length; acStartPoints[idx] and acEndPoint[idx] represent the 'idx' line of the hatch.
Parameters
[out] | acStartPoints | array of hatch line start points
[out] | acEndPoints | corresponding array of hatch line end points
Returns
Acad::eNotApplicable if the hatch has gradient pattern fill or solid fill @ Acad::eOk otherwise
◆ getLoopAt() [1/2]
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbHatch::getLoopAt  |  ( |  int  |  idx,
|  Adesk::Int32 &  |  type,
|  AcGePoint2dArray &  |  vertexArr,
|  AcGeDoubleArray &  |  bulgeArr
) |   |  const
Gets the hatch entity loop definition data for a polyline boundary.
Parameters
[in] | idx | loop idx
[out] | type | loop type :kDefault, kExternal, kPolyline, kDerived, kTextbox
 or bitwise combinations
[out] | vertexArr | polyline points array
[out] | bulgeArr | polyline bulgeArr array
Returns
Acad::eOk if succesfull Acad::eNotApplicable if loop type (boundary) is not a polyline Acad::eInvalidIndex otherwise
◆ getLoopAt() [2/2]
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbHatch::getLoopAt  |  ( |  int  |  index,
|  Adesk::Int32 &  |  type,
|  AcGeVoidPointerArray &  |  edges,
|  AcGeIntArray &  |  typeArray
) |   |  const
Gets the hatch entity loop definition data for a non polyline boundary.
Parameters
[in] | index | loop idx
[out] | type | loop type :kDefault, kExternal, kPolyline, kDerived, kTextbox
 or bitwise combinations
[out] | edges | void AcGeCurve pointers
[out] | typeArray | AcGeCurve pointers type, related to engePointers
Returns
Acad::eOk if succesfull Acad::eNotApplicable if loop type (boundary) is a polyline Acad::eInvalidIndex otherwise
◆ getPatternDefinitionAt()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbHatch::getPatternDefinitionAt  |  ( |  int  |  index,
|  double &  |  angle,
|  double &  |  baseX,
|  double &  |  baseY,
|  double &  |  offsetX,
|  double &  |  offsetY,
|  AcGeDoubleArray &  |  acDashes
) |   |  const
Returns the pattern definition line for this hatch.
Parameters
[in] | index | line index
[out] | angle | line angle
[out] | baseX | base point X
[out] | baseY | base point Y
[out] | offsetX | X offset
[out] | offsetY | Y offset
[out] | acDashes | dashes
Returns
Acad::eOk if successful Acad::eNotApplicable if current hatch's style is gradient Acad::eInvalidIndex otherwise
◆ getPlane()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbHatch::getPlane  |  ( |  AcGePlane &  |  plane,
|  AcDb::Planarity &  |  planarity
) |   |  const
virtual
See also
AcDbEntity::getPlane(AcGePlane&, AcDb::Planarity&)
Reimplemented from AcDbEntity.
◆ getRegionArea()
 UX_EXPORT_FUNCTION AcDbRegion * AcDbHatch::getRegionArea  |  ( |   | ) |   const
This function creates a region representing the hatch area from the boundary loops of the hatch.
Returns null if the hatch entity does not have a closed boundary, or if the region cannot be created for any other reason
Returns
tint shade value
◆ getShadeTintValue()
 UX_EXPORT_FUNCTION float AcDbHatch::getShadeTintValue  |  ( |   | ) |   const
The function returns the tint shade value in the range of 0.0 to 1.0.
Returns 0.0 for a luminance of 0. Returns 1.0 for a full luminance.
Returns
tint shade value
◆ gradientAngle()
 UX_EXPORT_FUNCTION double AcDbHatch::gradientAngle  |  ( |   | ) |   const
The function returns the angle of current gradient.
Returns
the angle (radians)
◆ gradientName()
 UX_EXPORT_FUNCTION const ACHAR * AcDbHatch::gradientName  |  ( |  void  |   | ) |   const
Gets the hatch entity gradient name.
Returns
the name of gradient The caller should make a copy of the returned string if it wishes to make further use of it. The caller should not free the returned pointer.
◆ gradientShift()
 UX_EXPORT_FUNCTION float AcDbHatch::gradientShift  |  ( |   | ) |   const
The function returns the diference between value of the gradient definition's default and shifted value.
Returns
the diference
◆ hatchObjectType()
 UX_EXPORT_FUNCTION AcDbHatch::HatchObjectType AcDbHatch::hatchObjectType  |  ( |   | ) |   const
Returns object type of the hatch.
Returns
one of AcDbHatch::kHatchObject, AcDbHatch::kGradientObject
◆ hatchStyle()
 UX_EXPORT_FUNCTION AcDbHatch::HatchStyle AcDbHatch::hatchStyle  |  ( |   | ) |   const
Gets the style of this hatch.
Returns
AcDbHatch::HatchStyle hatch style
◆ insertLoopAt() [1/3]
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbHatch::insertLoopAt  |  ( |  int  |  index,
|  Adesk::Int32  |  acLoopType,
|  const AcDbObjectIdArray &  |  acIdArray
)
Inserts a new boundary loop to the hatch entity.
Parameters
[in] | index | the index at which the boundary to be inserted
[in] | acLoopType | the boundary type
[in] | acIdArray | the ids of the entities that compose the boundary
Returns
Acad::eOk if successful Acad::eInvalidInput otherwise
◆ insertLoopAt() [2/3]
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbHatch::insertLoopAt  |  ( |  int  |  acIndex,
|  Adesk::Int32  |  acType,
|  const AcGePoint2dArray &  |  acVertices,
|  const AcGeDoubleArray &  |  acBulges
)
Inserts a new loop into the boundary loop list of the hatch entity.
Parameters
[in] | acIndex | index at which to insert the boundary loop
[in] | acType | type of the boundary loop
[in] | acVertices | list of points that form the boundary loop
[in] | acBulges | list of bulges for the loop's edges
Returns
Acad::eOk if successful Acad::eInvalidIndex if index is out of range Acad::eInvalidInput if vertex array is empty
◆ insertLoopAt() [3/3]
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbHatch::insertLoopAt  |  ( |  int  |  index,
|  Adesk::Int32  |  type,
|  const AcGeVoidPointerArray &  |  edges,
|  const AcGeIntArray &  |  typeArray
)
Inserts a new loop into the hatch boundary loop list.
Parameters
[in] | index | position of the new loop into the boundary loop list
[in] | loopType | kDefault or kExternal
[in] | edges | void AcGeCurve pointers
[in] | typeArray | AcGeCurve pointers type, related to engePointers
Returns
Acad::eOk if successful Acad::eInvalidInput otherwise
◆ isGradient()
 UX_EXPORT_FUNCTION Adesk::Boolean AcDbHatch::isGradient  |  ( |  void  |   | ) |   const
virtual
Check whether this hatch object uses a gradient pattern fill.
Returns
Adesk::kTrue if hatch uses gradient fill Adesk::kFalse otherwise
◆ isHatch()
 UX_EXPORT_FUNCTION Adesk::Boolean AcDbHatch::isHatch  |  ( |  void  |   | ) |   const
virtual
Check whether this hatch object uses a hatched pattern fill.
Returns
Adesk::kTrue if hatch uses hatched fill Adesk::kFalse otherwise
◆ isPlanar()
 DOIT UX_EXPORT_FUNCTION Adesk::Boolean AcDbHatch::isPlanar  |  ( |   | ) |   const
virtual
Reimplemented from AcDbEntity.
◆ isSolidFill()
 UX_EXPORT_FUNCTION bool AcDbHatch::isSolidFill  |  ( |   | ) |   const
Gets the hatch entity fill type.
Returns
true if solid fill false otherwise
◆ loopTypeAt()
 UX_EXPORT_FUNCTION Adesk::Int32 AcDbHatch::loopTypeAt  |  ( |  int  |  idx | ) |   const
Gets the hatch entity loop type.
Parameters
[in] | idx | loop idx
Returns
loop type: kDefault, kExternal, kPolyline, kDerived, kTextbox
 or bitwise combinations if succesfull -1 otherwise
◆ modifiedGraphics()
 UX_EXPORT_FUNCTION void AcDbHatch::modifiedGraphics  |  ( |  const AcDbEntity *  |  entity | )
virtual
See also
AcDbEntity::modifiedGraphics(const AcDbEntity*)
Reimplemented from AcDbObject.
◆ normal()
 UX_EXPORT_FUNCTION AcGeVector3d AcDbHatch::normal  |  ( |   | ) |   const
Gets the normal vector for the hatch entity internal.
Date
2009-04-29 arturs added support for closed objects
 2007-07-09 laurentiuv created
◆ numHatchLines()
 UX_EXPORT_FUNCTION int AcDbHatch::numHatchLines  |  ( |   | ) |   const
Get the number of lines created by a hatch after applying evaluateHatch()
Returns
0 if the hatch is a solid type number of lines composing the hatch otherwise
◆ numLoops()
 UX_EXPORT_FUNCTION int AcDbHatch::numLoops  |  ( |   | ) |   const
Gets the hatch entity number of boundary loops.
Returns
number of loops if succesfull 0 otherwise
◆ numPatternDefinitions()
 UX_EXPORT_FUNCTION int AcDbHatch::numPatternDefinitions  |  ( |   | ) |   const
Gets the number of pattern definition lines for this hatch.
Returns
number of pattern definition lines if successful 0 otherwise
◆ patternDouble()
 UX_EXPORT_FUNCTION bool AcDbHatch::patternDouble  |  ( |   | ) |   const
Returns whether this pattern is double hatched (cross hatched).
Only used for kUserDefined hatches.
Returns
whether pattern is double hatched.
◆ patternSpace()
 UX_EXPORT_FUNCTION double AcDbHatch::patternSpace  |  ( |   | ) |   const
Returns the space for the pattern.
Only used for kUserDefined hatches.
Returns
space for the hatch pattern.
◆ patternType()
 UX_EXPORT_FUNCTION AcDbHatch::HatchPatternType AcDbHatch::patternType  |  ( |  void  |   | ) |   const
Returns type of the pattern.
Returns
one of AcDbHatch::kUserDefined, AcDbHatch::kPreDefined, AcDbHatch::kCustomDefined
◆ receiveShadows()
 UX_EXPORT_FUNCTION bool AcDbHatch::receiveShadows  |  ( |   | ) |   const
virtual
See AcDbEntity::receiveShadows() .
Returns
always false for this type
Reimplemented from AcDbEntity.
◆ removeAssocObjIds()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbHatch::removeAssocObjIds  |  ( |   | )
Removes the associated boundary object ids with the hatch.
Remarks
this function works only for associative hatches
Returns
always Acad::eOk
◆ removeHatchLines()
 UX_EXPORT_FUNCTION void AcDbHatch::removeHatchLines  |  ( |   | )
Clears the hatch line cache of non-solid and non-gradient hatch object.
Remarks
the hatch stroke cache will be regenerated with each change of hatch definition data, and even with numHatchLines();
◆ removeLoopAt()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbHatch::removeLoopAt  |  ( |  int  |  idx | )
Removes the loop at given position @idx from the hatch.
Parameters
[in] | idx | loop index to remove
Returns
Acad::eOk if successful Acad::eInvalidIndex if index is out of range
◆ setBackgroundColor()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbHatch::setBackgroundColor  |  ( |  const AcCmColor &  |  col | )
The hatch,s background color is set by this function.
Parameters
[in] | col | col to set. If the hatch is gradient or solid than color is ignored
Returns
Acad::eOk, if successful, error code otherwise.
◆ setCastShadows()
 UX_EXPORT_FUNCTION void AcDbHatch::setCastShadows  |  ( |  bool  |  value | )
virtual
See AcDbEntity::setCastShadows(bool) .
Parameters
[in] | value | ignored
Reimplemented from AcDbEntity.
◆ setGradient()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbHatch::setGradient  |  ( |  AcDbHatch::GradientPatternType  |  gradientType,
|  const ACHAR *  |  gradientName
)
Sets the hatch entity gradient type and gradient name.
Parameters
[in] | gradientType | kPreDefinedGradient or kUserDefinedGradient, only first supported
[in] | gradientName | name of gradient (string)
◆ setGradientAngle()
 Acad::ErrorStatus AcDbHatch::setGradientAngle  |  ( |  double  |  ang | )
Sets the angle for the gradient hatch pattern.
Parameters
[in] | angle | It sets the angle which gradient definition will be draw Returns Acad::eOK if the operation is successful.
◆ setGradientColors()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbHatch::setGradientColors  |  ( |  unsigned int  |  index,
|  AcCmColor *  |  gradientColors,
|  float *  |  interpolationValues
)
Sets the hatch entity gradient colors.
Parameters
[in] | index | number of pairs gradientColors/interpolationValues, only 2 pairs currently supported
[in] | gradientColors | array of AcCmColor holding gradientColors, only 2 elements currently supported
[in] | interpolationValues | array of float values, only 2 elements currently supported and only 0.0f the first element and 1.0f the second element
Returns
Acad::eOk if successful The caller should free the allocateed arrays for gradientcolors and interpolationValues.
◆ setGradientOneColorMode()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbHatch::setGradientOneColorMode  |  ( |  Adesk::Boolean  |  singleColor | )
Sets the hatch entity gradient If is it false than the transition will be from a start color to the stop color If is it true than It will adjust the luminance version of the same color.
Parameters
[in] | singleColor | Value for know if is with one color or two color. Returns Acad::eOk if successful.
◆ setGradientShift()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbHatch::setGradientShift  |  ( |  float  |  shift | )
The diference beetween the shifted values and the gradient definition default is set by this function.
When we have 1.0 than the shifted gradient is full. When we have 0.0 than the hatch hasn't a shifted gradient.
Returns
Acad::eOk if it is successful. Return Acad::eNotApplicable for classic hatch. If the Acad::eInvalidInput if value have not value beetwen 0.0 and 1.0.
◆ setHatchObjectType()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbHatch::setHatchObjectType  |  ( |  AcDbHatch::HatchObjectType  |  t | )
Sets object type of the hatch.
Parameters
[in] | t | object type to set, one of AcDbHatch::kHatchObject, AcDbHatch::kGradientObject
Returns
Acad:eOk or error status
◆ setPattern()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbHatch::setPattern  |  ( |  AcDbHatch::HatchPatternType  |  patternType,
|  const ACHAR *  |  patternName
)
Sets both pattern type and pattern name for a hatch entity.
Parameters
[in] | patternType | type to set, one of kUserDefined, kPreDefined or kCustomDefined
[in] | patternName | name to set, may be NULL for kCustomDefined patterns.
Returns
one of Acad::eOk, Acad::eInvalidInput
Remarks
In BrxApi this function only can be applied to hatches which belong to a database.
◆ setPatternDouble()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbHatch::setPatternDouble  |  ( |  bool  |  value | )
Sets whether this pattern is double hatched (cross hatched).
Only used for kUserDefined hatches.
Returns
Acad::eNotApplicable, if gradient, Acad::eInvalidInput, if not kUserDefined, Acad::eOk else
Remarks
other CAD engines may return Acad::eOk for hatches which are not kUserDefined.
 In BrxApi this function only can be applied to hatches which belong to a database.
◆ setPatternScale()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbHatch::setPatternScale  |  ( |  double  |  value | )
Sets the hatch entity pattern scale internal.
Date
2008-09-28 monikah workaround for OdaIssue144 added - DwgDirect pops up an assert if setPatterScale is called on kUserDefined patterns
 2009-01-06 monikah added workaround for DwgDirect not allowing this function for solid hatches.
 2008-01-17 monikah TRY-CATCH added
 2007-07-09 laurentiuv created
Note
2009-01-06 monikah DwgDirect does not allow this function to be called for solid hatches. So we make a workaround, temporary setting the user defined solid hatch to be a predefined hatch with an empty name. Obviously this is an invalid name, but this is no problem, we catch that exception. Unfortunately many of the DwgDirect hatch functions regenerate the hatch, which leads to a eNoDatabase exception. We catch and ignure this one too.
◆ setPatternSpace()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbHatch::setPatternSpace  |  ( |  double  |  value | )
Sets the space for the pattern.
Only used for kUserDefined hatches.
Returns
Acad::eNotApplicable, if gradient, Acad::eInvalidInput, if not kUserDefined, Acad::eOk else
Remarks
other CAD engines may return Acad::eOk for hatches which are not kUserDefined.
 In BrxApi this function only can be applied to hatches which belong to a database.
◆ setReceiveShadows()
 UX_EXPORT_FUNCTION void AcDbHatch::setReceiveShadows  |  ( |  bool  |  value | )
virtual
See AcDbEntity::setReceiveShadows(bool) .
Parameters
[in] | value | ignored
Reimplemented from AcDbEntity.
◆ setShadeTintValue()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbHatch::setShadeTintValue  |  ( |  float  |  value | )
The tint shade value is set according to the first color if the gradient is using one-color mode.
Returns
Acad::eOk if successful or Acad::eInvalidInput if the input is out of range.
◆ setShadeTintValueAndColor2()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbHatch::setShadeTintValueAndColor2  |  ( |  float  |  value | )
The tint shade value and second gradient color are set according to the first color if the gradient is using one-color mode.
Returns
Acad::eOk if successful or Acad::eInvalidInput if the input is out of range.
◆ subSwapIdWith()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbHatch::subSwapIdWith  |  ( |  AcDbObjectId  |  id,
|  Adesk::Boolean  |  swapData = Adesk::kFalse,
|  Adesk::Boolean  |  swapDictionary = Adesk::kFalse
)
virtual
See also
AcDbEntity::subSwapIdWith(AcDbObjectId, Adesk::Boolean, Adesk::Boolean)
Reimplemented from AcDbObject.
◆ swapReferences()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbHatch::swapReferences  |  ( |  const AcDbIdMapping &  |  idMapping | )
virtual
See also
AcDbEntity::swapReferences(const AcDbIdMapping&)
Reimplemented from AcDbObject.