Public Types | Public Member Functions | Static Public Member Functions | List of all members
AcDbPointRef Class Referenceabstract
_ More...
#include <AcDbPointRef.h>
 Public Types
enum  | OsnapType {
 kOsnapNone = 0 , kOsnapEnd , kOsnapMid , kOsnapCen ,
 kOsnapNode , kOsnapQuad , kOsnapInt , kOsnapIns ,
 kOsnapPerp , kOsnapTan , kOsnapNear , kOsnapApint ,
 kOsnapStart = 13 , kOsnapCentroid
 }
 Public Member Functions
 virtual Acad::ErrorStatus  | deepClone (AcRxObject *, AcDbObject *&, AcDbIdMapping &, Adesk::Boolean=Adesk::kTrue) const
 virtual Acad::ErrorStatus  | dwgInFields (AcDbDwgFiler *, AcDbDatabase *)=0
 virtual Acad::ErrorStatus  | dwgOutFields (AcDbDwgFiler *, AcDbDatabase *) const =0
 virtual Acad::ErrorStatus  | dxfInFields (AcDbDxfFiler *, AcDbDatabase *)=0
 virtual Acad::ErrorStatus  | dxfOutFields (AcDbDxfFiler *, AcDbDatabase *) const =0
virtual Acad::ErrorStatus  | evalPoint (AcGePoint3d &)=0
 virtual Acad::ErrorStatus  | getEntities (AcDbFullSubentPathArray &, bool=true) const =0
 virtual bool  | isGeomErased () const =0
 virtual bool  | isXrefObj (AcDbObjectIdArray &, AcDbObjectIdArray &, bool=true) const =0
 virtual AcDbPointRef &  | operator= (const AcDbPointRef &)
 virtual Acad::ErrorStatus  | subErase (Adesk::Boolean)
 virtual void  | updateDueToMirror (bool=false)=0
 virtual Acad::ErrorStatus  | updateSubentPath (AcDbIdMapping &)=0
 virtual Acad::ErrorStatus  | updateXrefSubentPath ()=0
 virtual Acad::ErrorStatus  | wblockClone (AcRxObject *, AcDbObject *&, AcDbIdMapping &, Adesk::Boolean=Adesk::kTrue) const
 Public Member Functions inherited from AcRxObject
virtual AcRxObject *  | clone () const
Exported and implemented. More...
 virtual AcRx::Ordering  | comparedTo (const AcRxObject *) const
Exported and implemented.
virtual Acad::ErrorStatus  | copyFrom (const AcRxObject *)
Exported and implemented. More...
 virtual AcRxClass *  | isA () const
Exported and implemented.
virtual Adesk::Boolean  | isEqualTo (const AcRxObject *) const
Exported and implemented. More...
bool  | isKindOf (const AcRxClass *) const
Checks the object class. More...
AcRxObject *  | queryX (const AcRxClass *) const
returns the protocol extension object assigned to this class or a parent class. More...
AcRxObject *  | x (const AcRxClass *) const
returns the protocol extension object assigned to this class or a parent class. More...
 virtual  | ~AcRxObject ()
Destructor.
 Static Public Member Functions
 static bool  | calcTransform (const AcDbObjectIdArray &, AcGeMatrix3d &)
 static Acad::ErrorStatus  | dwgInFields (AcDbDwgFiler *, AcDbDatabase *, AcDbPointRef *&)
 static Acad::ErrorStatus  | dwgOutFields (AcDbDwgFiler *, AcDbDatabase *, const AcDbPointRef *)
 static Acad::ErrorStatus  | dxfInFields (AcDbDxfFiler *, AcDbDatabase *, AcDbPointRef *&)
 static Acad::ErrorStatus  | dxfOutFields (AcDbDxfFiler *, AcDbDatabase *, const AcDbPointRef *)
 static AcGeMatrix3d  | mswcsToPswcs (const AcDbViewport *)
 static AcDbEntity *  | subentPtr (const AcDbFullSubentPath &, bool &, bool &, bool &)
 static AcGeMatrix3d  | wcsToDcsMatrix (const AcDbViewport *)
 Static Public Member Functions inherited from AcRxObject
 static AcRxObject *  | cast (const AcRxObject *)
 static AcRxClass *  | desc ()
Exported and implemented.
 Additional Inherited Members
 Protected Member Functions inherited from AcRxObject
AcRxObject ()
Exported and implemented.
Detailed Description
_
Member Function Documentation
◆ evalPoint()
 virtual Acad::ErrorStatus AcDbPointRef::evalPoint  |  ( |  AcGePoint3d &  |   | )
pure virtual
Implemented in AcDbOsnapPointRef.