Public Member Functions | Static Public Member Functions | List of all members
AcDbAssocPersSubentId Class Referenceabstract
_ More...
#include <AcDbAssocPersSubentId.h>
 Public Member Functions
 virtual Acad::ErrorStatus  | audit (AcDbAuditInfo *)
virtual Acad::ErrorStatus  | copyFrom (const AcRxObject *)
 virtual Acad::ErrorStatus  | dwgInFields (AcDbDwgFiler *)
 virtual Acad::ErrorStatus  | dwgOutFields (AcDbDwgFiler *) const
 virtual Acad::ErrorStatus  | dxfInFields (AcDbDxfFiler *)
 virtual Acad::ErrorStatus  | dxfOutFields (AcDbDxfFiler *) const
 virtual Acad::ErrorStatus  | getTransientSubentIds (const AcDbEntity *, AcDbDatabase *, AcDbSubentIdArray &) const
 virtual bool  | isEqualTo (const AcDbEntity *, AcDbDatabase *, const AcDbAssocPersSubentId *) const
 virtual bool  | isNull () const =0
 virtual Acad::ErrorStatus  | mirror (const AcDbEntity *, AcDbDatabase *)
 virtual Acad::ErrorStatus  | release (AcDbEntity *, AcDbDatabase *) const
 virtual AcDb::SubentType  | subentType (const AcDbEntity *, AcDbDatabase *) const =0
 virtual int  | transientSubentCount (const AcDbEntity *, AcDbDatabase *) const
 Public Member Functions inherited from AcRxObject
virtual AcRxObject *  | clone () const
Exported and implemented. More...
 virtual AcRx::Ordering  | comparedTo (const AcRxObject *) const
Exported and implemented.
virtual Acad::ErrorStatus  | copyFrom (const AcRxObject *)
Exported and implemented. More...
 virtual AcRxClass *  | isA () const
Exported and implemented.
virtual Adesk::Boolean  | isEqualTo (const AcRxObject *) const
Exported and implemented. More...
bool  | isKindOf (const AcRxClass *) const
Checks the object class. More...
AcRxObject *  | queryX (const AcRxClass *) const
returns the protocol extension object assigned to this class or a parent class. More...
AcRxObject *  | x (const AcRxClass *) const
returns the protocol extension object assigned to this class or a parent class. More...
 virtual  | ~AcRxObject ()
Destructor.
 Static Public Member Functions
 static Acad::ErrorStatus  | createObjectAndDwgInFields (AcDbDatabase *, AcDbDwgFiler *, AcDbAssocPersSubentId *&)
 static Acad::ErrorStatus  | createObjectAndDxfInFields (AcDbDxfFiler *, AcDbAssocPersSubentId *&)
 Static Public Member Functions inherited from AcRxObject
 static AcRxObject *  | cast (const AcRxObject *)
 static AcRxClass *  | desc ()
Exported and implemented.
 Additional Inherited Members
 Protected Member Functions inherited from AcRxObject
AcRxObject ()
Exported and implemented.
Detailed Description
_
Member Function Documentation
◆ copyFrom()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbAssocPersSubentId::copyFrom  |  ( |  const AcRxObject *  |   | )
virtual
Reimplemented from AcRxObject.