Public Types | Public Member Functions | Public Attributes | List of all members
AcDbPointCloudEx Class Reference
 Public Types
enum  | DispOptionOutOfRange { kUseMinMaxColors = 0 , kUseRGBScanColors = 1 , kHidePoints = 2 }
enum  | PointCloudOSnapMode {
 kOsModePNod = 0 , kOsModePNea = 1 , kOsModePPer = 2 , kOsModePEdgeNea = 3 ,
 kOsModePEdgePer = 4 , kOsModePInt = 5 , kOsModePCL = 6 , kOsModePCorner = 7
 }
enum  | StylizationType {
 kTrueColor = 1 , kSingleColor = 2 , kNormalRamp = 3 , kHeightRamp = 4 ,
 kIntensityRamp = 5 , kClassificationRamp = 6 , kIntensityGamma = 101 , kIntensityShadow = 102 ,
 kPlaneDeviationRamp = 103 , kTempRegion = 201
 }
 Public Types inherited from AcDbEntity
enum  | VisualStyleType { kFullVisualStyle = 0 , kFaceVisualStyle = 1 , kEdgeVisualStyle = 2 }
 Public Types inherited from AcGiDrawable
enum  | DrawableType {
 kGeometry = 0 , kDistantLight , kPointLight , kSpotLight ,
 kAmbientLight , kSolidBackground , kGradientBackground , kImageBackground ,
 kGroundPlaneBackground , kViewport
 }
enum  | SetAttributesFlags {
 kDrawableNone = 0 , kDrawableIsAnEntity = 1 , kDrawableUsesNesting = 2 , kDrawableIsCompoundObject = 4 ,
 kDrawableViewIndependentViewportDraw = 8 , kDrawableIsInvisible = 16 , kDrawableHasAttributes = 32 , kDrawableRegenTypeDependentGeometry = 64 ,
 kDrawableIsDimension = 133 , kDrawableRegenDraw = 256 , kDrawableStandardDisplaySingleLOD = 512 , kDrawableShadedDisplaySingleLOD = 1024 ,
 kDrawableViewDependentViewportDraw = 2048 , kDrawableBlockDependentViewportDraw = 4096 , kDrawableIsExternalReference = 8192 , kDrawableNotPlottable = 16384 ,
 kDrawableNotAllowLCS = 32768 , kDrawableMergeControlOff = 65536 , kThreadedWorldDrawViewportDraw = 131072
 }
 Public Member Functions
 Acad::ErrorStatus  | addAttributeFilter (IAcDbPointCloudAttributeFilter *)
void  | addCroppingBoundary (const AcDbPointCloudCrop &)
Adds a new point cloud cropping. More...
 Acad::ErrorStatus  | addSpatialFilter (IAcDbPointCloudSpatialFilter *)
 void  | applyGeoLocation (bool=false, const AcString &=ACRX_T(""))
 void  | clearAttributeFilters ()
Acad::ErrorStatus  | clearCropping ()
Removes all point cloud croppings. More...
 void  | clearGeoLocation ()
 void  | clearSpatialFilters ()
 AcDbPointCloudCropStateManager *  | cropStatesManager ()
 const AcDbPointCloudCropStateManager *  | cropStatesManagerConst () const
 Acad::ErrorStatus  | detectPointBelonger (const AcGePoint3d &, AcString &, Adesk::UInt16 &) const
bool  | elevationApplyToFixedRange () const
Gets whether to apply a fixed elevation range. More...
DispOptionOutOfRange  | elevationOutOfRangeBehavior () const
Gets the elevation out of range behavior. More...
 AcPointCloudItem *  | findRegionItem (Adesk::Int32)
 AcPointCloudItem *  | findScanItem (const AcString &)
 bool  | geolocate () const
bool  | getActiveFileName (AcString &) const
Gets active filename of this point cloud. More...
 Acad::ErrorStatus  | getCandidatePlane (const CPoint &, AcGePlane &, double &, double &, double &, void *&) const
AcString  | getColorSchemeForStylization (StylizationType) const
Gets color scheme for the specified stylization. More...
int  | getCroppingCount () const
Gets number of croppings on this point cloud. More...
bool  | getCroppingInvert () const
Get whether cropping is inverted. More...
AcString  | getCurrentColorScheme () const
Gets current color scheme. More...
 Acad::ErrorStatus  | getCustomOsnapInfo (PointCloudOSnapMode, const AcGePoint3d &, const AcGePoint3d &, const AcGeMatrix3d &, AcGePoint3dArray &)
 Acad::ErrorStatus  | getCylinderAt (const AcGeMatrix3d &, const AcGePoint3d &, AcGePoint3d &, AcGeVector3d &, double &, double &)
 Acad::ErrorStatus  | getCylinderAt (const AcGeMatrix3d &, const AcGePoint3d &, AcPointCloudExtractedCylinder &)
unsigned int  | getDisplayedVisiblePointCount () const
Gets count of displayed visible points (NOT YET IMPLEMENTED). More...
 Acad::ErrorStatus  | getEstimatedPointCountByPrecision (Adesk::UInt64 &, double, IAcDbPointCloudSpatialFilter *=NULL, IAcDbPointCloudAttributeFilter *=NULL) const
 void  | getLimitBox (AcDbPointCloudExLimitBox &) const
unsigned int  | getLoadedVisiblePointCount () const
Gets count of loaded visible points (NOT YET IMPLEMENTED). More...
 Acad::ErrorStatus  | getMinDistPrecision (double &) const
void  | getNativeCloudExtent (AcDbExtents &) const
Gets current scale of this point cloud. More...
 bool  | getPlaneBoundaryAt (const AcGeMatrix3d &, const AcGePoint3d &, AcGePoint3dArray &)
 bool  | getPlaneOrPointAt (const AcGeMatrix3d &, const AcGePoint3d &, AcGePoint3dArray &)
AcDbPointCloudCrop *  | getPointCloudCropping (int)
Gets the specified point cloud cropping. More...
const AcDbPointCloudCrop *  | getPointCloudCroppingConst (int) const
Gets the specified point cloud cropping. More...
 const AcPointCloudItemArray *  | getPointCloudDataList () const
AcString  | getPointCloudName () const
Gets current name of this point cloud. More...
 PointCloudPerfMonitor *  | getPointCloudPerfMonitor ()
Acad::ErrorStatus  | getPointDataByPointCount (IAcDbPointCloudDataBuffer *&, Adesk::UInt32, const AcStringArray &, IAcDbPointCloudSpatialFilter *, IAcDbPointCloudAttributeFilter *, Adesk::UInt32, Adesk::UInt32) const
Returns point cloud data by approximate point count. More...
Acad::ErrorStatus  | getPointDataByPointCount (IAcDbPointCloudDataBuffer *&, Adesk::UInt32, IAcDbPointCloudSpatialFilter *pSpatialFilter, IAcDbPointCloudAttributeFilter *, Adesk::UInt32, Adesk::UInt32) const
Returns point cloud data by approximate point count. More...
 Acad::ErrorStatus  | getPointDataByPrecision (IAcDbPointCloudDataBuffer *&, double, IAcDbPointCloudSpatialFilter *=NULL, IAcDbPointCloudAttributeFilter *=NULL, Adesk::UInt32=0, Adesk::UInt32=1000000u) const
 Acad::ErrorStatus  | getPointDataBySegment (IAcDbPointCloudDataBuffer *&, const AcString &, Adesk::UInt16, Adesk::UInt32) const
 void *  | getQuery ()
 bool  | getScanViewInfo (const AcString &, AcGePoint3d &, AcDbExtents &) const
unsigned int  | getVisiblePointCount () const
Gets count of visible points (NOT YET IMPLEMENTED). More...
DispOptionOutOfRange  | intensityOutOfRangeBehavior () const
Gets the intensity out of range behavior. More...
AcGePoint3d  | location () const
Gets current scale of this point cloud. More...
bool  | locked () const
Gets current locked state of this point cloud. More...
double  | maxElevation () const
Gets the maximum elevation value. More...
Adesk::Int32  | maxIntensity () const
Gets the maximum intensity value. More...
double  | minElevation () const
Gets the minimum elevation value. More...
Adesk::Int32  | minIntensity () const
Gets the minimum intensity value. More...
 void  | objectToWorldMatrix (AcGeMatrix3d &) const
AcDbObjectId  | pointCloudDefExId () const
Gets the point cloud definition for this point cloud. More...
AcDbObjectId  | reactorId () const
Gets the reactor for this point cloud. More...
 Acad::ErrorStatus  | removeAttributeFilter (IAcDbPointCloudAttributeFilter *)
Acad::ErrorStatus  | removeLastCropping ()
Removes the last point cloud cropping. More...
 Acad::ErrorStatus  | removeSpatialFilter (IAcDbPointCloudSpatialFilter *)
 void  | resetLimitBox ()
 void  | resetScanRegionVisibility ()
double  | rotation () const
Gets current rotation of this point cloud. More...
double  | scale () const
Gets current scale of this point cloud. More...
bool  | setActiveFileName (const ACHAR *)
Sets the scale of this point cloud. More...
 void  | setAllRegionHighlight (bool, bool=false)
 void  | setAllRegionsVisibility (bool, bool=false)
 void  | setAllScanHighlight (bool)
 void  | setAllScansVisibility (bool)
 void  | setAllScansVisibilityByRegion (Adesk::Int32, bool)
Acad::ErrorStatus  | setColorSchemeForStylization (const AcString &, StylizationType)
Sets whether to show cropping. More...
Acad::ErrorStatus  | setCroppingInvert (bool)
Sets whether point cloud cropping is inverted. More...
Acad::ErrorStatus  | setCurrentColorScheme (const AcString &)
Sets current color scheme. More...
void  | setElevationApplyToFixedRange (bool)
Sets whether to apply a fixed elevation range. More...
void  | setElevationOutOfRangeBehavior (DispOptionOutOfRange)
Sets the elevation out of range behavior. More...
 void  | setHighlightLimitboxBoundary (bool)
void  | setInCreatingCroppingMode (bool)
Sets or resets creating cropping mode. More...
void  | setIntensityOutOfRangeBehavior (DispOptionOutOfRange)
Sets the intensity out of range behavior. More...
 Acad::ErrorStatus  | setLimitBox (const AcDbPointCloudExLimitBox &)
Acad::ErrorStatus  | setLocation (const AcGePoint3d &)
Sets the location of this point cloud. More...
void  | setLocked (bool)
Sets current locked state of this point cloud. More...
Acad::ErrorStatus  | setMinMaxElevation (double, double)
Sets the elevation value range. More...
Acad::ErrorStatus  | setMinMaxIntensity (Adesk::Int32 min, Adesk::Int32 max)
Sets the intensity value range. More...
void  | setPointCloudDefExId (const AcDbObjectId &)
Sets the point cloud definition for this point cloud. More...
Acad::ErrorStatus  | setPointCloudName (const AcString &)
Sets the name of this point cloud. More...
void  | setReactorId (const AcDbObjectId &)
Sets the reactor for this point cloud. More...
 void  | setRegionVisibility (Adesk::Int32, bool)
Acad::ErrorStatus  | setRotation (double)
Sets the rotation of this point cloud. More...
Acad::ErrorStatus  | setScale (double)
Sets the scale of this point cloud. More...
 void  | setScanVisibility (const AcString &, bool)
Acad::ErrorStatus  | setShowCropped (bool)
Sets whether to show cropping. More...
void  | setShowElevationAsGradient (bool)
Sets whether to show elevation as gradient. More...
void  | setShowIntensityAsGradient (bool)
Sets whether to show intensity as gradient. More...
Acad::ErrorStatus  | setStylizationType (StylizationType)
Sets stylization type. More...
bool  | showCropped () const
Get whether the cropping is shown. More...
bool  | showElevationAsGradient () const
Gets whether to show elevation as gradient. More...
bool  | showIntensityAsGradient () const
Gets whether to show intensity as gradient. More...
StylizationType  | stylizationType () const
Gets current stylization type. More...
Acad::ErrorStatus  | traverseAllPointData (IAcDbPointCloudPointProcessor *, IAcDbPointCloudSpatialFilter *, Adesk::UInt32, int) const
Calls processor for each traversed point. More...
 Acad::ErrorStatus  | traverseAllPointData (IAcDbPointCloudPointProcessor *, IAcDbPointCloudSpatialFilter *, Adesk::UInt32, int, const AcStringArray &) const
 void  | updateGeoLocation ()
~AcDbPointCloudEx ()
Destructor.
 Public Member Functions inherited from AcDbEntity
 virtual Acad::ErrorStatus  | addSubentPaths (const AcDbFullSubentPathArray &) final
virtual Acad::ErrorStatus  | applyPartialUndo (AcDbDwgFiler *, AcRxClass *)
virtual Acad::ErrorStatus  | audit (AcDbAuditInfo *)
AcDbObjectId  | blockId () const
Returns the Object ID of the BlockTableRecord that owns this entity. More...
Acad::ErrorStatus  | boundingBoxIntersectWith (const AcDbEntity *, AcDb::Intersect, AcGePoint3dArray &, Adesk::GsMarker, Adesk::GsMarker) const
Finds the intersection between the edges of the bounding box for this entity and the pOhter entity. More...
Acad::ErrorStatus  | boundingBoxIntersectWith (const AcDbEntity *, AcDb::Intersect, const AcGePlane &, AcGePoint3dArray &, Adesk::GsMarker, Adesk::GsMarker) const
First, the function projects the other entity and the bounding box of this entity on plane specified by plane. More...
virtual bool  | bounds (AcDbExtents &) const
Returns the extents of this entity as AcDbExtents. More...
virtual bool  | castShadows () const
Checks if this entity is able to cast shadows. More...
virtual Adesk::Boolean  | cloneMeForDragging () final
Checks if a clone will be created for this entity in case of a drag operation. More...
 virtual AcDb::CollisionType  | collisionType () const
AcCmColor  | color () const
Returns the true color information of the entity. More...
Adesk::UInt16  | colorIndex () const
Returns the color number in a range from 0 to 256. More...
 virtual Acad::ErrorStatus  | deleteSubentPaths (const AcDbFullSubentPathArray &) final
virtual void  | dragStatus (const AcDb::DragStat)
Acad::ErrorStatus  | draw ()
Draws or redraws the entity on screen. More...
virtual AcGiDrawable *  | drawable ()
virtual Acad::ErrorStatus  | dwgInFields (AcDbDwgFiler *)
virtual Acad::ErrorStatus  | dwgOutFields (AcDbDwgFiler *) const
virtual Acad::ErrorStatus  | dxfInFields (AcDbDxfFiler *)
virtual Acad::ErrorStatus  | dxfOutFields (AcDbDxfFiler *) const
AcCmEntityColor  | entityColor () const
Returns the lightweight color information of the entity. More...
virtual Acad::ErrorStatus  | explode (AcDbVoidPtrArray &) const final
virtual Acad::ErrorStatus  | getCompoundObjectTransform (AcGeMatrix3d &) const final
It is used for object without geometry like AcDbMleader. More...
virtual void  | getEcs (AcGeMatrix3d &) const
Returns the transformation matrix from OCS (Object Coordinate System) to WCS (World Coordinate System). More...
virtual Acad::ErrorStatus  | getGeomExtents (AcDbExtents &) const final
Returns extents of this entity. More...
 virtual Acad::ErrorStatus  | getGripEntityUCS (const void *, AcGeVector3d &, AcGePoint3d &, AcGeVector3d &) const final
 virtual Acad::ErrorStatus  | getGripPoints (AcDbGripDataPtrArray &, const double, const int, const AcGeVector3d &, const int) const final
virtual Acad::ErrorStatus  | getGripPoints (AcGePoint3dArray &, AcDbIntArray &, AcDbIntArray &) const final
Append grip points to the specified array. More...
 virtual Acad::ErrorStatus  | getGripPointsAtSubentPath (const AcDbFullSubentPath &, AcDbGripDataPtrArray &, const double, const int, const AcGeVector3d &, const int) const final
virtual Acad::ErrorStatus  | getGsMarkersAtSubentPath (const AcDbFullSubentPath &, AcArray< Adesk::GsMarker > &) const final
virtual Acad::ErrorStatus  | getMaterialMapper (AcGiMapper &) const
virtual Acad::ErrorStatus  | getOsnapPoints (AcDb::OsnapMode, Adesk::GsMarker, const AcGePoint3d &, const AcGePoint3d &, const AcGeMatrix3d &, AcGePoint3dArray &, AcDbIntArray &) const final
Gets the entity osnap points. More...
virtual Acad::ErrorStatus  | getOsnapPoints (AcDb::OsnapMode, Adesk::GsMarker, const AcGePoint3d &, const AcGePoint3d &, const AcGeMatrix3d &, AcGePoint3dArray &, AcDbIntArray &, const AcGeMatrix3d &) const final
Gets the entity osnap points. More...
virtual Acad::ErrorStatus  | getPlane (AcGePlane &, AcDb::Planarity &) const
Returns the plane that contains this entity. More...
AcDb::PlotStyleNameType  | getPlotStyleNameId (AcDbObjectId &) const
Returns the plot style name type and its associated id. More...
virtual Acad::ErrorStatus  | getStretchPoints (AcGePoint3dArray &) const final
Append stretch points to the specified array. More...
 virtual Acad::ErrorStatus  | getSubentClassId (const AcDbFullSubentPath &, CLSID *) const final
 virtual Acad::ErrorStatus  | getSubentPathGeomExtents (const AcDbFullSubentPath &, AcDbExtents &) const final
virtual Acad::ErrorStatus  | getSubentPathsAtGsMarker (AcDb::SubentType, Adesk::GsMarker, const AcGePoint3d &, const AcGeMatrix3d &, int &, AcDbFullSubentPath *&, int=0, AcDbObjectId *=NULL) const final
Gets the subentity paths appropriate for the passed in gs marker. More...
virtual Acad::ErrorStatus  | getTransformedCopy (const AcGeMatrix3d &, AcDbEntity *&) const final
Creates a copy of the current entity applying the transformation matrix. More...
 virtual void  | gripStatus (const AcDb::GripStat) final
 virtual bool  | hideMeForDragging () const final
virtual Acad::ErrorStatus  | highlight (const AcDbFullSubentPath &=kNullSubent, const Adesk::Boolean=Adesk::kFalse) const final
Highlights part of, or entire entity. More...
virtual Acad::ErrorStatus  | intersectWith (const AcDbEntity *, AcDb::Intersect, AcGePoint3dArray &, Adesk::GsMarker=0, Adesk::GsMarker=0) const final
Finds the intersection between this entity and the pOhter entity. More...
virtual Acad::ErrorStatus  | intersectWith (const AcDbEntity *, AcDb::Intersect, const AcGePlane &, AcGePoint3dArray &, Adesk::GsMarker=0, Adesk::GsMarker=0) const final
Projects this entity and the pOhter entity on plane, finds the intersection points between these projections and then projects back the points onto the caller entity. More...
 virtual bool  | isContentSnappable () const final
virtual Adesk::Boolean  | isPlanar () const
ACHAR *  | layer () const
Returns the layername. More...
AcDbObjectId  | layerId () const
Returns the Object ID of the LayerTableRecord referenced by this entity. More...
ACHAR *  | linetype () const
Gets the linetype value. More...
AcDbObjectId  | linetypeId () const
Gets the linetypeId value. More...
 double  | linetypeScale () const
returns the linetype scale factor for the entity
AcDb::LineWeight  | lineWeight () const
Gets the entity line weight. More...
virtual void  | list () const final
Prints the properties in drawing window. More...
ACHAR *  | material () const
Gets the material assigned to this entity. More...
AcDbObjectId  | materialId () const
Gets the AcDbObjectId of the material assigned to this entity. More...
virtual Acad::ErrorStatus  | moveGripPointsAt (const AcDbIntArray &, const AcGeVector3d &) final
Move the grip points pointed by the indexes specified in indexArray using the translationVector param direction and length Override this method in custom entities to define your own behaviour. More...
 virtual Acad::ErrorStatus  | moveGripPointsAt (const AcDbVoidPtrArray &, const AcGeVector3d &, const int) final
 virtual Acad::ErrorStatus  | moveGripPointsAtSubentPaths (const AcDbFullSubentPathArray &, const AcDbVoidPtrArray &, const AcGeVector3d &, const int) final
virtual Acad::ErrorStatus  | moveStretchPointsAt (const AcDbIntArray &, const AcGeVector3d &) final
Move the stretch points pointed by the indexes specified in indexArray with the offest specified by translationVector Override this method in custom entities to define your own behaviour. More...
ACHAR *  | plotStyleName () const
Returns the name of the plotStyleName string associated with this entity (DXF 390). More...
virtual bool  | receiveShadows () const
Checks if this entity is able to receive shadows. More...
void  | recordGraphicsModified (Adesk::Boolean=Adesk::kTrue)
Controls the entity display update when closing it Entities not updated when closed are updated at the first regen. More...
virtual void  | saveAs (AcGiWorldDraw *, AcDb::SaveType)
Generates the graphics primitives when a DWG save requiring proxy graphics to be saved is made. More...
virtual void  | setCastShadows (bool)
Sets this entity's flag regarding casting shadows. More...
virtual Acad::ErrorStatus  | setColor (const AcCmColor &, Adesk::Boolean=Adesk::kTrue)
Sets the color information of this entity from an AcCmColor instance. More...
virtual Acad::ErrorStatus  | setColor (const AcCmColor &, bool, AcDbDatabase *)
Sets the color property of this entity from an AcCmColor instance. More...
virtual Acad::ErrorStatus  | setColorIndex (Adesk::UInt16, Adesk::Boolean=Adesk::kTrue)
Sets the color index of this entity (DXF 62). More...
void  | setDatabaseDefaults ()
Applies the default properties of the entities database to this entity. More...
void  | setDatabaseDefaults (AcDbDatabase *)
Applies the default properties of the specified database to this entity. More...
virtual Acad::ErrorStatus  | setLayer (AcDbObjectId, Adesk::Boolean=Adesk::kTrue, bool=false)
Sets the layer to be referenced by this entity (DXF 8). More...
virtual Acad::ErrorStatus  | setLayer (const ACHAR *, Adesk::Boolean=Adesk::kTrue, bool=false)
Sets the layer to be referenced by this entity (DXF 8). More...
virtual Acad::ErrorStatus  | setLinetype (AcDbObjectId, Adesk::Boolean=Adesk::kTrue)
Sets the entities linetype to ltypeObjectId. More...
virtual Acad::ErrorStatus  | setLinetype (const ACHAR *, Adesk::Boolean=Adesk::kTrue)
Sets the entities linetype to the linetpye referenced by layerName. More...
virtual Acad::ErrorStatus  | setLinetypeScale (double, Adesk::Boolean=Adesk::kTrue)
sets value as entity linetype scale factor More...
virtual Acad::ErrorStatus  | setLineWeight (AcDb::LineWeight, Adesk::Boolean=Adesk::kTrue)
Sets the entity line weight. More...
virtual Acad::ErrorStatus  | setMaterial (AcDbObjectId, Adesk::Boolean=Adesk::kTrue)
Not implemented yet. More...
virtual Acad::ErrorStatus  | setMaterial (const ACHAR *, Adesk::Boolean=Adesk::kTrue)
Assigns the material to the entity. More...
virtual Acad::ErrorStatus  | setMaterialMapper (const AcGiMapper &, Adesk::Boolean=Adesk::kTrue)
It is used for apply material (scale, rotation, projection, mode overrides) to an identity.If it is used AcGiMapper::kIdentity it will apply for entity a default mapper. More...
virtual Acad::ErrorStatus  | setPlotStyleName (AcDb::PlotStyleNameType, AcDbObjectId=AcDbObjectId::kNull, Adesk::Boolean=Adesk::kTrue)
Sets the plot style of this entity. More...
virtual Acad::ErrorStatus  | setPlotStyleName (const ACHAR *, Adesk::Boolean=Adesk::kTrue)
Sets the plot style of this entity. More...
Acad::ErrorStatus  | setPropertiesFrom (const AcDbEntity *, Adesk::Boolean=Adesk::kTrue)
Copies the properties color, layer, linetype, linetypescale and visibility from the source entity pEntity to this entity. More...
virtual void  | setReceiveShadows (bool)
Sets this entity's flag regarding receiving shadows. More...
virtual Acad::ErrorStatus  | setTransparency (const AcCmTransparency &, Adesk::Boolean=Adesk::kTrue)
Sets the transparency setting of this entity, and returns eOk if successful. More...
virtual Acad::ErrorStatus  | setVisibility (AcDb::Visibility, Adesk::Boolean=Adesk::kTrue) final
notyetdocumented. More...
 virtual Acad::ErrorStatus  | setVisualStyle (AcDbObjectId, VisualStyleType=kFullVisualStyle, Adesk::Boolean=true)
 virtual void  | subentGripStatus (const AcDb::GripStat, const AcDbFullSubentPath &) final
virtual AcDbEntity *  | subentPtr (const AcDbFullSubentPath &) const final
Creates an entity as a copy of the subentity given by acSubentPath. More...
virtual void  | subSetDatabaseDefaults (AcDbDatabase *)
This function is called by AcDbEntity::setDatabaseDefaults(), to allow custom entities to set their related sub entities, if any; default implementation does nothing. More...
virtual Acad::ErrorStatus  | transformBy (const AcGeMatrix3d &) final
Applies given transformation (matrix) to the entity. More...
 virtual Acad::ErrorStatus  | transformSubentPathsBy (const AcDbFullSubentPathArray &, const AcGeMatrix3d &) final
 AcCmTransparency  | transparency () const
Returns the transparency setting of this entity.
virtual Acad::ErrorStatus  | unhighlight (const AcDbFullSubentPath &=kNullSubent, const Adesk::Boolean=Adesk::kFalse) const final
Unhighlights previously highlighted part of entity, or entire entity. More...
AcDb::Visibility  | visibility () const
Gets the visibility state. More...
 AcDbObjectId  | visualStyleId (VisualStyleType=kFullVisualStyle) const
 Public Member Functions inherited from AcDbObject
virtual Acad::ErrorStatus  | addPersistentReactor (AcDbObjectId)
Adds a persistent reactor to this object reactor list. More...
Acad::ErrorStatus  | addReactor (AcDbObjectReactor *) const
Adds a transient reactor to this object. More...
virtual Acad::ErrorStatus  | applyPartialUndo (AcDbDwgFiler *, AcRxClass *)
This function is called during Undo operations on objects, that use the 'Partial Undo meachanism'; this is, this object is opened with assertWriteEnabled(Adesk::kFalse) to indicate that custom Undo filing is used rather than the default Undo filing. More...
 void  | assertNotifyEnabled () const
 void  | assertReadEnabled () const
 void  | assertWriteEnabled (Adesk::Boolean=Adesk::kTrue, Adesk::Boolean=Adesk::kTrue)
virtual Acad::ErrorStatus  | audit (AcDbAuditInfo *)
Performs the audit operation for this object. More...
Acad::ErrorStatus  | cancel ()
Reverts all changes since the object had been opened and closes the object. More...
virtual void  | cancelled (const AcDbObject *)
A handler function for persistent reactors. More...
virtual AcRxObject *  | clone () const
Creates a shallow clone of this object. More...
Acad::ErrorStatus  | close ()
Closes the object. More...
Acad::ErrorStatus  | closeAndPage (Adesk::Boolean=Adesk::kTrue)
Closes the object. More...
virtual Acad::ErrorStatus  | composeForLoad (AcDb::OdaSaveType, AcDb::AcDbDwgVersion)
This function is intended for future MT file loading support. More...
virtual void  | copied (const AcDbObject *, const AcDbObject *)
A handler function for persistent reactors. More...
virtual Acad::ErrorStatus  | copyFrom (const AcRxObject *)
Copies the pSrc object information in this object. More...
Acad::ErrorStatus  | createExtensionDictionary ()
Creates a dictionary as extension dictionary for this object. More...
AcDbDatabase *  | database () const
Returns the database that contains this object. More...
virtual Acad::ErrorStatus  | decomposeForSave (AcDb::AcDbDwgVersion, AcDbObject *&, AcDbObjectId &, Adesk::Boolean &)
This function is called during dwg and dxf output, to allow a custom object to decompose itself, due to provided dwg/dxf target file version. More...
virtual Acad::ErrorStatus  | deepClone (AcDbObject *, AcDbObject *&, AcDbIdMapping &, Adesk::Boolean=Adesk::kTrue) const final
Clones this object, appends it to the owner pOwner and adds an AcDbIdPair record to the idMap. More...
void  | disableUndoRecording (Adesk::Boolean)
Disables or enables the undo recording for the object. More...
Acad::ErrorStatus  | downgradeOpen ()
Sets the open mode for an object opened for write to be opened for read. More...
Acad::ErrorStatus  | downgradeToNotify (Adesk::Boolean)
Sets the open mode for an object opened for write to be opened for notify. More...
virtual AcGiDrawable *  | drawable ()
Retrieves the AcGiDrawable instance of this object. More...
Acad::ErrorStatus  | dwgIn (AcDbDwgFiler *)
Calls the object's dwgInFields function, and reads any XData if present. More...
virtual Acad::ErrorStatus  | dwgInFields (AcDbDwgFiler *)
Reads the object from the DWG filer. More...
Acad::ErrorStatus  | dwgOut (AcDbDwgFiler *) const
Calls the object's dwgOutFields function, and writes any XData if present. More...
virtual Acad::ErrorStatus  | dwgOutFields (AcDbDwgFiler *) const
Writes the object to the DWG filer. More...
Acad::ErrorStatus  | dxfIn (AcDbDxfFiler *)
Calls the object's dxfInFields function, and reads any XData if present. More...
virtual Acad::ErrorStatus  | dxfInFields (AcDbDxfFiler *)
Reads the object from the DXF filer. More...
Acad::ErrorStatus  | dxfOut (AcDbDxfFiler *, Adesk::Boolean, Adesk::uchar *) const
Calls the object's dxfOutFields function, and writes any XData if present. More...
virtual Acad::ErrorStatus  | dxfOutFields (AcDbDxfFiler *) const
Writes the object to the DXF filer. More...
Acad::ErrorStatus  | erase (Adesk::Boolean=Adesk::kTrue)
Sets the bit that indicates that the object is erased. More...
virtual void  | erased (const AcDbObject *, Adesk::Boolean)
A handler function for persistent reactors. More...
AcDbObjectId  | extensionDictionary () const
Returns the object id of the extension dictionary for this object. More...
void  | getAcDbHandle (AcDbHandle &) const
Returns handle of this object. More...
Acad::ErrorStatus  | getBinaryData (const ACHAR *, Adesk::Int32 &, char *&) const
Creates a copy of the binary data stored as chunks of maximum 127 bytes in the resbuf chain of this object's extension dictionary xrecord entry given by entryName. More...
int  | getBrxOpenCount () const
This function returns the number of open BRX instances for this object. More...
int  | getBrxOpenState () const
This function returns the BRX object open state flags as bitfields, for diagnostic purpose. More...
virtual Acad::ErrorStatus  | getClassID (CLSID *) const final
Gets the COM wrapper Class ID for this entity. More...
int  | getCustomObjectState () const
This function returns the custom object status : 1=isCustomObject 2=DifferentialUndoDisabled. More...
Acad::ErrorStatus  | getField (const ACHAR *, AcDbField *&, AcDb::OpenMode) const
Retrieves the specified Field from this object, and opens it in mode. More...
Acad::ErrorStatus  | getField (const ACHAR *, AcDbObjectId &) const
Gets the pszPropName field object from field dictionary of this AcDbObject object, using pszPropName as key. More...
AcDbObjectId  | getFieldDictionary () const
Returns the Field dictionary associated with this object,. More...
Acad::ErrorStatus  | getFieldDictionary (AcDbDictionary *&, AcDb::OpenMode) const
Gets and opens the field dictionary for this. More...
Acad::ErrorStatus  | getObjectBirthVersion (AcDb::AcDbDwgVersion &, AcDb::MaintenanceReleaseVersion &)
This function is currently not supported by the CAD engine, always returns Acad::eOk, and 'kDHL_CURRENT' + 'kMReleaseCurrent' results. More...
virtual Acad::ErrorStatus  | getObjectSaveVersion (const AcDbDwgFiler *, AcDb::AcDbDwgVersion &, AcDb::MaintenanceReleaseVersion &)
Returns the DWG version for saving the object. More...
virtual Acad::ErrorStatus  | getObjectSaveVersion (const AcDbDxfFiler *, AcDb::AcDbDwgVersion &, AcDb::MaintenanceReleaseVersion &)
Returns the DWG version for saving the object. More...
int  | getOdaOpenCount () const
This function returns the number of open ODA instances for this object. More...
int  | getOdaOpenState () const
This function returns the ODA object open state flags as bitfields, for diagnostic purpose. More...
virtual void  | goodbye (const AcDbObject *)
A handler function for persistent reactors. More...
Acad::ErrorStatus  | handOverTo (AcDbObject *, Adesk::Boolean=Adesk::kTrue, Adesk::Boolean=Adesk::kTrue)
Hands over objects identity to another object. More...
bool  | hasFields () const
Return true if this object has single or multiple fields associated with him. More...
bool  | hasPersistentReactor (AcDbObjectId) const
Checks the input objectId in this object reactor list. More...
bool  | hasSaveVersionOverride ()
This function indicates whether this object overrides the filer's save version. More...
virtual AcDbObjectId  | id () const
Returns the database id of this object. More...
Adesk::Boolean  | isAcDbObjectIdsInFlux () const
Checks whether a deep clone operation was completed. More...
Adesk::Boolean  | isAProxy () const
Adesk::Boolean  | isCancelling () const
Adesk::Boolean  | isErased () const
Returns whether this object is erased. More...
Adesk::Boolean  | isEraseStatusToggled () const
Checks whether the object erase status has been toggled. More...
Adesk::Boolean  | isModified () const
Returns whether this object's assertWriteEnabled() has been called since it was opened. More...
Adesk::Boolean  | isModifiedGraphics () const
Checks whether this object graphics will be updated when the object is closed. More...
Adesk::Boolean  | isModifiedXData () const
Checks whether this object's xData was modified. More...
Adesk::Boolean  | isNewObject () const
Returns true if and only if this object has not been closed since it was created. More...
Adesk::Boolean  | isNotifyEnabled () const
Returns whether this object is opened for notify. More...
Adesk::Boolean  | isNotifying () const
virtual Adesk::Boolean  | isPersistent () const
Returns the 'persistent' status of a database object. More...
Adesk::Boolean  | isReadEnabled () const
Returns whether this object is opened for read. More...
 Adesk::Boolean  | isReallyClosing () const
Checks whether the next close call will completely close this object return true if on the next call the object will be completely closed false otherwise.
Adesk::Boolean  | isTransactionResident () const
Gets the object transaction status. More...
Adesk::Boolean  | isUndoing () const
bool  | isUndoRecordingDisabled () const
Returns whether the undo recording for the object is enabled or not. More...
Adesk::Boolean  | isWriteEnabled () const
Returns whether this object is opened for write. More...
virtual AcDb::DuplicateRecordCloning  | mergeStyle () const
Returns the object's merge behavior during cloning. More...
virtual void  | modified (const AcDbObject *)
A handler function for persistent reactors. More...
virtual void  | modifiedGraphics (const AcDbEntity *)
A handler function for persistent reactors. More...
virtual void  | modifiedXData (const AcDbObject *)
A handler function for persistent reactors. More...
virtual void  | modifyUndone (const AcDbObject *)
A handler function for persistent reactors. More...
virtual void  | objectClosed (const AcDbObjectId)
A handler function for persistent reactors. More...
AcDbObjectId  | objectId () const
Returns object id. More...
virtual void  | openedForModify (const AcDbObject *)
A handler function for persistent reactors. More...
AcDbObjectId  | ownerId () const
Returns object id of the owner. More...
AcDbVoidPtrArray *  | reactors ()
Gets the object pointers to reactors. More...
const AcDbVoidPtrArray *  | reactors () const
Gets the object pointers to reactors. More...
virtual void  | reappended (const AcDbObject *)
A handler function for persistent reactors. More...
 virtual void  | recvPropagateModify (const AcDbObject *)
Not implemented yet.
Acad::ErrorStatus  | releaseExtensionDictionary ()
Removes the extension dictionary associated with this object. More...
virtual Acad::ErrorStatus  | removeField (AcDbObjectId)
Removes the Field specified by acFieldId from this object. More...
virtual Acad::ErrorStatus  | removeField (const ACHAR *)
Removes the Field specified by szKeyString from this object. More...
virtual Acad::ErrorStatus  | removeField (const ACHAR *, AcDbObjectId &)
Removes the Field specified by acPszKeyString from this object, and returns its ObjectId value. More...
virtual Acad::ErrorStatus  | removePersistentReactor (AcDbObjectId)
Removes a persistent reactor from this object reactor list. More...
Acad::ErrorStatus  | removeReactor (AcDbObjectReactor *) const
Removes a transient reactor to this object. More...
void  | setAcDbObjectIdsInFlux ()
Call this function to indicate that the object IDs of this object and its sub-objects (if any) are not yet valid. More...
Acad::ErrorStatus  | setBinaryData (const ACHAR *, Adesk::Int32, const char *)
Creates a copy of the binary data, divides it in up to 127 bytes binary chunks and
 sets them as resbufs in the resbuf chain of this object's extension dictionary xrecord entry given by entryName. More...
virtual Acad::ErrorStatus  | setField (const ACHAR *, AcDbField *, AcDbObjectId &)
Adds the pAcField field object to field dictionary of this AcDbObject object, using pKey as key. More...
void  | setHasSaveVersionOverride (bool)
This function can be called to specify that the object has a "save version override". More...
virtual Acad::ErrorStatus  | setOwnerId (AcDbObjectId)
Sets the ownerId data member of the object to be objId. More...
virtual Acad::ErrorStatus  | setXData (const resbuf *)
Sets/removes xData associated with this object. More...
virtual Acad::ErrorStatus  | subCancel ()
Possibility to veto a cancel operation from within custom entities. More...
virtual Acad::ErrorStatus  | subClose ()
virtual Acad::ErrorStatus  | subErase (Adesk::Boolean)
This hook is called during an AcDbObject::erase call, before any actual erase operation is performed. More...
 virtual Acad::ErrorStatus  | subHandOverTo (AcDbObject *)
virtual void  | subObjModified (const AcDbObject *, const AcDbObject *)
A handler function for persistent reactors. More...
 virtual Acad::ErrorStatus  | subOpen (AcDb::OpenMode)
virtual Acad::ErrorStatus  | subSwapIdWith (AcDbObjectId, Adesk::Boolean=Adesk::kFalse, Adesk::Boolean=Adesk::kFalse)
This hook is called during an AcDbObject::swapIdWith() call, before any actual swap operation is performed. More...
Acad::ErrorStatus  | swapIdWith (AcDbObjectId, Adesk::Boolean=Adesk::kFalse, Adesk::Boolean=Adesk::kFalse)
Swaps the object id's between the object identified by param swapId and this object. More...
virtual Acad::ErrorStatus  | swapReferences (const AcDbIdMapping &)
Not implemented yet. More...
virtual void  | unappended (const AcDbObject *)
A handler function for persistent reactors. More...
AcDbDwgFiler *  | undoFiler ()
Gets the undo filer for this object. More...
Acad::ErrorStatus  | upgradeFromNotify (Adesk::Boolean &)
Upgrades the open status of this object to AcDb::kForWrite, if this object is already open (either in AcDb::kForRead, AcDb::kForNotify or AcDb::kForWrite) More...
Acad::ErrorStatus  | upgradeOpen ()
Changes the objects open mode to AcDb::kForWrite and sends notifications. More...
virtual Acad::ErrorStatus  | wblockClone (AcRxObject *, AcDbObject *&, AcDbIdMapping &, Adesk::Boolean=Adesk::kTrue) const final
Clones this object, appends it to the owner pOwner and adds an AcDbIdPair record to the idMap. More...
virtual resbuf *  | xData (const ACHAR *=NULL) const
Returns the xData associated with this object. More...
Acad::ErrorStatus  | xDataTransformBy (const AcGeMatrix3d &)
Transforms the extended data according to parameter transformation matrix. More...
 virtual void  | xmitPropagateModify () const
Not implemented yet.
 virtual  | ~AcDbObject ()
Destructor.
 Public Member Functions inherited from AcGiDrawable
virtual bool  | bounds (AcDbExtents &) const
virtual DrawableType  | drawableType () const
 virtual AcGiDrawStream *  | drawStream () const
 AcGsNode *  | gsNode () const
virtual AcDbObjectId  | id () const =0
virtual Adesk::Boolean  | isPersistent () const =0
virtual Adesk::UInt32  | regenSupportFlags () const final
Returns whether and to which level this object supports MultiThreading. More...
 virtual Adesk::Boolean  | RolloverHit (Adesk::ULongPtr, Adesk::ULongPtr, Adesk::Boolean)
 virtual Adesk::UInt32  | setAttributes (AcGiDrawableTraits *) final
 virtual void  | setDrawStream (AcGiDrawStream *)
 void  | setGsNode (AcGsNode *)
 virtual void  | viewportDraw (AcGiViewportDraw *) final
 virtual Adesk::UInt32  | viewportDrawLogicalFlags (AcGiViewportDraw *) final
 virtual Adesk::Boolean  | worldDraw (AcGiWorldDraw *) final
 Public Member Functions inherited from AcRxObject
virtual AcRxObject *  | clone () const
Exported and implemented. More...
 virtual AcRx::Ordering  | comparedTo (const AcRxObject *) const
Exported and implemented.
virtual Acad::ErrorStatus  | copyFrom (const AcRxObject *)
Exported and implemented. More...
 virtual AcRxClass *  | isA () const
Exported and implemented.
virtual Adesk::Boolean  | isEqualTo (const AcRxObject *) const
Exported and implemented. More...
bool  | isKindOf (const AcRxClass *) const
Checks the object class. More...
AcRxObject *  | queryX (const AcRxClass *) const
returns the protocol extension object assigned to this class or a parent class. More...
AcRxObject *  | x (const AcRxClass *) const
returns the protocol extension object assigned to this class or a parent class. More...
 virtual  | ~AcRxObject ()
Destructor.
 Public Attributes
AcDbPointCloudEx
Constructs a default point cloud.
 Public Attributes inherited from AcDbEntity
AcDbEntity
This protected constructor sets the initial value for color to 257, and for the objectids for layer and linetype to AcDbObjectId::kNull. More...
 Additional Inherited Members
 Static Public Member Functions inherited from AcRxObject
 static AcRxObject *  | cast (const AcRxObject *)
 static AcRxClass *  | desc ()
Exported and implemented.
 Static Public Member Functions inherited from AcHeapOperators
 static void  | operator delete (void *)
_
 static void  | operator delete (void *, const char *, int)
 static void  | operator delete (void *, void *)
 static void  | operator delete[] (void *)
_
 static void  | operator delete[] (void *, const char *, int)
 static void *  | operator new (size_t)
_
 static void *  | operator new (size_t, const char *, int)
 static void *  | operator new (size_t, void *p)
 static void *  | operator new[] (size_t)
_
 static void *  | operator new[] (size_t, const char *, int)
 Protected Member Functions inherited from AcDbEntity
 virtual Acad::ErrorStatus  | subAddSubentPaths (const AcDbFullSubentPathArray &)
 virtual Adesk::Boolean  | subCloneMeForDragging ()
 virtual Acad::ErrorStatus  | subDeleteSubentPaths (const AcDbFullSubentPathArray &)
virtual Acad::ErrorStatus  | subExplode (AcDbVoidPtrArray &) const
 virtual Acad::ErrorStatus  | subGetCompoundObjectTransform (AcGeMatrix3d &) const
virtual Acad::ErrorStatus  | subGetGeomExtents (AcDbExtents &) const
virtual Acad::ErrorStatus  | subGetGripEntityUCS (const void *, AcGeVector3d &, AcGePoint3d &, AcGeVector3d &) const
virtual Acad::ErrorStatus  | subGetGripPoints (AcDbGripDataPtrArray &, const double, const int, const AcGeVector3d &, const int) const
virtual Acad::ErrorStatus  | subGetGripPoints (AcGePoint3dArray &, AcDbIntArray &, AcDbIntArray &) const
 virtual Acad::ErrorStatus  | subGetGripPointsAtSubentPath (const AcDbFullSubentPath &, AcDbGripDataPtrArray &, const double, const int, const AcGeVector3d &, const int) const
virtual Acad::ErrorStatus  | subGetGsMarkersAtSubentPath (const AcDbFullSubentPath &, AcArray< Adesk::GsMarker > &) const
virtual Acad::ErrorStatus  | subGetOsnapPoints (AcDb::OsnapMode, Adesk::GsMarker, const AcGePoint3d &, const AcGePoint3d &, const AcGeMatrix3d &, AcGePoint3dArray &, AcDbIntArray &) const
 virtual Acad::ErrorStatus  | subGetOsnapPoints (AcDb::OsnapMode, Adesk::GsMarker, const AcGePoint3d &, const AcGePoint3d &, const AcGeMatrix3d &, AcGePoint3dArray &, AcDbIntArray &, const AcGeMatrix3d &) const
virtual Acad::ErrorStatus  | subGetStretchPoints (AcGePoint3dArray &) const
 virtual Acad::ErrorStatus  | subGetSubentClassId (const AcDbFullSubentPath &, CLSID *) const
 virtual Acad::ErrorStatus  | subGetSubentPathGeomExtents (const AcDbFullSubentPath &, AcDbExtents &) const
virtual Acad::ErrorStatus  | subGetSubentPathsAtGsMarker (AcDb::SubentType, Adesk::GsMarker, const AcGePoint3d &, const AcGeMatrix3d &, int &, AcDbFullSubentPath *&, int=0, AcDbObjectId *=nullptr) const
virtual Acad::ErrorStatus  | subGetTransformedCopy (const AcGeMatrix3d &, AcDbEntity *&) const
virtual void  | subGripStatus (const AcDb::GripStat)
 virtual bool  | subHideMeForDragging () const
virtual Acad::ErrorStatus  | subHighlight (const AcDbFullSubentPath &=kNullSubent, const Adesk::Boolean=false) const
virtual Acad::ErrorStatus  | subIntersectWith (const AcDbEntity *, AcDb::Intersect, AcGePoint3dArray &, Adesk::GsMarker=0, Adesk::GsMarker=0) const
virtual Acad::ErrorStatus  | subIntersectWith (const AcDbEntity *, AcDb::Intersect, const AcGePlane &, AcGePoint3dArray &, Adesk::GsMarker=0, Adesk::GsMarker=0) const
virtual bool  | subIsContentSnappable () const
virtual void  | subList () const
virtual Acad::ErrorStatus  | subMoveGripPointsAt (const AcDbIntArray &, const AcGeVector3d &)
virtual Acad::ErrorStatus  | subMoveGripPointsAt (const AcDbVoidPtrArray &, const AcGeVector3d &, const int)
 virtual Acad::ErrorStatus  | subMoveGripPointsAtSubentPaths (const AcDbFullSubentPathArray &, const AcDbVoidPtrArray &, const AcGeVector3d &, const int)
virtual Acad::ErrorStatus  | subMoveStretchPointsAt (const AcDbIntArray &, const AcGeVector3d &)
virtual Adesk::UInt32  | subSetAttributes (AcGiDrawableTraits *)
Sets the values of this object's subentity traits and returns with the calling object's subentity traits. More...
virtual Acad::ErrorStatus  | subSetVisibility (AcDb::Visibility, Adesk::Boolean=true)
 virtual void  | subSubentGripStatus (const AcDb::GripStat, const AcDbFullSubentPath &)
virtual AcDbEntity *  | subSubentPtr (const AcDbFullSubentPath &) const
virtual Acad::ErrorStatus  | subTransformBy (const AcGeMatrix3d &)
 virtual Acad::ErrorStatus  | subTransformSubentPathsBy (const AcDbFullSubentPathArray &, const AcGeMatrix3d &)
virtual Acad::ErrorStatus  | subUnhighlight (const AcDbFullSubentPath &=kNullSubent, const Adesk::Boolean=false) const
virtual void  | subViewportDraw (AcGiViewportDraw *)
 virtual AcDb::Visibility  | subVisibility () const
virtual Adesk::Boolean  | subWorldDraw (AcGiWorldDraw *)
 Protected Member Functions inherited from AcDbObject
virtual Acad::ErrorStatus  | subDeepClone (AcDbObject *, AcDbObject *&, AcDbIdMapping &, Adesk::Boolean=true) const
virtual Acad::ErrorStatus  | subGetClassID (CLSID *) const
virtual Adesk::UInt32  | subSetAttributes (AcGiDrawableTraits *)
Sets the values of this object's subentity traits and returns with the calling object's subentity traits. More...
virtual void  | subViewportDraw (AcGiViewportDraw *)
virtual Adesk::UInt32  | subViewportDrawLogicalFlags (AcGiViewportDraw *)
virtual Acad::ErrorStatus  | subWblockClone (AcRxObject *, AcDbObject *&, AcDbIdMapping &, Adesk::Boolean=true) const
virtual Adesk::Boolean  | subWorldDraw (AcGiWorldDraw *)
 Protected Member Functions inherited from AcGiDrawable
virtual Adesk::UInt32  | subRegenSupportFlags () const
Returns whether and to which level this object supports MultiThreading. More...
virtual Adesk::UInt32  | subSetAttributes (AcGiDrawableTraits *)=0
virtual void  | subViewportDraw (AcGiViewportDraw *)=0
 virtual Adesk::UInt32  | subViewportDrawLogicalFlags (AcGiViewportDraw *)
virtual Adesk::Boolean  | subWorldDraw (AcGiWorldDraw *)=0
 Protected Member Functions inherited from AcRxObject
AcRxObject ()
Exported and implemented.
Member Function Documentation
◆ addCroppingBoundary()
 UX_EXPORT_FUNCTION void AcDbPointCloudEx::addCroppingBoundary  |  ( |  const AcDbPointCloudCrop &  |  crop | )
Adds a new point cloud cropping.
Parameters
[in] | crop | cropping to add
◆ clearCropping()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbPointCloudEx::clearCropping  |  ( |   | )
Removes all point cloud croppings.
Returns
Acad::eOk if successful
◆ elevationApplyToFixedRange()
 UX_EXPORT_FUNCTION bool AcDbPointCloudEx::elevationApplyToFixedRange  |  ( |   | ) |   const
Gets whether to apply a fixed elevation range.
Returns
current value
◆ elevationOutOfRangeBehavior()
 UX_EXPORT_FUNCTION AcDbPointCloudEx::DispOptionOutOfRange AcDbPointCloudEx::elevationOutOfRangeBehavior  |  ( |   | ) |   const
Gets the elevation out of range behavior.
Returns
behavior
◆ getActiveFileName()
 UX_EXPORT_FUNCTION bool AcDbPointCloudEx::getActiveFileName  |  ( |  AcString &  |  filename | ) |   const
Gets active filename of this point cloud.
Parameters
[out] | filename | filename
Returns
true if a file is found
◆ getColorSchemeForStylization()
 UX_EXPORT_FUNCTION AcString AcDbPointCloudEx::getColorSchemeForStylization  |  ( |  StylizationType  |  type | ) |   const
Gets color scheme for the specified stylization.
Parameters
[in] | type | stylization type
Returns
color scheme
◆ getCroppingCount()
 UX_EXPORT_FUNCTION int AcDbPointCloudEx::getCroppingCount  |  ( |   | ) |   const
Gets number of croppings on this point cloud.
Returns
cropping count
◆ getCroppingInvert()
 UX_EXPORT_FUNCTION bool AcDbPointCloudEx::getCroppingInvert  |  ( |   | ) |   const
Get whether cropping is inverted.
Returns
true if cropping is inverted
◆ getCurrentColorScheme()
 UX_EXPORT_FUNCTION AcString AcDbPointCloudEx::getCurrentColorScheme  |  ( |   | ) |   const
Gets current color scheme.
Returns
color scheme
◆ getDisplayedVisiblePointCount()
 UX_EXPORT_FUNCTION unsigned int AcDbPointCloudEx::getDisplayedVisiblePointCount  |  ( |   | ) |   const
Gets count of displayed visible points (NOT YET IMPLEMENTED).
Returns
number of visible points
◆ getLoadedVisiblePointCount()
 UX_EXPORT_FUNCTION unsigned int AcDbPointCloudEx::getLoadedVisiblePointCount  |  ( |   | ) |   const
Gets count of loaded visible points (NOT YET IMPLEMENTED).
Returns
number of visible points
◆ getNativeCloudExtent()
 UX_EXPORT_FUNCTION void AcDbPointCloudEx::getNativeCloudExtent  |  ( |  AcDbExtents &  |   | ) |   const
Gets current scale of this point cloud.
Returns
point cloud scale
◆ getPointCloudCropping()
 UX_EXPORT_FUNCTION AcDbPointCloudCrop * AcDbPointCloudEx::getPointCloudCropping  |  ( |  int  |  idx | )
Gets the specified point cloud cropping.
Parameters
[in] | idx | zero based crop index
Returns
cropping
◆ getPointCloudCroppingConst()
 UX_EXPORT_FUNCTION const AcDbPointCloudCrop * AcDbPointCloudEx::getPointCloudCroppingConst  |  ( |  int  |  idx | ) |   const
Gets the specified point cloud cropping.
Parameters
[in] | idx | zero based crop index
Returns
cropping
◆ getPointCloudName()
 UX_EXPORT_FUNCTION AcString AcDbPointCloudEx::getPointCloudName  |  ( |   | ) |   const
Gets current name of this point cloud.
Returns
point cloud name
◆ getPointDataByPointCount() [1/2]
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbPointCloudEx::getPointDataByPointCount  |  ( |  IAcDbPointCloudDataBuffer *&  |  data,
|  Adesk::UInt32  |  pointCount,
|  const AcStringArray &  |  scanIds,
|  IAcDbPointCloudSpatialFilter *  |  spatialFilter,
|  IAcDbPointCloudAttributeFilter *  |  attributeFilter,
|  Adesk::UInt32  |  dataTypes,
|  Adesk::UInt32  |  maxData
) |   |  const
Returns point cloud data by approximate point count.
Parameters
[out] | data | buffer filled with point data
[in] | pointCount | requested approximate number of points
[in] | spatialFilter | optional spatial filter
[in] | attributeFilter | optional attribute filter
[in] | dataTypes | DataType mask to filter returned types
[in] | maxData | maximum points to return
[in] | scanIds | limit processing to specified scan ids
Returns
Acad::eOk if successful
◆ getPointDataByPointCount() [2/2]
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbPointCloudEx::getPointDataByPointCount  |  ( |  IAcDbPointCloudDataBuffer *&  |  data,
|  Adesk::UInt32  |  pointCount,
|  IAcDbPointCloudSpatialFilter *  |  spatialFilter,
|  IAcDbPointCloudAttributeFilter *  |  attributeFilter,
|  Adesk::UInt32  |  dataTypes,
|  Adesk::UInt32  |  maxData
) |   |  const
Returns point cloud data by approximate point count.
Parameters
[out] | data | buffer filled with point data
[in] | pointCount | requested approximate number of points
[in] | scanIds | return points from specified scan ids
[in] | spatialFilter | optional spatial filter
[in] | attributeFilter | optional attribute filter
[in] | dataTypes | DataType mask to filter returned types
[in] | maxData | maximum points to return
Returns
Acad::eOk if successful
◆ getVisiblePointCount()
 UX_EXPORT_FUNCTION unsigned int AcDbPointCloudEx::getVisiblePointCount  |  ( |   | ) |   const
Gets count of visible points (NOT YET IMPLEMENTED).
Returns
number of visible points
◆ intensityOutOfRangeBehavior()
 UX_EXPORT_FUNCTION AcDbPointCloudEx::DispOptionOutOfRange AcDbPointCloudEx::intensityOutOfRangeBehavior  |  ( |   | ) |   const
Gets the intensity out of range behavior.
Returns
behavior
◆ location()
 UX_EXPORT_FUNCTION AcGePoint3d AcDbPointCloudEx::location  |  ( |   | ) |   const
Gets current scale of this point cloud.
Returns
point cloud scale
◆ locked()
 UX_EXPORT_FUNCTION bool AcDbPointCloudEx::locked  |  ( |   | ) |   const
Gets current locked state of this point cloud.
Returns
point cloud locked state
◆ maxElevation()
 UX_EXPORT_FUNCTION double AcDbPointCloudEx::maxElevation  |  ( |   | ) |   const
Gets the maximum elevation value.
Returns
value
◆ maxIntensity()
 UX_EXPORT_FUNCTION Adesk::Int32 AcDbPointCloudEx::maxIntensity  |  ( |   | ) |   const
Gets the maximum intensity value.
Returns
value
◆ minElevation()
 UX_EXPORT_FUNCTION double AcDbPointCloudEx::minElevation  |  ( |   | ) |   const
Gets the minimum elevation value.
Returns
value
◆ minIntensity()
 UX_EXPORT_FUNCTION Adesk::Int32 AcDbPointCloudEx::minIntensity  |  ( |   | ) |   const
Gets the minimum intensity value.
Returns
value
◆ pointCloudDefExId()
 UX_EXPORT_FUNCTION AcDbObjectId AcDbPointCloudEx::pointCloudDefExId  |  ( |   | ) |   const
Gets the point cloud definition for this point cloud.
Returns
point cloud definition
◆ reactorId()
 UX_EXPORT_FUNCTION AcDbObjectId AcDbPointCloudEx::reactorId  |  ( |   | ) |   const
Gets the reactor for this point cloud.
Returns
point cloud reactor
◆ removeLastCropping()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbPointCloudEx::removeLastCropping  |  ( |   | )
Removes the last point cloud cropping.
Returns
Acad::eOk if successful
◆ rotation()
 UX_EXPORT_FUNCTION double AcDbPointCloudEx::rotation  |  ( |   | ) |   const
Gets current rotation of this point cloud.
Returns
point cloud rotation
◆ scale()
 UX_EXPORT_FUNCTION double AcDbPointCloudEx::scale  |  ( |   | ) |   const
Gets current scale of this point cloud.
Returns
point cloud scale
◆ setActiveFileName()
 UX_EXPORT_FUNCTION bool AcDbPointCloudEx::setActiveFileName  |  ( |  const ACHAR *  |  filename | )
Sets the scale of this point cloud.
Parameters
[in] | value | point cloud scale
Returns
Acad::eOk if successful
◆ setColorSchemeForStylization()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbPointCloudEx::setColorSchemeForStylization  |  ( |  const AcString &  |  scheme,
|  StylizationType  |  type
)
Sets whether to show cropping.
Parameters
[in] | scheme | color scheme
[in] | type | stylization type
Returns
Acad::eOk if successful
◆ setCroppingInvert()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbPointCloudEx::setCroppingInvert  |  ( |  bool  |  invert | )
Sets whether point cloud cropping is inverted.
Parameters
[in] | invert | new value
Returns
Acad::eOk if successful
◆ setCurrentColorScheme()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbPointCloudEx::setCurrentColorScheme  |  ( |  const AcString &  |  scheme | )
Sets current color scheme.
Parameters
[in] | scheme | color scheme
Returns
Acad::eOk if successful
◆ setElevationApplyToFixedRange()
 UX_EXPORT_FUNCTION void AcDbPointCloudEx::setElevationApplyToFixedRange  |  ( |  bool  |  val | )
Sets whether to apply a fixed elevation range.
Parameters
[in] | val | new value
◆ setElevationOutOfRangeBehavior()
 UX_EXPORT_FUNCTION void AcDbPointCloudEx::setElevationOutOfRangeBehavior  |  ( |  DispOptionOutOfRange  |  behavior | )
Sets the elevation out of range behavior.
Parameters
[in] | behavior | new behavior
◆ setInCreatingCroppingMode()
 UX_EXPORT_FUNCTION void AcDbPointCloudEx::setInCreatingCroppingMode  |  ( |  bool  |  val | )
Sets or resets creating cropping mode.
Parameters
[in] | val | mode to set
◆ setIntensityOutOfRangeBehavior()
 UX_EXPORT_FUNCTION void AcDbPointCloudEx::setIntensityOutOfRangeBehavior  |  ( |  DispOptionOutOfRange  |  behavior | )
Sets the intensity out of range behavior.
Parameters
[in] | behavior | new behavior
◆ setLocation()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbPointCloudEx::setLocation  |  ( |  const AcGePoint3d &  |  location | )
Sets the location of this point cloud.
Parameters
[in] | location | point cloud location
Returns
Acad::eOk if successful
◆ setLocked()
 UX_EXPORT_FUNCTION void AcDbPointCloudEx::setLocked  |  ( |  bool  |  locked | )
Sets current locked state of this point cloud.
Parameters
[in] | locked | point cloud locked state
◆ setMinMaxElevation()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbPointCloudEx::setMinMaxElevation  |  ( |  double  |  min,
|  double  |  max
)
Sets the elevation value range.
Parameters
[in] | min | minimum elevation
[in] | max | maximum elevation
Returns
Acad::eOk if successful
◆ setMinMaxIntensity()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbPointCloudEx::setMinMaxIntensity  |  ( |  Adesk::Int32  |  min,
|  Adesk::Int32  |  max
)
Sets the intensity value range.
Parameters
[in] | min | minimum intensity
[in] | max | maximum intensity
Returns
Acad::eOk if successful
◆ setPointCloudDefExId()
 UX_EXPORT_FUNCTION void AcDbPointCloudEx::setPointCloudDefExId  |  ( |  const AcDbObjectId &  |  defId | )
Sets the point cloud definition for this point cloud.
Parameters
[in] | defId | point cloud definition
◆ setPointCloudName()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbPointCloudEx::setPointCloudName  |  ( |  const AcString &  |  name | )
Sets the name of this point cloud.
Parameters
[in] | value | point cloud name
Returns
Acad::eOk if successful
◆ setReactorId()
 UX_EXPORT_FUNCTION void AcDbPointCloudEx::setReactorId  |  ( |  const AcDbObjectId &  |  reactorId | )
Sets the reactor for this point cloud.
Parameters
[in] | reactorId | point cloud reactor
◆ setRotation()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbPointCloudEx::setRotation  |  ( |  double  |  rotation | )
Sets the rotation of this point cloud.
Parameters
[in] | rotation | point cloud rotation
Returns
Acad::eOk if successful
◆ setScale()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbPointCloudEx::setScale  |  ( |  double  |  value | )
Sets the scale of this point cloud.
Parameters
[in] | value | point cloud scale
Returns
Acad::eOk if successful
◆ setShowCropped()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbPointCloudEx::setShowCropped  |  ( |  bool  |  cropped | )
Sets whether to show cropping.
Parameters
[in] | cropped | new value
Returns
Acad::eOk if successful
◆ setShowElevationAsGradient()
 UX_EXPORT_FUNCTION void AcDbPointCloudEx::setShowElevationAsGradient  |  ( |  bool  |  val | )
Sets whether to show elevation as gradient.
Parameters
[in] | val | new value
◆ setShowIntensityAsGradient()
 UX_EXPORT_FUNCTION void AcDbPointCloudEx::setShowIntensityAsGradient  |  ( |  bool  |  val | )
Sets whether to show intensity as gradient.
Parameters
[in] | val | new value
◆ setStylizationType()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbPointCloudEx::setStylizationType  |  ( |  StylizationType  |  type | )
Sets stylization type.
Parameters
[in] | type | stylization type
Returns
Acad::eOk if successful
◆ showCropped()
 UX_EXPORT_FUNCTION bool AcDbPointCloudEx::showCropped  |  ( |   | ) |   const
Get whether the cropping is shown.
Returns
true if cropping is shown
◆ showElevationAsGradient()
 UX_EXPORT_FUNCTION bool AcDbPointCloudEx::showElevationAsGradient  |  ( |   | ) |   const
Gets whether to show elevation as gradient.
Returns
current value
◆ showIntensityAsGradient()
 UX_EXPORT_FUNCTION bool AcDbPointCloudEx::showIntensityAsGradient  |  ( |   | ) |   const
Gets whether to show intensity as gradient.
Returns
true if showing intensity
◆ stylizationType()
 UX_EXPORT_FUNCTION AcDbPointCloudEx::StylizationType AcDbPointCloudEx::stylizationType  |  ( |   | ) |   const
Gets current stylization type.
Returns
stylization type
◆ traverseAllPointData()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbPointCloudEx::traverseAllPointData  |  ( |  IAcDbPointCloudPointProcessor *  |  processor,
|  IAcDbPointCloudSpatialFilter *  |  spatialFilter,
|  Adesk::UInt32  |  dataTypes,
|  int  |  lod
) |   |  const
Calls processor for each traversed point.
Parameters
[in] | processor | processor instance to handle each point
[in] | spatialFilter | optional spatial filter
[in] | dataTypes | DataType mask to filter returned types
[in] | lod | limit points by level of detail
Returns
Acad::eOk if successful