Public Member Functions | List of all members
AcDbFaceRef Class Reference
_ More...
#include <AcDbFaceRef.h>
 Public Member Functions
AcDbFaceRef (const AcDbCompoundObjectId &, const AcDbSubentId &=kNullSubentId, class BODY *=NULL)
AcDbFaceRef (const AcDbFaceRef &)
 BODY *  | asmBody () const
virtual Acad::ErrorStatus  | copyFrom (const AcRxObject *)
virtual AcDbEntity *  | createEntity () const
virtual Acad::ErrorStatus  | evaluateAndCacheGeometry ()
virtual bool  | isEmpty () const
virtual bool  | isValid () const
 AcDbFaceRef &  | operator= (const AcDbFaceRef &)
virtual void  | reset ()
 Public Member Functions inherited from AcDbSubentRef
AcDbSubentRef (const AcDbCompoundObjectId &, const AcDbSubentId &=kNullSubentId)
virtual Acad::ErrorStatus  | copyFrom (const AcRxObject *)
Initializes this reference using a given object. More...
virtual AcDbEntity *  | createEntity () const
Creates an entity using this subent reference. More...
virtual const AcDbCompoundObjectId &  | entity () const
Returns an object ID of the compounded entity. More...
virtual Acad::ErrorStatus  | evaluateAndCacheGeometry ()
Evaluates and caches the geometry. More...
virtual bool  | isEmpty () const
Returns boolean value indicating if the AcDbSubentRef is empty. More...
virtual bool  | isValid () const
Returns boolean value indicating if the AcDbSubentRef is valid. More...
AcDbSubentRef &  | operator= (const AcDbSubentRef &)
Creates AcDbSubentRef using other AcDbSubentRef. More...
virtual void  | reset ()
Resets this subent reference. More...
virtual AcDbSubentId  | subentId () const
Returns an subent ID. More...
virtual AcDbEntity *  | createEntity () const =0
virtual Acad::ErrorStatus  | evaluateAndCacheGeometry ()=0
virtual bool  | isEmpty () const =0
virtual bool  | isValid () const =0
virtual void  | reset ()=0
 Public Member Functions inherited from AcRxObject
virtual AcRxObject *  | clone () const
Exported and implemented. More...
 virtual AcRx::Ordering  | comparedTo (const AcRxObject *) const
Exported and implemented.
virtual Acad::ErrorStatus  | copyFrom (const AcRxObject *)
Exported and implemented. More...
 virtual AcRxClass *  | isA () const
Exported and implemented.
virtual Adesk::Boolean  | isEqualTo (const AcRxObject *) const
Exported and implemented. More...
bool  | isKindOf (const AcRxClass *) const
Checks the object class. More...
AcRxObject *  | queryX (const AcRxClass *) const
returns the protocol extension object assigned to this class or a parent class. More...
AcRxObject *  | x (const AcRxClass *) const
returns the protocol extension object assigned to this class or a parent class. More...
 virtual  | ~AcRxObject ()
Destructor.
 Additional Inherited Members
 Static Public Member Functions inherited from AcRxObject
 static AcRxObject *  | cast (const AcRxObject *)
 static AcRxClass *  | desc ()
Exported and implemented.
 Public Attributes inherited from AcDbSubentRef
AcDbSubentRef
Default constructor. More...
 Protected Member Functions inherited from AcDbSubentRef
void  | setEntity (const AcDbCompoundObjectId &)
Sets the compounded entity using an object ID. More...
void  | setFromSubentPath (const AcDbFullSubentPath &)
Sets the AcDbCompoundObjectId and AcDbSubentId parameters of this entity from AcDbFullSubentPath. More...
void  | setSubent (const AcDbSubentId &)
Sets an subent ID. More...
 Protected Member Functions inherited from AcRxObject
AcRxObject ()
Exported and implemented.
Detailed Description
_
Member Function Documentation
◆ copyFrom()
 virtual Acad::ErrorStatus AcDbFaceRef::copyFrom  |  ( |  const AcRxObject *  |   | )
virtual
Reimplemented from AcDbSubentRef.
◆ createEntity()
 virtual AcDbEntity * AcDbFaceRef::createEntity  |  ( |   | ) |   const
virtual
Reimplemented from AcDbSubentRef.
◆ evaluateAndCacheGeometry()
 virtual Acad::ErrorStatus AcDbFaceRef::evaluateAndCacheGeometry  |  ( |   | )
virtual
Reimplemented from AcDbSubentRef.
◆ isEmpty()
 virtual bool AcDbFaceRef::isEmpty  |  ( |   | ) |   const
virtual
Reimplemented from AcDbSubentRef.
◆ isValid()
 virtual bool AcDbFaceRef::isValid  |  ( |   | ) |   const
virtual
Reimplemented from AcDbSubentRef.
◆ reset()
 virtual void AcDbFaceRef::reset  |  ( |   | )
virtual
Reimplemented from AcDbSubentRef.