Public Types | Public Member Functions | Public Attributes | List of all members
AcDbSectionSettings Class Reference
_ More...
#include <AcDbSectionSettings.h>
 Public Types
enum  | Generation {
 kSourceAllObjects = 1 , kSourceSelectedObjects = 2 , kDestinationNewBlock = 16 , kDestinationReplaceBlock = 32 ,
 kDestinationFile = 64
 }
enum  | Geometry {
 kIntersectionBoundary = 1 , kIntersectionFill = 2 , kBackgroundGeometry = 4 , kForegroundGeometry = 8 ,
 kCurveTangencyLines = 16
 }
enum  | SectionType { kLiveSection = 1 , k2dSection = 2 , k3dSection = 4 }
 Public Types inherited from AcGiDrawable
enum  | DrawableType {
 kGeometry = 0 , kDistantLight , kPointLight , kSpotLight ,
 kAmbientLight , kSolidBackground , kGradientBackground , kImageBackground ,
 kGroundPlaneBackground , kViewport
 }
enum  | SetAttributesFlags {
 kDrawableNone = 0 , kDrawableIsAnEntity = 1 , kDrawableUsesNesting = 2 , kDrawableIsCompoundObject = 4 ,
 kDrawableViewIndependentViewportDraw = 8 , kDrawableIsInvisible = 16 , kDrawableHasAttributes = 32 , kDrawableRegenTypeDependentGeometry = 64 ,
 kDrawableIsDimension = 133 , kDrawableRegenDraw = 256 , kDrawableStandardDisplaySingleLOD = 512 , kDrawableShadedDisplaySingleLOD = 1024 ,
 kDrawableViewDependentViewportDraw = 2048 , kDrawableBlockDependentViewportDraw = 4096 , kDrawableIsExternalReference = 8192 , kDrawableNotPlottable = 16384 ,
 kDrawableNotAllowLCS = 32768 , kDrawableMergeControlOff = 65536 , kThreadedWorldDrawViewportDraw = 131072
 }
 Public Member Functions
AcCmColor  | color (SectionType, Geometry) const
Returns the color for specified geometry type for the specified section type. More...
SectionType  | currentSectionType () const
Returns the current section type. More...
AcDbObjectId  | destinationBlock (SectionType) const
Returns the ObjectId of the BlockTableRecord to be replaced, for the specified section type. More...
const ACHAR *  | destinationFile (SectionType) const
Returns the filename for sectioning output, for the specified section type. More...
bool  | divisionLines (SectionType, Geometry) const
Returns the division lines flag for specified geometry type for the specified section type. More...
int  | edgeTransparency (SectionType, Geometry) const
Returns the edge transparency for specified geometry type for the specified section type. More...
int  | faceTransparency (SectionType, Geometry) const
Returns the edge transparency for specified geometry type for the specified section type. More...
Generation  | generationOptions (SectionType) const
Returns the section generation options flag. More...
Acad::ErrorStatus  | getHatchPattern (SectionType, Geometry, AcDbHatch::HatchPatternType &, const ACHAR *&) const
Returns the hatch pattern for specified geometry type for the specified section type. More...
 Acad::ErrorStatus  | getSourceObjects (SectionType, AcDbObjectIdArray &) const
double  | hatchAngle (SectionType, Geometry) const
Returns the hatch angle for specified geometry type for the specified section type. More...
double  | hatchScale (SectionType, Geometry) const
Returns the hatch scale for specified geometry type for the specified section type. More...
double  | hatchSpacing (SectionType, Geometry) const
Returns the hatch spacing factor for specified geometry type for the specified section type. More...
bool  | hatchVisibility (SectionType, Geometry) const
Returns the hatch visibility flag for specified geometry type for the specified section type. More...
bool  | hiddenLine (SectionType, Geometry) const
Returns the hidden lines flag for specified geometry type for the specified section type. More...
const ACHAR *  | layer (SectionType, Geometry) const
Returns the layer for specified geometry type for the specified section type. More...
const ACHAR *  | linetype (SectionType, Geometry) const
Returns the linetype for specified geometry type for the specified section type. More...
double  | linetypeScale (SectionType, Geometry) const
Returns the linetype scale for specified geometry type for the specified section type. More...
AcDb::LineWeight  | lineWeight (SectionType, Geometry) const
Returns the lineweight for specified geometry type for the specified section type. More...
const ACHAR *  | plotStyleName (SectionType, Geometry) const
Returns the plotstyle name for specified geometry type for the specified section type. More...
Acad::ErrorStatus  | reset ()
Resets the section settings for all section types. More...
Acad::ErrorStatus  | reset (SectionType)
Resets the section settings for specified section type. More...
Acad::ErrorStatus  | setColor (SectionType, Geometry, const AcCmColor &)
Sets the color for specified geometry type for the specified section type. More...
Acad::ErrorStatus  | setCurrentSectionType (SectionType)
Sets the current section type. More...
Acad::ErrorStatus  | setDestinationBlock (SectionType, const AcDbObjectId &)
Sets the ObjectId of the BlockTableRecord to be replaced, for the specified section type. More...
Acad::ErrorStatus  | setDestinationFile (SectionType, const ACHAR *)
Sets the ObjectId of the BlockTableRecord to be replaced, for the specified section type. More...
Acad::ErrorStatus  | setDivisionLines (SectionType, Geometry, bool)
Sets the division lines flag for specified geometry type for the specified section type. More...
Acad::ErrorStatus  | setEdgeTransparency (SectionType, Geometry, int)
Sets the edge transparency for specified geometry type for the specified section type. More...
Acad::ErrorStatus  | setFaceTransparency (SectionType, Geometry, int)
Sets the face transparency for specified geometry type for the specified section type. More...
Acad::ErrorStatus  | setGenerationOptions (SectionType, Generation)
The generation option flag is implemented by this function. More...
Acad::ErrorStatus  | setHatchAngle (SectionType, Geometry, double)
Sets the hatch angle for specified geometry type for the specified section type. More...
Acad::ErrorStatus  | setHatchPattern (SectionType, Geometry, AcDbHatch::HatchPatternType, const ACHAR *)
Sets the hatch pattern for specified geometry type for the specified section type. More...
Acad::ErrorStatus  | setHatchScale (SectionType, Geometry, double)
Sets the hatch scale for specified geometry type for the specified section type. More...
Acad::ErrorStatus  | setHatchSpacing (SectionType, Geometry, double)
Sets the hatch spacing factor for specified geometry type for the specified section type. More...
Acad::ErrorStatus  | setHatchVisibility (SectionType, Geometry, bool)
Sets the hatch visibility flag for specified geometry type for the specified section type. More...
Acad::ErrorStatus  | setHiddenLine (SectionType, Geometry, bool)
Sets the hidden lines flag for specified geometry type for the specified section type. More...
Acad::ErrorStatus  | setLayer (SectionType, Geometry, const ACHAR *)
Sets the layer for specified geometry type for the specified section type. More...
Acad::ErrorStatus  | setLinetype (SectionType, Geometry, const ACHAR *)
Sets the linetype for specified geometry type for the specified section type. More...
Acad::ErrorStatus  | setLinetypeScale (SectionType, Geometry, double)
Sets the linetype scale for specified geometry type for the specified section type. More...
Acad::ErrorStatus  | setLineWeight (SectionType, Geometry, AcDb::LineWeight)
Sets the lineweight for specified geometry type for the specified section type. More...
Acad::ErrorStatus  | setPlotStyleName (SectionType, Geometry, const ACHAR *)
Sets the plotstyle name for specified geometry type for the specified section type. More...
Acad::ErrorStatus  | setSourceObjects (SectionType, const AcDbObjectIdArray &)
Sets the source entity set for the specified section type. More...
Acad::ErrorStatus  | setVisibility (SectionType, Geometry, bool)
Sets the visibility for specified geometry type for the specified section type. More...
bool  | visibility (SectionType, Geometry) const
Returns the visibility for specified geometry type for the specified section type. More...
~AcDbSectionSettings ()
Destructor.
 Public Member Functions inherited from AcDbObject
virtual Acad::ErrorStatus  | addPersistentReactor (AcDbObjectId)
Adds a persistent reactor to this object reactor list. More...
Acad::ErrorStatus  | addReactor (AcDbObjectReactor *) const
Adds a transient reactor to this object. More...
virtual Acad::ErrorStatus  | applyPartialUndo (AcDbDwgFiler *, AcRxClass *)
This function is called during Undo operations on objects, that use the 'Partial Undo meachanism'; this is, this object is opened with assertWriteEnabled(Adesk::kFalse) to indicate that custom Undo filing is used rather than the default Undo filing. More...
 void  | assertNotifyEnabled () const
 void  | assertReadEnabled () const
 void  | assertWriteEnabled (Adesk::Boolean=Adesk::kTrue, Adesk::Boolean=Adesk::kTrue)
virtual Acad::ErrorStatus  | audit (AcDbAuditInfo *)
Performs the audit operation for this object. More...
Acad::ErrorStatus  | cancel ()
Reverts all changes since the object had been opened and closes the object. More...
virtual void  | cancelled (const AcDbObject *)
A handler function for persistent reactors. More...
virtual AcRxObject *  | clone () const
Creates a shallow clone of this object. More...
Acad::ErrorStatus  | close ()
Closes the object. More...
Acad::ErrorStatus  | closeAndPage (Adesk::Boolean=Adesk::kTrue)
Closes the object. More...
virtual Acad::ErrorStatus  | composeForLoad (AcDb::OdaSaveType, AcDb::AcDbDwgVersion)
This function is intended for future MT file loading support. More...
virtual void  | copied (const AcDbObject *, const AcDbObject *)
A handler function for persistent reactors. More...
virtual Acad::ErrorStatus  | copyFrom (const AcRxObject *)
Copies the pSrc object information in this object. More...
Acad::ErrorStatus  | createExtensionDictionary ()
Creates a dictionary as extension dictionary for this object. More...
AcDbDatabase *  | database () const
Returns the database that contains this object. More...
virtual Acad::ErrorStatus  | decomposeForSave (AcDb::AcDbDwgVersion, AcDbObject *&, AcDbObjectId &, Adesk::Boolean &)
This function is called during dwg and dxf output, to allow a custom object to decompose itself, due to provided dwg/dxf target file version. More...
virtual Acad::ErrorStatus  | deepClone (AcDbObject *, AcDbObject *&, AcDbIdMapping &, Adesk::Boolean=Adesk::kTrue) const final
Clones this object, appends it to the owner pOwner and adds an AcDbIdPair record to the idMap. More...
void  | disableUndoRecording (Adesk::Boolean)
Disables or enables the undo recording for the object. More...
Acad::ErrorStatus  | downgradeOpen ()
Sets the open mode for an object opened for write to be opened for read. More...
Acad::ErrorStatus  | downgradeToNotify (Adesk::Boolean)
Sets the open mode for an object opened for write to be opened for notify. More...
virtual AcGiDrawable *  | drawable ()
Retrieves the AcGiDrawable instance of this object. More...
Acad::ErrorStatus  | dwgIn (AcDbDwgFiler *)
Calls the object's dwgInFields function, and reads any XData if present. More...
virtual Acad::ErrorStatus  | dwgInFields (AcDbDwgFiler *)
Reads the object from the DWG filer. More...
Acad::ErrorStatus  | dwgOut (AcDbDwgFiler *) const
Calls the object's dwgOutFields function, and writes any XData if present. More...
virtual Acad::ErrorStatus  | dwgOutFields (AcDbDwgFiler *) const
Writes the object to the DWG filer. More...
Acad::ErrorStatus  | dxfIn (AcDbDxfFiler *)
Calls the object's dxfInFields function, and reads any XData if present. More...
virtual Acad::ErrorStatus  | dxfInFields (AcDbDxfFiler *)
Reads the object from the DXF filer. More...
Acad::ErrorStatus  | dxfOut (AcDbDxfFiler *, Adesk::Boolean, Adesk::uchar *) const
Calls the object's dxfOutFields function, and writes any XData if present. More...
virtual Acad::ErrorStatus  | dxfOutFields (AcDbDxfFiler *) const
Writes the object to the DXF filer. More...
Acad::ErrorStatus  | erase (Adesk::Boolean=Adesk::kTrue)
Sets the bit that indicates that the object is erased. More...
virtual void  | erased (const AcDbObject *, Adesk::Boolean)
A handler function for persistent reactors. More...
AcDbObjectId  | extensionDictionary () const
Returns the object id of the extension dictionary for this object. More...
void  | getAcDbHandle (AcDbHandle &) const
Returns handle of this object. More...
Acad::ErrorStatus  | getBinaryData (const ACHAR *, Adesk::Int32 &, char *&) const
Creates a copy of the binary data stored as chunks of maximum 127 bytes in the resbuf chain of this object's extension dictionary xrecord entry given by entryName. More...
int  | getBrxOpenCount () const
This function returns the number of open BRX instances for this object. More...
int  | getBrxOpenState () const
This function returns the BRX object open state flags as bitfields, for diagnostic purpose. More...
virtual Acad::ErrorStatus  | getClassID (CLSID *) const final
Gets the COM wrapper Class ID for this entity. More...
int  | getCustomObjectState () const
This function returns the custom object status : 1=isCustomObject 2=DifferentialUndoDisabled. More...
Acad::ErrorStatus  | getField (const ACHAR *, AcDbField *&, AcDb::OpenMode) const
Retrieves the specified Field from this object, and opens it in mode. More...
Acad::ErrorStatus  | getField (const ACHAR *, AcDbObjectId &) const
Gets the pszPropName field object from field dictionary of this AcDbObject object, using pszPropName as key. More...
AcDbObjectId  | getFieldDictionary () const
Returns the Field dictionary associated with this object,. More...
Acad::ErrorStatus  | getFieldDictionary (AcDbDictionary *&, AcDb::OpenMode) const
Gets and opens the field dictionary for this. More...
Acad::ErrorStatus  | getObjectBirthVersion (AcDb::AcDbDwgVersion &, AcDb::MaintenanceReleaseVersion &)
This function is currently not supported by the CAD engine, always returns Acad::eOk, and 'kDHL_CURRENT' + 'kMReleaseCurrent' results. More...
virtual Acad::ErrorStatus  | getObjectSaveVersion (const AcDbDwgFiler *, AcDb::AcDbDwgVersion &, AcDb::MaintenanceReleaseVersion &)
Returns the DWG version for saving the object. More...
virtual Acad::ErrorStatus  | getObjectSaveVersion (const AcDbDxfFiler *, AcDb::AcDbDwgVersion &, AcDb::MaintenanceReleaseVersion &)
Returns the DWG version for saving the object. More...
int  | getOdaOpenCount () const
This function returns the number of open ODA instances for this object. More...
int  | getOdaOpenState () const
This function returns the ODA object open state flags as bitfields, for diagnostic purpose. More...
virtual void  | goodbye (const AcDbObject *)
A handler function for persistent reactors. More...
Acad::ErrorStatus  | handOverTo (AcDbObject *, Adesk::Boolean=Adesk::kTrue, Adesk::Boolean=Adesk::kTrue)
Hands over objects identity to another object. More...
bool  | hasFields () const
Return true if this object has single or multiple fields associated with him. More...
bool  | hasPersistentReactor (AcDbObjectId) const
Checks the input objectId in this object reactor list. More...
bool  | hasSaveVersionOverride ()
This function indicates whether this object overrides the filer's save version. More...
virtual AcDbObjectId  | id () const
Returns the database id of this object. More...
Adesk::Boolean  | isAcDbObjectIdsInFlux () const
Checks whether a deep clone operation was completed. More...
Adesk::Boolean  | isAProxy () const
Adesk::Boolean  | isCancelling () const
Adesk::Boolean  | isErased () const
Returns whether this object is erased. More...
Adesk::Boolean  | isEraseStatusToggled () const
Checks whether the object erase status has been toggled. More...
Adesk::Boolean  | isModified () const
Returns whether this object's assertWriteEnabled() has been called since it was opened. More...
Adesk::Boolean  | isModifiedGraphics () const
Checks whether this object graphics will be updated when the object is closed. More...
Adesk::Boolean  | isModifiedXData () const
Checks whether this object's xData was modified. More...
Adesk::Boolean  | isNewObject () const
Returns true if and only if this object has not been closed since it was created. More...
Adesk::Boolean  | isNotifyEnabled () const
Returns whether this object is opened for notify. More...
Adesk::Boolean  | isNotifying () const
virtual Adesk::Boolean  | isPersistent () const
Returns the 'persistent' status of a database object. More...
Adesk::Boolean  | isReadEnabled () const
Returns whether this object is opened for read. More...
 Adesk::Boolean  | isReallyClosing () const
Checks whether the next close call will completely close this object return true if on the next call the object will be completely closed false otherwise.
Adesk::Boolean  | isTransactionResident () const
Gets the object transaction status. More...
Adesk::Boolean  | isUndoing () const
bool  | isUndoRecordingDisabled () const
Returns whether the undo recording for the object is enabled or not. More...
Adesk::Boolean  | isWriteEnabled () const
Returns whether this object is opened for write. More...
virtual AcDb::DuplicateRecordCloning  | mergeStyle () const
Returns the object's merge behavior during cloning. More...
virtual void  | modified (const AcDbObject *)
A handler function for persistent reactors. More...
virtual void  | modifiedGraphics (const AcDbEntity *)
A handler function for persistent reactors. More...
virtual void  | modifiedXData (const AcDbObject *)
A handler function for persistent reactors. More...
virtual void  | modifyUndone (const AcDbObject *)
A handler function for persistent reactors. More...
virtual void  | objectClosed (const AcDbObjectId)
A handler function for persistent reactors. More...
AcDbObjectId  | objectId () const
Returns object id. More...
virtual void  | openedForModify (const AcDbObject *)
A handler function for persistent reactors. More...
AcDbObjectId  | ownerId () const
Returns object id of the owner. More...
AcDbVoidPtrArray *  | reactors ()
Gets the object pointers to reactors. More...
const AcDbVoidPtrArray *  | reactors () const
Gets the object pointers to reactors. More...
virtual void  | reappended (const AcDbObject *)
A handler function for persistent reactors. More...
 virtual void  | recvPropagateModify (const AcDbObject *)
Not implemented yet.
Acad::ErrorStatus  | releaseExtensionDictionary ()
Removes the extension dictionary associated with this object. More...
virtual Acad::ErrorStatus  | removeField (AcDbObjectId)
Removes the Field specified by acFieldId from this object. More...
virtual Acad::ErrorStatus  | removeField (const ACHAR *)
Removes the Field specified by szKeyString from this object. More...
virtual Acad::ErrorStatus  | removeField (const ACHAR *, AcDbObjectId &)
Removes the Field specified by acPszKeyString from this object, and returns its ObjectId value. More...
virtual Acad::ErrorStatus  | removePersistentReactor (AcDbObjectId)
Removes a persistent reactor from this object reactor list. More...
Acad::ErrorStatus  | removeReactor (AcDbObjectReactor *) const
Removes a transient reactor to this object. More...
void  | setAcDbObjectIdsInFlux ()
Call this function to indicate that the object IDs of this object and its sub-objects (if any) are not yet valid. More...
Acad::ErrorStatus  | setBinaryData (const ACHAR *, Adesk::Int32, const char *)
Creates a copy of the binary data, divides it in up to 127 bytes binary chunks and
 sets them as resbufs in the resbuf chain of this object's extension dictionary xrecord entry given by entryName. More...
virtual Acad::ErrorStatus  | setField (const ACHAR *, AcDbField *, AcDbObjectId &)
Adds the pAcField field object to field dictionary of this AcDbObject object, using pKey as key. More...
void  | setHasSaveVersionOverride (bool)
This function can be called to specify that the object has a "save version override". More...
virtual Acad::ErrorStatus  | setOwnerId (AcDbObjectId)
Sets the ownerId data member of the object to be objId. More...
virtual Acad::ErrorStatus  | setXData (const resbuf *)
Sets/removes xData associated with this object. More...
virtual Acad::ErrorStatus  | subCancel ()
Possibility to veto a cancel operation from within custom entities. More...
virtual Acad::ErrorStatus  | subClose ()
virtual Acad::ErrorStatus  | subErase (Adesk::Boolean)
This hook is called during an AcDbObject::erase call, before any actual erase operation is performed. More...
 virtual Acad::ErrorStatus  | subHandOverTo (AcDbObject *)
virtual void  | subObjModified (const AcDbObject *, const AcDbObject *)
A handler function for persistent reactors. More...
 virtual Acad::ErrorStatus  | subOpen (AcDb::OpenMode)
virtual Acad::ErrorStatus  | subSwapIdWith (AcDbObjectId, Adesk::Boolean=Adesk::kFalse, Adesk::Boolean=Adesk::kFalse)
This hook is called during an AcDbObject::swapIdWith() call, before any actual swap operation is performed. More...
Acad::ErrorStatus  | swapIdWith (AcDbObjectId, Adesk::Boolean=Adesk::kFalse, Adesk::Boolean=Adesk::kFalse)
Swaps the object id's between the object identified by param swapId and this object. More...
virtual Acad::ErrorStatus  | swapReferences (const AcDbIdMapping &)
Not implemented yet. More...
virtual void  | unappended (const AcDbObject *)
A handler function for persistent reactors. More...
AcDbDwgFiler *  | undoFiler ()
Gets the undo filer for this object. More...
Acad::ErrorStatus  | upgradeFromNotify (Adesk::Boolean &)
Upgrades the open status of this object to AcDb::kForWrite, if this object is already open (either in AcDb::kForRead, AcDb::kForNotify or AcDb::kForWrite) More...
Acad::ErrorStatus  | upgradeOpen ()
Changes the objects open mode to AcDb::kForWrite and sends notifications. More...
virtual Acad::ErrorStatus  | wblockClone (AcRxObject *, AcDbObject *&, AcDbIdMapping &, Adesk::Boolean=Adesk::kTrue) const final
Clones this object, appends it to the owner pOwner and adds an AcDbIdPair record to the idMap. More...
virtual resbuf *  | xData (const ACHAR *=NULL) const
Returns the xData associated with this object. More...
Acad::ErrorStatus  | xDataTransformBy (const AcGeMatrix3d &)
Transforms the extended data according to parameter transformation matrix. More...
 virtual void  | xmitPropagateModify () const
Not implemented yet.
 virtual  | ~AcDbObject ()
Destructor.
 Public Member Functions inherited from AcGiDrawable
virtual bool  | bounds (AcDbExtents &) const
virtual DrawableType  | drawableType () const
 virtual AcGiDrawStream *  | drawStream () const
 AcGsNode *  | gsNode () const
virtual AcDbObjectId  | id () const =0
virtual Adesk::Boolean  | isPersistent () const =0
virtual Adesk::UInt32  | regenSupportFlags () const final
Returns whether and to which level this object supports MultiThreading. More...
 virtual Adesk::Boolean  | RolloverHit (Adesk::ULongPtr, Adesk::ULongPtr, Adesk::Boolean)
 virtual Adesk::UInt32  | setAttributes (AcGiDrawableTraits *) final
 virtual void  | setDrawStream (AcGiDrawStream *)
 void  | setGsNode (AcGsNode *)
 virtual void  | viewportDraw (AcGiViewportDraw *) final
 virtual Adesk::UInt32  | viewportDrawLogicalFlags (AcGiViewportDraw *) final
 virtual Adesk::Boolean  | worldDraw (AcGiWorldDraw *) final
 Public Member Functions inherited from AcRxObject
virtual AcRxObject *  | clone () const
Exported and implemented. More...
 virtual AcRx::Ordering  | comparedTo (const AcRxObject *) const
Exported and implemented.
virtual Acad::ErrorStatus  | copyFrom (const AcRxObject *)
Exported and implemented. More...
 virtual AcRxClass *  | isA () const
Exported and implemented.
virtual Adesk::Boolean  | isEqualTo (const AcRxObject *) const
Exported and implemented. More...
bool  | isKindOf (const AcRxClass *) const
Checks the object class. More...
AcRxObject *  | queryX (const AcRxClass *) const
returns the protocol extension object assigned to this class or a parent class. More...
AcRxObject *  | x (const AcRxClass *) const
returns the protocol extension object assigned to this class or a parent class. More...
 virtual  | ~AcRxObject ()
Destructor.
 Public Attributes
AcDbSectionSettings
Default constructor.
 Additional Inherited Members
 Static Public Member Functions inherited from AcRxObject
 static AcRxObject *  | cast (const AcRxObject *)
 static AcRxClass *  | desc ()
Exported and implemented.
 Static Public Member Functions inherited from AcHeapOperators
 static void  | operator delete (void *)
_
 static void  | operator delete (void *, const char *, int)
 static void  | operator delete (void *, void *)
 static void  | operator delete[] (void *)
_
 static void  | operator delete[] (void *, const char *, int)
 static void *  | operator new (size_t)
_
 static void *  | operator new (size_t, const char *, int)
 static void *  | operator new (size_t, void *p)
 static void *  | operator new[] (size_t)
_
 static void *  | operator new[] (size_t, const char *, int)
 Protected Member Functions inherited from AcDbObject
virtual Acad::ErrorStatus  | subDeepClone (AcDbObject *, AcDbObject *&, AcDbIdMapping &, Adesk::Boolean=true) const
virtual Acad::ErrorStatus  | subGetClassID (CLSID *) const
virtual Adesk::UInt32  | subSetAttributes (AcGiDrawableTraits *)
Sets the values of this object's subentity traits and returns with the calling object's subentity traits. More...
virtual void  | subViewportDraw (AcGiViewportDraw *)
virtual Adesk::UInt32  | subViewportDrawLogicalFlags (AcGiViewportDraw *)
virtual Acad::ErrorStatus  | subWblockClone (AcRxObject *, AcDbObject *&, AcDbIdMapping &, Adesk::Boolean=true) const
virtual Adesk::Boolean  | subWorldDraw (AcGiWorldDraw *)
 Protected Member Functions inherited from AcGiDrawable
virtual Adesk::UInt32  | subRegenSupportFlags () const
Returns whether and to which level this object supports MultiThreading. More...
virtual Adesk::UInt32  | subSetAttributes (AcGiDrawableTraits *)=0
virtual void  | subViewportDraw (AcGiViewportDraw *)=0
 virtual Adesk::UInt32  | subViewportDrawLogicalFlags (AcGiViewportDraw *)
virtual Adesk::Boolean  | subWorldDraw (AcGiWorldDraw *)=0
 Protected Member Functions inherited from AcRxObject
AcRxObject ()
Exported and implemented.
Detailed Description
_
Member Function Documentation
◆ color()
 UX_EXPORT_FUNCTION AcCmColor AcDbSectionSettings::color  |  ( |  AcDbSectionSettings::SectionType  |  sectType,
|  AcDbSectionSettings::Geometry  |  geomType
) |   |  const
Returns the color for specified geometry type for the specified section type.
Parameters
[in] | sectType | - affected section type
[in] | geomType | - affected geometry object
Returns
AcCmColor value
◆ currentSectionType()
 UX_EXPORT_FUNCTION AcDbSectionSettings::SectionType AcDbSectionSettings::currentSectionType  |  ( |   | ) |   const
Returns the current section type.
Returns
current section type
◆ destinationBlock()
 UX_EXPORT_FUNCTION AcDbObjectId AcDbSectionSettings::destinationBlock  |  ( |  AcDbSectionSettings::SectionType  |  sectType | ) |   const
Returns the ObjectId of the BlockTableRecord to be replaced, for the specified section type.
Parameters
[in] | sectType | - affected section type
Returns
AcDbObjectId id of the BlockTableRecord to be replaced
◆ destinationFile()
 UX_EXPORT_FUNCTION const ACHAR * AcDbSectionSettings::destinationFile  |  ( |  AcDbSectionSettings::SectionType  |  sectType | ) |   const
Returns the filename for sectioning output, for the specified section type.
Parameters
[in] | sectType | - affected section type
Returns
const ACHAR* filename to be created with kDestinationFile
◆ divisionLines()
 UX_EXPORT_FUNCTION bool AcDbSectionSettings::divisionLines  |  ( |  AcDbSectionSettings::SectionType  |  sectType,
|  AcDbSectionSettings::Geometry  |  geomType
) |   |  const
Returns the division lines flag for specified geometry type for the specified section type.
Parameters
[in] | sectType | - affected section type
[in] | geomType | - affected geometry object
Returns
true/false
◆ edgeTransparency()
 UX_EXPORT_FUNCTION int AcDbSectionSettings::edgeTransparency  |  ( |  AcDbSectionSettings::SectionType  |  sectType,
|  AcDbSectionSettings::Geometry  |  geomType
) |   |  const
Returns the edge transparency for specified geometry type for the specified section type.
Parameters
[in] | sectType | - affected section type
[in] | geomType | - affected section type
Returns
int edge transparency
◆ faceTransparency()
 UX_EXPORT_FUNCTION int AcDbSectionSettings::faceTransparency  |  ( |  AcDbSectionSettings::SectionType  |  sectType,
|  AcDbSectionSettings::Geometry  |  geomType
) |   |  const
Returns the edge transparency for specified geometry type for the specified section type.
Parameters
[in] | sectType | - affected section type
[in] | geomType | - affected section type
Returns
int face transparency
◆ generationOptions()
 UX_EXPORT_FUNCTION AcDbSectionSettings::Generation AcDbSectionSettings::generationOptions  |  ( |  SectionType  |  sectType | ) |   const
Returns the section generation options flag.
Parameters
[in] | sectType
Returns
Generation enumerator
◆ getHatchPattern()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbSectionSettings::getHatchPattern  |  ( |  AcDbSectionSettings::SectionType  |  sectType,
|  AcDbSectionSettings::Geometry  |  geomType,
|  AcDbHatch::HatchPatternType &  |  patternType,
|  const ACHAR *&  |  szPatternName
) |   |  const
Returns the hatch pattern for specified geometry type for the specified section type.
Parameters
[in] | sectType | - affected section type
[in] | geomType | - affected section type
[out] | patternType | - the hatch pattern type
[out] | szPatternName | - the hatch pattern name
Returns
Acad::eOk if successful, error status otherwise
◆ hatchAngle()
 UX_EXPORT_FUNCTION double AcDbSectionSettings::hatchAngle  |  ( |  AcDbSectionSettings::SectionType  |  sectType,
|  AcDbSectionSettings::Geometry  |  geomType
) |   |  const
Returns the hatch angle for specified geometry type for the specified section type.
Parameters
[in] | sectType | - affected section type
[in] | geomType | - affected section type
Returns
double hatch angle
◆ hatchScale()
 UX_EXPORT_FUNCTION double AcDbSectionSettings::hatchScale  |  ( |  AcDbSectionSettings::SectionType  |  sectType,
|  AcDbSectionSettings::Geometry  |  geomType
) |   |  const
Returns the hatch scale for specified geometry type for the specified section type.
Parameters
[in] | sectType | - affected section type
[in] | geomType | - affected section type
Returns
double hatch scale
◆ hatchSpacing()
 UX_EXPORT_FUNCTION double AcDbSectionSettings::hatchSpacing  |  ( |  AcDbSectionSettings::SectionType  |  sectType,
|  AcDbSectionSettings::Geometry  |  geomType
) |   |  const
Returns the hatch spacing factor for specified geometry type for the specified section type.
Parameters
[in] | sectType | - affected section type
[in] | geomType | - affected section type
Returns
double hatch spacing factor
◆ hatchVisibility()
 UX_EXPORT_FUNCTION bool AcDbSectionSettings::hatchVisibility  |  ( |  AcDbSectionSettings::SectionType  |  sectType,
|  AcDbSectionSettings::Geometry  |  geomType
) |   |  const
Returns the hatch visibility flag for specified geometry type for the specified section type.
Parameters
[in] | sectType | - affected section type
[in] | geomType | - affected section type
Returns
bool hatch visibility
◆ hiddenLine()
 UX_EXPORT_FUNCTION bool AcDbSectionSettings::hiddenLine  |  ( |  AcDbSectionSettings::SectionType  |  sectType,
|  AcDbSectionSettings::Geometry  |  geomType
) |   |  const
Returns the hidden lines flag for specified geometry type for the specified section type.
Parameters
[in] | sectType | - affected section type
[in] | geomType | - affected geometry object
Returns
true/false
◆ layer()
 UX_EXPORT_FUNCTION const ACHAR * AcDbSectionSettings::layer  |  ( |  AcDbSectionSettings::SectionType  |  sectType,
|  AcDbSectionSettings::Geometry  |  geomType
) |   |  const
Returns the layer for specified geometry type for the specified section type.
Parameters
[in] | sectType | - affected section type
[in] | geomType | - affected geometry object
Returns
const ACHAR* layer
◆ linetype()
 UX_EXPORT_FUNCTION const ACHAR * AcDbSectionSettings::linetype  |  ( |  AcDbSectionSettings::SectionType  |  sectType,
|  AcDbSectionSettings::Geometry  |  geomType
) |   |  const
Returns the linetype for specified geometry type for the specified section type.
Parameters
[in] | sectType | - affected section type
[in] | geomType | - affected geometry object
Returns
const ACHAR* linetype
◆ linetypeScale()
 UX_EXPORT_FUNCTION double AcDbSectionSettings::linetypeScale  |  ( |  AcDbSectionSettings::SectionType  |  sectType,
|  AcDbSectionSettings::Geometry  |  geomType
) |   |  const
Returns the linetype scale for specified geometry type for the specified section type.
Parameters
[in] | sectType | - affected section type
[in] | geomType | - affected section type
Returns
double linetype scale
◆ lineWeight()
 UX_EXPORT_FUNCTION AcDb::LineWeight AcDbSectionSettings::lineWeight  |  ( |  AcDbSectionSettings::SectionType  |  sectType,
|  AcDbSectionSettings::Geometry  |  geomType
) |   |  const
Returns the lineweight for specified geometry type for the specified section type.
Parameters
[in] | sectType | - affected section type
[in] | geomType | - affected geometry object
Returns
AcDb::LineWeight value
◆ plotStyleName()
 UX_EXPORT_FUNCTION const ACHAR * AcDbSectionSettings::plotStyleName  |  ( |  AcDbSectionSettings::SectionType  |  sectType,
|  AcDbSectionSettings::Geometry  |  geomType
) |   |  const
Returns the plotstyle name for specified geometry type for the specified section type.
Parameters
[in] | sectType | - affected section type
[in] | geomType | - affected section type
Returns
const ACHAR* plotstyle name
◆ reset() [1/2]
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbSectionSettings::reset  |  ( |   | )
Resets the section settings for all section types.
Returns
Acad::eOk if successful, error status otherwise
◆ reset() [2/2]
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbSectionSettings::reset  |  ( |  SectionType  |  sectType | )
Resets the section settings for specified section type.
Parameters
[in] | section | type - all options for this section type are reset
Returns
Acad::eOk if successful, error status otherwise
◆ setColor()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbSectionSettings::setColor  |  ( |  AcDbSectionSettings::SectionType  |  sectType,
|  AcDbSectionSettings::Geometry  |  geomType,
|  const AcCmColor &  |  color
)
Sets the color for specified geometry type for the specified section type.
Parameters
[in] | sectType | - affected section type
[in] | geomType | - affected geometry object
[in] | color | - color value to set
Returns
Acad::eOk for success, or error status otherwise
◆ setCurrentSectionType()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbSectionSettings::setCurrentSectionType  |  ( |  AcDbSectionSettings::SectionType  |  sectionType | )
Sets the current section type.
Parameters
[in] | section | type to set as the current sectioning type
Returns
Acad::eOk if successful, error status otherwise
◆ setDestinationBlock()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbSectionSettings::setDestinationBlock  |  ( |  AcDbSectionSettings::SectionType  |  sectType,
|  const AcDbObjectId &  |  idBlock
)
Sets the ObjectId of the BlockTableRecord to be replaced, for the specified section type.
Parameters
[in] | sectType | - affected section type
[in] | idBlock | - ObjectId of the BlockTableRecord to be replaced with kDestinationReplaceBlock option
Returns
Acad::eOk for success, or error status otherwise
◆ setDestinationFile()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbSectionSettings::setDestinationFile  |  ( |  AcDbSectionSettings::SectionType  |  sectType,
|  const ACHAR *  |  szFilename
)
Sets the ObjectId of the BlockTableRecord to be replaced, for the specified section type.
Parameters
[in] | sectType | - affected section type
[in] | szFilename | - filename to be created
Returns
Acad::eOk for success, or error status otherwise
◆ setDivisionLines()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbSectionSettings::setDivisionLines  |  ( |  AcDbSectionSettings::SectionType  |  sectType,
|  AcDbSectionSettings::Geometry  |  geomType,
|  bool  |  setEnabled
)
Sets the division lines flag for specified geometry type for the specified section type.
Parameters
[in] | sectType | - affected section type
[in] | geomType | - affected geometry object
[in] | setEnabled | - true/false
Returns
Acad::eOk for success, or error status otherwise
◆ setEdgeTransparency()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbSectionSettings::setEdgeTransparency  |  ( |  AcDbSectionSettings::SectionType  |  sectType,
|  AcDbSectionSettings::Geometry  |  geomType,
|  int  |  transparency
)
Sets the edge transparency for specified geometry type for the specified section type.
Parameters
[in] | sectType | - affected section type
[in] | geomType | - affected geometry object
[in] | transparency | - new transparency value (0-100)
Returns
Acad::eOk for success, or error status otherwise
◆ setFaceTransparency()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbSectionSettings::setFaceTransparency  |  ( |  AcDbSectionSettings::SectionType  |  sectType,
|  AcDbSectionSettings::Geometry  |  geomType,
|  int  |  transparency
)
Sets the face transparency for specified geometry type for the specified section type.
Parameters
[in] | sectType | - affected section type
[in] | geomType | - affected geometry object
[in] | transparency | - new transparency value (0-100)
Returns
Acad::eOk for success, or error status otherwise
◆ setGenerationOptions()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbSectionSettings::setGenerationOptions  |  ( |  AcDbSectionSettings::SectionType  |  nSectionType,
|  AcDbSectionSettings::Generation  |  nOptionType
)
The generation option flag is implemented by this function.
Parameters
[in] | sectType
[in] | nOptionType | You can use only kGenerate2dSection or kGenerate3dSection for Type of section, kSourceAllObjects or kSourceSelectedObjects for Source, and kDestinationNewBlock, kDestinationReplaceBlock, or kDestinationFile for Destination.
Returns
Acad::eOk for success, or error status otherwise
◆ setHatchAngle()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbSectionSettings::setHatchAngle  |  ( |  AcDbSectionSettings::SectionType  |  sectType,
|  AcDbSectionSettings::Geometry  |  geomType,
|  double  |  angle
)
Sets the hatch angle for specified geometry type for the specified section type.
Parameters
[in] | sectType | - affected section type
[in] | geomType | - affected geometry object
[in] | angle | - hatch angle
Returns
Acad::eOk for success, or error status otherwise
◆ setHatchPattern()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbSectionSettings::setHatchPattern  |  ( |  AcDbSectionSettings::SectionType  |  sectType,
|  AcDbSectionSettings::Geometry  |  geomType,
|  AcDbHatch::HatchPatternType  |  patternType,
|  const ACHAR *  |  szPatternName
)
Sets the hatch pattern for specified geometry type for the specified section type.
Parameters
[in] | sectType | - affected section type
[in] | geomType | - affected geometry object
[in] | patternType | - the hatch pattern type
[in] | szPatternName | - the hatch pattern name
Returns
Acad::eOk for success, or error status otherwise
◆ setHatchScale()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbSectionSettings::setHatchScale  |  ( |  AcDbSectionSettings::SectionType  |  sectType,
|  AcDbSectionSettings::Geometry  |  geomType,
|  double  |  scale
)
Sets the hatch scale for specified geometry type for the specified section type.
Parameters
[in] | sectType | - affected section type
[in] | geomType | - affected geometry object
[in] | scale | - hatch scale
Returns
Acad::eOk for success, or error status otherwise
◆ setHatchSpacing()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbSectionSettings::setHatchSpacing  |  ( |  AcDbSectionSettings::SectionType  |  sectType,
|  AcDbSectionSettings::Geometry  |  geomType,
|  double  |  spacing
)
Sets the hatch spacing factor for specified geometry type for the specified section type.
Parameters
[in] | sectType | - affected section type
[in] | geomType | - affected geometry object
[in] | spacing | - spacing factor
Returns
Acad::eOk for success, or error status otherwise
◆ setHatchVisibility()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbSectionSettings::setHatchVisibility  |  ( |  AcDbSectionSettings::SectionType  |  sectType,
|  AcDbSectionSettings::Geometry  |  geomType,
|  bool  |  setEnabled
)
Sets the hatch visibility flag for specified geometry type for the specified section type.
Parameters
[in] | sectType | - affected section type
[in] | geomType | - affected geometry object
[in] | setEnabled | - hatch visibility enabled
Returns
Acad::eOk for success, or error status otherwise
◆ setHiddenLine()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbSectionSettings::setHiddenLine  |  ( |  AcDbSectionSettings::SectionType  |  sectType,
|  AcDbSectionSettings::Geometry  |  geomType,
|  bool  |  setEnabled
)
Sets the hidden lines flag for specified geometry type for the specified section type.
Parameters
[in] | sectType | - affected section type
[in] | geomType | - affected geometry object
[in] | setEnabled | - true/false
Returns
Acad::eOk for success, or error status otherwise
◆ setLayer()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbSectionSettings::setLayer  |  ( |  AcDbSectionSettings::SectionType  |  sectType,
|  AcDbSectionSettings::Geometry  |  geomType,
|  const ACHAR *  |  szLayer
)
Sets the layer for specified geometry type for the specified section type.
Parameters
[in] | sectType | - affected section type
[in] | geomType | - affected geometry object
[in] | szLayer | - layer name
Returns
Acad::eOk for success, or error status otherwise
◆ setLinetype()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbSectionSettings::setLinetype  |  ( |  AcDbSectionSettings::SectionType  |  sectType,
|  AcDbSectionSettings::Geometry  |  geomType,
|  const ACHAR *  |  szLinetype
)
Sets the linetype for specified geometry type for the specified section type.
Parameters
[in] | sectType | - affected section type
[in] | geomType | - affected geometry object
[in] | szLinetype | - linetype name
Returns
Acad::eOk for success, or error status otherwise
◆ setLinetypeScale()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbSectionSettings::setLinetypeScale  |  ( |  AcDbSectionSettings::SectionType  |  sectType,
|  AcDbSectionSettings::Geometry  |  geomType,
|  double  |  scale
)
Sets the linetype scale for specified geometry type for the specified section type.
Parameters
[in] | sectType | - affected section type
[in] | geomType | - affected geometry object
[in] | scale | - linetype scale
Returns
Acad::eOk for success, or error status otherwise
◆ setLineWeight()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbSectionSettings::setLineWeight  |  ( |  AcDbSectionSettings::SectionType  |  sectType,
|  AcDbSectionSettings::Geometry  |  geomType,
|  AcDb::LineWeight  |  lweight
)
Sets the lineweight for specified geometry type for the specified section type.
Parameters
[in] | sectType | - affected section type
[in] | geomType | - affected geometry object
[in] | lweight | - lineweight value to set
Returns
Acad::eOk for success, or error status otherwise
◆ setPlotStyleName()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbSectionSettings::setPlotStyleName  |  ( |  AcDbSectionSettings::SectionType  |  sectType,
|  AcDbSectionSettings::Geometry  |  geomType,
|  const ACHAR *  |  szPlotStyleName
)
Sets the plotstyle name for specified geometry type for the specified section type.
Parameters
[in] | sectType | - affected section type
[in] | geomType | - affected geometry object
[in] | szPlotStyleName | - plotstyle name
Returns
Acad::eOk for success, or error status otherwise
◆ setSourceObjects()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbSectionSettings::setSourceObjects  |  ( |  SectionType  |  sectType,
|  const AcDbObjectIdArray &  |  ids
)
Sets the source entity set for the specified section type.
Parameters
[in] | sectType | - affected section type
[in] | ids | - the array of source entities to be sectioned
Returns
Acad::eOk for success, or error status otherwise
◆ setVisibility()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbSectionSettings::setVisibility  |  ( |  AcDbSectionSettings::SectionType  |  sectType,
|  AcDbSectionSettings::Geometry  |  geomType,
|  bool  |  visible
)
Sets the visibility for specified geometry type for the specified section type.
Parameters
[in] | sectType
[in] | geomType
[in] | visible
Returns
Acad::eOk for success, or error status otherwise
◆ visibility()
 UX_EXPORT_FUNCTION bool AcDbSectionSettings::visibility  |  ( |  AcDbSectionSettings::SectionType  |  sectType,
|  AcDbSectionSettings::Geometry  |  geomType
) |   |  const
Returns the visibility for specified geometry type for the specified section type.
Parameters
[in] | sectType
[in] | geomType
Returns
true or false