Public Member Functions | List of all members
AcDbEntityHyperlinkPE Class Referenceabstract
_ More...
#include <AcDbEntityHyperlinkPE.h>
 Public Member Functions
virtual Acad::ErrorStatus  | getHyperlinkCollection (AcDbObject *, AcDbHyperlinkCollection *&, bool=false, bool=true)=0
Gets the hyperlinks collection from the object passed as a parameter. More...
 virtual Acad::ErrorStatus  | getHyperlinkCollection (const AcDbObjectIdArray *&, AcDbHyperlinkCollection *&, bool=false, bool=true)=0
!!! NOT IMPLEMENTED YET.
 virtual Acad::ErrorStatus  | getHyperlinkCount (AcDbObject *, UINT &, bool=true)=0
!!! NOT IMPLEMENTED YET.
 virtual Acad::ErrorStatus  | getHyperlinkCount (const AcDbObjectIdArray *&, UINT &, bool=true)=0
!!! NOT IMPLEMENTED YET.
 virtual Acad::ErrorStatus  | hasHyperlink (AcDbObject *, bool &, bool=true)=0
!!! NOT IMPLEMENTED YET.
 virtual Acad::ErrorStatus  | hasHyperlink (const AcDbObjectIdArray *&, bool &, bool=true)=0
!!! NOT IMPLEMENTED YET.
 virtual Acad::ErrorStatus  | setHyperlinkCollection (AcDbObject *, AcDbHyperlinkCollection *)=0
 Public Member Functions inherited from AcRxObject
virtual AcRxObject *  | clone () const
Exported and implemented. More...
 virtual AcRx::Ordering  | comparedTo (const AcRxObject *) const
Exported and implemented.
virtual Acad::ErrorStatus  | copyFrom (const AcRxObject *)
Exported and implemented. More...
 virtual AcRxClass *  | isA () const
Exported and implemented.
virtual Adesk::Boolean  | isEqualTo (const AcRxObject *) const
Exported and implemented. More...
bool  | isKindOf (const AcRxClass *) const
Checks the object class. More...
AcRxObject *  | queryX (const AcRxClass *) const
returns the protocol extension object assigned to this class or a parent class. More...
AcRxObject *  | x (const AcRxClass *) const
returns the protocol extension object assigned to this class or a parent class. More...
 virtual  | ~AcRxObject ()
Destructor.
 Additional Inherited Members
 Static Public Member Functions inherited from AcRxObject
 static AcRxObject *  | cast (const AcRxObject *)
 static AcRxClass *  | desc ()
Exported and implemented.
 Protected Member Functions inherited from AcRxObject
AcRxObject ()
Exported and implemented.
Detailed Description
_
Member Function Documentation
◆ getHyperlinkCollection()
 Acad::ErrorStatus AcDbEntityHyperlinkPE::getHyperlinkCollection  |  ( |  AcDbObject *  |  pObject,
|  AcDbHyperlinkCollection *&  |  pHyperLinkCol,
|  bool  |  bOnlyFirst = false,
|  bool  |  bGetBlock = true
)
pure virtual
Gets the hyperlinks collection from the object passed as a parameter.
Parameters
[in] | pObject | object from which the collection will be retrieved
[out] | pHyperlinkCol | hyperlinks collection obtained
[in] | bOnlyFirst | not functional
[in] | bGetBlock | not functional