Classes | Public Member Functions | List of all members
AcDbPointCloudColorRamp Class Reference
 Classes
class  | Imp
 Public Member Functions
AcCmEntityColor  | color (int) const
Gets the current color at the specified ramp index. More...
const AcString  | name () const
Gets the ramp name. More...
Adesk::Int32  | numColors () const
Gets the number of ramp colors. More...
void  | setColor (int, AcCmEntityColor)
Sets the color at the specified ramp index. More...
void  | setFrom (const AcDbPointCloudColorRamp *)
Copies this ramp from a source ramp. More...
Acad::ErrorStatus  | setName (const AcString &)
Sets the ramp name. More...
Acad::ErrorStatus  | setNumColors (Adesk::Int32)
Sets the number of colors in this ramp. More...
void  | setVisibility (int, Adesk::Boolean)
Sets the visibility of the specified ramp index. More...
Adesk::Boolean  | visibility (int) const
Gets the current visibility of the specified ramp index. More...
Member Function Documentation
◆ color()
 UX_EXPORT_FUNCTION AcCmEntityColor AcDbPointCloudColorRamp::color  |  ( |  int  |  index | ) |   const
Gets the current color at the specified ramp index.
Parameters
[in] | index | - ramp index
Returns
color
◆ name()
 UX_EXPORT_FUNCTION const AcString AcDbPointCloudColorRamp::name  |  ( |   | ) |   const
Gets the ramp name.
Returns
name
◆ numColors()
 UX_EXPORT_FUNCTION Adesk::Int32 AcDbPointCloudColorRamp::numColors  |  ( |   | ) |   const
Gets the number of ramp colors.
Returns
count
◆ setColor()
 UX_EXPORT_FUNCTION void AcDbPointCloudColorRamp::setColor  |  ( |  int  |  index,
|  AcCmEntityColor  |  color
)
Sets the color at the specified ramp index.
Parameters
[in] | index | - ramp index
[in] | color | - ramp color
◆ setFrom()
 UX_EXPORT_FUNCTION void AcDbPointCloudColorRamp::setFrom  |  ( |  const AcDbPointCloudColorRamp *  |  sourceRamp | )
Copies this ramp from a source ramp.
Parameters
[in] | sourceRamp | - ramp to copy from
◆ setName()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbPointCloudColorRamp::setName  |  ( |  const AcString &  |  name | )
Sets the ramp name.
Parameters
[in] | name | - ramp name
Returns
Acad::eOk if successful; error status otherwise
◆ setNumColors()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbPointCloudColorRamp::setNumColors  |  ( |  Adesk::Int32  |  size | )
Sets the number of colors in this ramp.
Parameters
[in] | size | - number of ramp colors
Returns
Acad::eOk if successful; error status otherwise
◆ setVisibility()
 UX_EXPORT_FUNCTION void AcDbPointCloudColorRamp::setVisibility  |  ( |  int  |  index,
|  Adesk::Boolean  |  visible
)
Sets the visibility of the specified ramp index.
Parameters
[in] | index | - ramp index
[in] | visible | - Adesk::kTrue to make visible; Adesk::kFalse to make invisible
◆ visibility()
 UX_EXPORT_FUNCTION Adesk::Boolean AcDbPointCloudColorRamp::visibility  |  ( |  int  |  index | ) |   const
Gets the current visibility of the specified ramp index.
Parameters
[in] | index | - ramp index
Returns
Adesk::kTrue if visible