Public Types | Public Member Functions | Static Public Member Functions | Public Attributes | Protected Member Functions | List of all members
AcDbLayerTableRecord Class Reference
_ More...
#include <AcDbLayerTableRecord.h>
 Public Types
enum  | { kDxfLayerPlotBit = 290 }
 typedef AcDbLayerTable  | TableType
 Public Types inherited from AcDbSymbolTableRecord
 typedef AcDbSymbolTable  | TableType
 Public Types inherited from AcGiDrawable
enum  | DrawableType {
 kGeometry = 0 , kDistantLight , kPointLight , kSpotLight ,
 kAmbientLight , kSolidBackground , kGradientBackground , kImageBackground ,
 kGroundPlaneBackground , kViewport
 }
enum  | SetAttributesFlags {
 kDrawableNone = 0 , kDrawableIsAnEntity = 1 , kDrawableUsesNesting = 2 , kDrawableIsCompoundObject = 4 ,
 kDrawableViewIndependentViewportDraw = 8 , kDrawableIsInvisible = 16 , kDrawableHasAttributes = 32 , kDrawableRegenTypeDependentGeometry = 64 ,
 kDrawableIsDimension = 133 , kDrawableRegenDraw = 256 , kDrawableStandardDisplaySingleLOD = 512 , kDrawableShadedDisplaySingleLOD = 1024 ,
 kDrawableViewDependentViewportDraw = 2048 , kDrawableBlockDependentViewportDraw = 4096 , kDrawableIsExternalReference = 8192 , kDrawableNotPlottable = 16384 ,
 kDrawableNotAllowLCS = 32768 , kDrawableMergeControlOff = 65536 , kThreadedWorldDrawViewportDraw = 131072
 }
 Public Member Functions
AcCmColor  | color () const
Returns the color of this Layer (DXF 62). More...
AcCmColor  | color (const AcDbObjectId &, bool &) const
Returns the viewport-specific color value which is assigned to this layer. More...
ACHAR *  | description () const
Retuns the user-defined text describing the current layer. More...
AcGiDrawable *  | drawable ()
AcCmEntityColor  | entityColor () const
Returns the color of this Layer as AcCmEntityColor. More...
bool  | hasAnyOverrides () const
Returns whether this layer any property overrides. More...
bool  | hasOverrides (const AcDbObjectId &) const
Returns whether this layer any property overrides for specified viewport. More...
bool  | isFrozen () const
Returns true if and only if this Layer is frozen (DXF 70, bit 0x01). More...
bool  | isHidden () const
Returns true if and only if this Layer is hidden. More...
bool  | isInUse () const
If the layer was in use when function AcDbLayerTable::generateUsageData was called, the function returns true, else returns false. More...
bool  | isLocked () const
Returns true if and only if this Layer is locked (DXF 70, bit 0x04). More...
bool  | isOff () const
Returns true if and only if this Layer is off (DXF 62). More...
bool  | isPlottable () const
Returns true if and only if this Layer is plottable. More...
bool  | isReconciled () const
Returns whether this layer is a reconciled layer or not. More...
AcDbObjectId  | linetypeObjectId () const
Returns the Object ID of the linetype associated with this Layer (DXF 6). More...
AcDbObjectId  | linetypeObjectId (const AcDbObjectId &, bool &) const
Returns the viewport-specific linetype ID value which is assigned to this layer. More...
AcDb::LineWeight  | lineWeight () const
Returns the lineweight associated with this Layer (DXF 370). More...
AcDb::LineWeight  | lineWeight (const AcDbObjectId &, bool &) const
Returns the viewport-specific lineweight value which is assigned to this layer. More...
AcDbObjectId  | materialId () const
Gets the material of this layer table record. More...
ACHAR *  | plotStyleName () const
Retuns a copy of the name of the plotstyle associated with this Layer (DXF 390). More...
ACHAR *  | plotStyleName (const AcDbObjectId &, bool &) const
Returns the viewport-specific plotstyle name which is assigned to this layer. More...
AcDbObjectId  | plotStyleNameId () const
Retuns the plotstyle ID associated with this Layer. More...
AcDbObjectId  | plotStyleNameId (const AcDbObjectId &, bool &) const
Returns the viewport-specific plotstyle ID which is assigned to this layer. More...
Acad::ErrorStatus  | removeAllOverrides ()
Removes all property overrides for this layer. More...
Acad::ErrorStatus  | removeColorOverride (const AcDbObjectId &)
Removes the viewport-specific color override value for this layer. More...
Acad::ErrorStatus  | removeLinetypeOverride (const AcDbObjectId &)
Removes the viewport-specific linetype override value for this layer. More...
Acad::ErrorStatus  | removeLineWeightOverride (const AcDbObjectId &)
Removes the viewport-specific lineweight override value for this layer. More...
Acad::ErrorStatus  | removePlotStyleOverride (const AcDbObjectId &)
Removes the viewport-specific plotstyle override value for this layer. More...
Acad::ErrorStatus  | removeTransparencyOverride (const AcDbObjectId &)
Removes the viewport-specific transparency override value for this layer. More...
Acad::ErrorStatus  | removeViewportOverrides (const AcDbObjectId &)
Removes all property overrides by specified viewport for this layer. More...
void  | setColor (const AcCmColor &)
Sets the color of this Layer (DXF 62). More...
Acad::ErrorStatus  | setColor (const AcCmColor &, const AcDbObjectId &)
Sets the viewport-specific color value for this layer. More...
Acad::ErrorStatus  | setDescription (const ACHAR *)
Sets the user-defined text describing the current layer. More...
Acad::ErrorStatus  | setIsFrozen (bool)
Sets the frozen status of this Layer (DXF 70, bit 0x01). More...
Acad::ErrorStatus  | setIsHidden (bool)
Sets this layer as a hidden layer for any user interface operation. More...
void  | setIsLocked (bool)
Sets the locked status of this Layer (DXF 70, bit 0x04). More...
void  | setIsOff (bool)
Sets the on / off status of this Layer (DXF 62). More...
Acad::ErrorStatus  | setIsPlottable (bool)
Sets the plottable status of this Layer (DXF 290). More...
Acad::ErrorStatus  | setIsReconciled (bool=true)
Sets this layer as reconciled or unreconciled layer. More...
void  | setLinetypeObjectId (AcDbObjectId)
Sets the Object ID for the linetype associated with this Layer (DXF 6). More...
Acad::ErrorStatus  | setLinetypeObjectId (const AcDbObjectId &, const AcDbObjectId &)
Sets the viewport-specific linetype ID value for this layer. More...
Acad::ErrorStatus  | setLineWeight (AcDb::LineWeight)
Sets the lineweight associated with this Layer (DXF 370). More...
Acad::ErrorStatus  | setLineWeight (AcDb::LineWeight, const AcDbObjectId &)
Sets the viewport-specific lineweight value for this layer. More...
Acad::ErrorStatus  | setMaterialId (AcDbObjectId)
Sets the material for this layer table record. More...
Acad::ErrorStatus  | setPlotStyleName (const AcDbObjectId &)
Sets the ID of the plotstyle associated with this Layer. More...
Acad::ErrorStatus  | setPlotStyleName (const AcDbObjectId &, const AcDbObjectId &)
Sets the viewport-specific plotstyle ID value for this layer. More...
Acad::ErrorStatus  | setPlotStyleName (const ACHAR *)
Sets the name of the plotstyle associated with this Layer (DXF 390). More...
Acad::ErrorStatus  | setPlotStyleName (const ACHAR *, const AcDbObjectId &)
Sets the viewport-specific plotstyle name value for this layer. More...
Acad::ErrorStatus  | setTransparency (const AcCmTransparency &)
Sets the transparency value for this layer. More...
Acad::ErrorStatus  | setTransparency (const AcCmTransparency &, const AcDbObjectId &)
Sets the viewport-specific transparency value for this layer. More...
void  | setVPDFLT (bool)
Sets the frozen in new viewports status of this Layer (DXF 70, bit 0x02). More...
AcCmTransparency  | transparency () const
Returns the transparency value which is assigned to this layer. More...
AcCmTransparency  | transparency (const AcDbObjectId &, bool &) const
Returns the viewport-specific transparency value which is assigned to this layer. More...
bool  | VPDFLT () const
Returns true if and only if this Layer is frozen in new viewports (DXF 70, bit 0x02). More...
 Public Member Functions inherited from AcDbSymbolTableRecord
Acad::ErrorStatus  | getName (ACHAR *&) const
getName. More...
Acad::ErrorStatus  | getName (AcString &) const
getName. More...
Acad::ErrorStatus  | getName (const ACHAR *&) const
getName. More...
bool  | isDependent () const
Returns whether this AcDbSymbolTableRecord is dependending on xref database. More...
bool  | isResolved () const
Returns whether this AcDbSymbolTableRecord is dependending on xref database. More...
Acad::ErrorStatus  | setName (const ACHAR *)
setName. More...
 virtual  | ~AcDbSymbolTableRecord ()
destructor.
 Public Member Functions inherited from AcDbObject
virtual Acad::ErrorStatus  | addPersistentReactor (AcDbObjectId)
Adds a persistent reactor to this object reactor list. More...
Acad::ErrorStatus  | addReactor (AcDbObjectReactor *) const
Adds a transient reactor to this object. More...
virtual Acad::ErrorStatus  | applyPartialUndo (AcDbDwgFiler *, AcRxClass *)
This function is called during Undo operations on objects, that use the 'Partial Undo meachanism'; this is, this object is opened with assertWriteEnabled(Adesk::kFalse) to indicate that custom Undo filing is used rather than the default Undo filing. More...
 void  | assertNotifyEnabled () const
 void  | assertReadEnabled () const
 void  | assertWriteEnabled (Adesk::Boolean=Adesk::kTrue, Adesk::Boolean=Adesk::kTrue)
virtual Acad::ErrorStatus  | audit (AcDbAuditInfo *)
Performs the audit operation for this object. More...
Acad::ErrorStatus  | cancel ()
Reverts all changes since the object had been opened and closes the object. More...
virtual void  | cancelled (const AcDbObject *)
A handler function for persistent reactors. More...
virtual AcRxObject *  | clone () const
Creates a shallow clone of this object. More...
Acad::ErrorStatus  | close ()
Closes the object. More...
Acad::ErrorStatus  | closeAndPage (Adesk::Boolean=Adesk::kTrue)
Closes the object. More...
virtual Acad::ErrorStatus  | composeForLoad (AcDb::OdaSaveType, AcDb::AcDbDwgVersion)
This function is intended for future MT file loading support. More...
virtual void  | copied (const AcDbObject *, const AcDbObject *)
A handler function for persistent reactors. More...
virtual Acad::ErrorStatus  | copyFrom (const AcRxObject *)
Copies the pSrc object information in this object. More...
Acad::ErrorStatus  | createExtensionDictionary ()
Creates a dictionary as extension dictionary for this object. More...
AcDbDatabase *  | database () const
Returns the database that contains this object. More...
virtual Acad::ErrorStatus  | decomposeForSave (AcDb::AcDbDwgVersion, AcDbObject *&, AcDbObjectId &, Adesk::Boolean &)
This function is called during dwg and dxf output, to allow a custom object to decompose itself, due to provided dwg/dxf target file version. More...
virtual Acad::ErrorStatus  | deepClone (AcDbObject *, AcDbObject *&, AcDbIdMapping &, Adesk::Boolean=Adesk::kTrue) const final
Clones this object, appends it to the owner pOwner and adds an AcDbIdPair record to the idMap. More...
void  | disableUndoRecording (Adesk::Boolean)
Disables or enables the undo recording for the object. More...
Acad::ErrorStatus  | downgradeOpen ()
Sets the open mode for an object opened for write to be opened for read. More...
Acad::ErrorStatus  | downgradeToNotify (Adesk::Boolean)
Sets the open mode for an object opened for write to be opened for notify. More...
virtual AcGiDrawable *  | drawable ()
Retrieves the AcGiDrawable instance of this object. More...
Acad::ErrorStatus  | dwgIn (AcDbDwgFiler *)
Calls the object's dwgInFields function, and reads any XData if present. More...
virtual Acad::ErrorStatus  | dwgInFields (AcDbDwgFiler *)
Reads the object from the DWG filer. More...
Acad::ErrorStatus  | dwgOut (AcDbDwgFiler *) const
Calls the object's dwgOutFields function, and writes any XData if present. More...
virtual Acad::ErrorStatus  | dwgOutFields (AcDbDwgFiler *) const
Writes the object to the DWG filer. More...
Acad::ErrorStatus  | dxfIn (AcDbDxfFiler *)
Calls the object's dxfInFields function, and reads any XData if present. More...
virtual Acad::ErrorStatus  | dxfInFields (AcDbDxfFiler *)
Reads the object from the DXF filer. More...
Acad::ErrorStatus  | dxfOut (AcDbDxfFiler *, Adesk::Boolean, Adesk::uchar *) const
Calls the object's dxfOutFields function, and writes any XData if present. More...
virtual Acad::ErrorStatus  | dxfOutFields (AcDbDxfFiler *) const
Writes the object to the DXF filer. More...
Acad::ErrorStatus  | erase (Adesk::Boolean=Adesk::kTrue)
Sets the bit that indicates that the object is erased. More...
virtual void  | erased (const AcDbObject *, Adesk::Boolean)
A handler function for persistent reactors. More...
AcDbObjectId  | extensionDictionary () const
Returns the object id of the extension dictionary for this object. More...
void  | getAcDbHandle (AcDbHandle &) const
Returns handle of this object. More...
Acad::ErrorStatus  | getBinaryData (const ACHAR *, Adesk::Int32 &, char *&) const
Creates a copy of the binary data stored as chunks of maximum 127 bytes in the resbuf chain of this object's extension dictionary xrecord entry given by entryName. More...
int  | getBrxOpenCount () const
This function returns the number of open BRX instances for this object. More...
int  | getBrxOpenState () const
This function returns the BRX object open state flags as bitfields, for diagnostic purpose. More...
virtual Acad::ErrorStatus  | getClassID (CLSID *) const final
Gets the COM wrapper Class ID for this entity. More...
int  | getCustomObjectState () const
This function returns the custom object status : 1=isCustomObject 2=DifferentialUndoDisabled. More...
Acad::ErrorStatus  | getField (const ACHAR *, AcDbField *&, AcDb::OpenMode) const
Retrieves the specified Field from this object, and opens it in mode. More...
Acad::ErrorStatus  | getField (const ACHAR *, AcDbObjectId &) const
Gets the pszPropName field object from field dictionary of this AcDbObject object, using pszPropName as key. More...
AcDbObjectId  | getFieldDictionary () const
Returns the Field dictionary associated with this object,. More...
Acad::ErrorStatus  | getFieldDictionary (AcDbDictionary *&, AcDb::OpenMode) const
Gets and opens the field dictionary for this. More...
Acad::ErrorStatus  | getObjectBirthVersion (AcDb::AcDbDwgVersion &, AcDb::MaintenanceReleaseVersion &)
This function is currently not supported by the CAD engine, always returns Acad::eOk, and 'kDHL_CURRENT' + 'kMReleaseCurrent' results. More...
virtual Acad::ErrorStatus  | getObjectSaveVersion (const AcDbDwgFiler *, AcDb::AcDbDwgVersion &, AcDb::MaintenanceReleaseVersion &)
Returns the DWG version for saving the object. More...
virtual Acad::ErrorStatus  | getObjectSaveVersion (const AcDbDxfFiler *, AcDb::AcDbDwgVersion &, AcDb::MaintenanceReleaseVersion &)
Returns the DWG version for saving the object. More...
int  | getOdaOpenCount () const
This function returns the number of open ODA instances for this object. More...
int  | getOdaOpenState () const
This function returns the ODA object open state flags as bitfields, for diagnostic purpose. More...
virtual void  | goodbye (const AcDbObject *)
A handler function for persistent reactors. More...
Acad::ErrorStatus  | handOverTo (AcDbObject *, Adesk::Boolean=Adesk::kTrue, Adesk::Boolean=Adesk::kTrue)
Hands over objects identity to another object. More...
bool  | hasFields () const
Return true if this object has single or multiple fields associated with him. More...
bool  | hasPersistentReactor (AcDbObjectId) const
Checks the input objectId in this object reactor list. More...
bool  | hasSaveVersionOverride ()
This function indicates whether this object overrides the filer's save version. More...
virtual AcDbObjectId  | id () const
Returns the database id of this object. More...
Adesk::Boolean  | isAcDbObjectIdsInFlux () const
Checks whether a deep clone operation was completed. More...
Adesk::Boolean  | isAProxy () const
Adesk::Boolean  | isCancelling () const
Adesk::Boolean  | isErased () const
Returns whether this object is erased. More...
Adesk::Boolean  | isEraseStatusToggled () const
Checks whether the object erase status has been toggled. More...
Adesk::Boolean  | isModified () const
Returns whether this object's assertWriteEnabled() has been called since it was opened. More...
Adesk::Boolean  | isModifiedGraphics () const
Checks whether this object graphics will be updated when the object is closed. More...
Adesk::Boolean  | isModifiedXData () const
Checks whether this object's xData was modified. More...
Adesk::Boolean  | isNewObject () const
Returns true if and only if this object has not been closed since it was created. More...
Adesk::Boolean  | isNotifyEnabled () const
Returns whether this object is opened for notify. More...
Adesk::Boolean  | isNotifying () const
virtual Adesk::Boolean  | isPersistent () const
Returns the 'persistent' status of a database object. More...
Adesk::Boolean  | isReadEnabled () const
Returns whether this object is opened for read. More...
 Adesk::Boolean  | isReallyClosing () const
Checks whether the next close call will completely close this object return true if on the next call the object will be completely closed false otherwise.
Adesk::Boolean  | isTransactionResident () const
Gets the object transaction status. More...
Adesk::Boolean  | isUndoing () const
bool  | isUndoRecordingDisabled () const
Returns whether the undo recording for the object is enabled or not. More...
Adesk::Boolean  | isWriteEnabled () const
Returns whether this object is opened for write. More...
virtual AcDb::DuplicateRecordCloning  | mergeStyle () const
Returns the object's merge behavior during cloning. More...
virtual void  | modified (const AcDbObject *)
A handler function for persistent reactors. More...
virtual void  | modifiedGraphics (const AcDbEntity *)
A handler function for persistent reactors. More...
virtual void  | modifiedXData (const AcDbObject *)
A handler function for persistent reactors. More...
virtual void  | modifyUndone (const AcDbObject *)
A handler function for persistent reactors. More...
virtual void  | objectClosed (const AcDbObjectId)
A handler function for persistent reactors. More...
AcDbObjectId  | objectId () const
Returns object id. More...
virtual void  | openedForModify (const AcDbObject *)
A handler function for persistent reactors. More...
AcDbObjectId  | ownerId () const
Returns object id of the owner. More...
AcDbVoidPtrArray *  | reactors ()
Gets the object pointers to reactors. More...
const AcDbVoidPtrArray *  | reactors () const
Gets the object pointers to reactors. More...
virtual void  | reappended (const AcDbObject *)
A handler function for persistent reactors. More...
 virtual void  | recvPropagateModify (const AcDbObject *)
Not implemented yet.
Acad::ErrorStatus  | releaseExtensionDictionary ()
Removes the extension dictionary associated with this object. More...
virtual Acad::ErrorStatus  | removeField (AcDbObjectId)
Removes the Field specified by acFieldId from this object. More...
virtual Acad::ErrorStatus  | removeField (const ACHAR *)
Removes the Field specified by szKeyString from this object. More...
virtual Acad::ErrorStatus  | removeField (const ACHAR *, AcDbObjectId &)
Removes the Field specified by acPszKeyString from this object, and returns its ObjectId value. More...
virtual Acad::ErrorStatus  | removePersistentReactor (AcDbObjectId)
Removes a persistent reactor from this object reactor list. More...
Acad::ErrorStatus  | removeReactor (AcDbObjectReactor *) const
Removes a transient reactor to this object. More...
void  | setAcDbObjectIdsInFlux ()
Call this function to indicate that the object IDs of this object and its sub-objects (if any) are not yet valid. More...
Acad::ErrorStatus  | setBinaryData (const ACHAR *, Adesk::Int32, const char *)
Creates a copy of the binary data, divides it in up to 127 bytes binary chunks and
 sets them as resbufs in the resbuf chain of this object's extension dictionary xrecord entry given by entryName. More...
virtual Acad::ErrorStatus  | setField (const ACHAR *, AcDbField *, AcDbObjectId &)
Adds the pAcField field object to field dictionary of this AcDbObject object, using pKey as key. More...
void  | setHasSaveVersionOverride (bool)
This function can be called to specify that the object has a "save version override". More...
virtual Acad::ErrorStatus  | setOwnerId (AcDbObjectId)
Sets the ownerId data member of the object to be objId. More...
virtual Acad::ErrorStatus  | setXData (const resbuf *)
Sets/removes xData associated with this object. More...
virtual Acad::ErrorStatus  | subCancel ()
Possibility to veto a cancel operation from within custom entities. More...
virtual Acad::ErrorStatus  | subClose ()
virtual Acad::ErrorStatus  | subErase (Adesk::Boolean)
This hook is called during an AcDbObject::erase call, before any actual erase operation is performed. More...
 virtual Acad::ErrorStatus  | subHandOverTo (AcDbObject *)
virtual void  | subObjModified (const AcDbObject *, const AcDbObject *)
A handler function for persistent reactors. More...
 virtual Acad::ErrorStatus  | subOpen (AcDb::OpenMode)
virtual Acad::ErrorStatus  | subSwapIdWith (AcDbObjectId, Adesk::Boolean=Adesk::kFalse, Adesk::Boolean=Adesk::kFalse)
This hook is called during an AcDbObject::swapIdWith() call, before any actual swap operation is performed. More...
Acad::ErrorStatus  | swapIdWith (AcDbObjectId, Adesk::Boolean=Adesk::kFalse, Adesk::Boolean=Adesk::kFalse)
Swaps the object id's between the object identified by param swapId and this object. More...
virtual Acad::ErrorStatus  | swapReferences (const AcDbIdMapping &)
Not implemented yet. More...
virtual void  | unappended (const AcDbObject *)
A handler function for persistent reactors. More...
AcDbDwgFiler *  | undoFiler ()
Gets the undo filer for this object. More...
Acad::ErrorStatus  | upgradeFromNotify (Adesk::Boolean &)
Upgrades the open status of this object to AcDb::kForWrite, if this object is already open (either in AcDb::kForRead, AcDb::kForNotify or AcDb::kForWrite) More...
Acad::ErrorStatus  | upgradeOpen ()
Changes the objects open mode to AcDb::kForWrite and sends notifications. More...
virtual Acad::ErrorStatus  | wblockClone (AcRxObject *, AcDbObject *&, AcDbIdMapping &, Adesk::Boolean=Adesk::kTrue) const final
Clones this object, appends it to the owner pOwner and adds an AcDbIdPair record to the idMap. More...
virtual resbuf *  | xData (const ACHAR *=NULL) const
Returns the xData associated with this object. More...
Acad::ErrorStatus  | xDataTransformBy (const AcGeMatrix3d &)
Transforms the extended data according to parameter transformation matrix. More...
 virtual void  | xmitPropagateModify () const
Not implemented yet.
 virtual  | ~AcDbObject ()
Destructor.
 Public Member Functions inherited from AcGiDrawable
virtual bool  | bounds (AcDbExtents &) const
virtual DrawableType  | drawableType () const
 virtual AcGiDrawStream *  | drawStream () const
 AcGsNode *  | gsNode () const
virtual AcDbObjectId  | id () const =0
virtual Adesk::Boolean  | isPersistent () const =0
virtual Adesk::UInt32  | regenSupportFlags () const final
Returns whether and to which level this object supports MultiThreading. More...
 virtual Adesk::Boolean  | RolloverHit (Adesk::ULongPtr, Adesk::ULongPtr, Adesk::Boolean)
 virtual Adesk::UInt32  | setAttributes (AcGiDrawableTraits *) final
 virtual void  | setDrawStream (AcGiDrawStream *)
 void  | setGsNode (AcGsNode *)
 virtual void  | viewportDraw (AcGiViewportDraw *) final
 virtual Adesk::UInt32  | viewportDrawLogicalFlags (AcGiViewportDraw *) final
 virtual Adesk::Boolean  | worldDraw (AcGiWorldDraw *) final
 Public Member Functions inherited from AcRxObject
virtual AcRxObject *  | clone () const
Exported and implemented. More...
 virtual AcRx::Ordering  | comparedTo (const AcRxObject *) const
Exported and implemented.
virtual Acad::ErrorStatus  | copyFrom (const AcRxObject *)
Exported and implemented. More...
 virtual AcRxClass *  | isA () const
Exported and implemented.
virtual Adesk::Boolean  | isEqualTo (const AcRxObject *) const
Exported and implemented. More...
bool  | isKindOf (const AcRxClass *) const
Checks the object class. More...
AcRxObject *  | queryX (const AcRxClass *) const
returns the protocol extension object assigned to this class or a parent class. More...
AcRxObject *  | x (const AcRxClass *) const
returns the protocol extension object assigned to this class or a parent class. More...
 virtual  | ~AcRxObject ()
Destructor.
 Static Public Member Functions
static bool  | isHidden (AcDbObjectId)
Returns true if and only if the given layer is hidden. More...
static bool  | isReconciled (const AcDbObjectId &)
Returns whether the specified layer is a reconciled layer or not. More...
 Static Public Member Functions inherited from AcRxObject
 static AcRxObject *  | cast (const AcRxObject *)
 static AcRxClass *  | desc ()
Exported and implemented.
 Static Public Member Functions inherited from AcHeapOperators
 static void  | operator delete (void *)
_
 static void  | operator delete (void *, const char *, int)
 static void  | operator delete (void *, void *)
 static void  | operator delete[] (void *)
_
 static void  | operator delete[] (void *, const char *, int)
 static void *  | operator new (size_t)
_
 static void *  | operator new (size_t, const char *, int)
 static void *  | operator new (size_t, void *p)
 static void *  | operator new[] (size_t)
_
 static void *  | operator new[] (size_t, const char *, int)
 Public Attributes
AcDbLayerTableRecord
Default constructor.
 Public Attributes inherited from AcDbSymbolTableRecord
AcDbSymbolTableRecord
only derived constructors are used.
 Protected Member Functions
virtual Adesk::UInt32  | subSetAttributes (AcGiDrawableTraits *)
virtual void  | subViewportDraw (AcGiViewportDraw *)
virtual Adesk::Boolean  | subWorldDraw (AcGiWorldDraw *)
 Protected Member Functions inherited from AcDbObject
virtual Acad::ErrorStatus  | subDeepClone (AcDbObject *, AcDbObject *&, AcDbIdMapping &, Adesk::Boolean=true) const
virtual Acad::ErrorStatus  | subGetClassID (CLSID *) const
virtual Adesk::UInt32  | subSetAttributes (AcGiDrawableTraits *)
Sets the values of this object's subentity traits and returns with the calling object's subentity traits. More...
virtual void  | subViewportDraw (AcGiViewportDraw *)
virtual Adesk::UInt32  | subViewportDrawLogicalFlags (AcGiViewportDraw *)
virtual Acad::ErrorStatus  | subWblockClone (AcRxObject *, AcDbObject *&, AcDbIdMapping &, Adesk::Boolean=true) const
virtual Adesk::Boolean  | subWorldDraw (AcGiWorldDraw *)
 Protected Member Functions inherited from AcGiDrawable
virtual Adesk::UInt32  | subRegenSupportFlags () const
Returns whether and to which level this object supports MultiThreading. More...
virtual Adesk::UInt32  | subSetAttributes (AcGiDrawableTraits *)=0
virtual void  | subViewportDraw (AcGiViewportDraw *)=0
 virtual Adesk::UInt32  | subViewportDrawLogicalFlags (AcGiViewportDraw *)
virtual Adesk::Boolean  | subWorldDraw (AcGiWorldDraw *)=0
 Protected Member Functions inherited from AcRxObject
AcRxObject ()
Exported and implemented.
Detailed Description
_
Member Function Documentation
◆ color() [1/2]
 UX_EXPORT_FUNCTION AcCmColor AcDbLayerTableRecord::color  |  ( |   | ) |   const
Returns the color of this Layer (DXF 62).
Returns
color of the layer.
◆ color() [2/2]
 UX_EXPORT_FUNCTION AcCmColor AcDbLayerTableRecord::color  |  ( |  const AcDbObjectId &  |  vportId,
|  bool &  |  isOverride
) |   |  const
Returns the viewport-specific color value which is assigned to this layer.
Parameters
[in] | vportId | defining the viewport
[out] | isOverride | specifies whether this is the default color (false) or an override for the layer color
Returns
color value assigned to this layer
◆ description()
 UX_EXPORT_FUNCTION ACHAR * AcDbLayerTableRecord::description  |  ( |   | ) |   const
Retuns the user-defined text describing the current layer.
Returns
description of the current layer.
◆ drawable()
 UX_EXPORT_FUNCTION AcGiDrawable * AcDbLayerTableRecord::drawable  |  ( |   | )
virtual
Reimplemented from AcDbObject.
◆ entityColor()
 UX_EXPORT_FUNCTION AcCmEntityColor AcDbLayerTableRecord::entityColor  |  ( |   | ) |   const
Returns the color of this Layer as AcCmEntityColor.
Returns
AcCmEntityColor color of the layer.
◆ hasAnyOverrides()
 UX_EXPORT_FUNCTION bool AcDbLayerTableRecord::hasAnyOverrides  |  ( |   | ) |   const
Returns whether this layer any property overrides.
Returns
true, if any property-overrides are present
◆ hasOverrides()
 UX_EXPORT_FUNCTION bool AcDbLayerTableRecord::hasOverrides  |  ( |  const AcDbObjectId &  |  vportId | ) |   const
Returns whether this layer any property overrides for specified viewport.
Parameters
[in] | vportId | defining the viewport
Returns
true, if any viewport-specific property-overrides are present
◆ isFrozen()
 UX_EXPORT_FUNCTION bool AcDbLayerTableRecord::isFrozen  |  ( |   | ) |   const
Returns true if and only if this Layer is frozen (DXF 70, bit 0x01).
Returns
true, if layer is frozen, false if layer is thawed.
◆ isHidden() [1/2]
 UX_EXPORT_FUNCTION bool AcDbLayerTableRecord::isHidden  |  ( |   | ) |   const
Returns true if and only if this Layer is hidden.
A hidden layer is not displayed in any user interface dialog.
Returns
true, if layer is hidden, false if it is not hidden
Remarks
Bricscad currently does not support 'isHidden()' - always returns false
◆ isHidden() [2/2]
 UX_EXPORT_FUNCTION bool AcDbLayerTableRecord::isHidden  |  ( |  AcDbObjectId  |  objIdLayer | )
static
Returns true if and only if the given layer is hidden.
A hidden layer is not displayed in any user interface dialog.
Parameters
[in] | objIdLayer | the layer to query
Returns
true, if layer is hidden, false if it is not hidden
Remarks
Bricscad currently does not support 'isHidden()' - always returns false
◆ isInUse()
 UX_EXPORT_FUNCTION bool AcDbLayerTableRecord::isInUse  |  ( |   | ) |   const
If the layer was in use when function AcDbLayerTable::generateUsageData was called, the function returns true, else returns false.
Returns true if the layer table record is not database resident or the function AcDbLayerTable::generateUsageData hasn't been called.
Returns
true if the layer is in use, otherwise return false.
◆ isLocked()
 UX_EXPORT_FUNCTION bool AcDbLayerTableRecord::isLocked  |  ( |   | ) |   const
Returns true if and only if this Layer is locked (DXF 70, bit 0x04).
Returns
true, if the layer is locked, false if it is unlocked.
◆ isOff()
 UX_EXPORT_FUNCTION bool AcDbLayerTableRecord::isOff  |  ( |   | ) |   const
Returns true if and only if this Layer is off (DXF 62).
A negative value for DXF 62 indicates, that the layer is off, a positive value that the layer is on.
Returns
true, if layer is off, false if it is on.
◆ isPlottable()
 UX_EXPORT_FUNCTION bool AcDbLayerTableRecord::isPlottable  |  ( |   | ) |   const
Returns true if and only if this Layer is plottable.
Returns
true, if the layer is plottable, false otherwise.
◆ isReconciled() [1/2]
 UX_EXPORT_FUNCTION bool AcDbLayerTableRecord::isReconciled  |  ( |   | ) |   const
Returns whether this layer is a reconciled layer or not.
Returns
true, if this layer is reconciled, false otherwise (new layer)
◆ isReconciled() [2/2]
 UX_EXPORT_FUNCTION bool AcDbLayerTableRecord::isReconciled  |  ( |  const AcDbObjectId &  |  id | )
static
Returns whether the specified layer is a reconciled layer or not.
Parameters
[in] | id | of a LayerTableRecord
Returns
Acad::eOk, if successful or error code otherwise
◆ linetypeObjectId() [1/2]
 UX_EXPORT_FUNCTION AcDbObjectId AcDbLayerTableRecord::linetypeObjectId  |  ( |   | ) |   const
Returns the Object ID of the linetype associated with this Layer (DXF 6).
Returns
objectId of the layers linetype. AcDbObjectId::kNull if no linetype is associated with this layer.
◆ linetypeObjectId() [2/2]
 UX_EXPORT_FUNCTION AcDbObjectId AcDbLayerTableRecord::linetypeObjectId  |  ( |  const AcDbObjectId &  |  vportId,
|  bool &  |  isOverride
) |   |  const
Returns the viewport-specific linetype ID value which is assigned to this layer.
Parameters
[in] | vportId | defining the viewport
[out] | isOverride | specifies whether this is the default linetype (false) or an override for the layer linetype
Returns
linetype ID value assigned to this layer
◆ lineWeight() [1/2]
 UX_EXPORT_FUNCTION AcDb::LineWeight AcDbLayerTableRecord::lineWeight  |  ( |   | ) |   const
Returns the lineweight associated with this Layer (DXF 370).
Returns
lineweight of the layer.
◆ lineWeight() [2/2]
 UX_EXPORT_FUNCTION AcDb::LineWeight AcDbLayerTableRecord::lineWeight  |  ( |  const AcDbObjectId &  |  vportId,
|  bool &  |  isOverride
) |   |  const
Returns the viewport-specific lineweight value which is assigned to this layer.
Parameters
[in] | vportId | defining the viewport
[out] | isOverride | specifies whether this is the default lineweight (false) or an override for the layer lineweight
Returns
lineweight value assigned to this layer
◆ materialId()
 UX_EXPORT_FUNCTION AcDbObjectId AcDbLayerTableRecord::materialId  |  ( |   | ) |   const
Gets the material of this layer table record.
Returns
object id of the material associated with this object
◆ plotStyleName() [1/2]
 UX_EXPORT_FUNCTION ACHAR * AcDbLayerTableRecord::plotStyleName  |  ( |   | ) |   const
Retuns a copy of the name of the plotstyle associated with this Layer (DXF 390).
The caller has to deallocate the string, e.g. with acdbFree.
Returns
name of the layers plotstyle.
◆ plotStyleName() [2/2]
 UX_EXPORT_FUNCTION ACHAR * AcDbLayerTableRecord::plotStyleName  |  ( |  const AcDbObjectId &  |  vportId,
|  bool &  |  isOverride
) |   |  const
Returns the viewport-specific plotstyle name which is assigned to this layer.
The caller has to deallocate the string, e.g. with acdbFree.
Parameters
[in] | vportId | defining the viewport
[out] | isOverride | specifies whether this is the default plotstyle name (false) or an override for the layer plotstyle
Returns
plotstyle name assigned to this layer
◆ plotStyleNameId() [1/2]
 UX_EXPORT_FUNCTION AcDbObjectId AcDbLayerTableRecord::plotStyleNameId  |  ( |   | ) |   const
Retuns the plotstyle ID associated with this Layer.
Returns
ID of the layers plotstyle.
◆ plotStyleNameId() [2/2]
 UX_EXPORT_FUNCTION AcDbObjectId AcDbLayerTableRecord::plotStyleNameId  |  ( |  const AcDbObjectId &  |  vportId,
|  bool &  |  isOverride
) |   |  const
Returns the viewport-specific plotstyle ID which is assigned to this layer.
Parameters
[in] | vportId | defining the viewport
[out] | isOverride | specifies whether this is the default plotstyle (false) or an override for the layer plotstyle
Returns
plotstyle ID value assigned to this layer
◆ removeAllOverrides()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbLayerTableRecord::removeAllOverrides  |  ( |   | )
Removes all property overrides for this layer.
Returns
Acad::eOk, if successful or error code otherwise
◆ removeColorOverride()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbLayerTableRecord::removeColorOverride  |  ( |  const AcDbObjectId &  |  vportId | )
Removes the viewport-specific color override value for this layer.
Parameters
[in] | vportId | defining the viewport
Returns
Acad::eOk, if override is successfully removed, error code otherwise
◆ removeLinetypeOverride()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbLayerTableRecord::removeLinetypeOverride  |  ( |  const AcDbObjectId &  |  vportId | )
Removes the viewport-specific linetype override value for this layer.
Parameters
[in] | vportId | defining the viewport
Returns
Acad::eOk, if override is successfully removed, error code otherwise
◆ removeLineWeightOverride()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbLayerTableRecord::removeLineWeightOverride  |  ( |  const AcDbObjectId &  |  vportId | )
Removes the viewport-specific lineweight override value for this layer.
Parameters
[in] | vportId | defining the viewport
Returns
Acad::eOk, if override is successfully removed, error code otherwise
◆ removePlotStyleOverride()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbLayerTableRecord::removePlotStyleOverride  |  ( |  const AcDbObjectId &  |  vportId | )
Removes the viewport-specific plotstyle override value for this layer.
Parameters
[in] | vportId | defining the viewport
Returns
Acad::eOk, if override is successfully removed, error code otherwise
◆ removeTransparencyOverride()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbLayerTableRecord::removeTransparencyOverride  |  ( |  const AcDbObjectId &  |  vportId | )
Removes the viewport-specific transparency override value for this layer.
Parameters
[in] | vportId | defining the viewport
Returns
Acad::eOk, if override is successfully removed, error code otherwise
◆ removeViewportOverrides()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbLayerTableRecord::removeViewportOverrides  |  ( |  const AcDbObjectId &  |  vportId | )
Removes all property overrides by specified viewport for this layer.
Parameters
[in] | vportId | defining the viewport
Returns
Acad::eOk, if successful or error code otherwise
◆ setColor() [1/2]
 UX_EXPORT_FUNCTION void AcDbLayerTableRecord::setColor  |  ( |  const AcCmColor &  |  clr | )
Sets the color of this Layer (DXF 62).
Parameters
[in] | clr | color to set.
◆ setColor() [2/2]
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbLayerTableRecord::setColor  |  ( |  const AcCmColor &  |  color,
|  const AcDbObjectId &  |  vportId
)
Sets the viewport-specific color value for this layer.
Parameters
[in] | color | value to be assigned to the layer
[in] | vportId | defining the viewport
Returns
Acad::eOk, if layer is successfully assigned the color value, error code otherwise
◆ setDescription()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbLayerTableRecord::setDescription  |  ( |  const ACHAR *  |  desc | )
Sets the user-defined text describing the current layer.
Parameters
[in] | desc | description of the current layer.
Returns
Acad::eNullObjectPointer, if this record is not database resident
 Acad::eOk otherwise
◆ setIsFrozen()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbLayerTableRecord::setIsFrozen  |  ( |  bool  |  frozen | )
Sets the frozen status of this Layer (DXF 70, bit 0x01).
Parameters
[in] | frozen | true, if layer should set to frozen, false if it should be set to thawed.
Returns
Acad::eOk
◆ setIsHidden()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbLayerTableRecord::setIsHidden  |  ( |  bool  |  bIsHidden | )
Sets this layer as a hidden layer for any user interface operation.
Parameters
[in] | bIsHidden | indicates whether the layer should be hidden or not
Returns
Acad::eOk, if layer is successfully set to be hidden Acad::eInvalidInput, if this layer is layer "0" or "DefPoints" or XRef-dependent;
Remarks
Bricscad currently does not support 'isHidden()' - always returns Acad::eInvalidInput
◆ setIsLocked()
 UX_EXPORT_FUNCTION void AcDbLayerTableRecord::setIsLocked  |  ( |  bool  |  locked | )
Sets the locked status of this Layer (DXF 70, bit 0x04).
Parameters
[in] | locked | true if layer will be locked, false if it will be unlocked.
◆ setIsOff()
 UX_EXPORT_FUNCTION void AcDbLayerTableRecord::setIsOff  |  ( |  bool  |  off | )
Sets the on / off status of this Layer (DXF 62).
Parameters
[in] | off | true, layer will be set to off, false layer will be set to on.
◆ setIsPlottable()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbLayerTableRecord::setIsPlottable  |  ( |  bool  |  bPlotability | )
Sets the plottable status of this Layer (DXF 290).
Parameters
[in] | bPlotability | true for plottable, false for non plottable.
Returns
Acad::eInvalidInput if the layer can not be made plottable.
 Acad::eOk otherwise
◆ setIsReconciled()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbLayerTableRecord::setIsReconciled  |  ( |  bool  |  asReconciled = true | )
Sets this layer as reconciled or unreconciled layer.
Parameters
[in] | true,to | declare this layer as reconciled, false to declare as unreconciled
Returns
Acad::eOk, if successful or error code otherwise
◆ setLinetypeObjectId() [1/2]
 UX_EXPORT_FUNCTION void AcDbLayerTableRecord::setLinetypeObjectId  |  ( |  AcDbObjectId  |  linetypeId | )
Sets the Object ID for the linetype associated with this Layer (DXF 6).
DXF 6 will contain the name of the linetype set with id.
Parameters
[in] | linetypeId | id of the linetype to set.
◆ setLinetypeObjectId() [2/2]
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbLayerTableRecord::setLinetypeObjectId  |  ( |  const AcDbObjectId &  |  ltypeId,
|  const AcDbObjectId &  |  vportId
)
Sets the viewport-specific linetype ID value for this layer.
Parameters
[in] | linetype | value to be assigned to the layer
[in] | vportId | defining the viewport
Returns
Acad::eOk, if layer is successfully assigned the linetype value, error code otherwise
◆ setLineWeight() [1/2]
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbLayerTableRecord::setLineWeight  |  ( |  AcDb::LineWeight  |  weight | )
Sets the lineweight associated with this Layer (DXF 370).
Parameters
[in] | weight | lineweight to set.
Returns
Acad::eOk
◆ setLineWeight() [2/2]
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbLayerTableRecord::setLineWeight  |  ( |  AcDb::LineWeight  |  lweight,
|  const AcDbObjectId &  |  vportId
)
Sets the viewport-specific lineweight value for this layer.
Parameters
[in] | lineweight | value to be assigned to the layer
[in] | vportId | defining the viewport
Returns
Acad::eOk, if layer is successfully assigned the lineweight value, error code otherwise
◆ setMaterialId()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbLayerTableRecord::setMaterialId  |  ( |  AcDbObjectId  |  materialId | )
Sets the material for this layer table record.
Parameters
[in] | materialId | object id of the material to set
Returns
Acad::eOk if successful,
 Acad::eNullObjectId if the passed in id is NULL,
 Acad::eNotThatKindOfClass if the passed in id is not of an AcDbMaterial object
◆ setPlotStyleName() [1/4]
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbLayerTableRecord::setPlotStyleName  |  ( |  const AcDbObjectId &  |  plotStyleId | )
Sets the ID of the plotstyle associated with this Layer.
Parameters
[in] | plotStyleId | ID of the plotstyle to set.
Returns
Acad::eOk, if successful, or error code otherwise
◆ setPlotStyleName() [2/4]
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbLayerTableRecord::setPlotStyleName  |  ( |  const AcDbObjectId &  |  pstyleId,
|  const AcDbObjectId &  |  vportId
)
Sets the viewport-specific plotstyle ID value for this layer.
Parameters
[in] | pstyleId | value to be assigned to the layer
[in] | vportId | defining the viewport
Returns
Acad::eOk, if layer is successfully assigned the plotstyle value, error code otherwise
◆ setPlotStyleName() [3/4]
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbLayerTableRecord::setPlotStyleName  |  ( |  const ACHAR *  |  plotStyleName | )
Sets the name of the plotstyle associated with this Layer (DXF 390).
This layertable record must be database resident, as the plot style name dictionary has to be searched for the plotstyle newName.
Parameters
[in] | plotStyleName | name of the plotstyle to set.
Returns
Acad::eNoDatabase, if this record is not database resident
 Acad::eKeyNotFound, if newName not in plotstyle dictionary
 Acad::ePlotStyleInColorDependentMode, if PSTYLEMODE is 1.
 Acad::eOk otherwise
◆ setPlotStyleName() [4/4]
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbLayerTableRecord::setPlotStyleName  |  ( |  const ACHAR *  |  pstyle,
|  const AcDbObjectId &  |  vportId
)
Sets the viewport-specific plotstyle name value for this layer.
Parameters
[in] | pstyle | name to be assigned to the layer
[in] | vportId | defining the viewport
Returns
Acad::eOk, if layer is successfully assigned the plotstyle name, error code otherwise
◆ setTransparency() [1/2]
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbLayerTableRecord::setTransparency  |  ( |  const AcCmTransparency &  |  transparency | )
Sets the transparency value for this layer.
Parameters
[in] | transparency | value to be assigned to the layer
Returns
Acad::eOk, if layer is successfully assigned the transparency value, error code othersie
◆ setTransparency() [2/2]
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbLayerTableRecord::setTransparency  |  ( |  const AcCmTransparency &  |  transparency,
|  const AcDbObjectId &  |  vportId
)
Sets the viewport-specific transparency value for this layer.
Parameters
[in] | transparency | value to be assigned to the layer
[in] | vportId | defining the viewport
Returns
Acad::eOk, if layer is successfully assigned the transparency value, error code otherwise
◆ setVPDFLT()
 UX_EXPORT_FUNCTION void AcDbLayerTableRecord::setVPDFLT  |  ( |  bool  |  frozen | )
Sets the frozen in new viewports status of this Layer (DXF 70, bit 0x02).
Parameters
[in] | frozen | true, if layer is frozen in new viewports, false if it is thawed.
◆ subSetAttributes()
 UX_EXPORT_FUNCTION Adesk::UInt32 AcDbLayerTableRecord::subSetAttributes  |  ( |  AcGiDrawableTraits *  |  pFeatures | )
protectedvirtual
Parameters
[in] | pFeatures
Returns
Reimplemented from AcDbObject.
◆ subViewportDraw()
 UX_EXPORT_FUNCTION void AcDbLayerTableRecord::subViewportDraw  |  ( |  AcGiViewportDraw *  |  pVd | )
protectedvirtual
Reimplemented from AcDbObject.
◆ subWorldDraw()
 UX_EXPORT_FUNCTION Adesk::Boolean AcDbLayerTableRecord::subWorldDraw  |  ( |  AcGiWorldDraw *  |  pWd | )
protectedvirtual
Reimplemented from AcDbObject.
◆ transparency() [1/2]
 UX_EXPORT_FUNCTION AcCmTransparency AcDbLayerTableRecord::transparency  |  ( |   | ) |   const
Returns the transparency value which is assigned to this layer.
Returns
transparency value assigned to this layer
◆ transparency() [2/2]
 UX_EXPORT_FUNCTION AcCmTransparency AcDbLayerTableRecord::transparency  |  ( |  const AcDbObjectId &  |  vportId,
|  bool &  |  isOverride
) |   |  const
Returns the viewport-specific transparency value which is assigned to this layer.
Parameters
[in] | vportId | defining the viewport
[out] | isOverride | specifies whether this is the default transparency (false) or an override for the layer transparency
Returns
transparency value assigned to this layer
◆ VPDFLT()
 UX_EXPORT_FUNCTION bool AcDbLayerTableRecord::VPDFLT  |  ( |   | ) |   const
Returns true if and only if this Layer is frozen in new viewports (DXF 70, bit 0x02).
The function name is a abbrevation for: ViewPort visibility DeFauLT.
Returns
true, if layer is frozen in new viewports, false if it is thawed.