Public Member Functions | Public Attributes | List of all members
AcDbObjectContextInterface Class Referenceabstract
_ More...
#include <AcDbObjectContextInterface.h>
 Public Member Functions
 virtual Acad::ErrorStatus  | addContext (AcDbObject *, const AcDbObjectContext &) const =0
 virtual bool  | hasContext (const AcDbObject *, const AcDbObjectContext &) const =0
 virtual Acad::ErrorStatus  | removeContext (AcDbObject *, const AcDbObjectContext &) const =0
 virtual bool  | supportsCollection (const AcDbObject *, const AcString &) const =0
 Public Member Functions inherited from AcRxObject
virtual AcRxObject *  | clone () const
Exported and implemented. More...
 virtual AcRx::Ordering  | comparedTo (const AcRxObject *) const
Exported and implemented.
virtual Acad::ErrorStatus  | copyFrom (const AcRxObject *)
Exported and implemented. More...
 virtual AcRxClass *  | isA () const
Exported and implemented.
virtual Adesk::Boolean  | isEqualTo (const AcRxObject *) const
Exported and implemented. More...
bool  | isKindOf (const AcRxClass *) const
Checks the object class. More...
AcRxObject *  | queryX (const AcRxClass *) const
returns the protocol extension object assigned to this class or a parent class. More...
AcRxObject *  | x (const AcRxClass *) const
returns the protocol extension object assigned to this class or a parent class. More...
 virtual  | ~AcRxObject ()
Destructor.
 Public Attributes
AcDbObjectContextInterface
Standard Contructor.
 Additional Inherited Members
 Static Public Member Functions inherited from AcRxObject
 static AcRxObject *  | cast (const AcRxObject *)
 static AcRxClass *  | desc ()
Exported and implemented.
 Protected Member Functions inherited from AcRxObject
AcRxObject ()
Exported and implemented.
Detailed Description
_