Public Member Functions | List of all members
AcDbObjectIterator Class Reference
_ More...
#include <AcDbObjectIterator.h>
 Public Member Functions
 bool  | done () const
AcDbEntity *  | entity ()
Returns pointer to the entity if it is NDBRO, NULL otherwise. More...
 AcDbObjectId  | objectId ()
void  | setPosition (AcDbEntity *)
Sets the iterator position to the given entity. More...
void  | setPosition (AcDbObjectId)
Sets the iterator position to the given entity. More...
 void  | start (bool=false)
 void  | step (bool=false, bool=true)
 Public Member Functions inherited from AcRxObject
virtual AcRxObject *  | clone () const
Exported and implemented. More...
 virtual AcRx::Ordering  | comparedTo (const AcRxObject *) const
Exported and implemented.
virtual Acad::ErrorStatus  | copyFrom (const AcRxObject *)
Exported and implemented. More...
 virtual AcRxClass *  | isA () const
Exported and implemented.
virtual Adesk::Boolean  | isEqualTo (const AcRxObject *) const
Exported and implemented. More...
bool  | isKindOf (const AcRxClass *) const
Checks the object class. More...
AcRxObject *  | queryX (const AcRxClass *) const
returns the protocol extension object assigned to this class or a parent class. More...
AcRxObject *  | x (const AcRxClass *) const
returns the protocol extension object assigned to this class or a parent class. More...
 virtual  | ~AcRxObject ()
Destructor.
 Additional Inherited Members
 Static Public Member Functions inherited from AcRxObject
 static AcRxObject *  | cast (const AcRxObject *)
 static AcRxClass *  | desc ()
Exported and implemented.
 Static Public Member Functions inherited from AcHeapOperators
 static void  | operator delete (void *)
_
 static void  | operator delete (void *, const char *, int)
 static void  | operator delete (void *, void *)
 static void  | operator delete[] (void *)
_
 static void  | operator delete[] (void *, const char *, int)
 static void *  | operator new (size_t)
_
 static void *  | operator new (size_t, const char *, int)
 static void *  | operator new (size_t, void *p)
 static void *  | operator new[] (size_t)
_
 static void *  | operator new[] (size_t, const char *, int)
 Protected Member Functions inherited from AcRxObject
AcRxObject ()
Exported and implemented.
Detailed Description
_
Member Function Documentation
◆ entity()
 UX_EXPORT_FUNCTION AcDbEntity * AcDbObjectIterator::entity  |  ( |   | )
Returns pointer to the entity if it is NDBRO, NULL otherwise.
Returns
pointer to the entity at which the iterator is positioned
Remarks
For DBRO use AcDbObjectIterator::objectId
◆ setPosition() [1/2]
 UX_EXPORT_FUNCTION void AcDbObjectIterator::setPosition  |  ( |  AcDbEntity *  |  pEnt | )
Sets the iterator position to the given entity.
Returns
none
Remarks
For DBRO use AcDbObjectIterator::setPosition(AcDbObjectId objId)
◆ setPosition() [2/2]
 UX_EXPORT_FUNCTION void AcDbObjectIterator::setPosition  |  ( |  AcDbObjectId  |  objId | )
Sets the iterator position to the given entity.
Returns
none
Remarks
For Non-DBRO use AcDbObjectIterator::setPosition(AcDbEntity* pEnt)