Public Member Functions | List of all members
AcDbXObject Class Reference
_ More...
#include <AcDbXObject.h>
 Public Member Functions
 virtual Acad::ErrorStatus  | audit (AcDbAuditInfo *)
 Acad::ErrorStatus  | dwgIn (AcDbDwgFiler *)
 virtual Acad::ErrorStatus  | dwgInFields (AcDbDwgFiler *)
 Acad::ErrorStatus  | dwgOut (AcDbDwgFiler *) const
 virtual Acad::ErrorStatus  | dwgOutFields (AcDbDwgFiler *) const
 Acad::ErrorStatus  | dxfIn (AcDbDxfFiler *)
 virtual Acad::ErrorStatus  | dxfInFields (AcDbDxfFiler *)
 Acad::ErrorStatus  | dxfOut (AcDbDxfFiler *) const
 virtual Acad::ErrorStatus  | dxfOutFields (AcDbDxfFiler *) const
 Public Member Functions inherited from AcRxObject
virtual AcRxObject *  | clone () const
Exported and implemented. More...
 virtual AcRx::Ordering  | comparedTo (const AcRxObject *) const
Exported and implemented.
virtual Acad::ErrorStatus  | copyFrom (const AcRxObject *)
Exported and implemented. More...
 virtual AcRxClass *  | isA () const
Exported and implemented.
virtual Adesk::Boolean  | isEqualTo (const AcRxObject *) const
Exported and implemented. More...
bool  | isKindOf (const AcRxClass *) const
Checks the object class. More...
AcRxObject *  | queryX (const AcRxClass *) const
returns the protocol extension object assigned to this class or a parent class. More...
AcRxObject *  | x (const AcRxClass *) const
returns the protocol extension object assigned to this class or a parent class. More...
 virtual  | ~AcRxObject ()
Destructor.
 Additional Inherited Members
 Static Public Member Functions inherited from AcRxObject
 static AcRxObject *  | cast (const AcRxObject *)
 static AcRxClass *  | desc ()
Exported and implemented.
 Protected Member Functions inherited from AcRxObject
AcRxObject ()
Exported and implemented.
Detailed Description
_