Public Member Functions | Public Attributes | List of all members
AcDbWblockCloneFiler Class Reference
_ More...
#include <AcDbWblockCloneFiler.h>
 Public Member Functions
virtual AcDb::FilerType  | filerType () const
Returns AcDb::kWblockCloneFiler. More...
virtual bool  | getNextHardObject (AcDbObjectId &)
Returns the next referenced object ID in the queue of object IDs. More...
 virtual bool  | moreHardObjects () const
virtual bool  | usesReferences () const
 Public Member Functions inherited from AcDbDeepCloneFiler
virtual Acad::ErrorStatus  | filerStatus () const
Returns filer status. More...
virtual AcDb::FilerType  | filerType () const
Returns AcDb::kDeepCloneFiler. More...
virtual bool  | getNextOwnedObject (AcDbObjectId &)
Returns the next owned object of the object actually being cloned. More...
 virtual bool  | moreOwnedObjects () const
virtual Acad::ErrorStatus  | readAcDbHandle (AcDbHandle *)
Reads a handle value from the filer in pAcHandle. More...
virtual Acad::ErrorStatus  | readAddress (void **)
Reads the address value from the current filer. More...
virtual Acad::ErrorStatus  | readBChunk (ads_binary *)
Reads a binary data block from the filer. More...
virtual Acad::ErrorStatus  | readBool (bool *)
Reads the bool value of the current filer. More...
virtual Acad::ErrorStatus  | readBoolean (Adesk::Boolean *)
Reads a boolean from the filer. More...
virtual Acad::ErrorStatus  | readBytes (void *, Adesk::UIntPtr)
Reads the specified byte values from the current filer. More...
virtual Acad::ErrorStatus  | readDouble (double *)
Reads the double value of the current filer. More...
virtual Acad::ErrorStatus  | readHardOwnershipId (AcDbHardOwnershipId *)
Reads a hard ownership id from the filer. More...
virtual Acad::ErrorStatus  | readHardPointerId (AcDbHardPointerId *)
Returns the hard pointer id for the current filer. More...
virtual Acad::ErrorStatus  | readInt16 (Adesk::Int16 *)
Reads the 16-bit int value of the current filer. More...
virtual Acad::ErrorStatus  | readInt32 (Adesk::Int32 *)
Reads the int value of the current filer. More...
virtual Acad::ErrorStatus  | readInt64 (Adesk::Int64 *)
Reads a 64 bit integer value from the filer in pValue. More...
virtual Acad::ErrorStatus  | readInt8 (Adesk::Int8 *)
Reads the 8-bit int value of the current filer. More...
virtual Acad::ErrorStatus  | readPoint2d (AcGePoint2d *)
Reads the AcGePoint2d value of the current filer. More...
virtual Acad::ErrorStatus  | readPoint3d (AcGePoint3d *)
Reads a 3d point value from the filer in pAcHandle. More...
virtual Acad::ErrorStatus  | readScale3d (AcGeScale3d *)
Reads the AcGeScale3d value of the current filer. More...
virtual Acad::ErrorStatus  | readSoftOwnershipId (AcDbSoftOwnershipId *)
Reads the specified AcDbSoftOwnershipId value from the current filer. More...
virtual Acad::ErrorStatus  | readSoftPointerId (AcDbSoftPointerId *)
Returns the soft pointer id for the current filer. More...
virtual Acad::ErrorStatus  | readString (ACHAR **)
Returns the string in the current filer. More...
virtual Acad::ErrorStatus  | readString (AcString &)
Reads the AcString value of the current filer. More...
virtual Acad::ErrorStatus  | readUInt16 (Adesk::UInt16 *)
Reads the 16-bit value of the current filer. More...
virtual Acad::ErrorStatus  | readUInt32 (Adesk::UInt32 *)
Reads an integer value from the filer in pAcUInt32. More...
virtual Acad::ErrorStatus  | readUInt64 (Adesk::UInt64 *)
Reads an unsigned 64 bit integer value from the filer in pValue. More...
virtual Acad::ErrorStatus  | readUInt8 (Adesk::UInt8 *)
Reads the 8-bit value of the current filer. More...
virtual Acad::ErrorStatus  | readVector2d (AcGeVector2d *)
Reads the AcGeVector2d value of the current filer. More...
virtual Acad::ErrorStatus  | readVector3d (AcGeVector3d *)
Reads the AcGeVector3d value of the current filer. More...
virtual void  | resetFilerStatus ()
Sets filer status to Acad::eOk. More...
virtual Acad::ErrorStatus  | seek (Adesk::Int64, int)
Resets the filer the the position given in the arguments. More...
virtual void  | setFilerStatus (Acad::ErrorStatus)
Sets the filer status to given @es status. More...
virtual Adesk::Int64  | tell () const
Returns the current filer position. More...
virtual bool  | usesReferences () const
Returns whether the filer requires all ObjectID references filed by the object. More...
virtual Acad::ErrorStatus  | writeAcDbHandle (const AcDbHandle &)
Write the AcDbHandle value to the current filer. More...
virtual Acad::ErrorStatus  | writeAddress (const void *)
Write the address value to the current filer. More...
virtual Acad::ErrorStatus  | writeBChunk (const ads_binary &)
Writes a binary data block to the filer. More...
virtual Acad::ErrorStatus  | writeBool (bool)
Writes the bool value to the current filer. More...
virtual Acad::ErrorStatus  | writeBoolean (Adesk::Boolean)
Writes a boolean in the filer. More...
virtual Acad::ErrorStatus  | writeBytes (const void *, Adesk::UIntPtr)
Writes the specified byte values to the current filer. More...
virtual Acad::ErrorStatus  | writeDouble (double)
Writes the double value to the current filer. More...
virtual Acad::ErrorStatus  | writeHardOwnershipId (const AcDbHardOwnershipId &)
Writes a hard ownership id in the filer. More...
virtual Acad::ErrorStatus  | writeHardPointerId (const AcDbHardPointerId &)
Writes the specified hard pointer id to the current filer. More...
virtual Acad::ErrorStatus  | writeInt16 (Adesk::Int16)
Writes the 16-bit int value to the current filer. More...
virtual Acad::ErrorStatus  | writeInt32 (Adesk::Int32)
Writes the int value to the current filer. More...
virtual Acad::ErrorStatus  | writeInt64 (Adesk::Int64)
Writes a signed 64 bit integer value to the filer. More...
virtual Acad::ErrorStatus  | writeInt8 (Adesk::Int8)
Writes the 8-bit int value to the current filer. More...
virtual Acad::ErrorStatus  | writePoint2d (const AcGePoint2d &)
Writes the AcGePoint2d value to the current filer. More...
virtual Acad::ErrorStatus  | writePoint3d (const AcGePoint3d &)
Writes the point acPoint to the filer. More...
virtual Acad::ErrorStatus  | writeScale3d (const AcGeScale3d &)
Writes the AcGeScale3d value to the current filer. More...
virtual Acad::ErrorStatus  | writeSoftOwnershipId (const AcDbSoftOwnershipId &)
Reads the specified AcDbSoftOwnershipId value from the current filer. More...
virtual Acad::ErrorStatus  | writeSoftPointerId (const AcDbSoftPointerId &)
Writes the specified soft pointer id to the current filer. More...
virtual Acad::ErrorStatus  | writeString (const ACHAR *)
Writes the string to the current filer. More...
virtual Acad::ErrorStatus  | writeString (const AcString &)
Writes the AcString value to the current filer. More...
virtual Acad::ErrorStatus  | writeUInt16 (Adesk::UInt16)
Writes the 16-bit value to the current filer. More...
virtual Acad::ErrorStatus  | writeUInt32 (Adesk::UInt32)
Writes the int acUInt32 to the filer. More...
virtual Acad::ErrorStatus  | writeUInt64 (Adesk::UInt64)
Writes an unsigned 64 bit integer value to the filer. More...
virtual Acad::ErrorStatus  | writeUInt8 (Adesk::UInt8)
Writes the 8-bit value to the current filer. More...
virtual Acad::ErrorStatus  | writeVector2d (const AcGeVector2d &)
Writes the AcGeVector2d value to the current filer. More...
virtual Acad::ErrorStatus  | writeVector3d (const AcGeVector3d &)
Writes the AcGeVector3d value to the current filer. More...
 virtual  | ~AcDbDeepCloneFiler ()
Destructor.
 Public Member Functions inherited from AcDbDwgFiler
AcDbDatabase *  | database () const
_LINUXMAC64 More...
virtual Acad::ErrorStatus  | dwgVersion (AcDb::AcDbDwgVersion &, AcDb::MaintenanceReleaseVersion &) const
Returns the drawing version in the output parameters major and minor. More...
virtual Acad::ErrorStatus  | filerStatus () const =0
virtual AcDb::FilerType  | filerType () const =0
 virtual AcDbAuditInfo *  | getAuditInfo () const
Not implemented yet.
virtual Acad::ErrorStatus  | readAcDbHandle (AcDbHandle *)=0
Reads the AcDbHandle value of the current filer. More...
virtual Acad::ErrorStatus  | readAddress (void **)
Reads the address value from the current filer. More...
virtual Acad::ErrorStatus  | readBChunk (ads_binary *)=0
Reads a binary data block from the filer. More...
virtual Acad::ErrorStatus  | readBool (bool *)=0
Reads the bool value of the current filer. More...
virtual Acad::ErrorStatus  | readBoolean (Adesk::Boolean *)=0
virtual Acad::ErrorStatus  | readBytes (void *, Adesk::UIntPtr)=0
Reads the number of byte values from the current filer. More...
 Acad::ErrorStatus  | readChar (Adesk::Int8 *)
virtual Acad::ErrorStatus  | readDouble (double *)=0
Reads the double value of the current filer. More...
virtual Acad::ErrorStatus  | readHardOwnershipId (AcDbHardOwnershipId *)=0
Reads an hard ownership id from the filer. More...
virtual Acad::ErrorStatus  | readHardPointerId (AcDbHardPointerId *)=0
Returns the hard pointer id for the current filer. More...
virtual Acad::ErrorStatus  | readInt16 (Adesk::Int16 *)=0
Reads the 16-bit int value of the current filer. More...
virtual Acad::ErrorStatus  | readInt32 (Adesk::Int32 *)=0
virtual Acad::ErrorStatus  | readInt64 (Adesk::Int64 *)=0
virtual Acad::ErrorStatus  | readInt8 (Adesk::Int8 *)=0
Reads the 8-bit int value of the current filer. More...
 Acad::ErrorStatus  | readItem (AcDbHandle *)
 Acad::ErrorStatus  | readItem (AcDbHardOwnershipId *)
 Acad::ErrorStatus  | readItem (AcDbHardPointerId *)
 Acad::ErrorStatus  | readItem (AcDbSoftOwnershipId *)
 Acad::ErrorStatus  | readItem (AcDbSoftPointerId *)
 Acad::ErrorStatus  | readItem (AcGePoint2d *)
 Acad::ErrorStatus  | readItem (AcGePoint3d *)
 Acad::ErrorStatus  | readItem (AcGeScale3d *)
 Acad::ErrorStatus  | readItem (AcGeVector2d *)
 Acad::ErrorStatus  | readItem (AcGeVector3d *)
 Acad::ErrorStatus  | readItem (ACHAR **)
 Acad::ErrorStatus  | readItem (Adesk::Boolean *)
 Acad::ErrorStatus  | readItem (Adesk::Int16 *)
 Acad::ErrorStatus  | readItem (Adesk::Int32 *)
 Acad::ErrorStatus  | readItem (Adesk::Int64 *)
 Acad::ErrorStatus  | readItem (Adesk::Int8 *)
 Acad::ErrorStatus  | readItem (Adesk::UInt16 *)
 Acad::ErrorStatus  | readItem (Adesk::UInt32 *)
 Acad::ErrorStatus  | readItem (Adesk::UInt64 *)
 Acad::ErrorStatus  | readItem (Adesk::UInt8 *)
 Acad::ErrorStatus  | readItem (ads_binary *)
 Acad::ErrorStatus  | readItem (bool *)
 Acad::ErrorStatus  | readItem (double *)
 Acad::ErrorStatus  | readItem (void **)
 Acad::ErrorStatus  | readItem (void *, Adesk::ULongPtr)
virtual Acad::ErrorStatus  | readPoint2d (AcGePoint2d *)=0
Reads the AcGePoint2d value of the current filer. More...
virtual Acad::ErrorStatus  | readPoint3d (AcGePoint3d *)=0
virtual Acad::ErrorStatus  | readScale3d (AcGeScale3d *)=0
Reads the AcGeScale3d value of the current filer. More...
virtual Acad::ErrorStatus  | readSoftOwnershipId (AcDbSoftOwnershipId *)=0
Reads the AcDbSoftOwnershipId value from the current filer. More...
virtual Acad::ErrorStatus  | readSoftPointerId (AcDbSoftPointerId *)=0
Returns the soft pointer id for the current filer. More...
virtual Acad::ErrorStatus  | readString (ACHAR **)=0
virtual Acad::ErrorStatus  | readString (AcString &)=0
Reads the AcString value of the current filer. More...
virtual Acad::ErrorStatus  | readUInt16 (Adesk::UInt16 *)=0
Reads the 16-bit value of the current filer. More...
virtual Acad::ErrorStatus  | readUInt32 (Adesk::UInt32 *)=0
virtual Acad::ErrorStatus  | readUInt64 (Adesk::UInt64 *)=0
virtual Acad::ErrorStatus  | readUInt8 (Adesk::UInt8 *)=0
Reads the 8-bit value of the current filer. More...
virtual Acad::ErrorStatus  | readVector2d (AcGeVector2d *)=0
Reads the AcGeVector2d value of the current filer. More...
virtual Acad::ErrorStatus  | readVector3d (AcGeVector3d *)=0
Reads the AcGeVector3d value of the current filer. More...
virtual void  | resetFilerStatus ()=0
virtual Acad::ErrorStatus  | seek (Adesk::Int64, int)=0
Not implemented yet. More...
virtual void  | setFilerStatus (Acad::ErrorStatus)=0
Sets the filer status to given @es status. More...
virtual Adesk::Int64  | tell () const =0
Returns the current filer position. More...
virtual bool  | usesReferences () const
Returns whether the filer requires all ObjectID references filed by the object. More...
virtual Acad::ErrorStatus  | writeAcDbHandle (const AcDbHandle &)=0
Writes the AcDbHandle value to the current filer. More...
virtual Acad::ErrorStatus  | writeAddress (const void *)
Write the address value to the current filer. More...
virtual Acad::ErrorStatus  | writeBChunk (const ads_binary &)=0
Writes a binary data block to the filer. More...
virtual Acad::ErrorStatus  | writeBool (bool)=0
Writes the bool value to the current filer. More...
virtual Acad::ErrorStatus  | writeBoolean (Adesk::Boolean)=0
virtual Acad::ErrorStatus  | writeBytes (const void *, Adesk::UIntPtr)=0
Writes the number of byte values to the current filer. More...
 Acad::ErrorStatus  | writeChar (Adesk::Int8)
virtual Acad::ErrorStatus  | writeDouble (double)=0
Writes the double value to the current filer. More...
virtual Acad::ErrorStatus  | writeHardOwnershipId (const AcDbHardOwnershipId &)=0
Writes the hard owner ship id in the filer. More...
virtual Acad::ErrorStatus  | writeHardPointerId (const AcDbHardPointerId &)=0
Writes the specified hard pointer id to the current filer. More...
virtual Acad::ErrorStatus  | writeInt16 (Adesk::Int16)=0
Writes the 16-bit int value to the current filer. More...
virtual Acad::ErrorStatus  | writeInt32 (Adesk::Int32)=0
virtual Acad::ErrorStatus  | writeInt64 (Adesk::Int64)=0
virtual Acad::ErrorStatus  | writeInt8 (Adesk::Int8)=0
Writes the 8-bit int value to the current filer. More...
 Acad::ErrorStatus  | writeItem (Adesk::Boolean)
 Acad::ErrorStatus  | writeItem (Adesk::Int16)
 Acad::ErrorStatus  | writeItem (Adesk::Int32)
 Acad::ErrorStatus  | writeItem (Adesk::Int64)
 Acad::ErrorStatus  | writeItem (Adesk::Int8)
 Acad::ErrorStatus  | writeItem (Adesk::UInt16)
 Acad::ErrorStatus  | writeItem (Adesk::UInt32)
 Acad::ErrorStatus  | writeItem (Adesk::UInt64)
 Acad::ErrorStatus  | writeItem (Adesk::UInt8)
 Acad::ErrorStatus  | writeItem (bool)
 Acad::ErrorStatus  | writeItem (const AcDbHandle &)
 Acad::ErrorStatus  | writeItem (const AcDbHardOwnershipId &)
 Acad::ErrorStatus  | writeItem (const AcDbHardPointerId &)
 Acad::ErrorStatus  | writeItem (const AcDbSoftOwnershipId &)
 Acad::ErrorStatus  | writeItem (const AcDbSoftPointerId &)
 Acad::ErrorStatus  | writeItem (const AcGePoint2d &)
 Acad::ErrorStatus  | writeItem (const AcGePoint3d &)
 Acad::ErrorStatus  | writeItem (const AcGeScale3d &)
 Acad::ErrorStatus  | writeItem (const AcGeVector2d &)
 Acad::ErrorStatus  | writeItem (const AcGeVector3d &)
 Acad::ErrorStatus  | writeItem (const ACHAR *)
 Acad::ErrorStatus  | writeItem (const ads_binary &)
 Acad::ErrorStatus  | writeItem (const void *)
 Acad::ErrorStatus  | writeItem (const void *, Adesk::ULongPtr)
 Acad::ErrorStatus  | writeItem (double)
virtual Acad::ErrorStatus  | writePoint2d (const AcGePoint2d &)=0
Writes the AcGePoint2d value to the current filer. More...
virtual Acad::ErrorStatus  | writePoint3d (const AcGePoint3d &)=0
virtual Acad::ErrorStatus  | writeScale3d (const AcGeScale3d &)=0
Writes the AcGeScale3d value to the current filer. More...
virtual Acad::ErrorStatus  | writeSoftOwnershipId (const AcDbSoftOwnershipId &)=0
Writes the AcDbSoftOwnershipId value to the current filer. More...
virtual Acad::ErrorStatus  | writeSoftPointerId (const AcDbSoftPointerId &)=0
Writes the specified soft pointer id to the current filer. More...
virtual Acad::ErrorStatus  | writeString (const ACHAR *)=0
virtual Acad::ErrorStatus  | writeString (const AcString &)=0
Writes the AcString value to the current filer. More...
virtual Acad::ErrorStatus  | writeUInt16 (Adesk::UInt16)=0
Writes the 16-bit value to the current filer. More...
virtual Acad::ErrorStatus  | writeUInt32 (Adesk::UInt32)=0
virtual Acad::ErrorStatus  | writeUInt64 (Adesk::UInt64)=0
virtual Acad::ErrorStatus  | writeUInt8 (Adesk::UInt8)=0
Writes the 8-bit value to the current filer. More...
virtual Acad::ErrorStatus  | writeVector2d (const AcGeVector2d &)=0
Writes the AcGeVector2d value to the current filer. More...
virtual Acad::ErrorStatus  | writeVector3d (const AcGeVector3d &)=0
Writes the AcGeVector3d value to the current filer. More...
 virtual  | ~AcDbDwgFiler ()
Destructor.
 Public Member Functions inherited from AcRxObject
virtual AcRxObject *  | clone () const
Exported and implemented. More...
 virtual AcRx::Ordering  | comparedTo (const AcRxObject *) const
Exported and implemented.
virtual Acad::ErrorStatus  | copyFrom (const AcRxObject *)
Exported and implemented. More...
 virtual AcRxClass *  | isA () const
Exported and implemented.
virtual Adesk::Boolean  | isEqualTo (const AcRxObject *) const
Exported and implemented. More...
bool  | isKindOf (const AcRxClass *) const
Checks the object class. More...
AcRxObject *  | queryX (const AcRxClass *) const
returns the protocol extension object assigned to this class or a parent class. More...
AcRxObject *  | x (const AcRxClass *) const
returns the protocol extension object assigned to this class or a parent class. More...
 virtual  | ~AcRxObject ()
Destructor.
 Public Attributes
AcDbWblockCloneFiler
Default constructor.
 Public Attributes inherited from AcDbDeepCloneFiler
AcDbDeepCloneFiler
Constructor.
 Public Attributes inherited from AcDbDwgFiler
AcDbDwgFiler
Constructor.
 Additional Inherited Members
 Static Public Member Functions inherited from AcRxObject
 static AcRxObject *  | cast (const AcRxObject *)
 static AcRxClass *  | desc ()
Exported and implemented.
 Protected Member Functions inherited from AcRxObject
AcRxObject ()
Exported and implemented.
Detailed Description
_
Member Function Documentation
◆ filerType()
 UX_EXPORT_FUNCTION AcDb::FilerType AcDbWblockCloneFiler::filerType  |  ( |   | ) |   const
virtual
Returns AcDb::kWblockCloneFiler.
Returns
AcDb::kWblockCloneFiler
Reimplemented from AcDbDeepCloneFiler.
◆ getNextHardObject()
 UX_EXPORT_FUNCTION bool AcDbWblockCloneFiler::getNextHardObject  |  ( |  AcDbObjectId &  |  acObjId | )
virtual
Returns the next referenced object ID in the queue of object IDs.
Parameters
[out] | acObjId | object id of the next hard referenced object in the queue
Returns
true, if there is at least one object ID in the queue false, otherwise
◆ usesReferences()
 bool AcDbWblockCloneFiler::usesReferences  |  ( |   | ) |   const
virtual
Reimplemented from AcDbDeepCloneFiler.