Public Member Functions | Protected Member Functions | List of all members
AcDbObject Class Reference
_ More...
#include <AcDbObject.h>
 Public Member Functions
virtual Acad::ErrorStatus  | addPersistentReactor (AcDbObjectId)
Adds a persistent reactor to this object reactor list. More...
Acad::ErrorStatus  | addReactor (AcDbObjectReactor *) const
Adds a transient reactor to this object. More...
virtual Acad::ErrorStatus  | applyPartialUndo (AcDbDwgFiler *, AcRxClass *)
This function is called during Undo operations on objects, that use the 'Partial Undo meachanism'; this is, this object is opened with assertWriteEnabled(Adesk::kFalse) to indicate that custom Undo filing is used rather than the default Undo filing. More...
 void  | assertNotifyEnabled () const
 void  | assertReadEnabled () const
 void  | assertWriteEnabled (Adesk::Boolean=Adesk::kTrue, Adesk::Boolean=Adesk::kTrue)
virtual Acad::ErrorStatus  | audit (AcDbAuditInfo *)
Performs the audit operation for this object. More...
Acad::ErrorStatus  | cancel ()
Reverts all changes since the object had been opened and closes the object. More...
virtual void  | cancelled (const AcDbObject *)
A handler function for persistent reactors. More...
virtual AcRxObject *  | clone () const
Creates a shallow clone of this object. More...
Acad::ErrorStatus  | close ()
Closes the object. More...
Acad::ErrorStatus  | closeAndPage (Adesk::Boolean=Adesk::kTrue)
Closes the object. More...
virtual Acad::ErrorStatus  | composeForLoad (AcDb::OdaSaveType, AcDb::AcDbDwgVersion)
This function is intended for future MT file loading support. More...
virtual void  | copied (const AcDbObject *, const AcDbObject *)
A handler function for persistent reactors. More...
virtual Acad::ErrorStatus  | copyFrom (const AcRxObject *)
Copies the pSrc object information in this object. More...
Acad::ErrorStatus  | createExtensionDictionary ()
Creates a dictionary as extension dictionary for this object. More...
AcDbDatabase *  | database () const
Returns the database that contains this object. More...
virtual Acad::ErrorStatus  | decomposeForSave (AcDb::AcDbDwgVersion, AcDbObject *&, AcDbObjectId &, Adesk::Boolean &)
This function is called during dwg and dxf output, to allow a custom object to decompose itself, due to provided dwg/dxf target file version. More...
virtual Acad::ErrorStatus  | deepClone (AcDbObject *, AcDbObject *&, AcDbIdMapping &, Adesk::Boolean=Adesk::kTrue) const final
Clones this object, appends it to the owner pOwner and adds an AcDbIdPair record to the idMap. More...
void  | disableUndoRecording (Adesk::Boolean)
Disables or enables the undo recording for the object. More...
Acad::ErrorStatus  | downgradeOpen ()
Sets the open mode for an object opened for write to be opened for read. More...
Acad::ErrorStatus  | downgradeToNotify (Adesk::Boolean)
Sets the open mode for an object opened for write to be opened for notify. More...
virtual AcGiDrawable *  | drawable ()
Retrieves the AcGiDrawable instance of this object. More...
Acad::ErrorStatus  | dwgIn (AcDbDwgFiler *)
Calls the object's dwgInFields function, and reads any XData if present. More...
virtual Acad::ErrorStatus  | dwgInFields (AcDbDwgFiler *)
Reads the object from the DWG filer. More...
Acad::ErrorStatus  | dwgOut (AcDbDwgFiler *) const
Calls the object's dwgOutFields function, and writes any XData if present. More...
virtual Acad::ErrorStatus  | dwgOutFields (AcDbDwgFiler *) const
Writes the object to the DWG filer. More...
Acad::ErrorStatus  | dxfIn (AcDbDxfFiler *)
Calls the object's dxfInFields function, and reads any XData if present. More...
virtual Acad::ErrorStatus  | dxfInFields (AcDbDxfFiler *)
Reads the object from the DXF filer. More...
Acad::ErrorStatus  | dxfOut (AcDbDxfFiler *, Adesk::Boolean, Adesk::uchar *) const
Calls the object's dxfOutFields function, and writes any XData if present. More...
virtual Acad::ErrorStatus  | dxfOutFields (AcDbDxfFiler *) const
Writes the object to the DXF filer. More...
Acad::ErrorStatus  | erase (Adesk::Boolean=Adesk::kTrue)
Sets the bit that indicates that the object is erased. More...
virtual void  | erased (const AcDbObject *, Adesk::Boolean)
A handler function for persistent reactors. More...
AcDbObjectId  | extensionDictionary () const
Returns the object id of the extension dictionary for this object. More...
void  | getAcDbHandle (AcDbHandle &) const
Returns handle of this object. More...
Acad::ErrorStatus  | getBinaryData (const ACHAR *, Adesk::Int32 &, char *&) const
Creates a copy of the binary data stored as chunks of maximum 127 bytes in the resbuf chain of this object's extension dictionary xrecord entry given by entryName. More...
int  | getBrxOpenCount () const
This function returns the number of open BRX instances for this object. More...
int  | getBrxOpenState () const
This function returns the BRX object open state flags as bitfields, for diagnostic purpose. More...
virtual Acad::ErrorStatus  | getClassID (CLSID *) const final
Gets the COM wrapper Class ID for this entity. More...
int  | getCustomObjectState () const
This function returns the custom object status : 1=isCustomObject 2=DifferentialUndoDisabled. More...
Acad::ErrorStatus  | getField (const ACHAR *, AcDbField *&, AcDb::OpenMode) const
Retrieves the specified Field from this object, and opens it in mode. More...
Acad::ErrorStatus  | getField (const ACHAR *, AcDbObjectId &) const
Gets the pszPropName field object from field dictionary of this AcDbObject object, using pszPropName as key. More...
AcDbObjectId  | getFieldDictionary () const
Returns the Field dictionary associated with this object,. More...
Acad::ErrorStatus  | getFieldDictionary (AcDbDictionary *&, AcDb::OpenMode) const
Gets and opens the field dictionary for this. More...
Acad::ErrorStatus  | getObjectBirthVersion (AcDb::AcDbDwgVersion &, AcDb::MaintenanceReleaseVersion &)
This function is currently not supported by the CAD engine, always returns Acad::eOk, and 'kDHL_CURRENT' + 'kMReleaseCurrent' results. More...
virtual Acad::ErrorStatus  | getObjectSaveVersion (const AcDbDwgFiler *, AcDb::AcDbDwgVersion &, AcDb::MaintenanceReleaseVersion &)
Returns the DWG version for saving the object. More...
virtual Acad::ErrorStatus  | getObjectSaveVersion (const AcDbDxfFiler *, AcDb::AcDbDwgVersion &, AcDb::MaintenanceReleaseVersion &)
Returns the DWG version for saving the object. More...
int  | getOdaOpenCount () const
This function returns the number of open ODA instances for this object. More...
int  | getOdaOpenState () const
This function returns the ODA object open state flags as bitfields, for diagnostic purpose. More...
virtual void  | goodbye (const AcDbObject *)
A handler function for persistent reactors. More...
Acad::ErrorStatus  | handOverTo (AcDbObject *, Adesk::Boolean=Adesk::kTrue, Adesk::Boolean=Adesk::kTrue)
Hands over objects identity to another object. More...
bool  | hasFields () const
Return true if this object has single or multiple fields associated with him. More...
bool  | hasPersistentReactor (AcDbObjectId) const
Checks the input objectId in this object reactor list. More...
bool  | hasSaveVersionOverride ()
This function indicates whether this object overrides the filer's save version. More...
virtual AcDbObjectId  | id () const
Returns the database id of this object. More...
Adesk::Boolean  | isAcDbObjectIdsInFlux () const
Checks whether a deep clone operation was completed. More...
Adesk::Boolean  | isAProxy () const
Adesk::Boolean  | isCancelling () const
Adesk::Boolean  | isErased () const
Returns whether this object is erased. More...
Adesk::Boolean  | isEraseStatusToggled () const
Checks whether the object erase status has been toggled. More...
Adesk::Boolean  | isModified () const
Returns whether this object's assertWriteEnabled() has been called since it was opened. More...
Adesk::Boolean  | isModifiedGraphics () const
Checks whether this object graphics will be updated when the object is closed. More...
Adesk::Boolean  | isModifiedXData () const
Checks whether this object's xData was modified. More...
Adesk::Boolean  | isNewObject () const
Returns true if and only if this object has not been closed since it was created. More...
Adesk::Boolean  | isNotifyEnabled () const
Returns whether this object is opened for notify. More...
Adesk::Boolean  | isNotifying () const
virtual Adesk::Boolean  | isPersistent () const
Returns the 'persistent' status of a database object. More...
Adesk::Boolean  | isReadEnabled () const
Returns whether this object is opened for read. More...
 Adesk::Boolean  | isReallyClosing () const
Checks whether the next close call will completely close this object return true if on the next call the object will be completely closed false otherwise.
Adesk::Boolean  | isTransactionResident () const
Gets the object transaction status. More...
Adesk::Boolean  | isUndoing () const
bool  | isUndoRecordingDisabled () const
Returns whether the undo recording for the object is enabled or not. More...
Adesk::Boolean  | isWriteEnabled () const
Returns whether this object is opened for write. More...
virtual AcDb::DuplicateRecordCloning  | mergeStyle () const
Returns the object's merge behavior during cloning. More...
virtual void  | modified (const AcDbObject *)
A handler function for persistent reactors. More...
virtual void  | modifiedGraphics (const AcDbEntity *)
A handler function for persistent reactors. More...
virtual void  | modifiedXData (const AcDbObject *)
A handler function for persistent reactors. More...
virtual void  | modifyUndone (const AcDbObject *)
A handler function for persistent reactors. More...
virtual void  | objectClosed (const AcDbObjectId)
A handler function for persistent reactors. More...
AcDbObjectId  | objectId () const
Returns object id. More...
virtual void  | openedForModify (const AcDbObject *)
A handler function for persistent reactors. More...
AcDbObjectId  | ownerId () const
Returns object id of the owner. More...
AcDbVoidPtrArray *  | reactors ()
Gets the object pointers to reactors. More...
const AcDbVoidPtrArray *  | reactors () const
Gets the object pointers to reactors. More...
virtual void  | reappended (const AcDbObject *)
A handler function for persistent reactors. More...
 virtual void  | recvPropagateModify (const AcDbObject *)
Not implemented yet.
Acad::ErrorStatus  | releaseExtensionDictionary ()
Removes the extension dictionary associated with this object. More...
virtual Acad::ErrorStatus  | removeField (AcDbObjectId)
Removes the Field specified by acFieldId from this object. More...
virtual Acad::ErrorStatus  | removeField (const ACHAR *)
Removes the Field specified by szKeyString from this object. More...
virtual Acad::ErrorStatus  | removeField (const ACHAR *, AcDbObjectId &)
Removes the Field specified by acPszKeyString from this object, and returns its ObjectId value. More...
virtual Acad::ErrorStatus  | removePersistentReactor (AcDbObjectId)
Removes a persistent reactor from this object reactor list. More...
Acad::ErrorStatus  | removeReactor (AcDbObjectReactor *) const
Removes a transient reactor to this object. More...
void  | setAcDbObjectIdsInFlux ()
Call this function to indicate that the object IDs of this object and its sub-objects (if any) are not yet valid. More...
Acad::ErrorStatus  | setBinaryData (const ACHAR *, Adesk::Int32, const char *)
Creates a copy of the binary data, divides it in up to 127 bytes binary chunks and
 sets them as resbufs in the resbuf chain of this object's extension dictionary xrecord entry given by entryName. More...
virtual Acad::ErrorStatus  | setField (const ACHAR *, AcDbField *, AcDbObjectId &)
Adds the pAcField field object to field dictionary of this AcDbObject object, using pKey as key. More...
void  | setHasSaveVersionOverride (bool)
This function can be called to specify that the object has a "save version override". More...
virtual Acad::ErrorStatus  | setOwnerId (AcDbObjectId)
Sets the ownerId data member of the object to be objId. More...
virtual Acad::ErrorStatus  | setXData (const resbuf *)
Sets/removes xData associated with this object. More...
virtual Acad::ErrorStatus  | subCancel ()
Possibility to veto a cancel operation from within custom entities. More...
virtual Acad::ErrorStatus  | subClose ()
virtual Acad::ErrorStatus  | subErase (Adesk::Boolean)
This hook is called during an AcDbObject::erase call, before any actual erase operation is performed. More...
 virtual Acad::ErrorStatus  | subHandOverTo (AcDbObject *)
virtual void  | subObjModified (const AcDbObject *, const AcDbObject *)
A handler function for persistent reactors. More...
 virtual Acad::ErrorStatus  | subOpen (AcDb::OpenMode)
virtual Acad::ErrorStatus  | subSwapIdWith (AcDbObjectId, Adesk::Boolean=Adesk::kFalse, Adesk::Boolean=Adesk::kFalse)
This hook is called during an AcDbObject::swapIdWith() call, before any actual swap operation is performed. More...
Acad::ErrorStatus  | swapIdWith (AcDbObjectId, Adesk::Boolean=Adesk::kFalse, Adesk::Boolean=Adesk::kFalse)
Swaps the object id's between the object identified by param swapId and this object. More...
virtual Acad::ErrorStatus  | swapReferences (const AcDbIdMapping &)
Not implemented yet. More...
virtual void  | unappended (const AcDbObject *)
A handler function for persistent reactors. More...
AcDbDwgFiler *  | undoFiler ()
Gets the undo filer for this object. More...
Acad::ErrorStatus  | upgradeFromNotify (Adesk::Boolean &)
Upgrades the open status of this object to AcDb::kForWrite, if this object is already open (either in AcDb::kForRead, AcDb::kForNotify or AcDb::kForWrite) More...
Acad::ErrorStatus  | upgradeOpen ()
Changes the objects open mode to AcDb::kForWrite and sends notifications. More...
virtual Acad::ErrorStatus  | wblockClone (AcRxObject *, AcDbObject *&, AcDbIdMapping &, Adesk::Boolean=Adesk::kTrue) const final
Clones this object, appends it to the owner pOwner and adds an AcDbIdPair record to the idMap. More...
virtual resbuf *  | xData (const ACHAR *=NULL) const
Returns the xData associated with this object. More...
Acad::ErrorStatus  | xDataTransformBy (const AcGeMatrix3d &)
Transforms the extended data according to parameter transformation matrix. More...
 virtual void  | xmitPropagateModify () const
Not implemented yet.
 virtual  | ~AcDbObject ()
Destructor.
 Public Member Functions inherited from AcGiDrawable
virtual bool  | bounds (AcDbExtents &) const
virtual DrawableType  | drawableType () const
 virtual AcGiDrawStream *  | drawStream () const
 AcGsNode *  | gsNode () const
virtual AcDbObjectId  | id () const =0
virtual Adesk::Boolean  | isPersistent () const =0
virtual Adesk::UInt32  | regenSupportFlags () const final
Returns whether and to which level this object supports MultiThreading. More...
 virtual Adesk::Boolean  | RolloverHit (Adesk::ULongPtr, Adesk::ULongPtr, Adesk::Boolean)
 virtual Adesk::UInt32  | setAttributes (AcGiDrawableTraits *) final
 virtual void  | setDrawStream (AcGiDrawStream *)
 void  | setGsNode (AcGsNode *)
 virtual void  | viewportDraw (AcGiViewportDraw *) final
 virtual Adesk::UInt32  | viewportDrawLogicalFlags (AcGiViewportDraw *) final
 virtual Adesk::Boolean  | worldDraw (AcGiWorldDraw *) final
 Public Member Functions inherited from AcRxObject
virtual AcRxObject *  | clone () const
Exported and implemented. More...
 virtual AcRx::Ordering  | comparedTo (const AcRxObject *) const
Exported and implemented.
virtual Acad::ErrorStatus  | copyFrom (const AcRxObject *)
Exported and implemented. More...
 virtual AcRxClass *  | isA () const
Exported and implemented.
virtual Adesk::Boolean  | isEqualTo (const AcRxObject *) const
Exported and implemented. More...
bool  | isKindOf (const AcRxClass *) const
Checks the object class. More...
AcRxObject *  | queryX (const AcRxClass *) const
returns the protocol extension object assigned to this class or a parent class. More...
AcRxObject *  | x (const AcRxClass *) const
returns the protocol extension object assigned to this class or a parent class. More...
 virtual  | ~AcRxObject ()
Destructor.
 Protected Member Functions
virtual Acad::ErrorStatus  | subDeepClone (AcDbObject *, AcDbObject *&, AcDbIdMapping &, Adesk::Boolean=true) const
virtual Acad::ErrorStatus  | subGetClassID (CLSID *) const
virtual Adesk::UInt32  | subSetAttributes (AcGiDrawableTraits *)
Sets the values of this object's subentity traits and returns with the calling object's subentity traits. More...
virtual void  | subViewportDraw (AcGiViewportDraw *)
virtual Adesk::UInt32  | subViewportDrawLogicalFlags (AcGiViewportDraw *)
virtual Acad::ErrorStatus  | subWblockClone (AcRxObject *, AcDbObject *&, AcDbIdMapping &, Adesk::Boolean=true) const
virtual Adesk::Boolean  | subWorldDraw (AcGiWorldDraw *)
 Protected Member Functions inherited from AcGiDrawable
virtual Adesk::UInt32  | subRegenSupportFlags () const
Returns whether and to which level this object supports MultiThreading. More...
virtual Adesk::UInt32  | subSetAttributes (AcGiDrawableTraits *)=0
virtual void  | subViewportDraw (AcGiViewportDraw *)=0
 virtual Adesk::UInt32  | subViewportDrawLogicalFlags (AcGiViewportDraw *)
virtual Adesk::Boolean  | subWorldDraw (AcGiWorldDraw *)=0
 Protected Member Functions inherited from AcRxObject
AcRxObject ()
Exported and implemented.
 Additional Inherited Members
 Public Types inherited from AcGiDrawable
enum  | DrawableType {
 kGeometry = 0 , kDistantLight , kPointLight , kSpotLight ,
 kAmbientLight , kSolidBackground , kGradientBackground , kImageBackground ,
 kGroundPlaneBackground , kViewport
 }
enum  | SetAttributesFlags {
 kDrawableNone = 0 , kDrawableIsAnEntity = 1 , kDrawableUsesNesting = 2 , kDrawableIsCompoundObject = 4 ,
 kDrawableViewIndependentViewportDraw = 8 , kDrawableIsInvisible = 16 , kDrawableHasAttributes = 32 , kDrawableRegenTypeDependentGeometry = 64 ,
 kDrawableIsDimension = 133 , kDrawableRegenDraw = 256 , kDrawableStandardDisplaySingleLOD = 512 , kDrawableShadedDisplaySingleLOD = 1024 ,
 kDrawableViewDependentViewportDraw = 2048 , kDrawableBlockDependentViewportDraw = 4096 , kDrawableIsExternalReference = 8192 , kDrawableNotPlottable = 16384 ,
 kDrawableNotAllowLCS = 32768 , kDrawableMergeControlOff = 65536 , kThreadedWorldDrawViewportDraw = 131072
 }
 Static Public Member Functions inherited from AcRxObject
 static AcRxObject *  | cast (const AcRxObject *)
 static AcRxClass *  | desc ()
Exported and implemented.
 Static Public Member Functions inherited from AcHeapOperators
 static void  | operator delete (void *)
_
 static void  | operator delete (void *, const char *, int)
 static void  | operator delete (void *, void *)
 static void  | operator delete[] (void *)
_
 static void  | operator delete[] (void *, const char *, int)
 static void *  | operator new (size_t)
_
 static void *  | operator new (size_t, const char *, int)
 static void *  | operator new (size_t, void *p)
 static void *  | operator new[] (size_t)
_
 static void *  | operator new[] (size_t, const char *, int)
Detailed Description
_
Member Function Documentation
◆ addPersistentReactor()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbObject::addPersistentReactor  |  ( |  AcDbObjectId  |  reactorId | )
virtual
Adds a persistent reactor to this object reactor list.
Parameters
[in] | reactorId | id of the persistent reactor
Returns
Acad::eOk if successful, Error Status otherwise
◆ addReactor()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbObject::addReactor  |  ( |  AcDbObjectReactor *  |  pAcReactor | ) |   const
Adds a transient reactor to this object.
Parameters
[in] | pAcReactor | the transient reactor to add
Returns
Acad::eOk if successful, Error Status otherwise
◆ applyPartialUndo()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbObject::applyPartialUndo  |  ( |  AcDbDwgFiler *  |  pFiler,
|  AcRxClass *  |  classDesc
)
virtual
This function is called during Undo operations on objects, that use the 'Partial Undo meachanism'; this is, this object is opened with assertWriteEnabled(Adesk::kFalse) to indicate that custom Undo filing is used rather than the default Undo filing.
Default implementation for AcDbObject does nothing than return Acad::eOk.
Parameters
[in] | pFiler | filer object used for Undo filing
[in] | classDesc | specifies the class object type that is intended to handle the Undo operation; can be used for validity checking
Returns
Acad::eOk if successful
Reimplemented in AcDbEntity, AcDbGroup, AcDbPolyline, and AcDbSortentsTable.
◆ audit()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbObject::audit  |  ( |  AcDbAuditInfo *  |  pAcAuditInfo | )
virtual
Performs the audit operation for this object.
Parameters
[in] | pAcAuditInfo | audit info object
Returns
Acad::eOk if successful
Reimplemented in AcDbDataTable, AcDbEntity, AcDbMPolygon, AcDbSortentsTable, AcDbTable, and AcDbTableStyle.
◆ cancel()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbObject::cancel  |  ( |   | )
Reverts all changes since the object had been opened and closes the object.
Can be aborted with on subCancel for custom entities.
Returns
Acad::eOk, if cancelling was successful, error status else.
Remarks
this function will not work for custom objects
◆ cancelled()
 UX_EXPORT_FUNCTION void AcDbObject::cancelled  |  ( |  const AcDbObject *  |  pObject | )
virtual
A handler function for persistent reactors.
This object is notified that another object has cancelled its open operation. For the event to be fired, this object must make part of the other object's list of persistent reactors. The method is usually overridden by custom objects. The default implementation does nothing.
Parameters
[in] | pObject | the original object that was copied
◆ clone()
 UX_EXPORT_FUNCTION AcRxObject * AcDbObject::clone  |  ( |   | ) |   const
virtual
Creates a shallow clone of this object.
Returns
A pointer to the clone object, or NULL if the clone operation failed
Reimplemented from AcRxObject.
Reimplemented in AcDbWipeout.
◆ close()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbObject::close  |  ( |   | )
Closes the object.
If the object is database resident, all changes are done. All appropriate notifications are sent. If the object is already notifying, the function does not close again. If the object is NOT database resident, call delete instead of close, otherwise your application is causing a memory leak. On database resident objects, never call delete, always use close.
Returns
Acad::eNoDatabase, if object is not database resident
 Acad::eCloseWasNotifying, if the object is already notifying
 return code of subclose() if this subfunction does not return Acad::eOk
 Acad::eOk, else
◆ closeAndPage()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbObject::closeAndPage  |  ( |  Adesk::Boolean  |  bDisableRecording = Adesk::kTrue | )
Closes the object.
See also
AcDbObject::close()
Parameters
[in] | bDisableRecording | - Boolean for turn off or on undo recording
Returns
Acad::eNoDatabase, if object is not database resident
 Acad::eCloseWasNotifying, if the object is already notifying
 return code of subclose() if this subfunction does not return Acad::eOk
 Acad::eOk, else
◆ composeForLoad()
 Acad::ErrorStatus AcDbObject::composeForLoad  |  ( |  AcDb::OdaSaveType  |  ,
|  AcDb::AcDbDwgVersion
)
virtual
This function is intended for future MT file loading support.
Not implemented yet.
Returns
Acad::eNotImplementedYet by default
◆ copied()
 UX_EXPORT_FUNCTION void AcDbObject::copied  |  ( |  const AcDbObject *  |  objToCopy,
|  const AcDbObject *  |  copiedObj
)
virtual
A handler function for persistent reactors.
This object is notified that another object was cloned. For the event to be fired, this object must make part of the other object's list of persistent reactors. The method is usually overridden by custom objects. The default implementation does nothing.
Parameters
[in] | objToCopy | the original object that was copied
[in] | copiedObj | the new object that is the copy of the original object
See also
AcDbObject::addPersistentReactor(AcDbObjectId)
 AcDbObject::clone()
Reimplemented in AcDbLeader, AcDbViewport, and AcDbAssocDependency.
◆ copyFrom()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbObject::copyFrom  |  ( |  const AcRxObject *  |  pSrc | )
virtual
Copies the pSrc object information in this object.
Parameters
[in] | pSrc | object to copy from
Returns
Acad::eOk if successful copied, Acad::eInvalidInput, if pSrc and this object have not the same object type.
Reimplemented from AcRxObject.
Reimplemented in AcDbGradientBackground, AcDbGroundPlaneBackground, AcDbImageBackground, AcDbMentalRayRenderSettings, AcDbMlineStyle, AcDbRenderGlobal, AcDbRenderSettings, and AcDbSolidBackground.
◆ createExtensionDictionary()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbObject::createExtensionDictionary  |  ( |   | )
Creates a dictionary as extension dictionary for this object.
Returns
Acad::eOk if created,
 Acad::eNoDatabase if this object is not database resident Acad::eAlreadyInDb if extension dictionary already exists for this object.
◆ database()
 UX_EXPORT_FUNCTION AcDbDatabase * AcDbObject::database  |  ( |   | ) |   const
Returns the database that contains this object.
Returns
pointer to the database this object is added to
◆ decomposeForSave()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbObject::decomposeForSave  |  ( |  AcDb::AcDbDwgVersion  |  version,
|  AcDbObject *&  |  replacingObject,
|  AcDbObjectId &  |  replacingId,
|  Adesk::Boolean &  |  replaceXData
)
virtual
This function is called during dwg and dxf output, to allow a custom object to decompose itself, due to provided dwg/dxf target file version.
Custom object classes, overriding this function, can provide either a non-DBRO object as replacement object, or the ObjectId of a DBRO object as replacement, but not both !
Parameters
[in] | version | DWG version to save the object to
[out] | replacingObject | the NDBRO object that replaces this object for save
[out] | replacingId | objectId of DBRO object that replaces this object for save
[out] | replaceXData | specifies whether XED data shall be saved to target
Returns
Acad::eOk if successful
Reimplemented in AcDbBlockTableRecord, AcDbDictionary, AcDbLight, AcDbMPolygon, AcDbSun, and AcDbVisualStyle.
◆ deepClone()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbObject::deepClone  |  ( |  AcDbObject *  |  pOwner,
|  AcDbObject *&  |  pClone,
|  AcDbIdMapping &  |  idMap,
|  Adesk::Boolean  |  bIsPrimary = Adesk::kTrue
) |   |  const
finalvirtual
Clones this object, appends it to the owner pOwner and adds an AcDbIdPair record to the idMap.
Parameters
[in] | pOwner | owner to add the cloned object to
[out] | pClone | resulting cloned object
[in,out] | idMap | with already cloned objects pairs, will receive pair of this operation
[in] | bIsPrimary | false, if this object is an owned object, true otherwise
◆ disableUndoRecording()
 UX_EXPORT_FUNCTION void AcDbObject::disableUndoRecording  |  ( |  Adesk::Boolean  |  disableUndo | )
Disables or enables the undo recording for the object.
Parameters
[in] | disableUndo | boolean indicating whether to turn on or off undo recording
◆ downgradeOpen()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbObject::downgradeOpen  |  ( |   | )
Sets the open mode for an object opened for write to be opened for read.
Returns
Acad::eNoDatabase, if object is not a database-resident object Acad::eNotOpenForWrite, if object was not opened for write Acad::eOk if successful.
◆ downgradeToNotify()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbObject::downgradeToNotify  |  ( |  Adesk::Boolean  |  wasWriteEnabled | )
Sets the open mode for an object opened for write to be opened for notify.
Parameters
[in] | Adesk::Boolean | wasWriteEnabled - the value passed from preceding AcDbObject::upgradeFromNotify() call
Returns
Acad::eWasNotOpenForWrite, if object was not opened for Write Acad::eOk if successful.
Remarks
AcDbObject::upgradeFromNotify() and AcDbObject::downgradeToNotify() must be paired
◆ drawable()
 UX_EXPORT_FUNCTION AcGiDrawable * AcDbObject::drawable  |  ( |   | )
virtual
Retrieves the AcGiDrawable instance of this object.
Returns
NULL, if the object has no drawable graphics associated; instance pointer otherwise
Reimplemented in AcDbBackground, AcDbBlockTableRecord, AcDbLinetypeTableRecord, AcDbMaterial, AcDbRenderEnvironment, AcDbRenderSettings, AcDbSun, AcDbViewportTableRecord, and AcDbVisualStyle.
◆ dwgIn()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbObject::dwgIn  |  ( |  AcDbDwgFiler *  |  dwgFiler | )
Calls the object's dwgInFields function, and reads any XData if present.
Parameters
[in] | dwgFiler | filer object to be used for filing
Returns
Acad::eOk if successful; error status otherwise
◆ dwgInFields()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbObject::dwgInFields  |  ( |  AcDbDwgFiler *  |  dwgFiler | )
virtual
Reads the object from the DWG filer.
Parameters
[in] | dwgFiler | the DWF filer containing the object data
Returns
Acad::eOk if successful
Date
2008-12-06 lucd added docs
Reimplemented in AcDbDataTable, AcDbDictionary, AcDbEntity, AcDbExtrudedSurface, AcDbField, AcDbGradientBackground, AcDbGroundPlaneBackground, AcDbGroup, AcDbImageBackground, AcDbLight, AcDbLoftedSurface, AcDbMaterial, AcDbMentalRayRenderSettings, AcDbMLeader, AcDbMlineStyle, AcDbMPolygon, AcDbOle2Frame, AcDbOleFrame, AcDbPlaneSurface, AcDbPolyline, AcDbRasterImage, AcDbRasterImageDef, AcDbRasterImageDefReactor, AcDbRasterVariables, AcDbRenderEnvironment, AcDbRenderGlobal, AcDbRenderSettings, AcDbRevolvedSurface, AcDbSection, AcDbSectionManager, AcDbSolidBackground, AcDbSortentsTable, AcDbSun, AcDbSurface, AcDbSweptSurface, AcDbTable, AcDbTableStyle, AcDbVisualStyle, AcDbXrecord, AcDbBreakData, AcDbBreakPointRef, and AcDbDataLink.
◆ dwgOut()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbObject::dwgOut  |  ( |  AcDbDwgFiler *  |  dwgFiler | ) |   const
Calls the object's dwgOutFields function, and writes any XData if present.
Parameters
[in] | dwgFiler | filer object to be used for filing
Returns
Acad::eOk if successful; error status otherwise
◆ dwgOutFields()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbObject::dwgOutFields  |  ( |  AcDbDwgFiler *  |  dwgFiler | ) |   const
virtual
Writes the object to the DWG filer.
Parameters
[in] | dwgFiler | the DWG filer that receives the object data
Returns
Acad::eOk if successful
Date
2009-04-15 arturs added support for closed objects
 2008-12-06 lucd added docs
Reimplemented in AcDbBlockTableRecord, AcDbBreakData, AcDbBreakPointRef, AcDbDataTable, AcDbDictionary, AcDbEntity, AcDbExtrudedSurface, AcDbField, AcDbGradientBackground, AcDbGroundPlaneBackground, AcDbGroup, AcDbImageBackground, AcDbLight, AcDbLoftedSurface, AcDbMaterial, AcDbMentalRayRenderSettings, AcDbMLeader, AcDbMlineStyle, AcDbMPolygon, AcDbOle2Frame, AcDbOleFrame, AcDbPlaneSurface, AcDbPolyline, AcDbRasterImage, AcDbRasterImageDef, AcDbRasterImageDefReactor, AcDbRasterVariables, AcDbRenderEnvironment, AcDbRenderGlobal, AcDbRenderSettings, AcDbRevolvedSurface, AcDbSection, AcDbSectionManager, AcDbSolidBackground, AcDbSortentsTable, AcDbSun, AcDbSurface, AcDbSweptSurface, AcDbTable, AcDbTableStyle, AcDbVisualStyle, AcDbXrecord, and AcDbDataLink.
◆ dxfIn()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbObject::dxfIn  |  ( |  AcDbDxfFiler *  |  dxfFiler | )
Calls the object's dxfInFields function, and reads any XData if present.
Parameters
[in] | dxfFiler | filer object to be used for filing
Returns
Acad::eOk if successful; error status otherwise
◆ dxfInFields()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbObject::dxfInFields  |  ( |  AcDbDxfFiler *  |  dxfFiler | )
virtual
Reads the object from the DXF filer.
Parameters
[in] | dxfFiler | the DXF filer containing the object data
Returns
Acad::eOk if successful
Reimplemented in AcDbDataTable, AcDbDictionary, AcDbEntity, AcDbExtrudedSurface, AcDbField, AcDbGradientBackground, AcDbGroundPlaneBackground, AcDbGroup, AcDbImageBackground, AcDbLight, AcDbLoftedSurface, AcDbMaterial, AcDbMentalRayRenderSettings, AcDbMLeader, AcDbMlineStyle, AcDbMPolygon, AcDbOle2Frame, AcDbOleFrame, AcDbPlaceHolder, AcDbPlaneSurface, AcDbPolyline, AcDbRasterImage, AcDbRasterImageDef, AcDbRasterImageDefReactor, AcDbRasterVariables, AcDbRenderEnvironment, AcDbRenderGlobal, AcDbRenderSettings, AcDbRevolvedSurface, AcDbSection, AcDbSectionManager, AcDbSolidBackground, AcDbSortentsTable, AcDbSun, AcDbSurface, AcDbSweptSurface, AcDbTable, AcDbTableStyle, AcDbVisualStyle, AcDbXrecord, AcDbBreakData, AcDbBreakPointRef, and AcDbDataLink.
◆ dxfOut()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbObject::dxfOut  |  ( |  AcDbDxfFiler *  |  dxfFiler,
|  Adesk::Boolean  |  allXdFlag,
|  Adesk::uchar *  |  regAppTable
) |   |  const
Calls the object's dxfOutFields function, and writes any XData if present.
Parameters
[in] | dxfFiler | filer object to be used for filing
[in] | bAllXDataFlag | ignored
[in] | pRegAppTable | ignored
Returns
Acad::eOk if successful; error status otherwise
◆ dxfOutFields()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbObject::dxfOutFields  |  ( |  AcDbDxfFiler *  |  dxfFiler | ) |   const
virtual
Writes the object to the DXF filer.
Parameters
[in] | dxfFiler | the DXF filer that receives the object data
Returns
Acad::eOk if successful
Date
2009-04-15 arturs added support for closed objects
 2008-12-14 lucd added docs
Reimplemented in AcDbBlockTableRecord, AcDbBreakData, AcDbBreakPointRef, AcDbDataTable, AcDbDictionary, AcDbEntity, AcDbExtrudedSurface, AcDbField, AcDbGradientBackground, AcDbGroundPlaneBackground, AcDbGroup, AcDbImageBackground, AcDbLight, AcDbLoftedSurface, AcDbMaterial, AcDbMentalRayRenderSettings, AcDbMLeader, AcDbMlineStyle, AcDbMPolygon, AcDbOle2Frame, AcDbOleFrame, AcDbPlaceHolder, AcDbPlaneSurface, AcDbPolyline, AcDbRasterImage, AcDbRasterImageDef, AcDbRasterImageDefReactor, AcDbRasterVariables, AcDbRenderEnvironment, AcDbRenderGlobal, AcDbRenderSettings, AcDbRevolvedSurface, AcDbSection, AcDbSectionManager, AcDbSolidBackground, AcDbSortentsTable, AcDbSun, AcDbSurface, AcDbSweptSurface, AcDbTable, AcDbTableStyle, AcDbVisualStyle, AcDbXrecord, and AcDbDataLink.
◆ erase()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbObject::erase  |  ( |  Adesk::Boolean  |  bErase = Adesk::kTrue | )
Sets the bit that indicates that the object is erased.
Parameters
[in] | bErase | flag indicating if the object is erased or unerased
Returns
Acad::eOk if successful
◆ erased()
 UX_EXPORT_FUNCTION void AcDbObject::erased  |  ( |  const AcDbObject *  |  erasedObj,
|  Adesk::Boolean  |  bIsErased
)
virtual
A handler function for persistent reactors.
This object is notified that another object's erase flag was modified. For the event to be fired, this object must make part of the other object's list of persistent reactors. The method is usually overridden by custom objects. The default implementation does nothing.
Parameters
[in] | erasedObj | the object whose erase flag has been modified.
[in] | bIsErased | flag indicating if the object was erased or un-erased.
See also
AcDbObject::addPersistentReactor(AcDbObjectId)
Reimplemented in AcDbDictionary, AcDbGroup, AcDbLeader, AcDbRasterImageDefReactor, AcDbTable, AcDbViewport, and AcDbAssocDependency.
◆ extensionDictionary()
 UX_EXPORT_FUNCTION AcDbObjectId AcDbObject::extensionDictionary  |  ( |   | ) |   const
Returns the object id of the extension dictionary for this object.
Returns
id of the extension dictionary or AcDbObjectId::kNull.
◆ getAcDbHandle()
 UX_EXPORT_FUNCTION void AcDbObject::getAcDbHandle  |  ( |  AcDbHandle &  |  handle | ) |   const
Returns handle of this object.
Non DBR objects will have a null handle.
Parameters
[out] | handle | handle of this object
◆ getBinaryData()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbObject::getBinaryData  |  ( |  const ACHAR *  |  entryName,
|  Adesk::Int32 &  |  dataSize,
|  char *&  |  pBinaryData
) |   |  const
Creates a copy of the binary data stored as chunks of maximum 127 bytes in the resbuf chain of this object's extension dictionary xrecord entry given by entryName.
Parameters
[in] | entryName | this object's extension dictionary entry name to get data from
[out] | dataSize | the size of the returned data
[out] | pBinaryData | pointer to the binary data
Returns
Acad::eOk if successful,
 Acad::eInvalidInput if entryName is not valid or is not an xrecord's one,
 Acad::eNoDatabase if this object is not database resident,
 Acad::eNullObjectId if the extension dictionary does not exist,
 Acad::eWasOpenForWrite if write is enabled for extension dict. or the xrec,
 Acad::eBadDxfSequence if the xrecord's resbuf chain contains other resbuf types
Remarks
The caller is responsible for the memory allocated by this function.
◆ getBrxOpenCount()
 int AcDbObject::getBrxOpenCount  |  ( |   | ) |   const
This function returns the number of open BRX instances for this object.
Returns
number of opened instances for this object
◆ getBrxOpenState()
 int AcDbObject::getBrxOpenState  |  ( |   | ) |   const
This function returns the BRX object open state flags as bitfields, for diagnostic purpose.
Returns
bit field combining the active open state modes for the bRX object 1 isReadEnabled 2 isWriteEnabled 4 isNotifyEnabled 8 isNotifying 16 isCancelling 32 isUndoing 64 isTransactionResident
◆ getClassID()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbObject::getClassID  |  ( |  CLSID *  |  pClassId | ) |   const
finalvirtual
Gets the COM wrapper Class ID for this entity.
Parameters
[out] | pClassId
◆ getCustomObjectState()
 int AcDbObject::getCustomObjectState  |  ( |   | ) |   const
This function returns the custom object status : 1=isCustomObject 2=DifferentialUndoDisabled.
Returns
status flags for this object
◆ getField() [1/2]
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbObject::getField  |  ( |  const ACHAR *  |  pszPropName,
|  AcDbField *&  |  pField,
|  AcDb::OpenMode  |  mode
) |   |  const
Retrieves the specified Field from this object, and opens it in mode.
Parameters
[in] | pszPropName | - property name to retrieve
[out] | pField | - the opened field object
[in] | mode | - the openMode for the field to be retrieved
Returns
Acad::eOk if successful, or eKeyNotFound
◆ getField() [2/2]
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbObject::getField  |  ( |  const ACHAR *  |  pszPropName,
|  AcDbObjectId &  |  fieldId
) |   |  const
Gets the pszPropName field object from field dictionary of this AcDbObject object, using pszPropName as key.
Parameters
[in] | pszPropName | represent the key for dictionary
[out] | fieldId | represent the output field ID to receive
Returns
Acad::eOk if successful,
 Acad::eInvalidInput if the pszPropName is NULL,
 Acad::eInvalidKey if the pszPropName is dictionary invalid string name
◆ getFieldDictionary() [1/2]
 UX_EXPORT_FUNCTION AcDbObjectId AcDbObject::getFieldDictionary  |  ( |   | ) |   const
Returns the Field dictionary associated with this object,.
Returns
ObjectId of the field dictionary, or AcDbObjectId::kNull
◆ getFieldDictionary() [2/2]
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbObject::getFieldDictionary  |  ( |  AcDbDictionary *&  |  pAcFieldDict,
|  AcDb::OpenMode  |  acMode
) |   |  const
Gets and opens the field dictionary for this.
Parameters
[out] | pAcFieldDict | the field dictionary object
[in] | acMode | open mode for the field dictionary
Returns
Acad::eOk if successful
◆ getObjectBirthVersion()
 Acad::ErrorStatus AcDbObject::getObjectBirthVersion  |  ( |  AcDb::AcDbDwgVersion &  |  version,
|  AcDb::MaintenanceReleaseVersion &  |  maintanance
)
This function is currently not supported by the CAD engine, always returns Acad::eOk, and 'kDHL_CURRENT' + 'kMReleaseCurrent' results.
Parameters
[out] | version,always | AcDb::kDHL_CURRENT
[out] | maintanance,always | AcDb::kMReleaseCurrent
Returns
always Acad::eOk
◆ getObjectSaveVersion() [1/2]
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbObject::getObjectSaveVersion  |  ( |  const AcDbDwgFiler *  |  dwgFiler,
|  AcDb::AcDbDwgVersion &  |  dwgVer,
|  AcDb::MaintenanceReleaseVersion &  |  dwgMaintVer
)
virtual
Returns the DWG version for saving the object.
If the object doesn't override this function, the filer version will be returned.
Parameters
[in] | dwgFiler | filer used for saving
[out] | dwgVer | DWG version to save the object to
[out] | dwgMaintVer | DWG maintenance version to save the object to
Returns
Acad::eOk if successful
◆ getObjectSaveVersion() [2/2]
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbObject::getObjectSaveVersion  |  ( |  const AcDbDxfFiler *  |  dxfFiler,
|  AcDb::AcDbDwgVersion &  |  dwgVer,
|  AcDb::MaintenanceReleaseVersion &  |  dwgMaintVer
)
virtual
Returns the DWG version for saving the object.
If the object doesn't override this function, the filer version will be returned.
Parameters
[in] | dwgFiler | filer used for saving
[out] | dwgVer | DWG version to save the object to
[out] | dwgMaintVer | DWG maintenance version to save the object to
Returns
Acad::eOk if successful
◆ getOdaOpenCount()
 int AcDbObject::getOdaOpenCount  |  ( |   | ) |   const
This function returns the number of open ODA instances for this object.
Returns
number of opened instances for the underlying ODA object 1 reference is always hold by the database, if the object is database-resident
◆ getOdaOpenState()
 int AcDbObject::getOdaOpenState  |  ( |   | ) |   const
This function returns the ODA object open state flags as bitfields, for diagnostic purpose.
Returns
bit field combining the active open state modes for the underlying ODA object -1 : error, ODA object not available 1 isReadEnabled 2 isWriteEnabled 4 isNotifyEnabled 8 isNotifying 16 isCancelling 32 isUndoing 64 isTransactionResident
◆ goodbye()
 UX_EXPORT_FUNCTION void AcDbObject::goodbye  |  ( |  const AcDbObject *  |  pObject | )
virtual
A handler function for persistent reactors.
This object is notified that another object is finally deleted. This method is usually overridden by custom objects. The default implementation does nothing.
Parameters
[in] | pObject | the object which was deleted
Reimplemented in AcDbDictionary, AcDbGroup, and AcDbLeader.
◆ handOverTo()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbObject::handOverTo  |  ( |  AcDbObject *  |  newObj,
|  Adesk::Boolean  |  xData = Adesk::kTrue,
|  Adesk::Boolean  |  extDict = Adesk::kTrue
)
Hands over objects identity to another object.
Parameters
[in] | newObj | object that receives this object id, handle,reactors, pXData, extension dictionary
[in] | xData | handover the pXData
[in] | extDict | handover the extension dictionary
Returns
Acad::eObjectToBeDeleted if operation succeeds, Acad::eIllegalReplacement, if newObj is DBRO or this object is not DBRO Acad::eInvalidContext if this object is transaction resident. Acad::eNotOpenForWrite if this object is only open for read
Remarks
if xData is set, xData are moved to newObj and removed from this object. Other CAD engines may copy xData.
 if xData are moved, function newObj will not have modified pXData - function isModifiedXData called on newObj will return Adesk::kFalse. Other CAD engines may return Adesk::kTrue in this case.
◆ hasFields()
 UX_EXPORT_FUNCTION bool AcDbObject::hasFields  |  ( |   | ) |   const
Return true if this object has single or multiple fields associated with him.
Returns
true if has one field or more, false otherwise
◆ hasPersistentReactor()
 UX_EXPORT_FUNCTION bool AcDbObject::hasPersistentReactor  |  ( |  AcDbObjectId  |  reactorId | ) |   const
Checks the input objectId in this object reactor list.
Parameters
[in] | reactorId | id of the persistent reactor to be checked return true if reactorId is the id of a reactor in this object reactor list false otherwise
◆ hasSaveVersionOverride()
 bool AcDbObject::hasSaveVersionOverride  |  ( |   | )
This function indicates whether this object overrides the filer's save version.
Returns
true if the object has
◆ id()
 UX_EXPORT_FUNCTION AcDbObjectId AcDbObject::id  |  ( |   | ) |   const
virtual
Returns the database id of this object.
Returns
database id
Remarks
It behaves exactly as the AcDbObject::objectId() function
Implements AcGiDrawable.
◆ isAcDbObjectIdsInFlux()
 UX_EXPORT_FUNCTION Adesk::Boolean AcDbObject::isAcDbObjectIdsInFlux  |  ( |   | ) |   const
Checks whether a deep clone operation was completed.
Returns
Adesk::kTrue, if the deep clone operation was not completed Adesk::kFalse, otherwise
◆ isAProxy()
 UX_EXPORT_FUNCTION Adesk::Boolean AcDbObject::isAProxy  |  ( |   | ) |   const
Returns
◆ isCancelling()
 UX_EXPORT_FUNCTION Adesk::Boolean AcDbObject::isCancelling  |  ( |   | ) |   const
Returns
◆ isErased()
 UX_EXPORT_FUNCTION Adesk::Boolean AcDbObject::isErased  |  ( |   | ) |   const
Returns whether this object is erased.
Returns
Adesk::kTrue true if this object is erased; Adesk::kFalse otherwise
◆ isEraseStatusToggled()
 UX_EXPORT_FUNCTION Adesk::Boolean AcDbObject::isEraseStatusToggled  |  ( |   | ) |   const
Checks whether the object erase status has been toggled.
Returns
Adesk::kTrue, if the object erase status has been toggled Adesk::kFalse, otherwise
◆ isModified()
 UX_EXPORT_FUNCTION Adesk::Boolean AcDbObject::isModified  |  ( |   | ) |   const
Returns whether this object's assertWriteEnabled() has been called since it was opened.
Returns
Adesk::kTrue if this object's assertWriteEnabled() has been called since it was opened
 Adesk::kFalse, otherwise
◆ isModifiedGraphics()
 UX_EXPORT_FUNCTION Adesk::Boolean AcDbObject::isModifiedGraphics  |  ( |   | ) |   const
Checks whether this object graphics will be updated when the object is closed.
Returns
Adesk::kTrue , if sucessfull Adesk::kFalse, otherwise
◆ isModifiedXData()
 UX_EXPORT_FUNCTION Adesk::Boolean AcDbObject::isModifiedXData  |  ( |   | ) |   const
Checks whether this object's xData was modified.
Returns
Adesk::kTrue , if sucessfull Adesk::kFalse, otherwise
◆ isNewObject()
 UX_EXPORT_FUNCTION Adesk::Boolean AcDbObject::isNewObject  |  ( |   | ) |   const
Returns true if and only if this object has not been closed since it was created.
Returns
Adesk::kTrue if and only if this object has not been closed since it was created.
 Adesk::kFalse, otherwise
◆ isNotifyEnabled()
 UX_EXPORT_FUNCTION Adesk::Boolean AcDbObject::isNotifyEnabled  |  ( |   | ) |   const
Returns whether this object is opened for notify.
Returns
Adesk::kTrue true if this object is open kForNotify; Adesk::kFalse otherwise
◆ isNotifying()
 UX_EXPORT_FUNCTION Adesk::Boolean AcDbObject::isNotifying  |  ( |   | ) |   const
Returns
◆ isPersistent()
 UX_EXPORT_FUNCTION Adesk::Boolean AcDbObject::isPersistent  |  ( |   | ) |   const
virtual
Returns the 'persistent' status of a database object.
Returns
persistency status
Remarks
always Adesk::kTrue for AcDbObject and derived classes
Implements AcGiDrawable.
◆ isReadEnabled()
 UX_EXPORT_FUNCTION Adesk::Boolean AcDbObject::isReadEnabled  |  ( |   | ) |   const
Returns whether this object is opened for read.
Returns
Adesk::kTrue true if this object is open for read; Adesk::kFalse otherwise
◆ isTransactionResident()
 UX_EXPORT_FUNCTION Adesk::Boolean AcDbObject::isTransactionResident  |  ( |   | ) |   const
Gets the object transaction status.
Not implemented yet.
Returns
Acad::kFalse
Remarks
Returns kFalse on every call.
◆ isUndoing()
 UX_EXPORT_FUNCTION Adesk::Boolean AcDbObject::isUndoing  |  ( |   | ) |   const
Returns
◆ isUndoRecordingDisabled()
 UX_EXPORT_FUNCTION bool AcDbObject::isUndoRecordingDisabled  |  ( |   | ) |   const
Returns whether the undo recording for the object is enabled or not.
Returns
true/false indicating whether undo recording is enabled or not
◆ isWriteEnabled()
 UX_EXPORT_FUNCTION Adesk::Boolean AcDbObject::isWriteEnabled  |  ( |   | ) |   const
Returns whether this object is opened for write.
Returns
Adesk::kTrue true if this object is open kForWrite; Adesk::kFalse otherwise
◆ mergeStyle()
 UX_EXPORT_FUNCTION AcDb::DuplicateRecordCloning AcDbObject::mergeStyle  |  ( |   | ) |   const
virtual
Returns the object's merge behavior during cloning.
Returns
merge style
Reimplemented in AcDbDictionary, and AcDbXrecord.
◆ modified()
 UX_EXPORT_FUNCTION void AcDbObject::modified  |  ( |  const AcDbObject *  |  pAcObj | )
virtual
A handler function for persistent reactors.
This object is notified that another object was modified. For the event to be fired, this object must make part of the other object's list of persistent reactors. The method is usually overridden by custom objects. The default implementation does nothing.
Parameters
[in] | pAcObj | the original object that is to be modified
See also
AcDbObject::addPersistentReactor(AcDbObjectId)
Reimplemented in AcDbLeader, AcDbMLeader, AcDbRasterImageDefReactor, and AcDbAssocDependency.
◆ modifiedGraphics()
 UX_EXPORT_FUNCTION void AcDbObject::modifiedGraphics  |  ( |  const AcDbEntity *  |  entity | )
virtual
A handler function for persistent reactors.
This object is notified that another object's 'graphicsModified' flag was modified. The method is usually overridden by custom objects. The default implementation does nothing.
Parameters
[in] | entity | the object whose graphicsModified flag has been set
See also
AcDbObject::addPersistentReactor(AcDbObjectId)
Reimplemented in AcDbHatch.
◆ modifiedXData()
 UX_EXPORT_FUNCTION void AcDbObject::modifiedXData  |  ( |  const AcDbObject *  |  pObject | )
virtual
A handler function for persistent reactors.
This object is notified that the XData of specified object were modified. This method is usually overridden by custom objects. The default implementation does nothing.
Parameters
[in] | pObject | the object which has its XData modified
◆ modifyUndone()
 UX_EXPORT_FUNCTION void AcDbObject::modifyUndone  |  ( |  const AcDbObject *  |  pObject | )
virtual
A handler function for persistent reactors.
This object is notified that modifications to this objects were undone. This method is usually overridden by custom objects. The default implementation does nothing.
Parameters
[in] | pObject | the object which has its previous modifications being undone
◆ objectClosed()
 UX_EXPORT_FUNCTION void AcDbObject::objectClosed  |  ( |  const AcDbObjectId  |  idObject | )
virtual
A handler function for persistent reactors.
This object is notified that the specified object was closed. This method is usually overridden by custom objects. The default implementation does nothing.
Parameters
[in] | idObject | the object which was closed
Reimplemented in AcDbDimension, and AcDbTable.
◆ objectId()
 UX_EXPORT_FUNCTION AcDbObjectId AcDbObject::objectId  |  ( |   | ) |   const
Returns object id.
NDBR Objects will return an AcDbObjectId::kNull object id
Returns
Object Id of this object
◆ openedForModify()
 UX_EXPORT_FUNCTION void AcDbObject::openedForModify  |  ( |  const AcDbObject *  |  pObject | )
virtual
A handler function for persistent reactors.
This object is notified that another object has been opened with kForWrite. This method is usually overridden by custom objects. The default implementation does nothing.
Parameters
[in] | pObject | the object which was opened
◆ ownerId()
 UX_EXPORT_FUNCTION AcDbObjectId AcDbObject::ownerId  |  ( |   | ) |   const
Returns object id of the owner.
Objects with no owner will return an AcDbObjectId::kNull object id
Returns
Object Id of this objects owner
◆ reactors() [1/2]
 UX_EXPORT_FUNCTION AcDbVoidPtrArray * AcDbObject::reactors  |  ( |   | )
Gets the object pointers to reactors.
Returns
pointer to void pointer array reactors
Remarks
if the object never has any reactor assigned to the object, the returned array is NULL, otherwise, the created array is non-NULL, but can be empty; the returned array may not be freed. Nevertheless directly manipulating the array has no effect on the reactors of this object. Especially removing a reactor from the array does not remove the reactor from the object. Recalling the function again, will return an array which again contains the reactor removed from the array before.
◆ reactors() [2/2]
 UX_EXPORT_FUNCTION const AcDbVoidPtrArray * AcDbObject::reactors  |  ( |   | ) |   const
Gets the object pointers to reactors.
Returns
const pointer to void pointer array reactors
Remarks
if the object never has any reactor assigned to the object, the returned array is NULL, otherwise, the created array is non-NULL, but can be empty; the returned array may not be freed. Nevertheless directly manipulating the array has no effect on the reactors of this object. Especially removing a reactor from the array does not remove the reactor from the object. Recalling the function again, will return an array which again contains the reactor removed from the array before.
◆ reappended()
 UX_EXPORT_FUNCTION void AcDbObject::reappended  |  ( |  const AcDbObject *  |  pObject | )
virtual
A handler function for persistent reactors.
This object is notified that the specified object was re-appended to the database. This method is usually overridden by custom objects. The default implementation does nothing.
Parameters
[in] | pObject | the object which was re-appemded to the database
◆ releaseExtensionDictionary()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbObject::releaseExtensionDictionary  |  ( |   | )
Removes the extension dictionary associated with this object.
Returns
Acad::eNullObjectId if no extension dictionary associated Acad::eWasOpenForRead if dictionary is currently open for read Acad::eWasOpenForNotify if dictionary is open for notify Acad::eWasOpenForWrite if extension dictionary is open for write Acad::eWasNotifying if extension dictionary is sending notifications Acad::eWasOpenForUndo if extension dictionary is undoing Acad::eContainerNotEmpty if extension dictionary is not empty Acad::eOk otherwise
◆ removeField() [1/3]
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbObject::removeField  |  ( |  AcDbObjectId  |  acFieldId | )
virtual
Removes the Field specified by acFieldId from this object.
Parameters
[in] | acFieldId | - property name to retrieve
Returns
Acad::eOk if successful, or eInvalidInput
Reimplemented in AcDbMText.
◆ removeField() [2/3]
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbObject::removeField  |  ( |  const ACHAR *  |  szKeyString | )
virtual
Removes the Field specified by szKeyString from this object.
Parameters
[in] | acPszKeyString | - property name to be removed
Returns
Acad::eOk if successful, or eInvalidInput or eKeyNotFound
Reimplemented in AcDbMText.
◆ removeField() [3/3]
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbObject::removeField  |  ( |  const ACHAR *  |  acPszKeyString,
|  AcDbObjectId &  |  acFieldId
)
virtual
Removes the Field specified by acPszKeyString from this object, and returns its ObjectId value.
Parameters
[in] | acPszKeyString | - property name to be removed
[out] | acFieldId | - ObjectId of the field removed
Returns
Acad::eOk if successful, or eInvalidInput or eKeyNotFound
Reimplemented in AcDbMText.
◆ removePersistentReactor()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbObject::removePersistentReactor  |  ( |  AcDbObjectId  |  reactorId | )
virtual
Removes a persistent reactor from this object reactor list.
Parameters
[in] | reactorId | id of the persistent reactor
Returns
Acad::eOk if successful, Error Status otherwise
◆ removeReactor()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbObject::removeReactor  |  ( |  AcDbObjectReactor *  |  pAcReactor | ) |   const
Removes a transient reactor to this object.
Parameters
[in] | pAcReactor | the transient reactor to remove
Returns
Acad::eOk if successful, Error Status otherwise
◆ setAcDbObjectIdsInFlux()
 UX_EXPORT_FUNCTION void AcDbObject::setAcDbObjectIdsInFlux  |  ( |   | )
Call this function to indicate that the object IDs of this object and its sub-objects (if any) are not yet valid.
Returns
void
◆ setBinaryData()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbObject::setBinaryData  |  ( |  const ACHAR *  |  entryName,
|  Adesk::Int32  |  dataSize,
|  const char *  |  pBinaryData
)
Creates a copy of the binary data, divides it in up to 127 bytes binary chunks and
 sets them as resbufs in the resbuf chain of this object's extension dictionary xrecord entry given by entryName.
Parameters
[in] | entryName | this object's extension dictionary entry name to copy data into
[in] | dataSize | the size of the data pointed by pBinaryData
[in] | pBinaryData | pointer to the binary data to be used
Returns
Acad::eOk if successful,
 Acad::eInvalidInput if dataSize or entryName are not valid,
 Acad::eNoDatabase if this object is not database resident,
 Acad::eWasOpenForWrite if write is enabled for extension dict. or the xrec,
 Acad::eWasOpenForRead if read is enabled for extension dict. or the xrec,
 Acad::eKeyNotFound if the passed in key was not found,
◆ setField()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbObject::setField  |  ( |  const ACHAR *  |  pKey,
|  AcDbField *  |  pAcField,
|  AcDbObjectId &  |  acFieldId
)
virtual
Adds the pAcField field object to field dictionary of this AcDbObject object, using pKey as key.
Parameters
[in] | pKey | represent the input key for dictionary
[in] | pAcField | represent the input field to add
[out] | acFieldId | represent the output field ID to receive
Returns
Acad::eOk if successful,
 Acad::eInvalidInput if the pKey is NULL,
 Acad::eInvalidKey if the pKey is dictionary invalid string name
Reimplemented in AcDbMText.
◆ setHasSaveVersionOverride()
 void AcDbObject::setHasSaveVersionOverride  |  ( |  bool  |  enable | )
This function can be called to specify that the object has a "save version override".
Parameters
[in] | true/false,indicating | whether the object has a "save version override"
Returns
true if the object has
◆ setOwnerId()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbObject::setOwnerId  |  ( |  AcDbObjectId  |  objId | )
virtual
Sets the ownerId data member of the object to be objId.
Parameters
[in] | objId | is the ownerId data member.
Returns
Acad::eOk if succesfull
◆ setXData()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbObject::setXData  |  ( |  const resbuf *  |  pXData | )
virtual
Sets/removes xData associated with this object.
Parameters
[in] | pXData | to be associated with this object.
Returns
Acad::eOk if successful,
 Acad::eInvalidInput if passed pXData is invalid Acad::eNoDatabase if no active database found Acad::eRegappIdNotFound if the application name given in pXData is not a registered application name.
Remarks
The resbuf pXData should begin with restype == 1001, and a registered application name string as resval.rstring. Example: ads_buildlist( 1001, _T("MyRegApp"), 1070, -45, 1040, 21.033, 0 )
 To remove application data pass resbuf with application name and no data. Example: ads_buildlist( 1001, _T("MyRegApp"), 0 ).
 Valid pXData group codes are in range: 1000-1071
◆ subCancel()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbObject::subCancel  |  ( |   | )
virtual
Possibility to veto a cancel operation from within custom entities.
Returns
error status. If Acad::eOk, cancel operation will proceed. Returning any other value will stop the cancel operation.
◆ subClose()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbObject::subClose  |  ( |   | )
virtual
Reimplemented in AcDbField, AcDbGroup, AcDbLight, AcDbMLeader, AcDbRasterImageDef, AcDbSection, and AcDbTable.
◆ subDeepClone()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbObject::subDeepClone  |  ( |  AcDbObject *  |  pOwner,
|  AcDbObject *&  |  pClone,
|  AcDbIdMapping &  |  idMap,
|  Adesk::Boolean  |  bIsPrimary = true
) |   |  const
protectedvirtual
Reimplemented in AcDbLight.
◆ subErase()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbObject::subErase  |  ( |  Adesk::Boolean  |  bErase | )
virtual
This hook is called during an AcDbObject::erase call, before any actual erase operation is performed.
The method is usually overridden by custom objects. If the custom implementation returns anything else then Acad::eOk, the erase operation will be aborted.
Parameters
[in] | bErase | the argument that was passed in the triggering erase call
Returns
Acad::eOk if the erase operation was executed successfully.
Reimplemented in AcDbMLeader, AcDbRasterImageDef, AcDbDictionary, AcDbGroup, and AcDbMlineStyle.
◆ subGetClassID()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbObject::subGetClassID  |  ( |  CLSID *  |  pClassId | ) |   const
protectedvirtual
Reimplemented in AcDbBlockReference, AcDbBlockTableRecord, AcDbDictionary, and AcDbNurbSurface.
◆ subObjModified()
 UX_EXPORT_FUNCTION void AcDbObject::subObjModified  |  ( |  const AcDbObject *  |  pObject,
|  const AcDbObject *  |  pSubObject
)
virtual
A handler function for persistent reactors.
This object is notified that another object' subObject has been modifed. This method is usually overridden by custom objects. The default implementation does nothing.
Parameters
[in] | pObject | the object which owns the modified sub-object
[in] | pSubObject | the sub-object which was modified
◆ subSetAttributes()
 UX_EXPORT_FUNCTION Adesk::UInt32 AcDbObject::subSetAttributes  |  ( |  AcGiDrawableTraits *  |  pIOTraitsObj | )
protectedvirtual
Sets the values of this object's subentity traits and returns with the calling object's subentity traits.
Parameters
[in] | pIOTraitsObj | pointer to the AcGiDrawableTraits object to be set
Returns
flags to be used by the vectorization framework
Implements AcGiDrawable.
Reimplemented in AcDbBlockTableRecord, AcDbEntity, AcDbGradientBackground, AcDbGroundPlaneBackground, AcDbImageBackground, AcDbLayerTableRecord, AcDbLight, AcDbLinetypeTableRecord, AcDbMaterial, AcDbMentalRayRenderSettings, AcDbPoint, AcDbRenderEnvironment, AcDbRenderSettings, AcDbSolidBackground, AcDbSun, AcDbText, AcDbViewport, AcDbViewportTableRecord, and AcDbVisualStyle.
◆ subSwapIdWith()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbObject::subSwapIdWith  |  ( |  AcDbObjectId  |  id,
|  Adesk::Boolean  |  inclXData = Adesk::kFalse,
|  Adesk::Boolean  |  inclXDict = Adesk::kFalse
)
virtual
This hook is called during an AcDbObject::swapIdWith() call, before any actual swap operation is performed.
The method is usually overridden by custom objects. If the custom implementation returns anything else then Acad::eOk, the swap operation will be aborted.
Parameters
[in] | id
[in] | inclXData | true to also swap XData, false otherwise
[in] | inclXDict | true to also swap extension dictionary, false otherwise
Returns
Acad::eOk if the swap operation was executed successfully.
Reimplemented in AcDbHatch, and AcDbRasterImage.
◆ subViewportDraw()
 UX_EXPORT_FUNCTION void AcDbObject::subViewportDraw  |  ( |  AcGiViewportDraw *  |  pAcVd | )
protectedvirtual
Implements AcGiDrawable.
Reimplemented in AcDb3dSolid, AcDbBlockTableRecord, AcDbLight, AcDbLinetypeTableRecord, AcDbOle2Frame, AcDbOleFrame, AcDbPoint, AcDbPolyline, AcDbRasterImage, and AcDbWipeout.
◆ subViewportDrawLogicalFlags()
 UX_EXPORT_FUNCTION Adesk::UInt32 AcDbObject::subViewportDrawLogicalFlags  |  ( |  AcGiViewportDraw *  |  pAcVd | )
protectedvirtual
Reimplemented from AcGiDrawable.
◆ subWblockClone()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbObject::subWblockClone  |  ( |  AcRxObject *  |  pOwner,
|  AcDbObject *&  |  pClone,
|  AcDbIdMapping &  |  idMap,
|  Adesk::Boolean  |  bIsPrimary = true
) |   |  const
protectedvirtual
Reimplemented in AcDbLight, and AcDbPlaceHolder.
◆ subWorldDraw()
 UX_EXPORT_FUNCTION Adesk::Boolean AcDbObject::subWorldDraw  |  ( |  AcGiWorldDraw *  |  pAcWd | )
protectedvirtual
Implements AcGiDrawable.
Reimplemented in AcDb3dSolid, AcDbBlockReference, AcDbBlockTableRecord, AcDbLight, AcDbLinetypeTableRecord, AcDbMPolygon, AcDbOle2Frame, AcDbOleFrame, AcDbPoint, AcDbPolyline, AcDbRasterImage, AcDbSection, AcDbTable, AcDbViewportTableRecord, and AcDbWipeout.
◆ swapIdWith()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbObject::swapIdWith  |  ( |  AcDbObjectId  |  swapId,
|  Adesk::Boolean  |  bSwapExtendedData = Adesk::kFalse,
|  Adesk::Boolean  |  bSwapExtensionDict = Adesk::kFalse
)
Swaps the object id's between the object identified by param swapId and this object.
Returns
Adesk::eOk, if successful Acad::eNoDatabase or Acad::eWrongDatabase, otherwise
◆ swapReferences()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbObject::swapReferences  |  ( |  const AcDbIdMapping &  |   | )
virtual
Not implemented yet.
Reimplemented in AcDbHatch.
◆ unappended()
 UX_EXPORT_FUNCTION void AcDbObject::unappended  |  ( |  const AcDbObject *  |  pObject | )
virtual
A handler function for persistent reactors.
This object is notified that the specified object is no longer database-resident. This method is usually overridden by custom objects. The default implementation does nothing.
Parameters
[in] | pObject | the object which was made non-database-resident
◆ undoFiler()
 UX_EXPORT_FUNCTION AcDbDwgFiler * AcDbObject::undoFiler  |  ( |   | )
Gets the undo filer for this object.
Returns
pointer to the undo dwg filer
◆ upgradeFromNotify()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbObject::upgradeFromNotify  |  ( |  Adesk::Boolean &  |  wasWriteEnabled | )
Upgrades the open status of this object to AcDb::kForWrite, if this object is already open (either in AcDb::kForRead, AcDb::kForNotify or AcDb::kForWrite)
Parameters
[out] | Adesk::Boolean | & wasWriteEnabled - indicates whether the object was already opened for write
Returns
Acad::eNotApplicable, if object was not opened for Notify Acad::eWasNotifying, if object was just sending notifications Acad::eOk if successful.
Remarks
AcDbObject::upgradeFromNotify() and AcDbObject::downgradeToNotify() must be paired
◆ upgradeOpen()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbObject::upgradeOpen  |  ( |   | )
Changes the objects open mode to AcDb::kForWrite and sends notifications.
If the object is already for writing, Acad::eWasOpenForWrite is returned. If it is open for read more than once, Acad::eHadMultipleReaders is returned.
Returns
Acad::eOk if successful, Acad::eWasOpenForWrite, Acad::eWasNotifying, Acad::eInvalidOpenState, Acad::eHadMultipleReaders else.
◆ wblockClone()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbObject::wblockClone  |  ( |  AcRxObject *  |  pOwner,
|  AcDbObject *&  |  pClone,
|  AcDbIdMapping &  |  idMap,
|  Adesk::Boolean  |  bIsPrimary = Adesk::kTrue
) |   |  const
finalvirtual
Clones this object, appends it to the owner pOwner and adds an AcDbIdPair record to the idMap.
Parameters
[in] | pOwner | owner to add the cloned object to
[out] | pClone | resulting cloned object
[in,out] | idMap | with already clone objects pairs, will receive pair of this operation
[in] | bIsPrimary | false, if this object is an owned object, true otherwise
◆ xData()
 UX_EXPORT_FUNCTION resbuf * AcDbObject::xData  |  ( |  const ACHAR *  |  registeredApp = NULL | ) |   const
virtual
Returns the xData associated with this object.
Parameters
[in] | registeredApp | to receive xData for chosen application, pass NULL to receive all associated sData.
Returns
xData as a pointer to resbuf
◆ xDataTransformBy()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbObject::xDataTransformBy  |  ( |  const AcGeMatrix3d &  |  matrix | )
Transforms the extended data according to parameter transformation matrix.
Parameters
[in] | matrix | transformation matrix
Returns
Acad::eOk, if sucessfull errorcode, otherwise