Public Member Functions | Public Attributes | List of all members
AcDbIdMapping Class Reference
_ More...
#include <AcDbIdMapping.h>
 Public Member Functions
virtual Acad::ErrorStatus  | assign (const AcDbIdPair &)
Inserts a pair in the map. More...
virtual bool  | change (const AcDbIdPair &)
Search and replace function for a pair entry in the map. More...
virtual bool  | compute (AcDbIdPair &) const
Gets the pair data from the map. More...
virtual Acad::ErrorStatus  | copyFrom (const AcRxObject *)
AcDb::DeepCloneType  | deepCloneContext () const
Returns the deep clone context this map is used for. More...
virtual bool  | del (AcDbObjectId)
Deletes a pair entry from the map. More...
Acad::ErrorStatus  | destDb (AcDbDatabase *&) const
Gets the destination database for the deep clone action. More...
AcDb::DuplicateRecordCloning  | duplicateRecordCloning () const
this function return the answer if symbols or dictionary entries are cloned or not More...
Acad::ErrorStatus  | origDb (AcDbDatabase *&) const
Gets the source database for the deep clone action. More...
Acad::ErrorStatus  | setDestDb (AcDbDatabase *)
Sets the destination database for the deep clone action. More...
 virtual  | ~AcDbIdMapping ()
Destructor.
 Public Member Functions inherited from AcRxObject
virtual AcRxObject *  | clone () const
Exported and implemented. More...
 virtual AcRx::Ordering  | comparedTo (const AcRxObject *) const
Exported and implemented.
virtual Acad::ErrorStatus  | copyFrom (const AcRxObject *)
Exported and implemented. More...
 virtual AcRxClass *  | isA () const
Exported and implemented.
virtual Adesk::Boolean  | isEqualTo (const AcRxObject *) const
Exported and implemented. More...
bool  | isKindOf (const AcRxClass *) const
Checks the object class. More...
AcRxObject *  | queryX (const AcRxClass *) const
returns the protocol extension object assigned to this class or a parent class. More...
AcRxObject *  | x (const AcRxClass *) const
returns the protocol extension object assigned to this class or a parent class. More...
 virtual  | ~AcRxObject ()
Destructor.
 Public Attributes
AcDbIdMapping
Default constructor.
 Additional Inherited Members
 Static Public Member Functions inherited from AcRxObject
 static AcRxObject *  | cast (const AcRxObject *)
 static AcRxClass *  | desc ()
Exported and implemented.
 Protected Member Functions inherited from AcRxObject
AcRxObject ()
Exported and implemented.
Detailed Description
_
Member Function Documentation
◆ assign()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbIdMapping::assign  |  ( |  const AcDbIdPair &  |  acPair | )
virtual
Inserts a pair in the map.
Parameters
[in] | acPair | pair to be added
Returns
Acad::eOk if successful error code otherwise
◆ change()
 UX_EXPORT_FUNCTION bool AcDbIdMapping::change  |  ( |  const AcDbIdPair &  |  acPair | )
virtual
Search and replace function for a pair entry in the map.
Parameters
[in] | acPair | replacing pair, contains the key to search for
Returns
true if key is found false otherwise
◆ compute()
 UX_EXPORT_FUNCTION bool AcDbIdMapping::compute  |  ( |  AcDbIdPair &  |  acPair | ) |   const
virtual
Gets the pair data from the map.
Parameters
[in,out] | acPair | in: pair containing the key to be searched for out: pair containing values sought
Returns
true if key is found false otherwise
◆ copyFrom()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbIdMapping::copyFrom  |  ( |  const AcRxObject *  |  pSource | )
virtual
See also
AcRxObject::copyFrom()
Reimplemented from AcRxObject.
◆ deepCloneContext()
 UX_EXPORT_FUNCTION AcDb::DeepCloneType AcDbIdMapping::deepCloneContext  |  ( |   | ) |   const
Returns the deep clone context this map is used for.
Returns
AcDb::DeepCloneType context
◆ del()
 UX_EXPORT_FUNCTION bool AcDbIdMapping::del  |  ( |  AcDbObjectId  |  keyId | )
virtual
Deletes a pair entry from the map.
Parameters
[in] | keyId | containing the AcPair key to be deleted
Returns
true if AcDbIdPair is found and deleted false otherwise
◆ destDb()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbIdMapping::destDb  |  ( |  AcDbDatabase *&  |  pAcDstDb | ) |   const
Gets the destination database for the deep clone action.
Parameters
[in] | pAcDstDb | destination database
Returns
Acad::eOk if successful Acad::eNullObjectId if the destination is not set = NULL
◆ duplicateRecordCloning()
 UX_EXPORT_FUNCTION AcDb::DuplicateRecordCloning AcDbIdMapping::duplicateRecordCloning  |  ( |   | ) |   const
this function return the answer if symbols or dictionary entries are cloned or not
Parameters
[out] | void
Returns
DuplicateRecordCloning
◆ origDb()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbIdMapping::origDb  |  ( |  AcDbDatabase *&  |  pAcSrcDb | ) |   const
Gets the source database for the deep clone action.
Parameters
[out] | pAcSrcDb | source database
Returns
Acad::eOk if successful Acad::eNoDatabase if no deep cloning is taking place Acad::eNotApplicable when called by
deepCloneObjects() and sets pAcSrcDb to destination database
wblockCloneObjects() and sets pAcSrcDb to NULL
◆ setDestDb()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbIdMapping::setDestDb  |  ( |  AcDbDatabase *  |  pAcDstDb | )
Sets the destination database for the deep clone action.
Parameters
[out] | pAcDstDb | destination database
Returns
Acad::eOk if successful , when the database is not set or if already set is the same as db Acad::eWrongDatabase, if the database is already set and different than db