Public Types | Public Member Functions | Static Public Member Functions | Public Attributes | Protected Member Functions | List of all members
AcDbMText Class Reference
_ More...
#include <AcDbMText.h>
 Public Types
enum  | AttachmentPoint {
 kTopLeft = 1 , kTopCenter , kTopRight , kMiddleLeft ,
 kMiddleCenter , kMiddleRight , kBottomLeft , kBottomCenter ,
 kBottomRight , kBaseLeft , kBaseCenter , kBaseRight ,
 kBaseAlign , kBottomAlign , kMiddleAlign , kTopAlign ,
 kBaseFit , kBottomFit , kMiddleFit , kTopFit ,
 kBaseMid , kBottomMid , kMiddleMid , kTopMid
 }
enum  | ColumnType { kNoColumns = 0 , kStaticColumns = 1 , kDynamicColumns = 2 }
enum  | FlowDirection {
 kLtoR = 1 , kRtoL , kTtoB , kBtoT ,
 kByStyle
 }
 Public Types inherited from AcDbEntity
enum  | VisualStyleType { kFullVisualStyle = 0 , kFaceVisualStyle = 1 , kEdgeVisualStyle = 2 }
 Public Types inherited from AcGiDrawable
enum  | DrawableType {
 kGeometry = 0 , kDistantLight , kPointLight , kSpotLight ,
 kAmbientLight , kSolidBackground , kGradientBackground , kImageBackground ,
 kGroundPlaneBackground , kViewport
 }
enum  | SetAttributesFlags {
 kDrawableNone = 0 , kDrawableIsAnEntity = 1 , kDrawableUsesNesting = 2 , kDrawableIsCompoundObject = 4 ,
 kDrawableViewIndependentViewportDraw = 8 , kDrawableIsInvisible = 16 , kDrawableHasAttributes = 32 , kDrawableRegenTypeDependentGeometry = 64 ,
 kDrawableIsDimension = 133 , kDrawableRegenDraw = 256 , kDrawableStandardDisplaySingleLOD = 512 , kDrawableShadedDisplaySingleLOD = 1024 ,
 kDrawableViewDependentViewportDraw = 2048 , kDrawableBlockDependentViewportDraw = 4096 , kDrawableIsExternalReference = 8192 , kDrawableNotPlottable = 16384 ,
 kDrawableNotAllowLCS = 32768 , kDrawableMergeControlOff = 65536 , kThreadedWorldDrawViewportDraw = 131072
 }
 Public Member Functions
double  | actualHeight (AcGiWorldDraw *=NULL) const
Returns the height of the bounding box. More...
double  | actualWidth () const
Returns the width of the bounding box. More...
double  | ascent () const
Gets the maximum height of the ascender for the first line. More...
AttachmentPoint  | attachment () const
Inputs the text contents of the MText object,. More...
bool  | backgroundFillOn () const
Returns true if background fill is on for this object. More...
ACHAR *  | contents () const
Returns a pointer to a dynamically allocated copy of the character contents of the MText object, formatting is removed; caller is responsible to deallocate the string by ::free() function. More...
Acad::ErrorStatus  | contents (AcString &) const
Gets the text content string. More...
 ACHAR *  | contentsRTF () const
Acad::ErrorStatus  | contentsRTF (AcString &sContentsRTF) const
Gets the rich text content string. More...
 Acad::ErrorStatus  | convertFieldToText ()
 int  | correctSpelling ()
double  | descent () const
Gets the maximum height of the descender for the last line. More...
AcGeVector3d  | direction () const
Returns the X axis for the text,. More...
void  | explodeFragments (AcDbMTextEnum, void *, AcGiWorldDraw *=NULL) const
Splits the mtext in simple text fragments. More...
FlowDirection  | flowDirection () const
Gets the flow direction for the MText. More...
Acad::ErrorStatus  | getBackgroundFillColor (AcCmColor &) const
Returns the background fill color (DXF 63). More...
Acad::ErrorStatus  | getBackgroundScaleFactor (double &) const
Gets the background scale factor. More...
Acad::ErrorStatus  | getBackgroundTransparency (AcCmTransparency &) const
This function gets for this object the transparency but only if the background fill is defined for object. More...
void  | getBoundingPoints (AcGePoint3dArray &) const
Returns the bounding box points in WCS. More...
Acad::ErrorStatus  | getColumnAutoHeight (bool &) const
Returns whether this AcDbMText entity uses fixed or dynamic column height. More...
Acad::ErrorStatus  | getColumnCount (int &) const
Returns the number of columns used by this AcDbMText entity. More...
Acad::ErrorStatus  | getColumnFlowReversed (bool &) const
Returns the column flow direction as normal or reversed; defines where columns are added. More...
Acad::ErrorStatus  | getColumnGutterWidth (double &) const
Returns the column gutter width used by this AcDbMText entity. More...
Acad::ErrorStatus  | getColumnHeight (int, double &) const
Returns the column height for the specified column. More...
Acad::ErrorStatus  | getColumnType (ColumnType &) const
Returns the column type used by this AcDbMText entity. More...
Acad::ErrorStatus  | getColumnWidth (double &) const
Returns the column width used by this AcDbMText entity. More...
void  | getEcs (AcGeMatrix3d &) const
double  | height () const
Gets the height of this MText object. More...
double  | lineSpacingFactor () const
Returns the line spacing factor. More...
AcDb::LineSpacingStyle  | lineSpacingStyle () const
Returns the line spacing style. More...
AcGePoint3d  | location () const
Gets the text location point,. More...
AcGeVector3d  | normal () const
Gets the text normal vector. More...
Acad::ErrorStatus  | removeField (AcDbObjectId)
Removes specified field. More...
Acad::ErrorStatus  | removeField (const ACHAR *)
Removes specified field. More...
Acad::ErrorStatus  | removeField (const ACHAR *, AcDbObjectId &)
Removes specified field. More...
double  | rotation () const
Gets the rotation angle. More...
Acad::ErrorStatus  | setAttachment (AttachmentPoint)
Inputs the text contents of the MText object,. More...
Acad::ErrorStatus  | setAttachmentMovingLocation (AttachmentPoint)
Thats the type of attachment (DXF 71) More...
Acad::ErrorStatus  | setBackgroundFill (bool)
Sets background fill on or off (DXF 90, bit 1);. More...
Acad::ErrorStatus  | setBackgroundFillColor (const AcCmColor &)
Sets the background fill color (DXF 63) More...
Acad::ErrorStatus  | setBackgroundScaleFactor (const double)
Sets the background scale factor. More...
Acad::ErrorStatus  | setBackgroundTransparency (const AcCmTransparency &)
This function sets for this object the transparency. More...
Acad::ErrorStatus  | setColumnAutoHeight (bool)
Defines whether this AcDbMText entity uses fixed or dynamic column height. More...
Acad::ErrorStatus  | setColumnCount (int)
Defines the number of columns used by this AcDbMText entity. More...
Acad::ErrorStatus  | setColumnFlowReversed (bool)
Defines the column flow direction as normal or reversed; defines where columns are added. More...
Acad::ErrorStatus  | setColumnGutterWidth (double)
Defines the column gutter width used by this AcDbMText entity. More...
Acad::ErrorStatus  | setColumnHeight (int, double)
Defines the column height for the specified column. More...
Acad::ErrorStatus  | setColumnType (ColumnType)
Assigns the column type to be used by this AcDbMText entity. More...
Acad::ErrorStatus  | setColumnWidth (double)
Defines the column width used by this AcDbMText entity. More...
int  | setContents (const ACHAR *)
Inputs the text contents of the MText object,. More...
int  | setContentsRTF (const ACHAR *)
Inputs the text contents of the MText object,. More...
Acad::ErrorStatus  | setDirection (const AcGeVector3d &)
Sets the X axis for the text,. More...
Acad::ErrorStatus  | setDynamicColumns (double, double, bool)
Sets this AcDbMText entity to dynamic columns mode, using specified parameters. More...
Acad::ErrorStatus  | setField (const ACHAR *, AcDbField *, AcDbObjectId &)
Adds a field to store in current object. More...
Acad::ErrorStatus  | setFlowDirection (FlowDirection)
Sets the flow direction for the MText. More...
Acad::ErrorStatus  | setHeight (double)
Sets the height for this MText object. More...
Acad::ErrorStatus  | setLineSpacingFactor (double)
Sets the line spacing factor to factor. More...
Acad::ErrorStatus  | setLineSpacingStyle (AcDb::LineSpacingStyle)
Sets the line spacing style to style. More...
Acad::ErrorStatus  | setLocation (const AcGePoint3d &)
Sets the text location point. More...
Acad::ErrorStatus  | setNormal (const AcGeVector3d &)
Sets the normal vector for the MText. More...
Acad::ErrorStatus  | setRotation (double)
Sets the rotation angle. More...
Acad::ErrorStatus  | setShowBorders (bool)
Enables or disables the border frame for this MText entity. More...
Acad::ErrorStatus  | setStaticColumns (double, double, int)
Sets this AcDbMText entity to tatic columns mode, using specified parameters. More...
Acad::ErrorStatus  | setTextHeight (double)
Sets the text height. More...
Acad::ErrorStatus  | setTextStyle (AcDbObjectId)
Sets the text style. More...
Acad::ErrorStatus  | setUseBackgroundColor (bool)
Sets whether using background color (DXF 90 bit 2);. More...
Acad::ErrorStatus  | setWidth (double)
Sets the text width. More...
bool  | showBorders () const
Returns whether the border frame for the MText is enabled or not. More...
ACHAR *  | text () const
Returns a pointer to a dynamically allocated copy of the character contents of the MText object, formatting is removed; caller is responsible to deallocate the string by ::free() function. More...
Acad::ErrorStatus  | text (AcString &) const
Gets the displayed text string without formatting. More...
double  | textHeight () const
Gets the text height. More...
AcDbObjectId  | textStyle () const
Gets the text style. More...
bool  | useBackgroundColorOn () const
Returns whether using background color (DXF 90 bit 2);. More...
double  | width () const
Gets the maximum text width. More...
 Public Member Functions inherited from AcDbEntity
 virtual Acad::ErrorStatus  | addSubentPaths (const AcDbFullSubentPathArray &) final
virtual Acad::ErrorStatus  | applyPartialUndo (AcDbDwgFiler *, AcRxClass *)
virtual Acad::ErrorStatus  | audit (AcDbAuditInfo *)
AcDbObjectId  | blockId () const
Returns the Object ID of the BlockTableRecord that owns this entity. More...
Acad::ErrorStatus  | boundingBoxIntersectWith (const AcDbEntity *, AcDb::Intersect, AcGePoint3dArray &, Adesk::GsMarker, Adesk::GsMarker) const
Finds the intersection between the edges of the bounding box for this entity and the pOhter entity. More...
Acad::ErrorStatus  | boundingBoxIntersectWith (const AcDbEntity *, AcDb::Intersect, const AcGePlane &, AcGePoint3dArray &, Adesk::GsMarker, Adesk::GsMarker) const
First, the function projects the other entity and the bounding box of this entity on plane specified by plane. More...
virtual bool  | bounds (AcDbExtents &) const
Returns the extents of this entity as AcDbExtents. More...
virtual bool  | castShadows () const
Checks if this entity is able to cast shadows. More...
virtual Adesk::Boolean  | cloneMeForDragging () final
Checks if a clone will be created for this entity in case of a drag operation. More...
 virtual AcDb::CollisionType  | collisionType () const
AcCmColor  | color () const
Returns the true color information of the entity. More...
Adesk::UInt16  | colorIndex () const
Returns the color number in a range from 0 to 256. More...
 virtual Acad::ErrorStatus  | deleteSubentPaths (const AcDbFullSubentPathArray &) final
virtual void  | dragStatus (const AcDb::DragStat)
Acad::ErrorStatus  | draw ()
Draws or redraws the entity on screen. More...
virtual AcGiDrawable *  | drawable ()
virtual Acad::ErrorStatus  | dwgInFields (AcDbDwgFiler *)
virtual Acad::ErrorStatus  | dwgOutFields (AcDbDwgFiler *) const
virtual Acad::ErrorStatus  | dxfInFields (AcDbDxfFiler *)
virtual Acad::ErrorStatus  | dxfOutFields (AcDbDxfFiler *) const
AcCmEntityColor  | entityColor () const
Returns the lightweight color information of the entity. More...
virtual Acad::ErrorStatus  | explode (AcDbVoidPtrArray &) const final
virtual Acad::ErrorStatus  | getCompoundObjectTransform (AcGeMatrix3d &) const final
It is used for object without geometry like AcDbMleader. More...
virtual void  | getEcs (AcGeMatrix3d &) const
Returns the transformation matrix from OCS (Object Coordinate System) to WCS (World Coordinate System). More...
virtual Acad::ErrorStatus  | getGeomExtents (AcDbExtents &) const final
Returns extents of this entity. More...
 virtual Acad::ErrorStatus  | getGripEntityUCS (const void *, AcGeVector3d &, AcGePoint3d &, AcGeVector3d &) const final
 virtual Acad::ErrorStatus  | getGripPoints (AcDbGripDataPtrArray &, const double, const int, const AcGeVector3d &, const int) const final
virtual Acad::ErrorStatus  | getGripPoints (AcGePoint3dArray &, AcDbIntArray &, AcDbIntArray &) const final
Append grip points to the specified array. More...
 virtual Acad::ErrorStatus  | getGripPointsAtSubentPath (const AcDbFullSubentPath &, AcDbGripDataPtrArray &, const double, const int, const AcGeVector3d &, const int) const final
virtual Acad::ErrorStatus  | getGsMarkersAtSubentPath (const AcDbFullSubentPath &, AcArray< Adesk::GsMarker > &) const final
virtual Acad::ErrorStatus  | getMaterialMapper (AcGiMapper &) const
virtual Acad::ErrorStatus  | getOsnapPoints (AcDb::OsnapMode, Adesk::GsMarker, const AcGePoint3d &, const AcGePoint3d &, const AcGeMatrix3d &, AcGePoint3dArray &, AcDbIntArray &) const final
Gets the entity osnap points. More...
virtual Acad::ErrorStatus  | getOsnapPoints (AcDb::OsnapMode, Adesk::GsMarker, const AcGePoint3d &, const AcGePoint3d &, const AcGeMatrix3d &, AcGePoint3dArray &, AcDbIntArray &, const AcGeMatrix3d &) const final
Gets the entity osnap points. More...
virtual Acad::ErrorStatus  | getPlane (AcGePlane &, AcDb::Planarity &) const
Returns the plane that contains this entity. More...
AcDb::PlotStyleNameType  | getPlotStyleNameId (AcDbObjectId &) const
Returns the plot style name type and its associated id. More...
virtual Acad::ErrorStatus  | getStretchPoints (AcGePoint3dArray &) const final
Append stretch points to the specified array. More...
 virtual Acad::ErrorStatus  | getSubentClassId (const AcDbFullSubentPath &, CLSID *) const final
 virtual Acad::ErrorStatus  | getSubentPathGeomExtents (const AcDbFullSubentPath &, AcDbExtents &) const final
virtual Acad::ErrorStatus  | getSubentPathsAtGsMarker (AcDb::SubentType, Adesk::GsMarker, const AcGePoint3d &, const AcGeMatrix3d &, int &, AcDbFullSubentPath *&, int=0, AcDbObjectId *=NULL) const final
Gets the subentity paths appropriate for the passed in gs marker. More...
virtual Acad::ErrorStatus  | getTransformedCopy (const AcGeMatrix3d &, AcDbEntity *&) const final
Creates a copy of the current entity applying the transformation matrix. More...
 virtual void  | gripStatus (const AcDb::GripStat) final
 virtual bool  | hideMeForDragging () const final
virtual Acad::ErrorStatus  | highlight (const AcDbFullSubentPath &=kNullSubent, const Adesk::Boolean=Adesk::kFalse) const final
Highlights part of, or entire entity. More...
virtual Acad::ErrorStatus  | intersectWith (const AcDbEntity *, AcDb::Intersect, AcGePoint3dArray &, Adesk::GsMarker=0, Adesk::GsMarker=0) const final
Finds the intersection between this entity and the pOhter entity. More...
virtual Acad::ErrorStatus  | intersectWith (const AcDbEntity *, AcDb::Intersect, const AcGePlane &, AcGePoint3dArray &, Adesk::GsMarker=0, Adesk::GsMarker=0) const final
Projects this entity and the pOhter entity on plane, finds the intersection points between these projections and then projects back the points onto the caller entity. More...
 virtual bool  | isContentSnappable () const final
virtual Adesk::Boolean  | isPlanar () const
ACHAR *  | layer () const
Returns the layername. More...
AcDbObjectId  | layerId () const
Returns the Object ID of the LayerTableRecord referenced by this entity. More...
ACHAR *  | linetype () const
Gets the linetype value. More...
AcDbObjectId  | linetypeId () const
Gets the linetypeId value. More...
 double  | linetypeScale () const
returns the linetype scale factor for the entity
AcDb::LineWeight  | lineWeight () const
Gets the entity line weight. More...
virtual void  | list () const final
Prints the properties in drawing window. More...
ACHAR *  | material () const
Gets the material assigned to this entity. More...
AcDbObjectId  | materialId () const
Gets the AcDbObjectId of the material assigned to this entity. More...
virtual Acad::ErrorStatus  | moveGripPointsAt (const AcDbIntArray &, const AcGeVector3d &) final
Move the grip points pointed by the indexes specified in indexArray using the translationVector param direction and length Override this method in custom entities to define your own behaviour. More...
 virtual Acad::ErrorStatus  | moveGripPointsAt (const AcDbVoidPtrArray &, const AcGeVector3d &, const int) final
 virtual Acad::ErrorStatus  | moveGripPointsAtSubentPaths (const AcDbFullSubentPathArray &, const AcDbVoidPtrArray &, const AcGeVector3d &, const int) final
virtual Acad::ErrorStatus  | moveStretchPointsAt (const AcDbIntArray &, const AcGeVector3d &) final
Move the stretch points pointed by the indexes specified in indexArray with the offest specified by translationVector Override this method in custom entities to define your own behaviour. More...
ACHAR *  | plotStyleName () const
Returns the name of the plotStyleName string associated with this entity (DXF 390). More...
virtual bool  | receiveShadows () const
Checks if this entity is able to receive shadows. More...
void  | recordGraphicsModified (Adesk::Boolean=Adesk::kTrue)
Controls the entity display update when closing it Entities not updated when closed are updated at the first regen. More...
virtual void  | saveAs (AcGiWorldDraw *, AcDb::SaveType)
Generates the graphics primitives when a DWG save requiring proxy graphics to be saved is made. More...
virtual void  | setCastShadows (bool)
Sets this entity's flag regarding casting shadows. More...
virtual Acad::ErrorStatus  | setColor (const AcCmColor &, Adesk::Boolean=Adesk::kTrue)
Sets the color information of this entity from an AcCmColor instance. More...
virtual Acad::ErrorStatus  | setColor (const AcCmColor &, bool, AcDbDatabase *)
Sets the color property of this entity from an AcCmColor instance. More...
virtual Acad::ErrorStatus  | setColorIndex (Adesk::UInt16, Adesk::Boolean=Adesk::kTrue)
Sets the color index of this entity (DXF 62). More...
void  | setDatabaseDefaults ()
Applies the default properties of the entities database to this entity. More...
void  | setDatabaseDefaults (AcDbDatabase *)
Applies the default properties of the specified database to this entity. More...
virtual Acad::ErrorStatus  | setLayer (AcDbObjectId, Adesk::Boolean=Adesk::kTrue, bool=false)
Sets the layer to be referenced by this entity (DXF 8). More...
virtual Acad::ErrorStatus  | setLayer (const ACHAR *, Adesk::Boolean=Adesk::kTrue, bool=false)
Sets the layer to be referenced by this entity (DXF 8). More...
virtual Acad::ErrorStatus  | setLinetype (AcDbObjectId, Adesk::Boolean=Adesk::kTrue)
Sets the entities linetype to ltypeObjectId. More...
virtual Acad::ErrorStatus  | setLinetype (const ACHAR *, Adesk::Boolean=Adesk::kTrue)
Sets the entities linetype to the linetpye referenced by layerName. More...
virtual Acad::ErrorStatus  | setLinetypeScale (double, Adesk::Boolean=Adesk::kTrue)
sets value as entity linetype scale factor More...
virtual Acad::ErrorStatus  | setLineWeight (AcDb::LineWeight, Adesk::Boolean=Adesk::kTrue)
Sets the entity line weight. More...
virtual Acad::ErrorStatus  | setMaterial (AcDbObjectId, Adesk::Boolean=Adesk::kTrue)
Not implemented yet. More...
virtual Acad::ErrorStatus  | setMaterial (const ACHAR *, Adesk::Boolean=Adesk::kTrue)
Assigns the material to the entity. More...
virtual Acad::ErrorStatus  | setMaterialMapper (const AcGiMapper &, Adesk::Boolean=Adesk::kTrue)
It is used for apply material (scale, rotation, projection, mode overrides) to an identity.If it is used AcGiMapper::kIdentity it will apply for entity a default mapper. More...
virtual Acad::ErrorStatus  | setPlotStyleName (AcDb::PlotStyleNameType, AcDbObjectId=AcDbObjectId::kNull, Adesk::Boolean=Adesk::kTrue)
Sets the plot style of this entity. More...
virtual Acad::ErrorStatus  | setPlotStyleName (const ACHAR *, Adesk::Boolean=Adesk::kTrue)
Sets the plot style of this entity. More...
Acad::ErrorStatus  | setPropertiesFrom (const AcDbEntity *, Adesk::Boolean=Adesk::kTrue)
Copies the properties color, layer, linetype, linetypescale and visibility from the source entity pEntity to this entity. More...
virtual void  | setReceiveShadows (bool)
Sets this entity's flag regarding receiving shadows. More...
virtual Acad::ErrorStatus  | setTransparency (const AcCmTransparency &, Adesk::Boolean=Adesk::kTrue)
Sets the transparency setting of this entity, and returns eOk if successful. More...
virtual Acad::ErrorStatus  | setVisibility (AcDb::Visibility, Adesk::Boolean=Adesk::kTrue) final
notyetdocumented. More...
 virtual Acad::ErrorStatus  | setVisualStyle (AcDbObjectId, VisualStyleType=kFullVisualStyle, Adesk::Boolean=true)
 virtual void  | subentGripStatus (const AcDb::GripStat, const AcDbFullSubentPath &) final
virtual AcDbEntity *  | subentPtr (const AcDbFullSubentPath &) const final
Creates an entity as a copy of the subentity given by acSubentPath. More...
virtual void  | subSetDatabaseDefaults (AcDbDatabase *)
This function is called by AcDbEntity::setDatabaseDefaults(), to allow custom entities to set their related sub entities, if any; default implementation does nothing. More...
virtual Acad::ErrorStatus  | transformBy (const AcGeMatrix3d &) final
Applies given transformation (matrix) to the entity. More...
 virtual Acad::ErrorStatus  | transformSubentPathsBy (const AcDbFullSubentPathArray &, const AcGeMatrix3d &) final
 AcCmTransparency  | transparency () const
Returns the transparency setting of this entity.
virtual Acad::ErrorStatus  | unhighlight (const AcDbFullSubentPath &=kNullSubent, const Adesk::Boolean=Adesk::kFalse) const final
Unhighlights previously highlighted part of entity, or entire entity. More...
AcDb::Visibility  | visibility () const
Gets the visibility state. More...
 AcDbObjectId  | visualStyleId (VisualStyleType=kFullVisualStyle) const
 Public Member Functions inherited from AcDbObject
virtual Acad::ErrorStatus  | addPersistentReactor (AcDbObjectId)
Adds a persistent reactor to this object reactor list. More...
Acad::ErrorStatus  | addReactor (AcDbObjectReactor *) const
Adds a transient reactor to this object. More...
virtual Acad::ErrorStatus  | applyPartialUndo (AcDbDwgFiler *, AcRxClass *)
This function is called during Undo operations on objects, that use the 'Partial Undo meachanism'; this is, this object is opened with assertWriteEnabled(Adesk::kFalse) to indicate that custom Undo filing is used rather than the default Undo filing. More...
 void  | assertNotifyEnabled () const
 void  | assertReadEnabled () const
 void  | assertWriteEnabled (Adesk::Boolean=Adesk::kTrue, Adesk::Boolean=Adesk::kTrue)
virtual Acad::ErrorStatus  | audit (AcDbAuditInfo *)
Performs the audit operation for this object. More...
Acad::ErrorStatus  | cancel ()
Reverts all changes since the object had been opened and closes the object. More...
virtual void  | cancelled (const AcDbObject *)
A handler function for persistent reactors. More...
virtual AcRxObject *  | clone () const
Creates a shallow clone of this object. More...
Acad::ErrorStatus  | close ()
Closes the object. More...
Acad::ErrorStatus  | closeAndPage (Adesk::Boolean=Adesk::kTrue)
Closes the object. More...
virtual Acad::ErrorStatus  | composeForLoad (AcDb::OdaSaveType, AcDb::AcDbDwgVersion)
This function is intended for future MT file loading support. More...
virtual void  | copied (const AcDbObject *, const AcDbObject *)
A handler function for persistent reactors. More...
virtual Acad::ErrorStatus  | copyFrom (const AcRxObject *)
Copies the pSrc object information in this object. More...
Acad::ErrorStatus  | createExtensionDictionary ()
Creates a dictionary as extension dictionary for this object. More...
AcDbDatabase *  | database () const
Returns the database that contains this object. More...
virtual Acad::ErrorStatus  | decomposeForSave (AcDb::AcDbDwgVersion, AcDbObject *&, AcDbObjectId &, Adesk::Boolean &)
This function is called during dwg and dxf output, to allow a custom object to decompose itself, due to provided dwg/dxf target file version. More...
virtual Acad::ErrorStatus  | deepClone (AcDbObject *, AcDbObject *&, AcDbIdMapping &, Adesk::Boolean=Adesk::kTrue) const final
Clones this object, appends it to the owner pOwner and adds an AcDbIdPair record to the idMap. More...
void  | disableUndoRecording (Adesk::Boolean)
Disables or enables the undo recording for the object. More...
Acad::ErrorStatus  | downgradeOpen ()
Sets the open mode for an object opened for write to be opened for read. More...
Acad::ErrorStatus  | downgradeToNotify (Adesk::Boolean)
Sets the open mode for an object opened for write to be opened for notify. More...
virtual AcGiDrawable *  | drawable ()
Retrieves the AcGiDrawable instance of this object. More...
Acad::ErrorStatus  | dwgIn (AcDbDwgFiler *)
Calls the object's dwgInFields function, and reads any XData if present. More...
virtual Acad::ErrorStatus  | dwgInFields (AcDbDwgFiler *)
Reads the object from the DWG filer. More...
Acad::ErrorStatus  | dwgOut (AcDbDwgFiler *) const
Calls the object's dwgOutFields function, and writes any XData if present. More...
virtual Acad::ErrorStatus  | dwgOutFields (AcDbDwgFiler *) const
Writes the object to the DWG filer. More...
Acad::ErrorStatus  | dxfIn (AcDbDxfFiler *)
Calls the object's dxfInFields function, and reads any XData if present. More...
virtual Acad::ErrorStatus  | dxfInFields (AcDbDxfFiler *)
Reads the object from the DXF filer. More...
Acad::ErrorStatus  | dxfOut (AcDbDxfFiler *, Adesk::Boolean, Adesk::uchar *) const
Calls the object's dxfOutFields function, and writes any XData if present. More...
virtual Acad::ErrorStatus  | dxfOutFields (AcDbDxfFiler *) const
Writes the object to the DXF filer. More...
Acad::ErrorStatus  | erase (Adesk::Boolean=Adesk::kTrue)
Sets the bit that indicates that the object is erased. More...
virtual void  | erased (const AcDbObject *, Adesk::Boolean)
A handler function for persistent reactors. More...
AcDbObjectId  | extensionDictionary () const
Returns the object id of the extension dictionary for this object. More...
void  | getAcDbHandle (AcDbHandle &) const
Returns handle of this object. More...
Acad::ErrorStatus  | getBinaryData (const ACHAR *, Adesk::Int32 &, char *&) const
Creates a copy of the binary data stored as chunks of maximum 127 bytes in the resbuf chain of this object's extension dictionary xrecord entry given by entryName. More...
int  | getBrxOpenCount () const
This function returns the number of open BRX instances for this object. More...
int  | getBrxOpenState () const
This function returns the BRX object open state flags as bitfields, for diagnostic purpose. More...
virtual Acad::ErrorStatus  | getClassID (CLSID *) const final
Gets the COM wrapper Class ID for this entity. More...
int  | getCustomObjectState () const
This function returns the custom object status : 1=isCustomObject 2=DifferentialUndoDisabled. More...
Acad::ErrorStatus  | getField (const ACHAR *, AcDbField *&, AcDb::OpenMode) const
Retrieves the specified Field from this object, and opens it in mode. More...
Acad::ErrorStatus  | getField (const ACHAR *, AcDbObjectId &) const
Gets the pszPropName field object from field dictionary of this AcDbObject object, using pszPropName as key. More...
AcDbObjectId  | getFieldDictionary () const
Returns the Field dictionary associated with this object,. More...
Acad::ErrorStatus  | getFieldDictionary (AcDbDictionary *&, AcDb::OpenMode) const
Gets and opens the field dictionary for this. More...
Acad::ErrorStatus  | getObjectBirthVersion (AcDb::AcDbDwgVersion &, AcDb::MaintenanceReleaseVersion &)
This function is currently not supported by the CAD engine, always returns Acad::eOk, and 'kDHL_CURRENT' + 'kMReleaseCurrent' results. More...
virtual Acad::ErrorStatus  | getObjectSaveVersion (const AcDbDwgFiler *, AcDb::AcDbDwgVersion &, AcDb::MaintenanceReleaseVersion &)
Returns the DWG version for saving the object. More...
virtual Acad::ErrorStatus  | getObjectSaveVersion (const AcDbDxfFiler *, AcDb::AcDbDwgVersion &, AcDb::MaintenanceReleaseVersion &)
Returns the DWG version for saving the object. More...
int  | getOdaOpenCount () const
This function returns the number of open ODA instances for this object. More...
int  | getOdaOpenState () const
This function returns the ODA object open state flags as bitfields, for diagnostic purpose. More...
virtual void  | goodbye (const AcDbObject *)
A handler function for persistent reactors. More...
Acad::ErrorStatus  | handOverTo (AcDbObject *, Adesk::Boolean=Adesk::kTrue, Adesk::Boolean=Adesk::kTrue)
Hands over objects identity to another object. More...
bool  | hasFields () const
Return true if this object has single or multiple fields associated with him. More...
bool  | hasPersistentReactor (AcDbObjectId) const
Checks the input objectId in this object reactor list. More...
bool  | hasSaveVersionOverride ()
This function indicates whether this object overrides the filer's save version. More...
virtual AcDbObjectId  | id () const
Returns the database id of this object. More...
Adesk::Boolean  | isAcDbObjectIdsInFlux () const
Checks whether a deep clone operation was completed. More...
Adesk::Boolean  | isAProxy () const
Adesk::Boolean  | isCancelling () const
Adesk::Boolean  | isErased () const
Returns whether this object is erased. More...
Adesk::Boolean  | isEraseStatusToggled () const
Checks whether the object erase status has been toggled. More...
Adesk::Boolean  | isModified () const
Returns whether this object's assertWriteEnabled() has been called since it was opened. More...
Adesk::Boolean  | isModifiedGraphics () const
Checks whether this object graphics will be updated when the object is closed. More...
Adesk::Boolean  | isModifiedXData () const
Checks whether this object's xData was modified. More...
Adesk::Boolean  | isNewObject () const
Returns true if and only if this object has not been closed since it was created. More...
Adesk::Boolean  | isNotifyEnabled () const
Returns whether this object is opened for notify. More...
Adesk::Boolean  | isNotifying () const
virtual Adesk::Boolean  | isPersistent () const
Returns the 'persistent' status of a database object. More...
Adesk::Boolean  | isReadEnabled () const
Returns whether this object is opened for read. More...
 Adesk::Boolean  | isReallyClosing () const
Checks whether the next close call will completely close this object return true if on the next call the object will be completely closed false otherwise.
Adesk::Boolean  | isTransactionResident () const
Gets the object transaction status. More...
Adesk::Boolean  | isUndoing () const
bool  | isUndoRecordingDisabled () const
Returns whether the undo recording for the object is enabled or not. More...
Adesk::Boolean  | isWriteEnabled () const
Returns whether this object is opened for write. More...
virtual AcDb::DuplicateRecordCloning  | mergeStyle () const
Returns the object's merge behavior during cloning. More...
virtual void  | modified (const AcDbObject *)
A handler function for persistent reactors. More...
virtual void  | modifiedGraphics (const AcDbEntity *)
A handler function for persistent reactors. More...
virtual void  | modifiedXData (const AcDbObject *)
A handler function for persistent reactors. More...
virtual void  | modifyUndone (const AcDbObject *)
A handler function for persistent reactors. More...
virtual void  | objectClosed (const AcDbObjectId)
A handler function for persistent reactors. More...
AcDbObjectId  | objectId () const
Returns object id. More...
virtual void  | openedForModify (const AcDbObject *)
A handler function for persistent reactors. More...
AcDbObjectId  | ownerId () const
Returns object id of the owner. More...
AcDbVoidPtrArray *  | reactors ()
Gets the object pointers to reactors. More...
const AcDbVoidPtrArray *  | reactors () const
Gets the object pointers to reactors. More...
virtual void  | reappended (const AcDbObject *)
A handler function for persistent reactors. More...
 virtual void  | recvPropagateModify (const AcDbObject *)
Not implemented yet.
Acad::ErrorStatus  | releaseExtensionDictionary ()
Removes the extension dictionary associated with this object. More...
virtual Acad::ErrorStatus  | removeField (AcDbObjectId)
Removes the Field specified by acFieldId from this object. More...
virtual Acad::ErrorStatus  | removeField (const ACHAR *)
Removes the Field specified by szKeyString from this object. More...
virtual Acad::ErrorStatus  | removeField (const ACHAR *, AcDbObjectId &)
Removes the Field specified by acPszKeyString from this object, and returns its ObjectId value. More...
virtual Acad::ErrorStatus  | removePersistentReactor (AcDbObjectId)
Removes a persistent reactor from this object reactor list. More...
Acad::ErrorStatus  | removeReactor (AcDbObjectReactor *) const
Removes a transient reactor to this object. More...
void  | setAcDbObjectIdsInFlux ()
Call this function to indicate that the object IDs of this object and its sub-objects (if any) are not yet valid. More...
Acad::ErrorStatus  | setBinaryData (const ACHAR *, Adesk::Int32, const char *)
Creates a copy of the binary data, divides it in up to 127 bytes binary chunks and
 sets them as resbufs in the resbuf chain of this object's extension dictionary xrecord entry given by entryName. More...
virtual Acad::ErrorStatus  | setField (const ACHAR *, AcDbField *, AcDbObjectId &)
Adds the pAcField field object to field dictionary of this AcDbObject object, using pKey as key. More...
void  | setHasSaveVersionOverride (bool)
This function can be called to specify that the object has a "save version override". More...
virtual Acad::ErrorStatus  | setOwnerId (AcDbObjectId)
Sets the ownerId data member of the object to be objId. More...
virtual Acad::ErrorStatus  | setXData (const resbuf *)
Sets/removes xData associated with this object. More...
virtual Acad::ErrorStatus  | subCancel ()
Possibility to veto a cancel operation from within custom entities. More...
virtual Acad::ErrorStatus  | subClose ()
virtual Acad::ErrorStatus  | subErase (Adesk::Boolean)
This hook is called during an AcDbObject::erase call, before any actual erase operation is performed. More...
 virtual Acad::ErrorStatus  | subHandOverTo (AcDbObject *)
virtual void  | subObjModified (const AcDbObject *, const AcDbObject *)
A handler function for persistent reactors. More...
 virtual Acad::ErrorStatus  | subOpen (AcDb::OpenMode)
virtual Acad::ErrorStatus  | subSwapIdWith (AcDbObjectId, Adesk::Boolean=Adesk::kFalse, Adesk::Boolean=Adesk::kFalse)
This hook is called during an AcDbObject::swapIdWith() call, before any actual swap operation is performed. More...
Acad::ErrorStatus  | swapIdWith (AcDbObjectId, Adesk::Boolean=Adesk::kFalse, Adesk::Boolean=Adesk::kFalse)
Swaps the object id's between the object identified by param swapId and this object. More...
virtual Acad::ErrorStatus  | swapReferences (const AcDbIdMapping &)
Not implemented yet. More...
virtual void  | unappended (const AcDbObject *)
A handler function for persistent reactors. More...
AcDbDwgFiler *  | undoFiler ()
Gets the undo filer for this object. More...
Acad::ErrorStatus  | upgradeFromNotify (Adesk::Boolean &)
Upgrades the open status of this object to AcDb::kForWrite, if this object is already open (either in AcDb::kForRead, AcDb::kForNotify or AcDb::kForWrite) More...
Acad::ErrorStatus  | upgradeOpen ()
Changes the objects open mode to AcDb::kForWrite and sends notifications. More...
virtual Acad::ErrorStatus  | wblockClone (AcRxObject *, AcDbObject *&, AcDbIdMapping &, Adesk::Boolean=Adesk::kTrue) const final
Clones this object, appends it to the owner pOwner and adds an AcDbIdPair record to the idMap. More...
virtual resbuf *  | xData (const ACHAR *=NULL) const
Returns the xData associated with this object. More...
Acad::ErrorStatus  | xDataTransformBy (const AcGeMatrix3d &)
Transforms the extended data according to parameter transformation matrix. More...
 virtual void  | xmitPropagateModify () const
Not implemented yet.
 virtual  | ~AcDbObject ()
Destructor.
 Public Member Functions inherited from AcGiDrawable
virtual bool  | bounds (AcDbExtents &) const
virtual DrawableType  | drawableType () const
 virtual AcGiDrawStream *  | drawStream () const
 AcGsNode *  | gsNode () const
virtual AcDbObjectId  | id () const =0
virtual Adesk::Boolean  | isPersistent () const =0
virtual Adesk::UInt32  | regenSupportFlags () const final
Returns whether and to which level this object supports MultiThreading. More...
 virtual Adesk::Boolean  | RolloverHit (Adesk::ULongPtr, Adesk::ULongPtr, Adesk::Boolean)
 virtual Adesk::UInt32  | setAttributes (AcGiDrawableTraits *) final
 virtual void  | setDrawStream (AcGiDrawStream *)
 void  | setGsNode (AcGsNode *)
 virtual void  | viewportDraw (AcGiViewportDraw *) final
 virtual Adesk::UInt32  | viewportDrawLogicalFlags (AcGiViewportDraw *) final
 virtual Adesk::Boolean  | worldDraw (AcGiWorldDraw *) final
 Public Member Functions inherited from AcRxObject
virtual AcRxObject *  | clone () const
Exported and implemented. More...
 virtual AcRx::Ordering  | comparedTo (const AcRxObject *) const
Exported and implemented.
virtual Acad::ErrorStatus  | copyFrom (const AcRxObject *)
Exported and implemented. More...
 virtual AcRxClass *  | isA () const
Exported and implemented.
virtual Adesk::Boolean  | isEqualTo (const AcRxObject *) const
Exported and implemented. More...
bool  | isKindOf (const AcRxClass *) const
Checks the object class. More...
AcRxObject *  | queryX (const AcRxClass *) const
returns the protocol extension object assigned to this class or a parent class. More...
AcRxObject *  | x (const AcRxClass *) const
returns the protocol extension object assigned to this class or a parent class. More...
 virtual  | ~AcRxObject ()
Destructor.
 Static Public Member Functions
static const ACHAR *const  | alignChange ()
Returns the string for align change. More...
static const ACHAR *const  | blockBegin ()
Returns the string for block begin. More...
static const ACHAR *const  | blockEnd ()
Returns the string for block end. More...
static const ACHAR *const  | colorChange ()
Returns the string for color change. More...
static const ACHAR *const  | fontChange ()
Returns the string for font change. More...
static const ACHAR *const  | heightChange ()
Returns the string for height change. More...
static const ACHAR *const  | lineBreak ()
Returns the string for line break. More...
static const ACHAR *const  | nonBreakSpace ()
Returns the string for non break space. More...
static const ACHAR *const  | obliqueChange ()
Returns the string for oblique change. More...
static const ACHAR *const  | overlineOff ()
Returns the string for overline off. More...
static const ACHAR *const  | overlineOn ()
Returns the string for overline on. More...
static const ACHAR *const  | paragraphBreak ()
Returns the string for paragraph break. More...
static const ACHAR *const  | stackStart ()
Returns the string for stack text start. More...
static const ACHAR *const  | trackChange ()
Returns the string for track change. More...
static const ACHAR *const  | underlineOff ()
Sets underline off. More...
static const ACHAR *const  | underlineOn ()
Sets underline on. More...
static const ACHAR *const  | widthChange ()
Returns the string for width change. More...
 Static Public Member Functions inherited from AcRxObject
 static AcRxObject *  | cast (const AcRxObject *)
 static AcRxClass *  | desc ()
Exported and implemented.
 Static Public Member Functions inherited from AcHeapOperators
 static void  | operator delete (void *)
_
 static void  | operator delete (void *, const char *, int)
 static void  | operator delete (void *, void *)
 static void  | operator delete[] (void *)
_
 static void  | operator delete[] (void *, const char *, int)
 static void *  | operator new (size_t)
_
 static void *  | operator new (size_t, const char *, int)
 static void *  | operator new (size_t, void *p)
 static void *  | operator new[] (size_t)
_
 static void *  | operator new[] (size_t, const char *, int)
 Public Attributes
AcDbMText
Default constructor.
 Public Attributes inherited from AcDbEntity
AcDbEntity
This protected constructor sets the initial value for color to 257, and for the objectids for layer and linetype to AcDbObjectId::kNull. More...
 Protected Member Functions
virtual Acad::ErrorStatus  | subGetTransformedCopy (const AcGeMatrix3d &, AcDbEntity *&) const
 Protected Member Functions inherited from AcDbEntity
 virtual Acad::ErrorStatus  | subAddSubentPaths (const AcDbFullSubentPathArray &)
 virtual Adesk::Boolean  | subCloneMeForDragging ()
 virtual Acad::ErrorStatus  | subDeleteSubentPaths (const AcDbFullSubentPathArray &)
virtual Acad::ErrorStatus  | subExplode (AcDbVoidPtrArray &) const
 virtual Acad::ErrorStatus  | subGetCompoundObjectTransform (AcGeMatrix3d &) const
virtual Acad::ErrorStatus  | subGetGeomExtents (AcDbExtents &) const
virtual Acad::ErrorStatus  | subGetGripEntityUCS (const void *, AcGeVector3d &, AcGePoint3d &, AcGeVector3d &) const
virtual Acad::ErrorStatus  | subGetGripPoints (AcDbGripDataPtrArray &, const double, const int, const AcGeVector3d &, const int) const
virtual Acad::ErrorStatus  | subGetGripPoints (AcGePoint3dArray &, AcDbIntArray &, AcDbIntArray &) const
 virtual Acad::ErrorStatus  | subGetGripPointsAtSubentPath (const AcDbFullSubentPath &, AcDbGripDataPtrArray &, const double, const int, const AcGeVector3d &, const int) const
virtual Acad::ErrorStatus  | subGetGsMarkersAtSubentPath (const AcDbFullSubentPath &, AcArray< Adesk::GsMarker > &) const
virtual Acad::ErrorStatus  | subGetOsnapPoints (AcDb::OsnapMode, Adesk::GsMarker, const AcGePoint3d &, const AcGePoint3d &, const AcGeMatrix3d &, AcGePoint3dArray &, AcDbIntArray &) const
 virtual Acad::ErrorStatus  | subGetOsnapPoints (AcDb::OsnapMode, Adesk::GsMarker, const AcGePoint3d &, const AcGePoint3d &, const AcGeMatrix3d &, AcGePoint3dArray &, AcDbIntArray &, const AcGeMatrix3d &) const
virtual Acad::ErrorStatus  | subGetStretchPoints (AcGePoint3dArray &) const
 virtual Acad::ErrorStatus  | subGetSubentClassId (const AcDbFullSubentPath &, CLSID *) const
 virtual Acad::ErrorStatus  | subGetSubentPathGeomExtents (const AcDbFullSubentPath &, AcDbExtents &) const
virtual Acad::ErrorStatus  | subGetSubentPathsAtGsMarker (AcDb::SubentType, Adesk::GsMarker, const AcGePoint3d &, const AcGeMatrix3d &, int &, AcDbFullSubentPath *&, int=0, AcDbObjectId *=nullptr) const
virtual Acad::ErrorStatus  | subGetTransformedCopy (const AcGeMatrix3d &, AcDbEntity *&) const
virtual void  | subGripStatus (const AcDb::GripStat)
 virtual bool  | subHideMeForDragging () const
virtual Acad::ErrorStatus  | subHighlight (const AcDbFullSubentPath &=kNullSubent, const Adesk::Boolean=false) const
virtual Acad::ErrorStatus  | subIntersectWith (const AcDbEntity *, AcDb::Intersect, AcGePoint3dArray &, Adesk::GsMarker=0, Adesk::GsMarker=0) const
virtual Acad::ErrorStatus  | subIntersectWith (const AcDbEntity *, AcDb::Intersect, const AcGePlane &, AcGePoint3dArray &, Adesk::GsMarker=0, Adesk::GsMarker=0) const
virtual bool  | subIsContentSnappable () const
virtual void  | subList () const
virtual Acad::ErrorStatus  | subMoveGripPointsAt (const AcDbIntArray &, const AcGeVector3d &)
virtual Acad::ErrorStatus  | subMoveGripPointsAt (const AcDbVoidPtrArray &, const AcGeVector3d &, const int)
 virtual Acad::ErrorStatus  | subMoveGripPointsAtSubentPaths (const AcDbFullSubentPathArray &, const AcDbVoidPtrArray &, const AcGeVector3d &, const int)
virtual Acad::ErrorStatus  | subMoveStretchPointsAt (const AcDbIntArray &, const AcGeVector3d &)
virtual Adesk::UInt32  | subSetAttributes (AcGiDrawableTraits *)
Sets the values of this object's subentity traits and returns with the calling object's subentity traits. More...
virtual Acad::ErrorStatus  | subSetVisibility (AcDb::Visibility, Adesk::Boolean=true)
 virtual void  | subSubentGripStatus (const AcDb::GripStat, const AcDbFullSubentPath &)
virtual AcDbEntity *  | subSubentPtr (const AcDbFullSubentPath &) const
virtual Acad::ErrorStatus  | subTransformBy (const AcGeMatrix3d &)
 virtual Acad::ErrorStatus  | subTransformSubentPathsBy (const AcDbFullSubentPathArray &, const AcGeMatrix3d &)
virtual Acad::ErrorStatus  | subUnhighlight (const AcDbFullSubentPath &=kNullSubent, const Adesk::Boolean=false) const
virtual void  | subViewportDraw (AcGiViewportDraw *)
 virtual AcDb::Visibility  | subVisibility () const
virtual Adesk::Boolean  | subWorldDraw (AcGiWorldDraw *)
 Protected Member Functions inherited from AcDbObject
virtual Acad::ErrorStatus  | subDeepClone (AcDbObject *, AcDbObject *&, AcDbIdMapping &, Adesk::Boolean=true) const
virtual Acad::ErrorStatus  | subGetClassID (CLSID *) const
virtual Adesk::UInt32  | subSetAttributes (AcGiDrawableTraits *)
Sets the values of this object's subentity traits and returns with the calling object's subentity traits. More...
virtual void  | subViewportDraw (AcGiViewportDraw *)
virtual Adesk::UInt32  | subViewportDrawLogicalFlags (AcGiViewportDraw *)
virtual Acad::ErrorStatus  | subWblockClone (AcRxObject *, AcDbObject *&, AcDbIdMapping &, Adesk::Boolean=true) const
virtual Adesk::Boolean  | subWorldDraw (AcGiWorldDraw *)
 Protected Member Functions inherited from AcGiDrawable
virtual Adesk::UInt32  | subRegenSupportFlags () const
Returns whether and to which level this object supports MultiThreading. More...
virtual Adesk::UInt32  | subSetAttributes (AcGiDrawableTraits *)=0
virtual void  | subViewportDraw (AcGiViewportDraw *)=0
 virtual Adesk::UInt32  | subViewportDrawLogicalFlags (AcGiViewportDraw *)
virtual Adesk::Boolean  | subWorldDraw (AcGiWorldDraw *)=0
 Protected Member Functions inherited from AcRxObject
AcRxObject ()
Exported and implemented.
Detailed Description
_
Member Function Documentation
◆ actualHeight()
 UX_EXPORT_FUNCTION double AcDbMText::actualHeight  |  ( |  AcGiWorldDraw *  |  contextWorldDraw = NULL | ) |   const
Returns the height of the bounding box.
Using worldDraw if given or the current drawing context if worldDraw is NULL.
Parameters
[in] | contextWorldDraw | Drawing context to use
Returns
height of the bounding box
◆ actualWidth()
 UX_EXPORT_FUNCTION double AcDbMText::actualWidth  |  ( |   | ) |   const
Returns the width of the bounding box.
Can be different of width().
Returns
actual width of the bounding box.
◆ alignChange()
 UX_EXPORT_FUNCTION const ACHAR *const AcDbMText::alignChange  |  ( |   | )
static
Returns the string for align change.
Returns
_T("\A")
◆ ascent()
 UX_EXPORT_FUNCTION double AcDbMText::ascent  |  ( |   | ) |   const
Gets the maximum height of the ascender for the first line.
Returns
ascent of MText object
◆ attachment()
 UX_EXPORT_FUNCTION AcDbMText::AttachmentPoint AcDbMText::attachment  |  ( |   | ) |   const
Inputs the text contents of the MText object,.
Parameters
[in] | text | string
Returns
some int
◆ backgroundFillOn()
 UX_EXPORT_FUNCTION bool AcDbMText::backgroundFillOn  |  ( |   | ) |   const
Returns true if background fill is on for this object.
Returns
true if the background fill is on. Otherwise returns false
◆ blockBegin()
 UX_EXPORT_FUNCTION const ACHAR *const AcDbMText::blockBegin  |  ( |   | )
static
Returns the string for block begin.
Returns
_T("{")
◆ blockEnd()
 UX_EXPORT_FUNCTION const ACHAR *const AcDbMText::blockEnd  |  ( |   | )
static
Returns the string for block end.
Returns
_T("}")
◆ colorChange()
 UX_EXPORT_FUNCTION const ACHAR *const AcDbMText::colorChange  |  ( |   | )
static
Returns the string for color change.
Returns
_T("\C")
◆ contents() [1/2]
 UX_EXPORT_FUNCTION ACHAR * AcDbMText::contents  |  ( |   | ) |   const
Returns a pointer to a dynamically allocated copy of the character contents of the MText object, formatting is removed; caller is responsible to deallocate the string by ::free() function.
Returns
string contents
◆ contents() [2/2]
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbMText::contents  |  ( |  AcString &  |  content | ) |   const
Gets the text content string.
Parameters
[out] | content | string
Returns
Acad::eOk if successful
◆ contentsRTF()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbMText::contentsRTF  |  ( |  AcString &  |  content | ) |   const
Gets the rich text content string.
Parameters
[out] | content | string
Returns
Acad::eOk if successful
◆ descent()
 UX_EXPORT_FUNCTION double AcDbMText::descent  |  ( |   | ) |   const
Gets the maximum height of the descender for the last line.
Returns
descent of MText object
◆ direction()
 UX_EXPORT_FUNCTION AcGeVector3d AcDbMText::direction  |  ( |  void  |   | ) |   const
Returns the X axis for the text,.
Returns
AcGeVector3d X axis
◆ explodeFragments()
 UX_EXPORT_FUNCTION void AcDbMText::explodeFragments  |  ( |  AcDbMTextEnum  |  cbf,
|  void *  |  sndArg,
|  AcGiWorldDraw *  |  ctxt = NULL
) |   |  const
Splits the mtext in simple text fragments.
Parameters
[in] | cbf | callback function
[in] | sndCbkArg | the second argument of the callback function cbf
[in] | ctxt | drawing context
Remarks
unlike some other CAD platforms this function does only work for database resident objects.
◆ flowDirection()
 UX_EXPORT_FUNCTION AcDbMText::FlowDirection AcDbMText::flowDirection  |  ( |   | ) |   const
Gets the flow direction for the MText.
Returns
the flow direction of the test or asserts if error is encountered
◆ fontChange()
 UX_EXPORT_FUNCTION const ACHAR *const AcDbMText::fontChange  |  ( |   | )
static
Returns the string for font change.
Returns
_T("\F")
◆ getBackgroundFillColor()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbMText::getBackgroundFillColor  |  ( |  AcCmColor &  |  bgFillClr | ) |   const
Returns the background fill color (DXF 63).
Parameters
[out] | bgFillClr | background fill
Returns
Acad::eOk, if background fill is on, Acad::eNotApplicable if background fill is undefined.
◆ getBackgroundScaleFactor()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbMText::getBackgroundScaleFactor  |  ( |  double &  |  scale | ) |   const
Gets the background scale factor.
Parameters
[out] | scale | factor
Returns
Acad::eOk if successful
◆ getBackgroundTransparency()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbMText::getBackgroundTransparency  |  ( |  AcCmTransparency &  |  acCmTransp | ) |   const
This function gets for this object the transparency but only if the background fill is defined for object.
Parameters
[in] | acCmTransp | transparency
Returns
Acad::eOk if successful; error status otherwise
◆ getBoundingPoints()
 UX_EXPORT_FUNCTION void AcDbMText::getBoundingPoints  |  ( |  AcGePoint3dArray &  |  pntArray | ) |   const
Returns the bounding box points in WCS.
The four points are appended to pntsArr.
Parameters
[out] | pntArray | array of 4 points, top left, top right, bottom left, bottom right.
◆ getColumnAutoHeight()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbMText::getColumnAutoHeight  |  ( |  bool &  |  isAutoHeight | ) |   const
Returns whether this AcDbMText entity uses fixed or dynamic column height.
Parameters
[out] | isAutoHeight | - true/false, specifies whether automatic or fixed column height is used
Returns
Acad::eOk if successful, error status otherwise
◆ getColumnCount()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbMText::getColumnCount  |  ( |  int &  |  numColumns | ) |   const
Returns the number of columns used by this AcDbMText entity.
Parameters
[out] | numColumns | - number of columns
Returns
Acad::eOk if successful, error status otherwise
◆ getColumnFlowReversed()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbMText::getColumnFlowReversed  |  ( |  bool &  |  isReversed | ) |   const
Returns the column flow direction as normal or reversed; defines where columns are added.
Parameters
[out] | isReversed | - the column flow direction used
Returns
Acad::eOk if successful, error status otherwise
◆ getColumnGutterWidth()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbMText::getColumnGutterWidth  |  ( |  double &  |  gutterWidth | ) |   const
Returns the column gutter width used by this AcDbMText entity.
Parameters
[out] | gutterWidth | - the column gutter width used
Returns
Acad::eOk if successful, error status otherwise
◆ getColumnHeight()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbMText::getColumnHeight  |  ( |  int  |  colIdx,
|  double &  |  colHeight
) |   |  const
Returns the column height for the specified column.
Parameters
[in] | colIdx | - the column index
[out] | colHeight | - the column height used by the specified column
Returns
Acad::eOk if successful, error status otherwise
◆ getColumnType()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbMText::getColumnType  |  ( |  ColumnType &  |  colType | ) |   const
Returns the column type used by this AcDbMText entity.
Parameters
[out] | colType | - specifies the column type used by this MText entity
Returns
Acad::eOk if successful, error status otherwise
◆ getColumnWidth()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbMText::getColumnWidth  |  ( |  double &  |  columnWidth | ) |   const
Returns the column width used by this AcDbMText entity.
Parameters
[out] | columnWidth | - the column width used
Returns
Acad::eOk if successful, error status otherwise
◆ getEcs()
 UX_EXPORT_FUNCTION void AcDbMText::getEcs  |  ( |  AcGeMatrix3d &  |  retVal | ) |   const
virtual
See also
AcDbEntity::getEcs(AcGeMatrix3d&)
Reimplemented from AcDbEntity.
◆ height()
 UX_EXPORT_FUNCTION double AcDbMText::height  |  ( |   | ) |   const
Gets the height of this MText object.
Returns
height of MText object
◆ heightChange()
 UX_EXPORT_FUNCTION const ACHAR *const AcDbMText::heightChange  |  ( |   | )
static
Returns the string for height change.
Returns
_T("\H")
◆ lineBreak()
 UX_EXPORT_FUNCTION const ACHAR *const AcDbMText::lineBreak  |  ( |   | )
static
Returns the string for line break.
Returns
_T("\p")
◆ lineSpacingFactor()
 UX_EXPORT_FUNCTION double AcDbMText::lineSpacingFactor  |  ( |   | ) |   const
Returns the line spacing factor.
A factor of 1.0 represents single spacing and a facor of 2.0 represents double spacing. The factor returned is between 0.25 and 4.0.
Returns
factor for line spacing
◆ lineSpacingStyle()
 UX_EXPORT_FUNCTION AcDb::LineSpacingStyle AcDbMText::lineSpacingStyle  |  ( |   | ) |   const
Returns the line spacing style.
Returns
style used line spacing
◆ location()
 UX_EXPORT_FUNCTION AcGePoint3d AcDbMText::location  |  ( |  void  |   | ) |   const
Gets the text location point,.
Returns
location point
◆ nonBreakSpace()
 UX_EXPORT_FUNCTION const ACHAR *const AcDbMText::nonBreakSpace  |  ( |   | )
static
Returns the string for non break space.
Returns
_T("\~")
◆ normal()
 UX_EXPORT_FUNCTION AcGeVector3d AcDbMText::normal  |  ( |  void  |   | ) |   const
Gets the text normal vector.
Returns
normal vector
◆ obliqueChange()
 UX_EXPORT_FUNCTION const ACHAR *const AcDbMText::obliqueChange  |  ( |   | )
static
Returns the string for oblique change.
Returns
_T("\Q")
◆ overlineOff()
 UX_EXPORT_FUNCTION const ACHAR *const AcDbMText::overlineOff  |  ( |   | )
static
Returns the string for overline off.
Returns
_T("\o")
◆ overlineOn()
 UX_EXPORT_FUNCTION const ACHAR *const AcDbMText::overlineOn  |  ( |   | )
static
Returns the string for overline on.
Returns
_T("\O")
◆ paragraphBreak()
 UX_EXPORT_FUNCTION const ACHAR *const AcDbMText::paragraphBreak  |  ( |   | )
static
Returns the string for paragraph break.
Returns
_T("\P")
◆ removeField() [1/3]
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbMText::removeField  |  ( |  AcDbObjectId  |  acFieldId | )
virtual
Removes specified field.
Parameters
[in] | acFieldId | - field identifier to remove
Returns
Acad::eOk if successful
Remarks
Currently this does not work for NDBRO AcDbMText.
Reimplemented from AcDbObject.
◆ removeField() [2/3]
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbMText::removeField  |  ( |  const ACHAR *  |  pKey | )
virtual
Removes specified field.
Parameters
[in] | pKey | - property name to remove
Returns
Acad::eOk if successful
Remarks
Currently this does not work for NDBRO AcDbMText.
Reimplemented from AcDbObject.
◆ removeField() [3/3]
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbMText::removeField  |  ( |  const ACHAR *  |  pKey,
|  AcDbObjectId &  |  acFieldId
)
virtual
Removes specified field.
Parameters
[in] | pKey | - property name to remove
[out] | acFieldId | - field identifier removed
Returns
Acad::eOk if successful
Remarks
Currently this does not work for NDBRO AcDbMText.
Reimplemented from AcDbObject.
◆ rotation()
 UX_EXPORT_FUNCTION double AcDbMText::rotation  |  ( |  void  |   | ) |   const
Gets the rotation angle.
Returns
rotation angle
◆ setAttachment()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbMText::setAttachment  |  ( |  AttachmentPoint  |  pnt | )
Inputs the text contents of the MText object,.
Parameters
[in] | pnt
Returns
Acad::eOk if successful
 Acad::Acad::eInvalidInput if error occurs
◆ setAttachmentMovingLocation()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbMText::setAttachmentMovingLocation  |  ( |  AttachmentPoint  |  type | )
Thats the type of attachment (DXF 71)
Parameters
[in] | type | type of attachment
Returns
one of Acad::eInvalidInput , Acad::eOk
◆ setBackgroundFill()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbMText::setBackgroundFill  |  ( |  bool  |  bFillOn | )
Sets background fill on or off (DXF 90, bit 1);.
Parameters
[in] | bFillOn | enable (or disable)
Returns
Acad::eOk
◆ setBackgroundFillColor()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbMText::setBackgroundFillColor  |  ( |  const AcCmColor &  |  bgFillClr | )
Sets the background fill color (DXF 63)
Parameters
[in] | bgFillClr | background fill color
Returns
◆ setBackgroundScaleFactor()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbMText::setBackgroundScaleFactor  |  ( |  const double  |  scale | )
Sets the background scale factor.
Parameters
[in] | scale
Returns
Acad::eOk if successful
◆ setBackgroundTransparency()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbMText::setBackgroundTransparency  |  ( |  const AcCmTransparency &  |  acCmTransp | )
This function sets for this object the transparency.
Parameters
[in] | acCmTransp | transparency
Returns
Acad::eOk if successful; error status otherwise
◆ setColumnAutoHeight()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbMText::setColumnAutoHeight  |  ( |  bool  |  isAutoHeight | )
Defines whether this AcDbMText entity uses fixed or dynamic column height.
Parameters
[in] | isAutoHeight | - true/false, specifies whether automatic or fixed column height is used
Returns
Acad::eOk if successful, error status otherwise
◆ setColumnCount()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbMText::setColumnCount  |  ( |  int  |  numColumns | )
Defines the number of columns used by this AcDbMText entity.
Parameters
[in] | numColumns | - the number of columns to be used
Returns
Acad::eOk if successful, error status otherwise
◆ setColumnFlowReversed()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbMText::setColumnFlowReversed  |  ( |  bool  |  isReversed | )
Defines the column flow direction as normal or reversed; defines where columns are added.
Parameters
[in] | isReversed | - true/false, for reversed or normal column flow direction
Returns
Acad::eOk if successful, error status otherwise
◆ setColumnGutterWidth()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbMText::setColumnGutterWidth  |  ( |  double  |  gutterWidth | )
Defines the column gutter width used by this AcDbMText entity.
Parameters
[in] | gutterWidth | - the gutter width to be used for of columns
Returns
Acad::eOk if successful, error status otherwise
◆ setColumnHeight()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbMText::setColumnHeight  |  ( |  int  |  colIdx,
|  double  |  colHeight
)
Defines the column height for the specified column.
Parameters
[in] | colIdx | - the column index
[in] | colHeight | - the column height to be used for the specified column
Returns
Acad::eOk if successful, error status otherwise
◆ setColumnType()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbMText::setColumnType  |  ( |  ColumnType  |  colType | )
Assigns the column type to be used by this AcDbMText entity.
Parameters
[in] | colType | - specifies the column type to be used
Returns
Acad::eOk if successful, error status otherwise
◆ setColumnWidth()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbMText::setColumnWidth  |  ( |  double  |  columnWidth | )
Defines the column width used by this AcDbMText entity.
Parameters
[in] | columnWidth | - the width to be used for of columns
Returns
Acad::eOk if successful, error status otherwise
◆ setContents()
 UX_EXPORT_FUNCTION int AcDbMText::setContents  |  ( |  const ACHAR *  |  text | )
Inputs the text contents of the MText object,.
Parameters
[in] | text | string
Returns
some int (usually 0)
◆ setContentsRTF()
 UX_EXPORT_FUNCTION int AcDbMText::setContentsRTF  |  ( |  const ACHAR *  |  text | )
Inputs the text contents of the MText object,.
Parameters
[in] | text | string format RTF
Returns
0 if succesfull
◆ setDirection()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbMText::setDirection  |  ( |  const AcGeVector3d &  |  direction | )
Sets the X axis for the text,.
Returns
Acad::eOk if successful
◆ setDynamicColumns()
 Acad::ErrorStatus AcDbMText::setDynamicColumns  |  ( |  double  |  colWidth,
|  double  |  gutterWidth,
|  bool  |  isAutoHeight
)
Sets this AcDbMText entity to dynamic columns mode, using specified parameters.
Parameters
[in] | colWidth | - the column width
[in] | gutterWidth | - the column gutter width
[in] | isAutoHeight | - true/false, specifies whether automatic or fixed column height is used
Returns
Acad::eOk if successful, error status otherwise
◆ setField()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbMText::setField  |  ( |  const ACHAR *  |  pKey,
|  AcDbField *  |  pAcField,
|  AcDbObjectId &  |  acFieldId
)
virtual
Adds a field to store in current object.
Parameters
[in] | pKey | - property name of the field
[in] | pAcField | - field to set
[out] | acFieldId | - field identifier
Returns
Acad::eOk if successful
Remarks
Currently this does not work for NDBRO AcDbMText.
Reimplemented from AcDbObject.
◆ setFlowDirection()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbMText::setFlowDirection  |  ( |  FlowDirection  |  direction | )
Sets the flow direction for the MText.
Parameters
[in] | flow | direction
Returns
Acad::eOk if successful
◆ setHeight()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbMText::setHeight  |  ( |  double  |  txtHeight | )
Sets the height for this MText object.
Parameters
[in] | txtHeight
Returns
Acad::eOk if successful, Acad::eInvalidInput otherwise
◆ setLineSpacingFactor()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbMText::setLineSpacingFactor  |  ( |  double  |  factor | )
Sets the line spacing factor to factor.
A factor of 1.0 represents single spacing
 and a facor of 2.0 represents double spacing. The factor must be between 0.25 and 4.0.
Parameters
[in] | factor | factor for line spacing
Returns
Acad::eOk if the factor is within specified limits Acad::eInvalidInput otherwise
◆ setLineSpacingStyle()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbMText::setLineSpacingStyle  |  ( |  AcDb::LineSpacingStyle  |  style | )
Sets the line spacing style to style.
Parameters
[in] | style | AcDb::kAtLeast for a minimum line spacing or AcDb::kExactly for absolute line spacing.
Returns
Acad::eOk if successful Acad::eInvalidInput otherwise
◆ setLocation()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbMText::setLocation  |  ( |  const AcGePoint3d &  |  locPoint | )
Sets the text location point.
Parameters
[in] | locPoint | location point
Returns
Acad::eOk if successful
 Acad::Acad::eInvalidInput if error occurs
◆ setNormal()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbMText::setNormal  |  ( |  const AcGeVector3d &  |  normal | )
Sets the normal vector for the MText.
Parameters
[in] | normal | vector
Returns
Acad::eOk if successful
◆ setRotation()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbMText::setRotation  |  ( |  double  |  rotation | )
Sets the rotation angle.
Parameters
[in] | rotation
Returns
Acad::eOk if successful
 Acad::Acad::eInvalidInput if error occurs
◆ setShowBorders()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbMText::setShowBorders  |  ( |  bool  |  showBorders | )
Enables or disables the border frame for this MText entity.
Parameters
[in] | showBorders | true/false to enable resp. disable the MText's border
Returns
Acad::eOk if successful; error status otherwise
◆ setStaticColumns()
 Acad::ErrorStatus AcDbMText::setStaticColumns  |  ( |  double  |  colWidth,
|  double  |  gutterWidth,
|  int  |  colCount
)
Sets this AcDbMText entity to tatic columns mode, using specified parameters.
Parameters
[in] | colWidth | - the column width
[in] | gutterWidth | - the column gutter width
[in] | colCount | - the number of columns to be used
Returns
Acad::eOk if successful, error status otherwise
◆ setTextHeight()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbMText::setTextHeight  |  ( |  double  |  textHeight | )
Sets the text height.
Parameters
[in] | textHeight
Returns
Acad::eOk if successful
 Acad::Acad::eInvalidInput if error occurs
◆ setTextStyle()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbMText::setTextStyle  |  ( |  AcDbObjectId  |  textStyleId | )
Sets the text style.
Parameters
[in] | textStyleId | text style Object id
Returns
Acad::eOk if successful
 Acad::Acad::eInvalidInput if error occurs
◆ setUseBackgroundColor()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbMText::setUseBackgroundColor  |  ( |  bool  |  bUseBgrClr | )
Sets whether using background color (DXF 90 bit 2);.
Parameters
[in] | bUseBgrClr | true for using background color, false for not using it.
Returns
Acad::eOk
◆ setWidth()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbMText::setWidth  |  ( |  double  |  textWidth | )
Sets the text width.
Parameters
[in] | textWidth
Returns
Acad::eOk if successful
 Acad::eInvalidInput if error occurs
◆ showBorders()
 UX_EXPORT_FUNCTION bool AcDbMText::showBorders  |  ( |   | ) |   const
Returns whether the border frame for the MText is enabled or not.
Returns
true/false
◆ stackStart()
 UX_EXPORT_FUNCTION const ACHAR *const AcDbMText::stackStart  |  ( |   | )
static
Returns the string for stack text start.
Returns
_T("\S")
◆ subGetTransformedCopy()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbMText::subGetTransformedCopy  |  ( |  const AcGeMatrix3d &  |  matrix,
|  AcDbEntity *&  |  resultEntity
) |   |  const
protectedvirtual
Reimplemented from AcDbEntity.
◆ text() [1/2]
 UX_EXPORT_FUNCTION ACHAR * AcDbMText::text  |  ( |   | ) |   const
Returns a pointer to a dynamically allocated copy of the character contents of the MText object, formatting is removed; caller is responsible to deallocate the string by ::free() function.
Returns
string contents
◆ text() [2/2]
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbMText::text  |  ( |  AcString &  |  txt | ) |   const
Gets the displayed text string without formatting.
Parameters
[out] | txt | string
Returns
Acad::eOk if successful
◆ textHeight()
 UX_EXPORT_FUNCTION double AcDbMText::textHeight  |  ( |  void  |   | ) |   const
Gets the text height.
Returns
text height
◆ textStyle()
 UX_EXPORT_FUNCTION AcDbObjectId AcDbMText::textStyle  |  ( |  void  |   | ) |   const
Gets the text style.
Returns
text style Object id NULL if error occurs
◆ trackChange()
 UX_EXPORT_FUNCTION const ACHAR *const AcDbMText::trackChange  |  ( |   | )
static
Returns the string for track change.
Returns
_T("\T")
◆ underlineOff()
 UX_EXPORT_FUNCTION const ACHAR *const AcDbMText::underlineOff  |  ( |   | )
static
Sets underline off.
Returns
the string "\I"
◆ underlineOn()
 UX_EXPORT_FUNCTION const ACHAR *const AcDbMText::underlineOn  |  ( |   | )
static
Sets underline on.
Returns
the string "\L"
◆ useBackgroundColorOn()
 UX_EXPORT_FUNCTION bool AcDbMText::useBackgroundColorOn  |  ( |   | ) |   const
Returns whether using background color (DXF 90 bit 2);.
Returns
using background color or not.
◆ width()
 UX_EXPORT_FUNCTION double AcDbMText::width  |  ( |  void  |   | ) |   const
Gets the maximum text width.
If a line can not be wrapped, the actualWidth() can exceed the width() value.
Returns
text width
◆ widthChange()
 UX_EXPORT_FUNCTION const ACHAR *const AcDbMText::widthChange  |  ( |   | )
static
Returns the string for width change.
Returns
_T("\W")