Public Types | Public Member Functions | Public Attributes | List of all members
AcDbMLeaderStyle Class Reference
_ More...
#include <AcDbMLeaderStyle.h>
 Public Types
enum  | BlockConnectionType { kConnectExtents = 0 , kConnectBase }
enum  | ContentType { kNoneContent = 0 , kBlockContent , kMTextContent , kToleranceContent }
enum  | DrawLeaderOrderType { kDrawLeaderHeadFirst = 0 , kDrawLeaderTailFirst }
enum  | DrawMLeaderOrderType { kDrawContentFirst = 0 , kDrawLeaderFirst }
enum  | LeaderDirectionType {
 kUnknownLeader = 0 , kLeftLeader , kRightLeader , kTopLeader ,
 kBottomLeader
 }
enum  | LeaderType { kInVisibleLeader = 0 , kStraightLeader , kSplineLeader }
enum  | SegmentAngleType {
 kAny = 0 , k15 , k30 , k45 ,
 k60 , k90 = 6 , kHorz = 12
 }
enum  | TextAlignmentType { kLeftAlignment = 0 , kCenterAlignment , kRightAlignment }
enum  | TextAngleType { kInsertAngle = 0 , kHorizontalAngle , kAlwaysRightReadingAngle }
enum  | TextAttachmentDirection { kAttachmentHorizontal = 0 , kAttachmentVertical }
enum  | TextAttachmentType {
 kAttachmentTopOfTop = 0 , kAttachmentMiddleOfTop , kAttachmentMiddle , kAttachmentMiddleOfBottom ,
 kAttachmentBottomOfBottom , kAttachmentBottomLine , kAttachmentBottomOfTopLine , kAttachmentBottomOfTop ,
 kAttachmentAllLine , kAttachmentCenter , kAttachmentLinedCenter
 }
 Public Types inherited from AcGiDrawable
enum  | DrawableType {
 kGeometry = 0 , kDistantLight , kPointLight , kSpotLight ,
 kAmbientLight , kSolidBackground , kGradientBackground , kImageBackground ,
 kGroundPlaneBackground , kViewport
 }
enum  | SetAttributesFlags {
 kDrawableNone = 0 , kDrawableIsAnEntity = 1 , kDrawableUsesNesting = 2 , kDrawableIsCompoundObject = 4 ,
 kDrawableViewIndependentViewportDraw = 8 , kDrawableIsInvisible = 16 , kDrawableHasAttributes = 32 , kDrawableRegenTypeDependentGeometry = 64 ,
 kDrawableIsDimension = 133 , kDrawableRegenDraw = 256 , kDrawableStandardDisplaySingleLOD = 512 , kDrawableShadedDisplaySingleLOD = 1024 ,
 kDrawableViewDependentViewportDraw = 2048 , kDrawableBlockDependentViewportDraw = 4096 , kDrawableIsExternalReference = 8192 , kDrawableNotPlottable = 16384 ,
 kDrawableNotAllowLCS = 32768 , kDrawableMergeControlOff = 65536 , kThreadedWorldDrawViewportDraw = 131072
 }
 Public Member Functions
 double  | alignSpace () const
bool  | annotative () const
Returns true if mleader style is annotative or false otherwise. More...
 double  | arrowSize () const
AcDbObjectId  | arrowSymbolId () const
Returns the AcDbObjectId of the arrow symbol for this MLeader entity. More...
virtual Adesk::UInt32  | bitFlags () const
Returns the actual settings for this MLeaderStyle object. More...
 AcCmColor  | blockColor () const
 BlockConnectionType  | blockConnectionType () const
 AcDbObjectId  | blockId () const
 double  | blockRotation () const
 AcGeScale3d  | blockScale () const
 double  | breakSize () const
ContentType  | contentType () const
Returns the content type for this MLeaderStyle object. More...
AcDbMText *  | defaultMText () const
Returns a sample MText, configured from this MLeaderStyle properties. More...
virtual const ACHAR *  | description () const
Returns the description of this MLeaderStyle object. More...
 double  | doglegLength () const
 DrawLeaderOrderType  | drawLeaderOrderType () const
 DrawMLeaderOrderType  | drawMLeaderOrderType () const
 bool  | enableBlockRotation () const
 bool  | enableBlockScale () const
 bool  | enableDogleg () const
bool  | enableFrameText () const
Returns whether the text frame for this AcDbMLeader object is shown or not. More...
bool  | enableLanding () const
Returns whether the landing part is enabled for this MLeader entity. More...
 bool  | extendLeaderToText () const
 SegmentAngleType  | firstSegmentAngleConstraint () const
virtual Acad::ErrorStatus  | getName (ACHAR *&) const
Returns the name of this MLeaderStyle object. More...
 bool  | isRenamable () const
double  | landingGap () const
Returns the landing gap value located between connection points and mleader content. More...
AcCmColor  | leaderLineColor () const
Gets the color of the leader line. More...
LeaderType  | leaderLineType () const
Returns the leader line type for this MLeaderStyle. More...
AcDbObjectId  | leaderLineTypeId () const
Returns the linetype ID for this MLeader entity. More...
 AcDb::LineWeight  | leaderLineWeight () const
int  | maxLeaderSegmentsPoints () const
Returns the maximum number of segment points for a leader line. More...
 bool  | overwritePropChanged () const
Acad::ErrorStatus  | postMLeaderStyleToDb (AcDbDatabase *, const ACHAR *, AcDbObjectId &)
Saves this MLeaderStyle object to the MLeaderStyle dictionary under specified name. More...
 double  | scale () const
 SegmentAngleType  | secondSegmentAngleConstraint () const
 Acad::ErrorStatus  | setAlignSpace (double)
Acad::ErrorStatus  | setAnnotative (bool)
Makes mleader style annotative or non-annotative. More...
 Acad::ErrorStatus  | setArrowSize (double)
Acad::ErrorStatus  | setArrowSymbolId (const AcDbObjectId &)
Assigns the AcDbObjectId for the arrow symbol of this MLeader entity. More...
 Acad::ErrorStatus  | setArrowSymbolId (const ACHAR *)
virtual Acad::ErrorStatus  | setBitFlags (Adesk::UInt32)
Sets the settings flags for this MLeaderStyle object. More...
 Acad::ErrorStatus  | setBlockColor (const AcCmColor &)
 Acad::ErrorStatus  | setBlockConnectionType (BlockConnectionType)
 Acad::ErrorStatus  | setBlockId (const AcDbObjectId &)
 Acad::ErrorStatus  | setBlockId (const ACHAR *)
 Acad::ErrorStatus  | setBlockRotation (double)
 Acad::ErrorStatus  | setBlockScale (const AcGeScale3d &)
 Acad::ErrorStatus  | setBreakSize (double)
Acad::ErrorStatus  | setContentType (ContentType)
Sets the content type for this MLeaderStyle object. More...
Acad::ErrorStatus  | setDefaultMText (const AcDbMText *)
Configures the MText content of this MLeaderStyle from given AcDbMText entity. More...
virtual Acad::ErrorStatus  | setDescription (const ACHAR *)
Sets the description for this MLeaderStyle object. More...
 Acad::ErrorStatus  | setDoglegLength (double)
 Acad::ErrorStatus  | setDrawLeaderOrderType (DrawLeaderOrderType)
 Acad::ErrorStatus  | setDrawMLeaderOrderType (DrawMLeaderOrderType)
 Acad::ErrorStatus  | setEnableBlockRotation (bool)
 Acad::ErrorStatus  | setEnableBlockScale (bool)
Acad::ErrorStatus  | setEnableDogleg (bool)
Enable or disable the dog leg line. More...
Acad::ErrorStatus  | setEnableFrameText (bool)
Enables or disables the text frame for this AcDbMLeader object. More...
Acad::ErrorStatus  | setEnableLanding (bool)
Defines whether the landing part is enabled or not for this MLeader entity. More...
 Acad::ErrorStatus  | setExtendLeaderToText (bool)
Acad::ErrorStatus  | setFirstSegmentAngleConstraint (SegmentAngleType)
Set the angle for the first segment of mleader object. More...
Acad::ErrorStatus  | setLandingGap (double)
Sets the landing gap value of mleader style. More...
Acad::ErrorStatus  | setLeaderLineColor (const AcCmColor &)
Sets the color of the leader line. More...
Acad::ErrorStatus  | setLeaderLineType (LeaderType)
Sets the leader line type for this MLeaderStyle. More...
Acad::ErrorStatus  | setLeaderLineTypeId (const AcDbObjectId &)
Assigns the AcDbObjectId for the linetype of this MLeader entity. More...
 Acad::ErrorStatus  | setLeaderLineWeight (AcDb::LineWeight)
Acad::ErrorStatus  | setMaxLeaderSegmentsPoints (int)
Sets the maximum number of segment points for a leader line. More...
virtual Acad::ErrorStatus  | setName (const ACHAR *)
Sets the name for this MLeaderStyle object. More...
 Acad::ErrorStatus  | setScale (double)
Acad::ErrorStatus  | setSecondSegmentAngleConstraint (SegmentAngleType)
Set the angle for the second segment of mleader object. More...
Acad::ErrorStatus  | setTextAlignAlwaysLeft (bool)
Sets text alignment to align on the left side. More...
 Acad::ErrorStatus  | setTextAlignmentType (TextAlignmentType)
Acad::ErrorStatus  | setTextAngleType (TextAngleType)
Sets the text angle type for this MLeaderStyle. More...
 Acad::ErrorStatus  | setTextAttachmentDirection (AcDbMLeaderStyle::TextAttachmentDirection)
 Acad::ErrorStatus  | setTextAttachmentType (TextAttachmentType)
Acad::ErrorStatus  | setTextAttachmentType (TextAttachmentType, LeaderDirectionType)
Sets the text attachment type, for specified leader direction, for this MLeaderStyle object. More...
Acad::ErrorStatus  | setTextColor (const AcCmColor &)
Sets the color of the text. More...
 Acad::ErrorStatus  | setTextHeight (double)
Acad::ErrorStatus  | setTextStyleId (const AcDbObjectId &)
Sets the TextStyle Id for this MLeaderStyle. More...
 bool  | textAlignAlwaysLeft () const
 TextAlignmentType  | textAlignmentType () const
 TextAngleType  | textAngleType () const
 TextAttachmentDirection  | textAttachmentDirection () const
 TextAttachmentType  | textAttachmentType () const
TextAttachmentType  | textAttachmentType (LeaderDirectionType) const
Returns the text attachment type, for specified leader direction, for this MLeaderStyle object. More...
AcCmColor  | textColor () const
Gets the color of the text. More...
 double  | textHeight () const
AcDbObjectId  | textStyleId () const
Returns the TextStyle Id for this MLeaderStyle. More...
 virtual  | ~AcDbMLeaderStyle ()
Default destructor.
 Public Member Functions inherited from AcDbObject
virtual Acad::ErrorStatus  | addPersistentReactor (AcDbObjectId)
Adds a persistent reactor to this object reactor list. More...
Acad::ErrorStatus  | addReactor (AcDbObjectReactor *) const
Adds a transient reactor to this object. More...
virtual Acad::ErrorStatus  | applyPartialUndo (AcDbDwgFiler *, AcRxClass *)
This function is called during Undo operations on objects, that use the 'Partial Undo meachanism'; this is, this object is opened with assertWriteEnabled(Adesk::kFalse) to indicate that custom Undo filing is used rather than the default Undo filing. More...
 void  | assertNotifyEnabled () const
 void  | assertReadEnabled () const
 void  | assertWriteEnabled (Adesk::Boolean=Adesk::kTrue, Adesk::Boolean=Adesk::kTrue)
virtual Acad::ErrorStatus  | audit (AcDbAuditInfo *)
Performs the audit operation for this object. More...
Acad::ErrorStatus  | cancel ()
Reverts all changes since the object had been opened and closes the object. More...
virtual void  | cancelled (const AcDbObject *)
A handler function for persistent reactors. More...
virtual AcRxObject *  | clone () const
Creates a shallow clone of this object. More...
Acad::ErrorStatus  | close ()
Closes the object. More...
Acad::ErrorStatus  | closeAndPage (Adesk::Boolean=Adesk::kTrue)
Closes the object. More...
virtual Acad::ErrorStatus  | composeForLoad (AcDb::OdaSaveType, AcDb::AcDbDwgVersion)
This function is intended for future MT file loading support. More...
virtual void  | copied (const AcDbObject *, const AcDbObject *)
A handler function for persistent reactors. More...
virtual Acad::ErrorStatus  | copyFrom (const AcRxObject *)
Copies the pSrc object information in this object. More...
Acad::ErrorStatus  | createExtensionDictionary ()
Creates a dictionary as extension dictionary for this object. More...
AcDbDatabase *  | database () const
Returns the database that contains this object. More...
virtual Acad::ErrorStatus  | decomposeForSave (AcDb::AcDbDwgVersion, AcDbObject *&, AcDbObjectId &, Adesk::Boolean &)
This function is called during dwg and dxf output, to allow a custom object to decompose itself, due to provided dwg/dxf target file version. More...
virtual Acad::ErrorStatus  | deepClone (AcDbObject *, AcDbObject *&, AcDbIdMapping &, Adesk::Boolean=Adesk::kTrue) const final
Clones this object, appends it to the owner pOwner and adds an AcDbIdPair record to the idMap. More...
void  | disableUndoRecording (Adesk::Boolean)
Disables or enables the undo recording for the object. More...
Acad::ErrorStatus  | downgradeOpen ()
Sets the open mode for an object opened for write to be opened for read. More...
Acad::ErrorStatus  | downgradeToNotify (Adesk::Boolean)
Sets the open mode for an object opened for write to be opened for notify. More...
virtual AcGiDrawable *  | drawable ()
Retrieves the AcGiDrawable instance of this object. More...
Acad::ErrorStatus  | dwgIn (AcDbDwgFiler *)
Calls the object's dwgInFields function, and reads any XData if present. More...
virtual Acad::ErrorStatus  | dwgInFields (AcDbDwgFiler *)
Reads the object from the DWG filer. More...
Acad::ErrorStatus  | dwgOut (AcDbDwgFiler *) const
Calls the object's dwgOutFields function, and writes any XData if present. More...
virtual Acad::ErrorStatus  | dwgOutFields (AcDbDwgFiler *) const
Writes the object to the DWG filer. More...
Acad::ErrorStatus  | dxfIn (AcDbDxfFiler *)
Calls the object's dxfInFields function, and reads any XData if present. More...
virtual Acad::ErrorStatus  | dxfInFields (AcDbDxfFiler *)
Reads the object from the DXF filer. More...
Acad::ErrorStatus  | dxfOut (AcDbDxfFiler *, Adesk::Boolean, Adesk::uchar *) const
Calls the object's dxfOutFields function, and writes any XData if present. More...
virtual Acad::ErrorStatus  | dxfOutFields (AcDbDxfFiler *) const
Writes the object to the DXF filer. More...
Acad::ErrorStatus  | erase (Adesk::Boolean=Adesk::kTrue)
Sets the bit that indicates that the object is erased. More...
virtual void  | erased (const AcDbObject *, Adesk::Boolean)
A handler function for persistent reactors. More...
AcDbObjectId  | extensionDictionary () const
Returns the object id of the extension dictionary for this object. More...
void  | getAcDbHandle (AcDbHandle &) const
Returns handle of this object. More...
Acad::ErrorStatus  | getBinaryData (const ACHAR *, Adesk::Int32 &, char *&) const
Creates a copy of the binary data stored as chunks of maximum 127 bytes in the resbuf chain of this object's extension dictionary xrecord entry given by entryName. More...
int  | getBrxOpenCount () const
This function returns the number of open BRX instances for this object. More...
int  | getBrxOpenState () const
This function returns the BRX object open state flags as bitfields, for diagnostic purpose. More...
virtual Acad::ErrorStatus  | getClassID (CLSID *) const final
Gets the COM wrapper Class ID for this entity. More...
int  | getCustomObjectState () const
This function returns the custom object status : 1=isCustomObject 2=DifferentialUndoDisabled. More...
Acad::ErrorStatus  | getField (const ACHAR *, AcDbField *&, AcDb::OpenMode) const
Retrieves the specified Field from this object, and opens it in mode. More...
Acad::ErrorStatus  | getField (const ACHAR *, AcDbObjectId &) const
Gets the pszPropName field object from field dictionary of this AcDbObject object, using pszPropName as key. More...
AcDbObjectId  | getFieldDictionary () const
Returns the Field dictionary associated with this object,. More...
Acad::ErrorStatus  | getFieldDictionary (AcDbDictionary *&, AcDb::OpenMode) const
Gets and opens the field dictionary for this. More...
Acad::ErrorStatus  | getObjectBirthVersion (AcDb::AcDbDwgVersion &, AcDb::MaintenanceReleaseVersion &)
This function is currently not supported by the CAD engine, always returns Acad::eOk, and 'kDHL_CURRENT' + 'kMReleaseCurrent' results. More...
virtual Acad::ErrorStatus  | getObjectSaveVersion (const AcDbDwgFiler *, AcDb::AcDbDwgVersion &, AcDb::MaintenanceReleaseVersion &)
Returns the DWG version for saving the object. More...
virtual Acad::ErrorStatus  | getObjectSaveVersion (const AcDbDxfFiler *, AcDb::AcDbDwgVersion &, AcDb::MaintenanceReleaseVersion &)
Returns the DWG version for saving the object. More...
int  | getOdaOpenCount () const
This function returns the number of open ODA instances for this object. More...
int  | getOdaOpenState () const
This function returns the ODA object open state flags as bitfields, for diagnostic purpose. More...
virtual void  | goodbye (const AcDbObject *)
A handler function for persistent reactors. More...
Acad::ErrorStatus  | handOverTo (AcDbObject *, Adesk::Boolean=Adesk::kTrue, Adesk::Boolean=Adesk::kTrue)
Hands over objects identity to another object. More...
bool  | hasFields () const
Return true if this object has single or multiple fields associated with him. More...
bool  | hasPersistentReactor (AcDbObjectId) const
Checks the input objectId in this object reactor list. More...
bool  | hasSaveVersionOverride ()
This function indicates whether this object overrides the filer's save version. More...
virtual AcDbObjectId  | id () const
Returns the database id of this object. More...
Adesk::Boolean  | isAcDbObjectIdsInFlux () const
Checks whether a deep clone operation was completed. More...
Adesk::Boolean  | isAProxy () const
Adesk::Boolean  | isCancelling () const
Adesk::Boolean  | isErased () const
Returns whether this object is erased. More...
Adesk::Boolean  | isEraseStatusToggled () const
Checks whether the object erase status has been toggled. More...
Adesk::Boolean  | isModified () const
Returns whether this object's assertWriteEnabled() has been called since it was opened. More...
Adesk::Boolean  | isModifiedGraphics () const
Checks whether this object graphics will be updated when the object is closed. More...
Adesk::Boolean  | isModifiedXData () const
Checks whether this object's xData was modified. More...
Adesk::Boolean  | isNewObject () const
Returns true if and only if this object has not been closed since it was created. More...
Adesk::Boolean  | isNotifyEnabled () const
Returns whether this object is opened for notify. More...
Adesk::Boolean  | isNotifying () const
virtual Adesk::Boolean  | isPersistent () const
Returns the 'persistent' status of a database object. More...
Adesk::Boolean  | isReadEnabled () const
Returns whether this object is opened for read. More...
 Adesk::Boolean  | isReallyClosing () const
Checks whether the next close call will completely close this object return true if on the next call the object will be completely closed false otherwise.
Adesk::Boolean  | isTransactionResident () const
Gets the object transaction status. More...
Adesk::Boolean  | isUndoing () const
bool  | isUndoRecordingDisabled () const
Returns whether the undo recording for the object is enabled or not. More...
Adesk::Boolean  | isWriteEnabled () const
Returns whether this object is opened for write. More...
virtual AcDb::DuplicateRecordCloning  | mergeStyle () const
Returns the object's merge behavior during cloning. More...
virtual void  | modified (const AcDbObject *)
A handler function for persistent reactors. More...
virtual void  | modifiedGraphics (const AcDbEntity *)
A handler function for persistent reactors. More...
virtual void  | modifiedXData (const AcDbObject *)
A handler function for persistent reactors. More...
virtual void  | modifyUndone (const AcDbObject *)
A handler function for persistent reactors. More...
virtual void  | objectClosed (const AcDbObjectId)
A handler function for persistent reactors. More...
AcDbObjectId  | objectId () const
Returns object id. More...
virtual void  | openedForModify (const AcDbObject *)
A handler function for persistent reactors. More...
AcDbObjectId  | ownerId () const
Returns object id of the owner. More...
AcDbVoidPtrArray *  | reactors ()
Gets the object pointers to reactors. More...
const AcDbVoidPtrArray *  | reactors () const
Gets the object pointers to reactors. More...
virtual void  | reappended (const AcDbObject *)
A handler function for persistent reactors. More...
 virtual void  | recvPropagateModify (const AcDbObject *)
Not implemented yet.
Acad::ErrorStatus  | releaseExtensionDictionary ()
Removes the extension dictionary associated with this object. More...
virtual Acad::ErrorStatus  | removeField (AcDbObjectId)
Removes the Field specified by acFieldId from this object. More...
virtual Acad::ErrorStatus  | removeField (const ACHAR *)
Removes the Field specified by szKeyString from this object. More...
virtual Acad::ErrorStatus  | removeField (const ACHAR *, AcDbObjectId &)
Removes the Field specified by acPszKeyString from this object, and returns its ObjectId value. More...
virtual Acad::ErrorStatus  | removePersistentReactor (AcDbObjectId)
Removes a persistent reactor from this object reactor list. More...
Acad::ErrorStatus  | removeReactor (AcDbObjectReactor *) const
Removes a transient reactor to this object. More...
void  | setAcDbObjectIdsInFlux ()
Call this function to indicate that the object IDs of this object and its sub-objects (if any) are not yet valid. More...
Acad::ErrorStatus  | setBinaryData (const ACHAR *, Adesk::Int32, const char *)
Creates a copy of the binary data, divides it in up to 127 bytes binary chunks and
 sets them as resbufs in the resbuf chain of this object's extension dictionary xrecord entry given by entryName. More...
virtual Acad::ErrorStatus  | setField (const ACHAR *, AcDbField *, AcDbObjectId &)
Adds the pAcField field object to field dictionary of this AcDbObject object, using pKey as key. More...
void  | setHasSaveVersionOverride (bool)
This function can be called to specify that the object has a "save version override". More...
virtual Acad::ErrorStatus  | setOwnerId (AcDbObjectId)
Sets the ownerId data member of the object to be objId. More...
virtual Acad::ErrorStatus  | setXData (const resbuf *)
Sets/removes xData associated with this object. More...
virtual Acad::ErrorStatus  | subCancel ()
Possibility to veto a cancel operation from within custom entities. More...
virtual Acad::ErrorStatus  | subClose ()
virtual Acad::ErrorStatus  | subErase (Adesk::Boolean)
This hook is called during an AcDbObject::erase call, before any actual erase operation is performed. More...
 virtual Acad::ErrorStatus  | subHandOverTo (AcDbObject *)
virtual void  | subObjModified (const AcDbObject *, const AcDbObject *)
A handler function for persistent reactors. More...
 virtual Acad::ErrorStatus  | subOpen (AcDb::OpenMode)
virtual Acad::ErrorStatus  | subSwapIdWith (AcDbObjectId, Adesk::Boolean=Adesk::kFalse, Adesk::Boolean=Adesk::kFalse)
This hook is called during an AcDbObject::swapIdWith() call, before any actual swap operation is performed. More...
Acad::ErrorStatus  | swapIdWith (AcDbObjectId, Adesk::Boolean=Adesk::kFalse, Adesk::Boolean=Adesk::kFalse)
Swaps the object id's between the object identified by param swapId and this object. More...
virtual Acad::ErrorStatus  | swapReferences (const AcDbIdMapping &)
Not implemented yet. More...
virtual void  | unappended (const AcDbObject *)
A handler function for persistent reactors. More...
AcDbDwgFiler *  | undoFiler ()
Gets the undo filer for this object. More...
Acad::ErrorStatus  | upgradeFromNotify (Adesk::Boolean &)
Upgrades the open status of this object to AcDb::kForWrite, if this object is already open (either in AcDb::kForRead, AcDb::kForNotify or AcDb::kForWrite) More...
Acad::ErrorStatus  | upgradeOpen ()
Changes the objects open mode to AcDb::kForWrite and sends notifications. More...
virtual Acad::ErrorStatus  | wblockClone (AcRxObject *, AcDbObject *&, AcDbIdMapping &, Adesk::Boolean=Adesk::kTrue) const final
Clones this object, appends it to the owner pOwner and adds an AcDbIdPair record to the idMap. More...
virtual resbuf *  | xData (const ACHAR *=NULL) const
Returns the xData associated with this object. More...
Acad::ErrorStatus  | xDataTransformBy (const AcGeMatrix3d &)
Transforms the extended data according to parameter transformation matrix. More...
 virtual void  | xmitPropagateModify () const
Not implemented yet.
 virtual  | ~AcDbObject ()
Destructor.
 Public Member Functions inherited from AcGiDrawable
virtual bool  | bounds (AcDbExtents &) const
virtual DrawableType  | drawableType () const
 virtual AcGiDrawStream *  | drawStream () const
 AcGsNode *  | gsNode () const
virtual AcDbObjectId  | id () const =0
virtual Adesk::Boolean  | isPersistent () const =0
virtual Adesk::UInt32  | regenSupportFlags () const final
Returns whether and to which level this object supports MultiThreading. More...
 virtual Adesk::Boolean  | RolloverHit (Adesk::ULongPtr, Adesk::ULongPtr, Adesk::Boolean)
 virtual Adesk::UInt32  | setAttributes (AcGiDrawableTraits *) final
 virtual void  | setDrawStream (AcGiDrawStream *)
 void  | setGsNode (AcGsNode *)
 virtual void  | viewportDraw (AcGiViewportDraw *) final
 virtual Adesk::UInt32  | viewportDrawLogicalFlags (AcGiViewportDraw *) final
 virtual Adesk::Boolean  | worldDraw (AcGiWorldDraw *) final
 Public Member Functions inherited from AcRxObject
virtual AcRxObject *  | clone () const
Exported and implemented. More...
 virtual AcRx::Ordering  | comparedTo (const AcRxObject *) const
Exported and implemented.
virtual Acad::ErrorStatus  | copyFrom (const AcRxObject *)
Exported and implemented. More...
 virtual AcRxClass *  | isA () const
Exported and implemented.
virtual Adesk::Boolean  | isEqualTo (const AcRxObject *) const
Exported and implemented. More...
bool  | isKindOf (const AcRxClass *) const
Checks the object class. More...
AcRxObject *  | queryX (const AcRxClass *) const
returns the protocol extension object assigned to this class or a parent class. More...
AcRxObject *  | x (const AcRxClass *) const
returns the protocol extension object assigned to this class or a parent class. More...
 virtual  | ~AcRxObject ()
Destructor.
 Public Attributes
AcDbMLeaderStyle
Default constructor.
 Additional Inherited Members
 Static Public Member Functions inherited from AcRxObject
 static AcRxObject *  | cast (const AcRxObject *)
 static AcRxClass *  | desc ()
Exported and implemented.
 Static Public Member Functions inherited from AcHeapOperators
 static void  | operator delete (void *)
_
 static void  | operator delete (void *, const char *, int)
 static void  | operator delete (void *, void *)
 static void  | operator delete[] (void *)
_
 static void  | operator delete[] (void *, const char *, int)
 static void *  | operator new (size_t)
_
 static void *  | operator new (size_t, const char *, int)
 static void *  | operator new (size_t, void *p)
 static void *  | operator new[] (size_t)
_
 static void *  | operator new[] (size_t, const char *, int)
 Protected Member Functions inherited from AcDbObject
virtual Acad::ErrorStatus  | subDeepClone (AcDbObject *, AcDbObject *&, AcDbIdMapping &, Adesk::Boolean=true) const
virtual Acad::ErrorStatus  | subGetClassID (CLSID *) const
virtual Adesk::UInt32  | subSetAttributes (AcGiDrawableTraits *)
Sets the values of this object's subentity traits and returns with the calling object's subentity traits. More...
virtual void  | subViewportDraw (AcGiViewportDraw *)
virtual Adesk::UInt32  | subViewportDrawLogicalFlags (AcGiViewportDraw *)
virtual Acad::ErrorStatus  | subWblockClone (AcRxObject *, AcDbObject *&, AcDbIdMapping &, Adesk::Boolean=true) const
virtual Adesk::Boolean  | subWorldDraw (AcGiWorldDraw *)
 Protected Member Functions inherited from AcGiDrawable
virtual Adesk::UInt32  | subRegenSupportFlags () const
Returns whether and to which level this object supports MultiThreading. More...
virtual Adesk::UInt32  | subSetAttributes (AcGiDrawableTraits *)=0
virtual void  | subViewportDraw (AcGiViewportDraw *)=0
 virtual Adesk::UInt32  | subViewportDrawLogicalFlags (AcGiViewportDraw *)
virtual Adesk::Boolean  | subWorldDraw (AcGiWorldDraw *)=0
 Protected Member Functions inherited from AcRxObject
AcRxObject ()
Exported and implemented.
Detailed Description
_
Member Function Documentation
◆ annotative()
 UX_EXPORT_FUNCTION bool AcDbMLeaderStyle::annotative  |  ( |   | ) |   const
Returns true if mleader style is annotative or false otherwise.
Returns
style annotative state
◆ arrowSymbolId()
 UX_EXPORT_FUNCTION AcDbObjectId AcDbMLeaderStyle::arrowSymbolId  |  ( |   | ) |   const
Returns the AcDbObjectId of the arrow symbol for this MLeader entity.
Returns
AcDbObjectId - the object ID of the assigned arrow symbol
◆ bitFlags()
 UX_EXPORT_FUNCTION Adesk::UInt32 AcDbMLeaderStyle::bitFlags  |  ( |   | ) |   const
virtual
Returns the actual settings for this MLeaderStyle object.
Returns
the bitflags representing the actual setting
◆ contentType()
 UX_EXPORT_FUNCTION AcDbMLeaderStyle::ContentType AcDbMLeaderStyle::contentType  |  ( |   | ) |   const
Returns the content type for this MLeaderStyle object.
Returns
actual content type
◆ defaultMText()
 UX_EXPORT_FUNCTION AcDbMText * AcDbMLeaderStyle::defaultMText  |  ( |   | ) |   const
Returns a sample MText, configured from this MLeaderStyle properties.
Returns
AcDbMText* or NULL, if no default MText can be created
◆ description()
 UX_EXPORT_FUNCTION const ACHAR * AcDbMLeaderStyle::description  |  ( |   | ) |   const
virtual
Returns the description of this MLeaderStyle object.
Returns
the decription for the MleaderStyle, mus not be released
◆ enableFrameText()
 UX_EXPORT_FUNCTION bool AcDbMLeaderStyle::enableFrameText  |  ( |   | ) |   const
Returns whether the text frame for this AcDbMLeader object is shown or not.
Returns
true or false, indicating whether the text frame is shown
◆ enableLanding()
 UX_EXPORT_FUNCTION bool AcDbMLeaderStyle::enableLanding  |  ( |   | ) |   const
Returns whether the landing part is enabled for this MLeader entity.
Returns
bool - true or false, indicating whether the landing part is enabled or not
◆ getName()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbMLeaderStyle::getName  |  ( |  ACHAR *&  |  pszName | ) |   const
virtual
Returns the name of this MLeaderStyle object.
Parameters
[out] | szName,must | be released by calling application
Returns
Acad::eOk for success, error codes otherwise
◆ landingGap()
 UX_EXPORT_FUNCTION double AcDbMLeaderStyle::landingGap  |  ( |   | ) |   const
Returns the landing gap value located between connection points and mleader content.
Returns
the landing gap distance
◆ leaderLineColor()
 UX_EXPORT_FUNCTION AcCmColor AcDbMLeaderStyle::leaderLineColor  |  ( |   | ) |   const
Gets the color of the leader line.
Returns
leader line color
◆ leaderLineType()
 UX_EXPORT_FUNCTION AcDbMLeaderStyle::LeaderType AcDbMLeaderStyle::leaderLineType  |  ( |   | ) |   const
Returns the leader line type for this MLeaderStyle.
Returns
leaderType type of leader line
◆ leaderLineTypeId()
 UX_EXPORT_FUNCTION AcDbObjectId AcDbMLeaderStyle::leaderLineTypeId  |  ( |   | ) |   const
Returns the linetype ID for this MLeader entity.
Returns
AcDbObjectId - the object ID of the MLeader's linetype
◆ maxLeaderSegmentsPoints()
 int AcDbMLeaderStyle::maxLeaderSegmentsPoints  |  ( |   | ) |   const
Returns the maximum number of segment points for a leader line.
Returns
text attachment type
◆ postMLeaderStyleToDb()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbMLeaderStyle::postMLeaderStyleToDb  |  ( |  AcDbDatabase *  |  pTargetDbb,
|  const ACHAR *  |  szStyleName,
|  AcDbObjectId &  |  styleId
)
Saves this MLeaderStyle object to the MLeaderStyle dictionary under specified name.
Parameters
[in] | pTargetDbb | database to store this style
[in] | szStyleName | name for this style
[out] | styleId | the ObjectId of the sytle
Returns
Acad::eOk for success, error codes otherwise
◆ setAnnotative()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbMLeaderStyle::setAnnotative  |  ( |  bool  |  val | )
Makes mleader style annotative or non-annotative.
Parameters
[in] | val | input flag indicating the annotative state
Returns
Acad::eOk for success, or error status otherwise
◆ setArrowSymbolId()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbMLeaderStyle::setArrowSymbolId  |  ( |  const AcDbObjectId &  |  idArrowSymbol | )
Assigns the AcDbObjectId for the arrow symbol of this MLeader entity.
Parameters
[in] | idArrowSymbol | - the AcDbObjectId of the arrow symbol to be assigned
Returns
Acad::eOk for success, error code otherwise
◆ setBitFlags()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbMLeaderStyle::setBitFlags  |  ( |  Adesk::UInt32  |  flags | )
virtual
Sets the settings flags for this MLeaderStyle object.
Parameters
[in] | flags,new | flags to be assigned
Returns
Acad::eOk for success, error codes otherwise
◆ setContentType()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbMLeaderStyle::setContentType  |  ( |  AcDbMLeaderStyle::ContentType  |  cType | )
Sets the content type for this MLeaderStyle object.
Parameters
[in] | cType | content type
Returns
Acad::eOk for success, error codes otherwise
◆ setDefaultMText()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbMLeaderStyle::setDefaultMText  |  ( |  const AcDbMText *  |  defMText | )
Configures the MText content of this MLeaderStyle from given AcDbMText entity.
Parameters
[in] | styleId | textstyle ID for the MText
Returns
Acad::eOk for success, error codes otherwise
◆ setDescription()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbMLeaderStyle::setDescription  |  ( |  const ACHAR *  |  szDescription | )
virtual
Sets the description for this MLeaderStyle object.
Parameters
[in] | szDescription,new | description to be assigned
Returns
Acad::eOk for success, error codes otherwise
◆ setEnableDogleg()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbMLeaderStyle::setEnableDogleg  |  ( |  bool  |  enableLeg | )
Enable or disable the dog leg line.
Parameters
[in] | set | enableLeg to true or false
Returns
Acad::eOk for success, or error status otherwise
◆ setEnableFrameText()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbMLeaderStyle::setEnableFrameText  |  ( |  bool  |  showFrame | )
Enables or disables the text frame for this AcDbMLeader object.
Parameters
[in] | showFrame | show or hide the text frame
Returns
Acad::eOk for success, or error status otherwise
◆ setEnableLanding()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbMLeaderStyle::setEnableLanding  |  ( |  bool  |  enable | )
Defines whether the landing part is enabled or not for this MLeader entity.
Parameters
[in] | enable | - true to enable the landing part, false otherwise
Returns
Acad::eOk for success, error code otherwise
◆ setFirstSegmentAngleConstraint()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbMLeaderStyle::setFirstSegmentAngleConstraint  |  ( |  AcDbMLeaderStyle::SegmentAngleType  |  firstAngleType | )
Set the angle for the first segment of mleader object.
Parameters
[in] | ldType | leader direction
Returns
Acad::eOk for success, error codes otherwise
◆ setLandingGap()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbMLeaderStyle::setLandingGap  |  ( |  double  |  val | )
Sets the landing gap value of mleader style.
Parameters
[in] | val | input distance of landing gap
Returns
Acad::eOk for success, or error status otherwise
◆ setLeaderLineColor()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbMLeaderStyle::setLeaderLineColor  |  ( |  const AcCmColor &  |  color | )
Sets the color of the leader line.
Parameters
[in] | color | leader line color
Returns
Acad::eOk for success, or error status otherwise
◆ setLeaderLineType()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbMLeaderStyle::setLeaderLineType  |  ( |  AcDbMLeaderStyle::LeaderType  |  leaderType | )
Sets the leader line type for this MLeaderStyle.
Parameters
[in] | leaderType | type of leader line
Returns
Acad::eOk for success, error codes otherwise
◆ setLeaderLineTypeId()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbMLeaderStyle::setLeaderLineTypeId  |  ( |  const AcDbObjectId &  |  idLineType | )
Assigns the AcDbObjectId for the linetype of this MLeader entity.
Parameters
[in] | idLineType | - the AcDbObjectId of the linetype to be assigned
Returns
Acad::eOk for success, error code otherwise
◆ setMaxLeaderSegmentsPoints()
 Acad::ErrorStatus AcDbMLeaderStyle::setMaxLeaderSegmentsPoints  |  ( |  int  |  numMaxLeaderPoints | )
Sets the maximum number of segment points for a leader line.
Parameters
[in] | numMaxLeaderPoints | max. number of leader line's segment points (0 for unlimited points)
Returns
Acad::eOk for success, error codes otherwise
◆ setName()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbMLeaderStyle::setName  |  ( |  const ACHAR *  |  pszName | )
virtual
Sets the name for this MLeaderStyle object.
Parameters
[in] | szName,new | name to be assigned
Returns
Acad::eOk for success, error codes otherwise
◆ setSecondSegmentAngleConstraint()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbMLeaderStyle::setSecondSegmentAngleConstraint  |  ( |  AcDbMLeaderStyle::SegmentAngleType  |  secondAngleType | )
Set the angle for the second segment of mleader object.
Parameters
[in] | ldType | leader direction
Returns
Acad::eOk for success, error codes otherwise
◆ setTextAlignAlwaysLeft()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbMLeaderStyle::setTextAlignAlwaysLeft  |  ( |  bool  |  alignAlwaysLeft | )
Sets text alignment to align on the left side.
Parameters
[in] | alignAlwaysLeft | input flag for setting text alignment
Returns
Acad::eOk for success, error codes otherwise
◆ setTextAngleType()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbMLeaderStyle::setTextAngleType  |  ( |  TextAngleType  |  txtAngleType | )
Sets the text angle type for this MLeaderStyle.
Parameters
[in] | txtAngleType | text angle type
Returns
Acad::eOk for success, error codes otherwise
◆ setTextAttachmentType()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbMLeaderStyle::setTextAttachmentType  |  ( |  AcDbMLeaderStyle::TextAttachmentType  |  taType,
|  AcDbMLeaderStyle::LeaderDirectionType  |  ldType
)
Sets the text attachment type, for specified leader direction, for this MLeaderStyle object.
Parameters
[in] | taType | text attachment type
[in] | ldType | leader direction
Returns
Acad::eOk for success, error codes otherwise
◆ setTextColor()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbMLeaderStyle::setTextColor  |  ( |  const AcCmColor &  |  color | )
Sets the color of the text.
Parameters
[in] | color | text color
Returns
Acad::eOk for success, or error status otherwise
◆ setTextStyleId()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbMLeaderStyle::setTextStyleId  |  ( |  const AcDbObjectId &  |  idTextStyle | )
Sets the TextStyle Id for this MLeaderStyle.
Parameters
[in] | idTextStyle | textstyle ID
Returns
Acad::eOk for success, error codes otherwise
◆ textAttachmentType()
 UX_EXPORT_FUNCTION AcDbMLeaderStyle::TextAttachmentType AcDbMLeaderStyle::textAttachmentType  |  ( |  AcDbMLeaderStyle::LeaderDirectionType  |  lDirection | ) |   const
Returns the text attachment type, for specified leader direction, for this MLeaderStyle object.
Parameters
[in] | ldType | leader direction
Returns
text attachment type
◆ textColor()
 UX_EXPORT_FUNCTION AcCmColor AcDbMLeaderStyle::textColor  |  ( |   | ) |   const
Gets the color of the text.
Returns
text color
◆ textStyleId()
 UX_EXPORT_FUNCTION AcDbObjectId AcDbMLeaderStyle::textStyleId  |  ( |   | ) |   const
Returns the TextStyle Id for this MLeaderStyle.
Returns
textstyle ID of this leader line