Public Types | Public Member Functions | Public Attributes | Protected Member Functions | List of all members
AcDbMPolygon Class Reference
_ More...
#include <AcDbMPolygon.h>
 Public Types
enum  | loopDir { kExterior = 0 , kInterior , kAnnotation }
 Public Types inherited from AcDbEntity
enum  | VisualStyleType { kFullVisualStyle = 0 , kFaceVisualStyle = 1 , kEdgeVisualStyle = 2 }
 Public Types inherited from AcGiDrawable
enum  | DrawableType {
 kGeometry = 0 , kDistantLight , kPointLight , kSpotLight ,
 kAmbientLight , kSolidBackground , kGradientBackground , kImageBackground ,
 kGroundPlaneBackground , kViewport
 }
enum  | SetAttributesFlags {
 kDrawableNone = 0 , kDrawableIsAnEntity = 1 , kDrawableUsesNesting = 2 , kDrawableIsCompoundObject = 4 ,
 kDrawableViewIndependentViewportDraw = 8 , kDrawableIsInvisible = 16 , kDrawableHasAttributes = 32 , kDrawableRegenTypeDependentGeometry = 64 ,
 kDrawableIsDimension = 133 , kDrawableRegenDraw = 256 , kDrawableStandardDisplaySingleLOD = 512 , kDrawableShadedDisplaySingleLOD = 1024 ,
 kDrawableViewDependentViewportDraw = 2048 , kDrawableBlockDependentViewportDraw = 4096 , kDrawableIsExternalReference = 8192 , kDrawableNotPlottable = 16384 ,
 kDrawableNotAllowLCS = 32768 , kDrawableMergeControlOff = 65536 , kThreadedWorldDrawViewportDraw = 131072
 }
 Public Member Functions
virtual Acad::ErrorStatus  | appendLoopFromBoundary (const AcDb2dPolyline *, bool=true, double=AcDbMPolygonCrossingFuzz)
It adds a boundary to instance of AcDbMPolygon. More...
virtual Acad::ErrorStatus  | appendLoopFromBoundary (const AcDbCircle *, bool=true, double=AcDbMPolygonCrossingFuzz)
It adds a boundary to instance of AcDbMPolygon. More...
virtual Acad::ErrorStatus  | appendLoopFromBoundary (const AcDbPolyline *, bool=true, double=AcDbMPolygonCrossingFuzz)
Adds the boundary as specified by the input AcDbPolyline as a loop to this AcDbMPolygon entity. More...
virtual Acad::ErrorStatus  | appendMPolygonLoop (const AcGePoint2dArray &, const AcGeDoubleArray &, bool=true, double=AcDbMPolygonCrossingFuzz)
It adds a new boundary to instance of AcDbMPolygon. More...
virtual Acad::ErrorStatus  | audit (AcDbAuditInfo *)
virtual Acad::ErrorStatus  | balanceDisplay ()
Removes degenerated loops, or reactivates now-valid loops, to refresh a proper hatches display. More...
virtual Acad::ErrorStatus  | balanceTree ()
Reorders all loops to be outer resp. More...
virtual Acad::ErrorStatus  | createLoops (const AcArray< AcGePoint2dArray > &, const AcArray< AcGeDoubleArray > &, AcDbIntArray &, bool=true, double=AcDbMPolygonCrossingFuzz)
Creates multiple loops for the mpolygon entity. More...
virtual Acad::ErrorStatus  | createLoopsFromBoundaries (const AcDbObjectIdArray &, AcDbIntArray &, bool=true, double=AcDbMPolygonCrossingFuzz)
Creates multiple loops from boundary entities. More...
virtual Acad::ErrorStatus  | decomposeForSave (AcDb::AcDbDwgVersion, AcDbObject *&, AcDbObjectId &, Adesk::Boolean &)
virtual void  | deleteMPolygonTree (AcDbMPolygonNode *) const
Deletes the specified node (and all sub-nodes) of the AcDbMPolygonNode tree. More...
virtual Acad::ErrorStatus  | dwgInFields (AcDbDwgFiler *)
virtual Acad::ErrorStatus  | dwgOutFields (AcDbDwgFiler *) const
virtual Acad::ErrorStatus  | dxfInFields (AcDbDxfFiler *)
virtual Acad::ErrorStatus  | dxfOutFields (AcDbDxfFiler *) const
virtual double  | elevation () const
Gets the AcDbMPolygon's elevation. More...
virtual Acad::ErrorStatus  | evaluateHatch (bool=false)
It calls for internal AcDbHatch member AcDbHatch::evaluateHatch() More...
virtual double  | getArea () const
Gets the total area of all boundaries in that AcDbMPolygon's object. More...
virtual void  | getChildLoops (int, AcGeIntArray &) const
Returns the indices of child loops for specified MPolygon boundary loop. More...
virtual int  | getClosestLoopTo (const AcGePoint3d &) const
Returns the index of the loop nearest the specified point. More...
 virtual Acad::ErrorStatus  | getLoopAtGsMarker (int, int &) const
virtual Acad::ErrorStatus  | getLoopDirection (int, loopDir &) const
Returns the direction type for the specified loop. More...
virtual Acad::ErrorStatus  | getMPolygonLoopAt (int, AcGePoint2dArray &, AcGeDoubleArray &) const
Returns the definition data of specified MPolygon boundary loop. More...
virtual Acad::ErrorStatus  | getMPolygonTree (AcDbMPolygonNode *&) const
Returns the root node of the AcDbMPolygonNode tree for this AcDbMPolygon entity. More...
virtual AcGeVector2d  | getOffsetVector () const
Gets the offset vector for this AcDbMPolygon entity (relative distance to center). More...
virtual int  | getParentLoop (int) const
Returns the index of the immediate parent loop of the specified (child) loop. More...
virtual Acad::ErrorStatus  | getPatternDefinitionAt (int, double &, double &, double &, double &, double &, AcGeDoubleArray &) const
Returns the requested loop hatch pattern information. More...
virtual double  | getPerimeter () const
Gets the total perimeter of all boundaries in that AcDbMPolygon's object. More...
virtual AcDbHatch *  | hatch ()
Gets a pointer to the internal member of class AcDbMPolygon. More...
 virtual bool  | includesTouchingLoops (double=AcDbMPolygonCrossingFuzz) const
virtual Acad::ErrorStatus  | insertMPolygonLoopAt (int, const AcGePoint2dArray &, const AcGeDoubleArray &, bool=true, double=AcDbMPolygonCrossingFuzz)
Inserts a new loop at the specified index. More...
virtual bool  | isBalanced () const
Returns whether this AcDbMPolygon entity is in balanced state (no degenerated loops, no self-crossing loops, proper inner/outer loops status). More...
virtual int  | isPointInsideMPolygon (const AcGePoint3d &, AcGeIntArray &, double=AcDbMPolygonCrossingFuzz) const
Adds the boundary as specified by the input AcDbPolyline as a loop to this AcDbMPolygon entity. More...
virtual bool  | isPointOnLoopBoundary (const AcGePoint3d &, int, double=AcDbMPolygonCrossingFuzz) const
Function checks a specific loop boundary in AcDbMPolygon to see if it contains worldPt. More...
 virtual Acad::ErrorStatus  | loopCrossesItself (bool &, bool, AcDbMPolygonCrossingArray &, const AcGePoint2dArray &, const AcGeDoubleArray &, double=AcDbMPolygonCrossingFuzz) const
 virtual bool  | loopCrossesItself (const AcGePoint2dArray &, const AcGeDoubleArray &, double=AcDbMPolygonCrossingFuzz) const
 virtual Acad::ErrorStatus  | loopCrossesMPolygon (bool &, bool, AcDbMPolygonCrossingArray &, const AcGePoint2dArray &, const AcGeDoubleArray &, double=AcDbMPolygonCrossingFuzz) const
virtual AcGeVector3d  | normal () const
Gets the normal vector (normalized to unit and expressed in WCS) of an AcDbMPolygon entity. More...
virtual int  | numMPolygonLoops () const
Returns the number of polygon loops for this MPolygon entity. More...
virtual int  | numPatternDefinitions () const
Returns the number of pattern definitions used by this AcDbMPolygon entity. More...
virtual double  | patternAngle () const
Returns the pattern angle (in radians) for this AcDbMPolygon entity. More...
virtual AcCmColor  | patternColor () const
Returns the index of color in AcDbHatch member of AcDbMPolygon instance. More...
virtual bool  | patternDouble () const
PatternDouble apllies other set of hatch lines. More...
virtual const ACHAR *  | patternName () const
Returns the pattern name for this AcDbMPolygon entity. More...
virtual double  | patternScale () const
Returns the pattern scale for this AcDbMPolygon entity. More...
virtual double  | patternSpace () const
Returns the space pattern for internal AcDbHatch member. More...
virtual AcDbHatch::HatchPatternType  | patternType () const
Returns type of the pattern for internal AcDbHatch member . More...
virtual Acad::ErrorStatus  | removeMPolygonLoopAt (int)
Removes the specified boundary loop from MPolygon. More...
virtual void  | saveAs (AcGiWorldDraw *, AcDb::SaveType)
 virtual bool  | selfCrosses (const AcGePoint2dArray &, const AcGeDoubleArray &, double=AcDbMPolygonCrossingFuzz) const
virtual Acad::ErrorStatus  | setElevation (double)
Sets the AcDbMPolygon's elevation. More...
Acad::ErrorStatus  | setGradient (AcDbHatch::GradientPatternType, const ACHAR *)
Sets the hatch entity gradient type and gradient name for this object. More...
Acad::ErrorStatus  | setGradientAngle (double)
Sets the object . More...
Acad::ErrorStatus  | setGradientColors (unsigned int, AcCmColor *, float *)
This method sets AcDbHatch member of AcDbMPolygon instance with colors containing gradient definition. More...
Acad::ErrorStatus  | setGradientOneColorMode (Adesk::Boolean)
Sets the hatch entity gradient for internal AcDbHatch member. More...
Acad::ErrorStatus  | setGradientShift (float)
Sets the hatch entity gradient with this shift value. More...
virtual Acad::ErrorStatus  | setLoopDirection (int, loopDir)
Sets the specified loop's direction. More...
virtual Acad::ErrorStatus  | setNormal (const AcGeVector3d &)
Sets the normal vector (normalized to unit and expressed in WCS)for an AcDbMPolygon entity. More...
virtual Acad::ErrorStatus  | setPattern (AcDbHatch::HatchPatternType, const ACHAR *)
Sets both pattern type and pattern name for AcDbHatch member. More...
virtual Acad::ErrorStatus  | setPatternAngle (double)
Sets the pattern (in radians) angle for AcDbHatch member. More...
virtual Acad::ErrorStatus  | setPatternColor (const AcCmColor &)
Sets the fill color for AcDbHatch member. More...
virtual Acad::ErrorStatus  | setPatternDouble (bool)
Sets AcDbHatch member of AcDbMPolygon instance with true or false if paterne is double. More...
virtual Acad::ErrorStatus  | setPatternScale (double)
Sets the pattern scale for internal AcDbHatch member . More...
virtual Acad::ErrorStatus  | setPatternSpace (double)
Sets the space for the pattern for internal AcDbHatch member . More...
virtual Acad::ErrorStatus  | subIntersectWith (const AcDbEntity *, AcDb::Intersect, AcGePoint3dArray &, Adesk::GsMarker=0, Adesk::GsMarker=0) const
virtual Acad::ErrorStatus  | subIntersectWith (const AcDbEntity *, AcDb::Intersect, const AcGePlane &, AcGePoint3dArray &, Adesk::GsMarker=0, Adesk::GsMarker=0) const
 virtual  | ~AcDbMPolygon ()
Destructor.
 Public Member Functions inherited from AcDbEntity
 virtual Acad::ErrorStatus  | addSubentPaths (const AcDbFullSubentPathArray &) final
virtual Acad::ErrorStatus  | applyPartialUndo (AcDbDwgFiler *, AcRxClass *)
virtual Acad::ErrorStatus  | audit (AcDbAuditInfo *)
AcDbObjectId  | blockId () const
Returns the Object ID of the BlockTableRecord that owns this entity. More...
Acad::ErrorStatus  | boundingBoxIntersectWith (const AcDbEntity *, AcDb::Intersect, AcGePoint3dArray &, Adesk::GsMarker, Adesk::GsMarker) const
Finds the intersection between the edges of the bounding box for this entity and the pOhter entity. More...
Acad::ErrorStatus  | boundingBoxIntersectWith (const AcDbEntity *, AcDb::Intersect, const AcGePlane &, AcGePoint3dArray &, Adesk::GsMarker, Adesk::GsMarker) const
First, the function projects the other entity and the bounding box of this entity on plane specified by plane. More...
virtual bool  | bounds (AcDbExtents &) const
Returns the extents of this entity as AcDbExtents. More...
virtual bool  | castShadows () const
Checks if this entity is able to cast shadows. More...
virtual Adesk::Boolean  | cloneMeForDragging () final
Checks if a clone will be created for this entity in case of a drag operation. More...
 virtual AcDb::CollisionType  | collisionType () const
AcCmColor  | color () const
Returns the true color information of the entity. More...
Adesk::UInt16  | colorIndex () const
Returns the color number in a range from 0 to 256. More...
 virtual Acad::ErrorStatus  | deleteSubentPaths (const AcDbFullSubentPathArray &) final
virtual void  | dragStatus (const AcDb::DragStat)
Acad::ErrorStatus  | draw ()
Draws or redraws the entity on screen. More...
virtual AcGiDrawable *  | drawable ()
virtual Acad::ErrorStatus  | dwgInFields (AcDbDwgFiler *)
virtual Acad::ErrorStatus  | dwgOutFields (AcDbDwgFiler *) const
virtual Acad::ErrorStatus  | dxfInFields (AcDbDxfFiler *)
virtual Acad::ErrorStatus  | dxfOutFields (AcDbDxfFiler *) const
AcCmEntityColor  | entityColor () const
Returns the lightweight color information of the entity. More...
virtual Acad::ErrorStatus  | explode (AcDbVoidPtrArray &) const final
virtual Acad::ErrorStatus  | getCompoundObjectTransform (AcGeMatrix3d &) const final
It is used for object without geometry like AcDbMleader. More...
virtual void  | getEcs (AcGeMatrix3d &) const
Returns the transformation matrix from OCS (Object Coordinate System) to WCS (World Coordinate System). More...
virtual Acad::ErrorStatus  | getGeomExtents (AcDbExtents &) const final
Returns extents of this entity. More...
 virtual Acad::ErrorStatus  | getGripEntityUCS (const void *, AcGeVector3d &, AcGePoint3d &, AcGeVector3d &) const final
 virtual Acad::ErrorStatus  | getGripPoints (AcDbGripDataPtrArray &, const double, const int, const AcGeVector3d &, const int) const final
virtual Acad::ErrorStatus  | getGripPoints (AcGePoint3dArray &, AcDbIntArray &, AcDbIntArray &) const final
Append grip points to the specified array. More...
 virtual Acad::ErrorStatus  | getGripPointsAtSubentPath (const AcDbFullSubentPath &, AcDbGripDataPtrArray &, const double, const int, const AcGeVector3d &, const int) const final
virtual Acad::ErrorStatus  | getGsMarkersAtSubentPath (const AcDbFullSubentPath &, AcArray< Adesk::GsMarker > &) const final
virtual Acad::ErrorStatus  | getMaterialMapper (AcGiMapper &) const
virtual Acad::ErrorStatus  | getOsnapPoints (AcDb::OsnapMode, Adesk::GsMarker, const AcGePoint3d &, const AcGePoint3d &, const AcGeMatrix3d &, AcGePoint3dArray &, AcDbIntArray &) const final
Gets the entity osnap points. More...
virtual Acad::ErrorStatus  | getOsnapPoints (AcDb::OsnapMode, Adesk::GsMarker, const AcGePoint3d &, const AcGePoint3d &, const AcGeMatrix3d &, AcGePoint3dArray &, AcDbIntArray &, const AcGeMatrix3d &) const final
Gets the entity osnap points. More...
virtual Acad::ErrorStatus  | getPlane (AcGePlane &, AcDb::Planarity &) const
Returns the plane that contains this entity. More...
AcDb::PlotStyleNameType  | getPlotStyleNameId (AcDbObjectId &) const
Returns the plot style name type and its associated id. More...
virtual Acad::ErrorStatus  | getStretchPoints (AcGePoint3dArray &) const final
Append stretch points to the specified array. More...
 virtual Acad::ErrorStatus  | getSubentClassId (const AcDbFullSubentPath &, CLSID *) const final
 virtual Acad::ErrorStatus  | getSubentPathGeomExtents (const AcDbFullSubentPath &, AcDbExtents &) const final
virtual Acad::ErrorStatus  | getSubentPathsAtGsMarker (AcDb::SubentType, Adesk::GsMarker, const AcGePoint3d &, const AcGeMatrix3d &, int &, AcDbFullSubentPath *&, int=0, AcDbObjectId *=NULL) const final
Gets the subentity paths appropriate for the passed in gs marker. More...
virtual Acad::ErrorStatus  | getTransformedCopy (const AcGeMatrix3d &, AcDbEntity *&) const final
Creates a copy of the current entity applying the transformation matrix. More...
 virtual void  | gripStatus (const AcDb::GripStat) final
 virtual bool  | hideMeForDragging () const final
virtual Acad::ErrorStatus  | highlight (const AcDbFullSubentPath &=kNullSubent, const Adesk::Boolean=Adesk::kFalse) const final
Highlights part of, or entire entity. More...
virtual Acad::ErrorStatus  | intersectWith (const AcDbEntity *, AcDb::Intersect, AcGePoint3dArray &, Adesk::GsMarker=0, Adesk::GsMarker=0) const final
Finds the intersection between this entity and the pOhter entity. More...
virtual Acad::ErrorStatus  | intersectWith (const AcDbEntity *, AcDb::Intersect, const AcGePlane &, AcGePoint3dArray &, Adesk::GsMarker=0, Adesk::GsMarker=0) const final
Projects this entity and the pOhter entity on plane, finds the intersection points between these projections and then projects back the points onto the caller entity. More...
 virtual bool  | isContentSnappable () const final
virtual Adesk::Boolean  | isPlanar () const
ACHAR *  | layer () const
Returns the layername. More...
AcDbObjectId  | layerId () const
Returns the Object ID of the LayerTableRecord referenced by this entity. More...
ACHAR *  | linetype () const
Gets the linetype value. More...
AcDbObjectId  | linetypeId () const
Gets the linetypeId value. More...
 double  | linetypeScale () const
returns the linetype scale factor for the entity
AcDb::LineWeight  | lineWeight () const
Gets the entity line weight. More...
virtual void  | list () const final
Prints the properties in drawing window. More...
ACHAR *  | material () const
Gets the material assigned to this entity. More...
AcDbObjectId  | materialId () const
Gets the AcDbObjectId of the material assigned to this entity. More...
virtual Acad::ErrorStatus  | moveGripPointsAt (const AcDbIntArray &, const AcGeVector3d &) final
Move the grip points pointed by the indexes specified in indexArray using the translationVector param direction and length Override this method in custom entities to define your own behaviour. More...
 virtual Acad::ErrorStatus  | moveGripPointsAt (const AcDbVoidPtrArray &, const AcGeVector3d &, const int) final
 virtual Acad::ErrorStatus  | moveGripPointsAtSubentPaths (const AcDbFullSubentPathArray &, const AcDbVoidPtrArray &, const AcGeVector3d &, const int) final
virtual Acad::ErrorStatus  | moveStretchPointsAt (const AcDbIntArray &, const AcGeVector3d &) final
Move the stretch points pointed by the indexes specified in indexArray with the offest specified by translationVector Override this method in custom entities to define your own behaviour. More...
ACHAR *  | plotStyleName () const
Returns the name of the plotStyleName string associated with this entity (DXF 390). More...
virtual bool  | receiveShadows () const
Checks if this entity is able to receive shadows. More...
void  | recordGraphicsModified (Adesk::Boolean=Adesk::kTrue)
Controls the entity display update when closing it Entities not updated when closed are updated at the first regen. More...
virtual void  | saveAs (AcGiWorldDraw *, AcDb::SaveType)
Generates the graphics primitives when a DWG save requiring proxy graphics to be saved is made. More...
virtual void  | setCastShadows (bool)
Sets this entity's flag regarding casting shadows. More...
virtual Acad::ErrorStatus  | setColor (const AcCmColor &, Adesk::Boolean=Adesk::kTrue)
Sets the color information of this entity from an AcCmColor instance. More...
virtual Acad::ErrorStatus  | setColor (const AcCmColor &, bool, AcDbDatabase *)
Sets the color property of this entity from an AcCmColor instance. More...
virtual Acad::ErrorStatus  | setColorIndex (Adesk::UInt16, Adesk::Boolean=Adesk::kTrue)
Sets the color index of this entity (DXF 62). More...
void  | setDatabaseDefaults ()
Applies the default properties of the entities database to this entity. More...
void  | setDatabaseDefaults (AcDbDatabase *)
Applies the default properties of the specified database to this entity. More...
virtual Acad::ErrorStatus  | setLayer (AcDbObjectId, Adesk::Boolean=Adesk::kTrue, bool=false)
Sets the layer to be referenced by this entity (DXF 8). More...
virtual Acad::ErrorStatus  | setLayer (const ACHAR *, Adesk::Boolean=Adesk::kTrue, bool=false)
Sets the layer to be referenced by this entity (DXF 8). More...
virtual Acad::ErrorStatus  | setLinetype (AcDbObjectId, Adesk::Boolean=Adesk::kTrue)
Sets the entities linetype to ltypeObjectId. More...
virtual Acad::ErrorStatus  | setLinetype (const ACHAR *, Adesk::Boolean=Adesk::kTrue)
Sets the entities linetype to the linetpye referenced by layerName. More...
virtual Acad::ErrorStatus  | setLinetypeScale (double, Adesk::Boolean=Adesk::kTrue)
sets value as entity linetype scale factor More...
virtual Acad::ErrorStatus  | setLineWeight (AcDb::LineWeight, Adesk::Boolean=Adesk::kTrue)
Sets the entity line weight. More...
virtual Acad::ErrorStatus  | setMaterial (AcDbObjectId, Adesk::Boolean=Adesk::kTrue)
Not implemented yet. More...
virtual Acad::ErrorStatus  | setMaterial (const ACHAR *, Adesk::Boolean=Adesk::kTrue)
Assigns the material to the entity. More...
virtual Acad::ErrorStatus  | setMaterialMapper (const AcGiMapper &, Adesk::Boolean=Adesk::kTrue)
It is used for apply material (scale, rotation, projection, mode overrides) to an identity.If it is used AcGiMapper::kIdentity it will apply for entity a default mapper. More...
virtual Acad::ErrorStatus  | setPlotStyleName (AcDb::PlotStyleNameType, AcDbObjectId=AcDbObjectId::kNull, Adesk::Boolean=Adesk::kTrue)
Sets the plot style of this entity. More...
virtual Acad::ErrorStatus  | setPlotStyleName (const ACHAR *, Adesk::Boolean=Adesk::kTrue)
Sets the plot style of this entity. More...
Acad::ErrorStatus  | setPropertiesFrom (const AcDbEntity *, Adesk::Boolean=Adesk::kTrue)
Copies the properties color, layer, linetype, linetypescale and visibility from the source entity pEntity to this entity. More...
virtual void  | setReceiveShadows (bool)
Sets this entity's flag regarding receiving shadows. More...
virtual Acad::ErrorStatus  | setTransparency (const AcCmTransparency &, Adesk::Boolean=Adesk::kTrue)
Sets the transparency setting of this entity, and returns eOk if successful. More...
virtual Acad::ErrorStatus  | setVisibility (AcDb::Visibility, Adesk::Boolean=Adesk::kTrue) final
notyetdocumented. More...
 virtual Acad::ErrorStatus  | setVisualStyle (AcDbObjectId, VisualStyleType=kFullVisualStyle, Adesk::Boolean=true)
 virtual void  | subentGripStatus (const AcDb::GripStat, const AcDbFullSubentPath &) final
virtual AcDbEntity *  | subentPtr (const AcDbFullSubentPath &) const final
Creates an entity as a copy of the subentity given by acSubentPath. More...
virtual void  | subSetDatabaseDefaults (AcDbDatabase *)
This function is called by AcDbEntity::setDatabaseDefaults(), to allow custom entities to set their related sub entities, if any; default implementation does nothing. More...
virtual Acad::ErrorStatus  | transformBy (const AcGeMatrix3d &) final
Applies given transformation (matrix) to the entity. More...
 virtual Acad::ErrorStatus  | transformSubentPathsBy (const AcDbFullSubentPathArray &, const AcGeMatrix3d &) final
 AcCmTransparency  | transparency () const
Returns the transparency setting of this entity.
virtual Acad::ErrorStatus  | unhighlight (const AcDbFullSubentPath &=kNullSubent, const Adesk::Boolean=Adesk::kFalse) const final
Unhighlights previously highlighted part of entity, or entire entity. More...
AcDb::Visibility  | visibility () const
Gets the visibility state. More...
 AcDbObjectId  | visualStyleId (VisualStyleType=kFullVisualStyle) const
 Public Member Functions inherited from AcDbObject
virtual Acad::ErrorStatus  | addPersistentReactor (AcDbObjectId)
Adds a persistent reactor to this object reactor list. More...
Acad::ErrorStatus  | addReactor (AcDbObjectReactor *) const
Adds a transient reactor to this object. More...
virtual Acad::ErrorStatus  | applyPartialUndo (AcDbDwgFiler *, AcRxClass *)
This function is called during Undo operations on objects, that use the 'Partial Undo meachanism'; this is, this object is opened with assertWriteEnabled(Adesk::kFalse) to indicate that custom Undo filing is used rather than the default Undo filing. More...
 void  | assertNotifyEnabled () const
 void  | assertReadEnabled () const
 void  | assertWriteEnabled (Adesk::Boolean=Adesk::kTrue, Adesk::Boolean=Adesk::kTrue)
virtual Acad::ErrorStatus  | audit (AcDbAuditInfo *)
Performs the audit operation for this object. More...
Acad::ErrorStatus  | cancel ()
Reverts all changes since the object had been opened and closes the object. More...
virtual void  | cancelled (const AcDbObject *)
A handler function for persistent reactors. More...
virtual AcRxObject *  | clone () const
Creates a shallow clone of this object. More...
Acad::ErrorStatus  | close ()
Closes the object. More...
Acad::ErrorStatus  | closeAndPage (Adesk::Boolean=Adesk::kTrue)
Closes the object. More...
virtual Acad::ErrorStatus  | composeForLoad (AcDb::OdaSaveType, AcDb::AcDbDwgVersion)
This function is intended for future MT file loading support. More...
virtual void  | copied (const AcDbObject *, const AcDbObject *)
A handler function for persistent reactors. More...
virtual Acad::ErrorStatus  | copyFrom (const AcRxObject *)
Copies the pSrc object information in this object. More...
Acad::ErrorStatus  | createExtensionDictionary ()
Creates a dictionary as extension dictionary for this object. More...
AcDbDatabase *  | database () const
Returns the database that contains this object. More...
virtual Acad::ErrorStatus  | decomposeForSave (AcDb::AcDbDwgVersion, AcDbObject *&, AcDbObjectId &, Adesk::Boolean &)
This function is called during dwg and dxf output, to allow a custom object to decompose itself, due to provided dwg/dxf target file version. More...
virtual Acad::ErrorStatus  | deepClone (AcDbObject *, AcDbObject *&, AcDbIdMapping &, Adesk::Boolean=Adesk::kTrue) const final
Clones this object, appends it to the owner pOwner and adds an AcDbIdPair record to the idMap. More...
void  | disableUndoRecording (Adesk::Boolean)
Disables or enables the undo recording for the object. More...
Acad::ErrorStatus  | downgradeOpen ()
Sets the open mode for an object opened for write to be opened for read. More...
Acad::ErrorStatus  | downgradeToNotify (Adesk::Boolean)
Sets the open mode for an object opened for write to be opened for notify. More...
virtual AcGiDrawable *  | drawable ()
Retrieves the AcGiDrawable instance of this object. More...
Acad::ErrorStatus  | dwgIn (AcDbDwgFiler *)
Calls the object's dwgInFields function, and reads any XData if present. More...
virtual Acad::ErrorStatus  | dwgInFields (AcDbDwgFiler *)
Reads the object from the DWG filer. More...
Acad::ErrorStatus  | dwgOut (AcDbDwgFiler *) const
Calls the object's dwgOutFields function, and writes any XData if present. More...
virtual Acad::ErrorStatus  | dwgOutFields (AcDbDwgFiler *) const
Writes the object to the DWG filer. More...
Acad::ErrorStatus  | dxfIn (AcDbDxfFiler *)
Calls the object's dxfInFields function, and reads any XData if present. More...
virtual Acad::ErrorStatus  | dxfInFields (AcDbDxfFiler *)
Reads the object from the DXF filer. More...
Acad::ErrorStatus  | dxfOut (AcDbDxfFiler *, Adesk::Boolean, Adesk::uchar *) const
Calls the object's dxfOutFields function, and writes any XData if present. More...
virtual Acad::ErrorStatus  | dxfOutFields (AcDbDxfFiler *) const
Writes the object to the DXF filer. More...
Acad::ErrorStatus  | erase (Adesk::Boolean=Adesk::kTrue)
Sets the bit that indicates that the object is erased. More...
virtual void  | erased (const AcDbObject *, Adesk::Boolean)
A handler function for persistent reactors. More...
AcDbObjectId  | extensionDictionary () const
Returns the object id of the extension dictionary for this object. More...
void  | getAcDbHandle (AcDbHandle &) const
Returns handle of this object. More...
Acad::ErrorStatus  | getBinaryData (const ACHAR *, Adesk::Int32 &, char *&) const
Creates a copy of the binary data stored as chunks of maximum 127 bytes in the resbuf chain of this object's extension dictionary xrecord entry given by entryName. More...
int  | getBrxOpenCount () const
This function returns the number of open BRX instances for this object. More...
int  | getBrxOpenState () const
This function returns the BRX object open state flags as bitfields, for diagnostic purpose. More...
virtual Acad::ErrorStatus  | getClassID (CLSID *) const final
Gets the COM wrapper Class ID for this entity. More...
int  | getCustomObjectState () const
This function returns the custom object status : 1=isCustomObject 2=DifferentialUndoDisabled. More...
Acad::ErrorStatus  | getField (const ACHAR *, AcDbField *&, AcDb::OpenMode) const
Retrieves the specified Field from this object, and opens it in mode. More...
Acad::ErrorStatus  | getField (const ACHAR *, AcDbObjectId &) const
Gets the pszPropName field object from field dictionary of this AcDbObject object, using pszPropName as key. More...
AcDbObjectId  | getFieldDictionary () const
Returns the Field dictionary associated with this object,. More...
Acad::ErrorStatus  | getFieldDictionary (AcDbDictionary *&, AcDb::OpenMode) const
Gets and opens the field dictionary for this. More...
Acad::ErrorStatus  | getObjectBirthVersion (AcDb::AcDbDwgVersion &, AcDb::MaintenanceReleaseVersion &)
This function is currently not supported by the CAD engine, always returns Acad::eOk, and 'kDHL_CURRENT' + 'kMReleaseCurrent' results. More...
virtual Acad::ErrorStatus  | getObjectSaveVersion (const AcDbDwgFiler *, AcDb::AcDbDwgVersion &, AcDb::MaintenanceReleaseVersion &)
Returns the DWG version for saving the object. More...
virtual Acad::ErrorStatus  | getObjectSaveVersion (const AcDbDxfFiler *, AcDb::AcDbDwgVersion &, AcDb::MaintenanceReleaseVersion &)
Returns the DWG version for saving the object. More...
int  | getOdaOpenCount () const
This function returns the number of open ODA instances for this object. More...
int  | getOdaOpenState () const
This function returns the ODA object open state flags as bitfields, for diagnostic purpose. More...
virtual void  | goodbye (const AcDbObject *)
A handler function for persistent reactors. More...
Acad::ErrorStatus  | handOverTo (AcDbObject *, Adesk::Boolean=Adesk::kTrue, Adesk::Boolean=Adesk::kTrue)
Hands over objects identity to another object. More...
bool  | hasFields () const
Return true if this object has single or multiple fields associated with him. More...
bool  | hasPersistentReactor (AcDbObjectId) const
Checks the input objectId in this object reactor list. More...
bool  | hasSaveVersionOverride ()
This function indicates whether this object overrides the filer's save version. More...
virtual AcDbObjectId  | id () const
Returns the database id of this object. More...
Adesk::Boolean  | isAcDbObjectIdsInFlux () const
Checks whether a deep clone operation was completed. More...
Adesk::Boolean  | isAProxy () const
Adesk::Boolean  | isCancelling () const
Adesk::Boolean  | isErased () const
Returns whether this object is erased. More...
Adesk::Boolean  | isEraseStatusToggled () const
Checks whether the object erase status has been toggled. More...
Adesk::Boolean  | isModified () const
Returns whether this object's assertWriteEnabled() has been called since it was opened. More...
Adesk::Boolean  | isModifiedGraphics () const
Checks whether this object graphics will be updated when the object is closed. More...
Adesk::Boolean  | isModifiedXData () const
Checks whether this object's xData was modified. More...
Adesk::Boolean  | isNewObject () const
Returns true if and only if this object has not been closed since it was created. More...
Adesk::Boolean  | isNotifyEnabled () const
Returns whether this object is opened for notify. More...
Adesk::Boolean  | isNotifying () const
virtual Adesk::Boolean  | isPersistent () const
Returns the 'persistent' status of a database object. More...
Adesk::Boolean  | isReadEnabled () const
Returns whether this object is opened for read. More...
 Adesk::Boolean  | isReallyClosing () const
Checks whether the next close call will completely close this object return true if on the next call the object will be completely closed false otherwise.
Adesk::Boolean  | isTransactionResident () const
Gets the object transaction status. More...
Adesk::Boolean  | isUndoing () const
bool  | isUndoRecordingDisabled () const
Returns whether the undo recording for the object is enabled or not. More...
Adesk::Boolean  | isWriteEnabled () const
Returns whether this object is opened for write. More...
virtual AcDb::DuplicateRecordCloning  | mergeStyle () const
Returns the object's merge behavior during cloning. More...
virtual void  | modified (const AcDbObject *)
A handler function for persistent reactors. More...
virtual void  | modifiedGraphics (const AcDbEntity *)
A handler function for persistent reactors. More...
virtual void  | modifiedXData (const AcDbObject *)
A handler function for persistent reactors. More...
virtual void  | modifyUndone (const AcDbObject *)
A handler function for persistent reactors. More...
virtual void  | objectClosed (const AcDbObjectId)
A handler function for persistent reactors. More...
AcDbObjectId  | objectId () const
Returns object id. More...
virtual void  | openedForModify (const AcDbObject *)
A handler function for persistent reactors. More...
AcDbObjectId  | ownerId () const
Returns object id of the owner. More...
AcDbVoidPtrArray *  | reactors ()
Gets the object pointers to reactors. More...
const AcDbVoidPtrArray *  | reactors () const
Gets the object pointers to reactors. More...
virtual void  | reappended (const AcDbObject *)
A handler function for persistent reactors. More...
 virtual void  | recvPropagateModify (const AcDbObject *)
Not implemented yet.
Acad::ErrorStatus  | releaseExtensionDictionary ()
Removes the extension dictionary associated with this object. More...
virtual Acad::ErrorStatus  | removeField (AcDbObjectId)
Removes the Field specified by acFieldId from this object. More...
virtual Acad::ErrorStatus  | removeField (const ACHAR *)
Removes the Field specified by szKeyString from this object. More...
virtual Acad::ErrorStatus  | removeField (const ACHAR *, AcDbObjectId &)
Removes the Field specified by acPszKeyString from this object, and returns its ObjectId value. More...
virtual Acad::ErrorStatus  | removePersistentReactor (AcDbObjectId)
Removes a persistent reactor from this object reactor list. More...
Acad::ErrorStatus  | removeReactor (AcDbObjectReactor *) const
Removes a transient reactor to this object. More...
void  | setAcDbObjectIdsInFlux ()
Call this function to indicate that the object IDs of this object and its sub-objects (if any) are not yet valid. More...
Acad::ErrorStatus  | setBinaryData (const ACHAR *, Adesk::Int32, const char *)
Creates a copy of the binary data, divides it in up to 127 bytes binary chunks and
 sets them as resbufs in the resbuf chain of this object's extension dictionary xrecord entry given by entryName. More...
virtual Acad::ErrorStatus  | setField (const ACHAR *, AcDbField *, AcDbObjectId &)
Adds the pAcField field object to field dictionary of this AcDbObject object, using pKey as key. More...
void  | setHasSaveVersionOverride (bool)
This function can be called to specify that the object has a "save version override". More...
virtual Acad::ErrorStatus  | setOwnerId (AcDbObjectId)
Sets the ownerId data member of the object to be objId. More...
virtual Acad::ErrorStatus  | setXData (const resbuf *)
Sets/removes xData associated with this object. More...
virtual Acad::ErrorStatus  | subCancel ()
Possibility to veto a cancel operation from within custom entities. More...
virtual Acad::ErrorStatus  | subClose ()
virtual Acad::ErrorStatus  | subErase (Adesk::Boolean)
This hook is called during an AcDbObject::erase call, before any actual erase operation is performed. More...
 virtual Acad::ErrorStatus  | subHandOverTo (AcDbObject *)
virtual void  | subObjModified (const AcDbObject *, const AcDbObject *)
A handler function for persistent reactors. More...
 virtual Acad::ErrorStatus  | subOpen (AcDb::OpenMode)
virtual Acad::ErrorStatus  | subSwapIdWith (AcDbObjectId, Adesk::Boolean=Adesk::kFalse, Adesk::Boolean=Adesk::kFalse)
This hook is called during an AcDbObject::swapIdWith() call, before any actual swap operation is performed. More...
Acad::ErrorStatus  | swapIdWith (AcDbObjectId, Adesk::Boolean=Adesk::kFalse, Adesk::Boolean=Adesk::kFalse)
Swaps the object id's between the object identified by param swapId and this object. More...
virtual Acad::ErrorStatus  | swapReferences (const AcDbIdMapping &)
Not implemented yet. More...
virtual void  | unappended (const AcDbObject *)
A handler function for persistent reactors. More...
AcDbDwgFiler *  | undoFiler ()
Gets the undo filer for this object. More...
Acad::ErrorStatus  | upgradeFromNotify (Adesk::Boolean &)
Upgrades the open status of this object to AcDb::kForWrite, if this object is already open (either in AcDb::kForRead, AcDb::kForNotify or AcDb::kForWrite) More...
Acad::ErrorStatus  | upgradeOpen ()
Changes the objects open mode to AcDb::kForWrite and sends notifications. More...
virtual Acad::ErrorStatus  | wblockClone (AcRxObject *, AcDbObject *&, AcDbIdMapping &, Adesk::Boolean=Adesk::kTrue) const final
Clones this object, appends it to the owner pOwner and adds an AcDbIdPair record to the idMap. More...
virtual resbuf *  | xData (const ACHAR *=NULL) const
Returns the xData associated with this object. More...
Acad::ErrorStatus  | xDataTransformBy (const AcGeMatrix3d &)
Transforms the extended data according to parameter transformation matrix. More...
 virtual void  | xmitPropagateModify () const
Not implemented yet.
 virtual  | ~AcDbObject ()
Destructor.
 Public Member Functions inherited from AcGiDrawable
virtual bool  | bounds (AcDbExtents &) const
virtual DrawableType  | drawableType () const
 virtual AcGiDrawStream *  | drawStream () const
 AcGsNode *  | gsNode () const
virtual AcDbObjectId  | id () const =0
virtual Adesk::Boolean  | isPersistent () const =0
virtual Adesk::UInt32  | regenSupportFlags () const final
Returns whether and to which level this object supports MultiThreading. More...
 virtual Adesk::Boolean  | RolloverHit (Adesk::ULongPtr, Adesk::ULongPtr, Adesk::Boolean)
 virtual Adesk::UInt32  | setAttributes (AcGiDrawableTraits *) final
 virtual void  | setDrawStream (AcGiDrawStream *)
 void  | setGsNode (AcGsNode *)
 virtual void  | viewportDraw (AcGiViewportDraw *) final
 virtual Adesk::UInt32  | viewportDrawLogicalFlags (AcGiViewportDraw *) final
 virtual Adesk::Boolean  | worldDraw (AcGiWorldDraw *) final
 Public Member Functions inherited from AcRxObject
virtual AcRxObject *  | clone () const
Exported and implemented. More...
 virtual AcRx::Ordering  | comparedTo (const AcRxObject *) const
Exported and implemented.
virtual Acad::ErrorStatus  | copyFrom (const AcRxObject *)
Exported and implemented. More...
 virtual AcRxClass *  | isA () const
Exported and implemented.
virtual Adesk::Boolean  | isEqualTo (const AcRxObject *) const
Exported and implemented. More...
bool  | isKindOf (const AcRxClass *) const
Checks the object class. More...
AcRxObject *  | queryX (const AcRxClass *) const
returns the protocol extension object assigned to this class or a parent class. More...
AcRxObject *  | x (const AcRxClass *) const
returns the protocol extension object assigned to this class or a parent class. More...
 virtual  | ~AcRxObject ()
Destructor.
 Public Attributes
AcDbMPolygon
Default constructor.
 Public Attributes inherited from AcDbEntity
AcDbEntity
This protected constructor sets the initial value for color to 257, and for the objectids for layer and linetype to AcDbObjectId::kNull. More...
 Protected Member Functions
virtual Acad::ErrorStatus  | subExplode (AcDbVoidPtrArray &) const
virtual Acad::ErrorStatus  | subGetClassID (CLSID *) const
virtual Acad::ErrorStatus  | subGetGeomExtents (AcDbExtents &) const
virtual Acad::ErrorStatus  | subGetGripPoints (AcGePoint3dArray &, AcDbIntArray &, AcDbIntArray &) const
virtual Acad::ErrorStatus  | subGetGsMarkersAtSubentPath (const AcDbFullSubentPath &, AcArray< Adesk::GsMarker > &) const
virtual Acad::ErrorStatus  | subGetOsnapPoints (AcDb::OsnapMode, Adesk::GsMarker, const AcGePoint3d &, const AcGePoint3d &, const AcGeMatrix3d &, AcGePoint3dArray &, AcDbIntArray &) const
virtual Acad::ErrorStatus  | subGetStretchPoints (AcGePoint3dArray &) const
virtual Acad::ErrorStatus  | subGetSubentPathsAtGsMarker (AcDb::SubentType, Adesk::GsMarker, const AcGePoint3d &, const AcGeMatrix3d &, int &, AcDbFullSubentPath *&, int=0, AcDbObjectId *=NULL) const
virtual void  | subList () const
virtual Acad::ErrorStatus  | subMoveGripPointsAt (const AcDbIntArray &, const AcGeVector3d &)
virtual Acad::ErrorStatus  | subMoveStretchPointsAt (const AcDbIntArray &, const AcGeVector3d &)
virtual AcDbEntity *  | subSubentPtr (const AcDbFullSubentPath &) const
virtual Acad::ErrorStatus  | subTransformBy (const AcGeMatrix3d &)
virtual Adesk::Boolean  | subWorldDraw (AcGiWorldDraw *)
Creates a viewport-independent graphical representation of the object. More...
 Protected Member Functions inherited from AcDbEntity
 virtual Acad::ErrorStatus  | subAddSubentPaths (const AcDbFullSubentPathArray &)
 virtual Adesk::Boolean  | subCloneMeForDragging ()
 virtual Acad::ErrorStatus  | subDeleteSubentPaths (const AcDbFullSubentPathArray &)
virtual Acad::ErrorStatus  | subExplode (AcDbVoidPtrArray &) const
 virtual Acad::ErrorStatus  | subGetCompoundObjectTransform (AcGeMatrix3d &) const
virtual Acad::ErrorStatus  | subGetGeomExtents (AcDbExtents &) const
virtual Acad::ErrorStatus  | subGetGripEntityUCS (const void *, AcGeVector3d &, AcGePoint3d &, AcGeVector3d &) const
virtual Acad::ErrorStatus  | subGetGripPoints (AcDbGripDataPtrArray &, const double, const int, const AcGeVector3d &, const int) const
virtual Acad::ErrorStatus  | subGetGripPoints (AcGePoint3dArray &, AcDbIntArray &, AcDbIntArray &) const
 virtual Acad::ErrorStatus  | subGetGripPointsAtSubentPath (const AcDbFullSubentPath &, AcDbGripDataPtrArray &, const double, const int, const AcGeVector3d &, const int) const
virtual Acad::ErrorStatus  | subGetGsMarkersAtSubentPath (const AcDbFullSubentPath &, AcArray< Adesk::GsMarker > &) const
virtual Acad::ErrorStatus  | subGetOsnapPoints (AcDb::OsnapMode, Adesk::GsMarker, const AcGePoint3d &, const AcGePoint3d &, const AcGeMatrix3d &, AcGePoint3dArray &, AcDbIntArray &) const
 virtual Acad::ErrorStatus  | subGetOsnapPoints (AcDb::OsnapMode, Adesk::GsMarker, const AcGePoint3d &, const AcGePoint3d &, const AcGeMatrix3d &, AcGePoint3dArray &, AcDbIntArray &, const AcGeMatrix3d &) const
virtual Acad::ErrorStatus  | subGetStretchPoints (AcGePoint3dArray &) const
 virtual Acad::ErrorStatus  | subGetSubentClassId (const AcDbFullSubentPath &, CLSID *) const
 virtual Acad::ErrorStatus  | subGetSubentPathGeomExtents (const AcDbFullSubentPath &, AcDbExtents &) const
virtual Acad::ErrorStatus  | subGetSubentPathsAtGsMarker (AcDb::SubentType, Adesk::GsMarker, const AcGePoint3d &, const AcGeMatrix3d &, int &, AcDbFullSubentPath *&, int=0, AcDbObjectId *=nullptr) const
virtual Acad::ErrorStatus  | subGetTransformedCopy (const AcGeMatrix3d &, AcDbEntity *&) const
virtual void  | subGripStatus (const AcDb::GripStat)
 virtual bool  | subHideMeForDragging () const
virtual Acad::ErrorStatus  | subHighlight (const AcDbFullSubentPath &=kNullSubent, const Adesk::Boolean=false) const
virtual Acad::ErrorStatus  | subIntersectWith (const AcDbEntity *, AcDb::Intersect, AcGePoint3dArray &, Adesk::GsMarker=0, Adesk::GsMarker=0) const
virtual Acad::ErrorStatus  | subIntersectWith (const AcDbEntity *, AcDb::Intersect, const AcGePlane &, AcGePoint3dArray &, Adesk::GsMarker=0, Adesk::GsMarker=0) const
virtual bool  | subIsContentSnappable () const
virtual void  | subList () const
virtual Acad::ErrorStatus  | subMoveGripPointsAt (const AcDbIntArray &, const AcGeVector3d &)
virtual Acad::ErrorStatus  | subMoveGripPointsAt (const AcDbVoidPtrArray &, const AcGeVector3d &, const int)
 virtual Acad::ErrorStatus  | subMoveGripPointsAtSubentPaths (const AcDbFullSubentPathArray &, const AcDbVoidPtrArray &, const AcGeVector3d &, const int)
virtual Acad::ErrorStatus  | subMoveStretchPointsAt (const AcDbIntArray &, const AcGeVector3d &)
virtual Adesk::UInt32  | subSetAttributes (AcGiDrawableTraits *)
Sets the values of this object's subentity traits and returns with the calling object's subentity traits. More...
virtual Acad::ErrorStatus  | subSetVisibility (AcDb::Visibility, Adesk::Boolean=true)
 virtual void  | subSubentGripStatus (const AcDb::GripStat, const AcDbFullSubentPath &)
virtual AcDbEntity *  | subSubentPtr (const AcDbFullSubentPath &) const
virtual Acad::ErrorStatus  | subTransformBy (const AcGeMatrix3d &)
 virtual Acad::ErrorStatus  | subTransformSubentPathsBy (const AcDbFullSubentPathArray &, const AcGeMatrix3d &)
virtual Acad::ErrorStatus  | subUnhighlight (const AcDbFullSubentPath &=kNullSubent, const Adesk::Boolean=false) const
virtual void  | subViewportDraw (AcGiViewportDraw *)
 virtual AcDb::Visibility  | subVisibility () const
virtual Adesk::Boolean  | subWorldDraw (AcGiWorldDraw *)
 Protected Member Functions inherited from AcDbObject
virtual Acad::ErrorStatus  | subDeepClone (AcDbObject *, AcDbObject *&, AcDbIdMapping &, Adesk::Boolean=true) const
virtual Acad::ErrorStatus  | subGetClassID (CLSID *) const
virtual Adesk::UInt32  | subSetAttributes (AcGiDrawableTraits *)
Sets the values of this object's subentity traits and returns with the calling object's subentity traits. More...
virtual void  | subViewportDraw (AcGiViewportDraw *)
virtual Adesk::UInt32  | subViewportDrawLogicalFlags (AcGiViewportDraw *)
virtual Acad::ErrorStatus  | subWblockClone (AcRxObject *, AcDbObject *&, AcDbIdMapping &, Adesk::Boolean=true) const
virtual Adesk::Boolean  | subWorldDraw (AcGiWorldDraw *)
 Protected Member Functions inherited from AcGiDrawable
virtual Adesk::UInt32  | subRegenSupportFlags () const
Returns whether and to which level this object supports MultiThreading. More...
virtual Adesk::UInt32  | subSetAttributes (AcGiDrawableTraits *)=0
virtual void  | subViewportDraw (AcGiViewportDraw *)=0
 virtual Adesk::UInt32  | subViewportDrawLogicalFlags (AcGiViewportDraw *)
virtual Adesk::Boolean  | subWorldDraw (AcGiWorldDraw *)=0
 Protected Member Functions inherited from AcRxObject
AcRxObject ()
Exported and implemented.
 Additional Inherited Members
 Static Public Member Functions inherited from AcRxObject
 static AcRxObject *  | cast (const AcRxObject *)
 static AcRxClass *  | desc ()
Exported and implemented.
 Static Public Member Functions inherited from AcHeapOperators
 static void  | operator delete (void *)
_
 static void  | operator delete (void *, const char *, int)
 static void  | operator delete (void *, void *)
 static void  | operator delete[] (void *)
_
 static void  | operator delete[] (void *, const char *, int)
 static void *  | operator new (size_t)
_
 static void *  | operator new (size_t, const char *, int)
 static void *  | operator new (size_t, void *p)
 static void *  | operator new[] (size_t)
_
 static void *  | operator new[] (size_t, const char *, int)
Detailed Description
_
Member Function Documentation
◆ appendLoopFromBoundary() [1/3]
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbMPolygon::appendLoopFromBoundary  |  ( |  const AcDb2dPolyline *  |  pPolyline,
|  bool  |  notCrossing = true,
|  double  |  tolerance = AcDbMPolygonCrossingFuzz
)
virtual
It adds a boundary to instance of AcDbMPolygon.
Parameters
[in] | pPolyline | It's a handle for adding a boundary.
[in] | notCrossing | If true the boundary will be rejected in all of these cases
It is overlapped to itself
It is overlapped to another boundary in the same object If false both casses will be accepted.
[in] | tolerance | It's the tolerance to check if the boundary crosses another boundary in the same object
Returns
Adesk::eOK for success Acad::eAmbiguousInput if the boundary is rejected because it crosses another boundary in the same object
◆ appendLoopFromBoundary() [2/3]
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbMPolygon::appendLoopFromBoundary  |  ( |  const AcDbCircle *  |  pAcDbCircle,
|  bool  |  notCrossing = true,
|  double  |  tolerance = AcDbMPolygonCrossingFuzz
)
virtual
It adds a boundary to instance of AcDbMPolygon.
Parameters
[in] | pAcDbCircle | It's a handle for adding a boundary.
[in] | notCrossing | If true the boundary will be rejected in all of these cases
It is overlapped to itself
It is overlapped to another boundary in the same object If false both cases will be accepted.
[in] | tolerance | It's the tolerance to check if the boundary crosses another boundary in the same object
Returns
Adesk::eOK for success Acad::eAmbiguousInput if the boundary is rejected because it crosses another boundary in the same object
◆ appendLoopFromBoundary() [3/3]
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbMPolygon::appendLoopFromBoundary  |  ( |  const AcDbPolyline *  |  pPolyline,
|  bool  |  notCrossing = true,
|  double  |  tolerance = AcDbMPolygonCrossingFuzz
)
virtual
Adds the boundary as specified by the input AcDbPolyline as a loop to this AcDbMPolygon entity.
Parameters
[in] | pPolyline | -
[in] | notCrossing | - if true, the boundary will be rejected for crossing boundaries cases :
it is overlapping itself
it is overlapping with any other boundary in this object if argument is false, both cases will be accepted.
[in] | tolerance | - is the tolerance used to verify whether the polyline crosses any boundary in this object
Returns
Adesk::eOK for success Acad::eAmbiguousInput if the boundary is rejected because it crosses another boundary in this object
◆ appendMPolygonLoop()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbMPolygon::appendMPolygonLoop  |  ( |  const AcGePoint2dArray &  |  vertices,
|  const AcGeDoubleArray &  |  bulges,
|  bool  |  noCrossing = true,
|  double  |  tolerance = AcDbMPolygonCrossingFuzz
)
virtual
It adds a new boundary to instance of AcDbMPolygon.
Parameters
[in] | verticesArr | It's a set of AcGePoint2d for adding a boundary.
[in] | bulges | It's a set of value needed for adding a boundary.
[in] | noCrossing | If true the boundary will be rejected in all of these cases
It is overlapped to itself
It is overlapped to another boundary in the same object If false both casses will be accepted.
[in] | tolerance | It's the tolerance to check if the boundary crosses another boundary in the same object
Returns
Adesk::eOK for success Acad::eAmbiguousInput if the boundary is rejected because it crosses another boundary in the same object
◆ audit()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbMPolygon::audit  |  ( |  AcDbAuditInfo *  |  info | )
virtual
See also
AcDbEntity::audit(AcDbAuditInfo*)
Reimplemented from AcDbEntity.
◆ balanceDisplay()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbMPolygon::balanceDisplay  |  ( |   | )
virtual
Removes degenerated loops, or reactivates now-valid loops, to refresh a proper hatches display.
Returns Acad::eOk if successful, error status otherwise
◆ balanceTree()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbMPolygon::balanceTree  |  ( |   | )
virtual
Reorders all loops to be outer resp.
inner loops, and aligns the loop vertices arrays; also triggers the hatch display update accordingly. Returns Acad::eOk if successful, error status otherwise
◆ createLoops()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbMPolygon::createLoops  |  ( |  const AcArray< AcGePoint2dArray > &  |  loops,
|  const AcArray< AcGeDoubleArray > &  |  bulges,
|  AcDbIntArray &  |  rejected,
|  bool  |  noCrossing = true,
|  double  |  tolerance = AcDbMPolygonCrossingFuzz
)
virtual
Creates multiple loops for the mpolygon entity.
Parameters
[in] | loops | array of loops to create
[in] | bulges | corresponding bulges for loop segments
[out] | rejected | rejected loops
[in] | noCrossing | if true, any crossing loops will be rejected
[in] | tolerance | tolerance used for determining whether loops are crossing
Returns
Acad::eOk, or error status
◆ createLoopsFromBoundaries()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbMPolygon::createLoopsFromBoundaries  |  ( |  const AcDbObjectIdArray &  |  boundaries,
|  AcDbIntArray &  |  rejected,
|  bool  |  noCrossing = true,
|  double  |  tolerance = AcDbMPolygonCrossingFuzz
)
virtual
Creates multiple loops from boundary entities.
Parameters
[in] | boundaries | boundary entities
[out] | rejected | rejected loops
[in] | noCrossing | if true, any crossing loops will be rejected
[in] | tolerance | tolerance used for determining whether loops are crossing
Returns
Acad::eOk, or error status
◆ decomposeForSave()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbMPolygon::decomposeForSave  |  ( |  AcDb::AcDbDwgVersion  |  version,
|  AcDbObject *&  |  replacingObject,
|  AcDbObjectId &  |  replacingId,
|  Adesk::Boolean &  |  replaceXData
)
virtual
See also
AcDbEntity::decomposeForSave(AcDb::AcDbDwgVersion, AcDbObject*&, AcDbObjectId&, Adesk::Boolean&)
Reimplemented from AcDbObject.
◆ deleteMPolygonTree()
 UX_EXPORT_FUNCTION void AcDbMPolygon::deleteMPolygonTree  |  ( |  AcDbMPolygonNode *  |  node | ) |   const
virtual
Deletes the specified node (and all sub-nodes) of the AcDbMPolygonNode tree.
Parameters
[in] | node | - the root node of the AcDbMPolygon tree
Returns
Acad::eOk, or error status
◆ dwgInFields()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbMPolygon::dwgInFields  |  ( |  AcDbDwgFiler *  |  dwgFiler | )
virtual
See also
AcDbEntity::dwgInFields(AcDbDwgFiler*)
Reimplemented from AcDbEntity.
◆ dwgOutFields()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbMPolygon::dwgOutFields  |  ( |  AcDbDwgFiler *  |  dwgFiler | ) |   const
virtual
See also
AcDbEntity::dwgOutFields(AcDbDwgFiler*)
Reimplemented from AcDbEntity.
◆ dxfInFields()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbMPolygon::dxfInFields  |  ( |  AcDbDxfFiler *  |  dxfFiler | )
virtual
See also
AcDbEntity::dxfInFields(AcDbDxfFiler*)
Reimplemented from AcDbEntity.
◆ dxfOutFields()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbMPolygon::dxfOutFields  |  ( |  AcDbDxfFiler *  |  dxfFiler | ) |   const
virtual
See also
AcDbEntity::dxfOutFields(AcDbDxfFiler*)
Reimplemented from AcDbEntity.
◆ elevation()
 UX_EXPORT_FUNCTION double AcDbMPolygon::elevation  |  ( |   | ) |   const
virtual
Gets the AcDbMPolygon's elevation.
Returns
elevation value
◆ evaluateHatch()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbMPolygon::evaluateHatch  |  ( |  bool  |  bEstimate = false | )
virtual
It calls for internal AcDbHatch member AcDbHatch::evaluateHatch()
Parameters
[in] | bEstimate | abort, if the number of patterns exceeds 100.000.
Returns
one of: Acad::eOk, Acad::eHatchTooDense, Acad::eInvalidInput, Acad::eAmbiguousOutput.
◆ getArea()
 UX_EXPORT_FUNCTION double AcDbMPolygon::getArea  |  ( |   | ) |   const
virtual
Gets the total area of all boundaries in that AcDbMPolygon's object.
Returns
area
◆ getChildLoops()
 UX_EXPORT_FUNCTION void AcDbMPolygon::getChildLoops  |  ( |  int  |  loop,
|  AcGeIntArray &  |  childLoops
) |   |  const
virtual
Returns the indices of child loops for specified MPolygon boundary loop.
Parameters
[in] | loop | index of 'parent' loop to query
[out] | childLoops | array of child loop indices
◆ getClosestLoopTo()
 UX_EXPORT_FUNCTION int AcDbMPolygon::getClosestLoopTo  |  ( |  const AcGePoint3d &  |  point | ) |   const
virtual
Returns the index of the loop nearest the specified point.
Parameters
[in] | point | target point
Returns
int index of the closest loop
◆ getLoopDirection()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbMPolygon::getLoopDirection  |  ( |  int  |  loopIndex,
|  AcDbMPolygon::loopDir &  |  loopDirection
) |   |  const
virtual
Returns the direction type for the specified loop.
Parameters
[in] | loopIndex | - the index of the loop to retrieve the loop direction for
[out] | loopDirection | - the loop direction for the specified loop
Returns
Acad::eOk, or error status
◆ getMPolygonLoopAt()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbMPolygon::getMPolygonLoopAt  |  ( |  int  |  loop,
|  AcGePoint2dArray &  |  arVertices,
|  AcGeDoubleArray &  |  arBulges
) |   |  const
virtual
Returns the definition data of specified MPolygon boundary loop.
Parameters
[in] | loop | index of loop to query
[out] | arVertices | 2d definition points
[out] | arBulges | definition bulges array Returns Acad::eOk if successful, error status otherwise
◆ getMPolygonTree()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbMPolygon::getMPolygonTree  |  ( |  AcDbMPolygonNode *&  |  root | ) |   const
virtual
Returns the root node of the AcDbMPolygonNode tree for this AcDbMPolygon entity.
Parameters
[out] | root | - the root node of the AcDbMPolygon tree
Returns
Acad::eOk, or error status
◆ getOffsetVector()
 UX_EXPORT_FUNCTION AcGeVector2d AcDbMPolygon::getOffsetVector  |  ( |   | ) |   const
virtual
Gets the offset vector for this AcDbMPolygon entity (relative distance to center).
Returns
2d offset vector
◆ getParentLoop()
 UX_EXPORT_FUNCTION int AcDbMPolygon::getParentLoop  |  ( |  int  |  index | ) |   const
virtual
Returns the index of the immediate parent loop of the specified (child) loop.
Parameters
[in] | index | - the index of the (child) loop
Returns
int - index of the immediate parent loop
◆ getPatternDefinitionAt()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbMPolygon::getPatternDefinitionAt  |  ( |  int  |  loop,
|  double &  |  angle,
|  double &  |  posX,
|  double &  |  posY,
|  double &  |  offsetX,
|  double &  |  offsetY,
|  AcGeDoubleArray &  |  dashes
) |   |  const
virtual
Returns the requested loop hatch pattern information.
Parameters
[in] | loop | index of loop to retrieve hatch pattern
[out] | angle | pattern angle
[out] | posX | pattern base point X coordinate
[out] | posY | pattern base point Y coordinate
[out] | offsetX | pattern X offset
[out] | offsetY | pattern Y offset
[out] | dashes | pattern definition
Returns
Acad::eOk, or error status
◆ getPerimeter()
 UX_EXPORT_FUNCTION double AcDbMPolygon::getPerimeter  |  ( |   | ) |   const
virtual
Gets the total perimeter of all boundaries in that AcDbMPolygon's object.
Returns
perimeter
◆ hatch()
 UX_EXPORT_FUNCTION AcDbHatch * AcDbMPolygon::hatch  |  ( |   | )
virtual
Gets a pointer to the internal member of class AcDbMPolygon.
Returns
the pointer of internal member
◆ insertMPolygonLoopAt()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbMPolygon::insertMPolygonLoopAt  |  ( |  int  |  loop,
|  const AcGePoint2dArray &  |  vertices,
|  const AcGeDoubleArray &  |  bulges,
|  bool  |  noCrossing = true,
|  double  |  tolerance = AcDbMPolygonCrossingFuzz
)
virtual
Inserts a new loop at the specified index.
Parameters
[in] | loop | index of new loop
[in] | vertices | loop vertices
[in] | bulges | loop bulges
[in] | noCrossing | if true, any crossing loops will be rejected
[in] | tolerance | tolerance used for determining whether loops are crossing
Returns
Acad::eOk, or error status
◆ isBalanced()
 UX_EXPORT_FUNCTION bool AcDbMPolygon::isBalanced  |  ( |   | ) |   const
virtual
Returns whether this AcDbMPolygon entity is in balanced state (no degenerated loops, no self-crossing loops, proper inner/outer loops status).
Returns bool - true, if the AcDbMPolygon is balanced, false otherwise
◆ isPointInsideMPolygon()
 UX_EXPORT_FUNCTION int AcDbMPolygon::isPointInsideMPolygon  |  ( |  const AcGePoint3d &  |  pt,
|  AcGeIntArray &  |  loops,
|  double  |  tolerance = AcDbMPolygonCrossingFuzz
) |   |  const
virtual
Adds the boundary as specified by the input AcDbPolyline as a loop to this AcDbMPolygon entity.
Parameters
[in] | pt | - point to query relation for
[out] | loops | - on output, array contains the indices of the loops, containing the point
[in] | tolerance | - is the tolerance used to be used
Returns
number of detected loops
◆ isPointOnLoopBoundary()
 UX_EXPORT_FUNCTION bool AcDbMPolygon::isPointOnLoopBoundary  |  ( |  const AcGePoint3d &  |  worldPt,
|  int  |  loop,
|  double  |  tol = AcDbMPolygonCrossingFuzz
) |   |  const
virtual
Function checks a specific loop boundary in AcDbMPolygon to see if it contains worldPt.
Parameters
[in] | worldPt | - world coordinate point
[in] | loop | - boundary loop index
[in] | tol | - tolerance
Returns
true if worldPt is on the loop boundary
◆ normal()
 UX_EXPORT_FUNCTION AcGeVector3d AcDbMPolygon::normal  |  ( |   | ) |   const
virtual
Gets the normal vector (normalized to unit and expressed in WCS) of an AcDbMPolygon entity.
Returns
normal vector
◆ numMPolygonLoops()
 UX_EXPORT_FUNCTION int AcDbMPolygon::numMPolygonLoops  |  ( |   | ) |   const
virtual
Returns the number of polygon loops for this MPolygon entity.
Returns
2d offset vector
◆ numPatternDefinitions()
 UX_EXPORT_FUNCTION int AcDbMPolygon::numPatternDefinitions  |  ( |   | ) |   const
virtual
Returns the number of pattern definitions used by this AcDbMPolygon entity.
Returns
int - number of pattern definitions
◆ patternAngle()
 UX_EXPORT_FUNCTION double AcDbMPolygon::patternAngle  |  ( |   | ) |   const
virtual
Returns the pattern angle (in radians) for this AcDbMPolygon entity.
Returns
double pattern angle in radians
◆ patternColor()
 UX_EXPORT_FUNCTION AcCmColor AcDbMPolygon::patternColor  |  ( |   | ) |   const
virtual
Returns the index of color in AcDbHatch member of AcDbMPolygon instance.
Returns
◆ patternDouble()
 UX_EXPORT_FUNCTION bool AcDbMPolygon::patternDouble  |  ( |   | ) |   const
virtual
PatternDouble apllies other set of hatch lines.
This set have 90 degrees to the original hatch lines but It's used only for kUserDefined pattern.
Returns
value of double pattern. If we have kPreDefined or kCustomDefined than return false
◆ patternName()
 UX_EXPORT_FUNCTION const ACHAR * AcDbMPolygon::patternName  |  ( |   | ) |   const
virtual
Returns the pattern name for this AcDbMPolygon entity.
Returns
const ACHAR* pattern name
◆ patternScale()
 UX_EXPORT_FUNCTION double AcDbMPolygon::patternScale  |  ( |   | ) |   const
virtual
Returns the pattern scale for this AcDbMPolygon entity.
Returns
double pattern scale
◆ patternSpace()
 UX_EXPORT_FUNCTION double AcDbMPolygon::patternSpace  |  ( |  void  |   | ) |   const
virtual
Returns the space pattern for internal AcDbHatch member.
Only used for kUserDefined hatches.
Returns
space for the hatch pattern.
◆ patternType()
 UX_EXPORT_FUNCTION AcDbHatch::HatchPatternType AcDbMPolygon::patternType  |  ( |   | ) |   const
virtual
Returns type of the pattern for internal AcDbHatch member .
Returns
one of AcDbHatch::kUserDefined, AcDbHatch::kPreDefined, AcDbHatch::kCustomDefined
◆ removeMPolygonLoopAt()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbMPolygon::removeMPolygonLoopAt  |  ( |  int  |  loop | )
virtual
Removes the specified boundary loop from MPolygon.
Parameters
[in] | loop | index of loop to be removed Returns Acad::eOk if successful, error status otherwise
◆ saveAs()
 UX_EXPORT_FUNCTION void AcDbMPolygon::saveAs  |  ( |  AcGiWorldDraw *  |  wd,
|  AcDb::SaveType  |  type
)
virtual
See also
AcDbEntity::saveAs(AcGiWorldDraw*, AcDb::SaveType)
Reimplemented from AcDbEntity.
◆ setElevation()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbMPolygon::setElevation  |  ( |  double  |  value | )
virtual
Sets the AcDbMPolygon's elevation.
Parameters
[in] | elevation | value
Returns
Acad::eOk
◆ setGradient()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbMPolygon::setGradient  |  ( |  AcDbHatch::GradientPatternType  |  gradientType,
|  const ACHAR *  |  gradientName
)
Sets the hatch entity gradient type and gradient name for this object.
Parameters
[in] | gradientType | kPreDefinedGradient or kUserDefinedGradient, only first supported
[in] | gradientName | name of gradient (string)
◆ setGradientAngle()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbMPolygon::setGradientAngle  |  ( |  double  |  ang | )
Sets the object .
Parameters
[in] | angle | It sets the hatch gradient with angle which will be draw. Returns Acad::eOK if the operation is successful.
◆ setGradientColors()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbMPolygon::setGradientColors  |  ( |  unsigned int  |  numberOfColor,
|  AcCmColor *  |  colors,
|  float *  |  valueOfGradient
)
This method sets AcDbHatch member of AcDbMPolygon instance with colors containing gradient definition.
Our present release supports only a count value of 2. The start color will be retained by colors[0] and the end color will be retained by colors[count-1]. The AcDbHatch member makes a copy of the arrays provided as arguments. Do not forget to clear the memory of colors and values arrays after usage.
Parameters
[in] | index | number of pairs gradientColors/interpolationValues, only 2 pairs currently supported
[in] | gradientColors | array of AcCmColor holding gradientColors, only 2 elements currently supported
[in] | interpolationValues | array of float values, only 2 elements currently supported and only 0.0f the first element and 1.0f the second element
Returns
Acad::eOk if succesfull
 Acad::eBadColor When we have other method than AcCmEntityColor::kByColor or kByACI.
 Acad::eInvalidInput When we have valueOfGradient array out of the range [0.0f .. 1.0f]. or if numberOfColor is less than 2 or valueOfGradient[0] != 0 , values[count-1] != 1.0f.
 Acad::eNotImplementedYet if valueOfGradient > 2.
 Acad::eOutOfMemory if memory allocation error
◆ setGradientOneColorMode()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbMPolygon::setGradientOneColorMode  |  ( |  Adesk::Boolean  |  singleColor | )
Sets the hatch entity gradient for internal AcDbHatch member.
If is it false than the transition will be from a start color to the stop color If is it true than It will adjust the luminance version of the same color.
Parameters
[in] | singleColor | Value for know if is with one color or two color. Returns Acad::eOk if successful.
◆ setGradientShift()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbMPolygon::setGradientShift  |  ( |  float  |  shift | )
Sets the hatch entity gradient with this shift value.
Parameters
[in] | value | of shift
◆ setLoopDirection()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbMPolygon::setLoopDirection  |  ( |  int  |  loop,
|  AcDbMPolygon::loopDir  |  direction
)
virtual
Sets the specified loop's direction.
Parameters
[in] | loop | index of loop
[in] | direction | direction of loop Returns Acad::eOk if successful, error status otherwise
◆ setNormal()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbMPolygon::setNormal  |  ( |  const AcGeVector3d &  |  normalVector | )
virtual
Sets the normal vector (normalized to unit and expressed in WCS)for an AcDbMPolygon entity.
Parameters
[in] | normalVector | vector value
Returns
Acad::eOk, if successful, error code otherwise
◆ setPattern()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbMPolygon::setPattern  |  ( |  AcDbHatch::HatchPatternType  |  patternType,
|  const ACHAR *  |  patternName
)
virtual
Sets both pattern type and pattern name for AcDbHatch member.
Parameters
[in] | patternType | type to set, one of kUserDefined, kPreDefined or kCustomDefined
[in] | patternName | name to set, may be NULL for kCustomDefined patterns.
Returns
one of Acad::eOk, Acad::eInvalidInput ,
◆ setPatternAngle()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbMPolygon::setPatternAngle  |  ( |  double  |  value | )
virtual
Sets the pattern (in radians) angle for AcDbHatch member.
Parameters
[in] | value | - the pattern angle in radians
◆ setPatternColor()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbMPolygon::setPatternColor  |  ( |  const AcCmColor &  |  color | )
virtual
Sets the fill color for AcDbHatch member.
Parameters
[in] | color | It is index for the color to set AcDbHatch member of AcDbMPolygon instance.
Returns
Acad::eOk if succesfull
◆ setPatternDouble()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbMPolygon::setPatternDouble  |  ( |  bool  |  isPatternDouble | )
virtual
Sets AcDbHatch member of AcDbMPolygon instance with true or false if paterne is double.
Parameters
[in] | isPatternDouble | It is ignored if we've kPreDefined and kCustomDefined
Returns
Acad::eOk if succesfull or Acad::eNotApplicable for gradient.
◆ setPatternScale()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbMPolygon::setPatternScale  |  ( |  double  |  patternScale | )
virtual
Sets the pattern scale for internal AcDbHatch member .
Parameters
[in] | patternScale | It is important to be positive and not equal with zero.
Returns
Acad::eNotApplicable, if current object type is gradient, Acad::eOk otherwise
◆ setPatternSpace()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbMPolygon::setPatternSpace  |  ( |  double  |  valueSpace | )
virtual
Sets the space for the pattern for internal AcDbHatch member .
Only used for kUserDefined hatches.
Returns
Acad::eNotApplicable, if gradient, Acad::eInvalidInput, if not kUserDefined, Acad::eOk else
Remarks
other CAD engines may return Acad::eOk for hatches which are not kUserDefined.
 In BrxApi this function only can be applied to hatches which belong to a database.
◆ subExplode()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbMPolygon::subExplode  |  ( |  AcDbVoidPtrArray &  |  pointerArray | ) |   const
protectedvirtual
See also
AcDbEntity::explode(AcDbVoidPtrArray&) const
Reimplemented from AcDbEntity.
◆ subGetClassID()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbMPolygon::subGetClassID  |  ( |  CLSID *  |  pClassId | ) |   const
protectedvirtual
Reimplemented from AcDbObject.
◆ subGetGeomExtents()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbMPolygon::subGetGeomExtents  |  ( |  AcDbExtents &  |  resultBox | ) |   const
protectedvirtual
See also
AcDbEntity::getGeomExtents(AcDbExtents&)
Reimplemented from AcDbEntity.
◆ subGetGripPoints()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbMPolygon::subGetGripPoints  |  ( |  AcGePoint3dArray &  |  pointArray,
|  AcDbIntArray &  |  snapSettingsArray,
|  AcDbIntArray &  |  idArray
) |   |  const
protectedvirtual
See also
AcDbEntity::subGetGripPoints(AcGePoint3dArray&, AcDbIntArray&, AcDbIntArray&)
Reimplemented from AcDbEntity.
◆ subGetGsMarkersAtSubentPath()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbMPolygon::subGetGsMarkersAtSubentPath  |  ( |  const AcDbFullSubentPath &  |  subentId,
|  AcArray< Adesk::GsMarker > &  |  markerArray
) |   |  const
protectedvirtual
See also
AcDbEntity::getGsMarkersAtSubentPath(const AcDbFullSubentPath&, AcDbIntArray&)
Reimplemented from AcDbEntity.
◆ subGetOsnapPoints()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbMPolygon::subGetOsnapPoints  |  ( |  AcDb::OsnapMode  |  mode,
|  Adesk::GsMarker  |  subEntSelectMarker,
|  const AcGePoint3d &  |  pickedPnt,
|  const AcGePoint3d &  |  lastSelectedPnt,
|  const AcGeMatrix3d &  |  matrix,
|  AcGePoint3dArray &  |  snapIOArray,
|  AcDbIntArray &  |  idArray
) |   |  const
protectedvirtual
See also
AcDbEntity::getOsnapPoints(AcDb::OsnapMode, Adesk::GsMarker, const AcGePoint3d&, const AcGePoint3d&, const AcGeMatrix3d&, AcGePoint3dArray&, AcDbIntArray&)
Reimplemented from AcDbEntity.
◆ subGetStretchPoints()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbMPolygon::subGetStretchPoints  |  ( |  AcGePoint3dArray &  |  pointArray | ) |   const
protectedvirtual
See also
AcDbEntity::subGetStretchPoints(AcGePoint3dArray&)
Reimplemented from AcDbEntity.
◆ subGetSubentPathsAtGsMarker()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbMPolygon::subGetSubentPathsAtGsMarker  |  ( |  AcDb::SubentType  |  eSubentType,
|  Adesk::GsMarker  |  gsMarker,
|  const AcGePoint3d &  |  pntIn,
|  const AcGeMatrix3d &  |  transformationMatrix,
|  int &  |  pathCnt,
|  AcDbFullSubentPath *&  |  pSubentPathArr,
|  int  |  insCnt = 0,
|  AcDbObjectId *  |  pContainerArray = NULL
) |   |  const
protectedvirtual
See also
AcDbEntity::getSubentPathsAtGsMarker(AcDb::SubentType, Adesk::GsMarker, const AcGePoint3d&, const AcGeMatrix3d&, int&, AcDbFullSubentPath*&, int, AcDbObjectId*)
Reimplemented from AcDbEntity.
◆ subIntersectWith() [1/2]
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbMPolygon::subIntersectWith  |  ( |  const AcDbEntity *  |  pEntity,
|  AcDb::Intersect  |  type,
|  AcGePoint3dArray &  |  pointArray,
|  Adesk::GsMarker  |  thisSubEntId = 0,
|  Adesk::GsMarker  |  inputSubEntId = 0
) |   |  const
virtual
See also
AcDbEntity::intersectWith(const AcDbEntity*, AcDb::Intersect, AcGePoint3dArray&, int, int)
Reimplemented from AcDbEntity.
◆ subIntersectWith() [2/2]
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbMPolygon::subIntersectWith  |  ( |  const AcDbEntity *  |  pEntity,
|  AcDb::Intersect  |  type,
|  const AcGePlane &  |  plane,
|  AcGePoint3dArray &  |  pointArray,
|  Adesk::GsMarker  |  thisSubEntId = 0,
|  Adesk::GsMarker  |  inputSubEntId = 0
) |   |  const
virtual
See also
AcDbEntity::intersectWith(const AcDbEntity*, AcDb::Intersect, const AcGePlane&, AcGePoint3dArray&, int, int)
Reimplemented from AcDbEntity.
◆ subList()
 UX_EXPORT_FUNCTION void AcDbMPolygon::subList  |  ( |   | ) |   const
protectedvirtual
See also
AcDbEntity::list()
Reimplemented from AcDbEntity.
◆ subMoveGripPointsAt()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbMPolygon::subMoveGripPointsAt  |  ( |  const AcDbIntArray &  |  indexArray,
|  const AcGeVector3d &  |  translationVector
)
protectedvirtual
See also
AcDbEntity::subMoveGripPointsAt(const AcDbIntArray&, const AcGeVector3d&)
Reimplemented from AcDbEntity.
◆ subMoveStretchPointsAt()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbMPolygon::subMoveStretchPointsAt  |  ( |  const AcDbIntArray &  |  indexArray,
|  const AcGeVector3d &  |  translationVector
)
protectedvirtual
See also
AcDbEntity::subMoveStretchPointsAt(const AcDbIntArray&, const AcGeVector3d&)
Reimplemented from AcDbEntity.
◆ subSubentPtr()
 UX_EXPORT_FUNCTION AcDbEntity * AcDbMPolygon::subSubentPtr  |  ( |  const AcDbFullSubentPath &  |  pathId | ) |   const
protectedvirtual
See also
AcDbEntity::subentPtr(const AcDbFullSubentPath&)
Reimplemented from AcDbEntity.
◆ subTransformBy()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbMPolygon::subTransformBy  |  ( |  const AcGeMatrix3d &  |  matrix | )
protectedvirtual
See also
AcDbEntity::transformBy(const AcGeMatrix3d&)
Reimplemented from AcDbEntity.
◆ subWorldDraw()
 UX_EXPORT_FUNCTION Adesk::Boolean AcDbMPolygon::subWorldDraw  |  ( |  AcGiWorldDraw *  |  pWd | )
protectedvirtual
Creates a viewport-independent graphical representation of the object.
Parameters
[in] | pWd | pointer to initialized AcGiWorldDraw interface
Returns
if false, viewportDraw() must be called,
 if true, the graphical representation is viewport-independent
Reimplemented from AcDbEntity.