Public Member Functions | Protected Member Functions | List of all members
AcDbAnnotationScale Class Reference
_ More...
#include <AcDbAnnotationScale.h>
 Public Member Functions
virtual AcString  | collectionName () const
Returns the collection name for this AcDbAnnotationScale object. More...
virtual Acad::ErrorStatus  | copyFrom (const AcRxObject *)
virtual Acad::ErrorStatus  | getDrawingUnits (double &) const
Returns the drawing unit value for this AcDbAnnotationScale object. More...
virtual Acad::ErrorStatus  | getIsTemporaryScale (bool &) const
Retrusn whether this annotation scale object is a temporary object. More...
virtual Acad::ErrorStatus  | getName (AcString &) const
Returns the name value for this AcDbAnnotationScale object. More...
virtual Acad::ErrorStatus  | getPaperUnits (double &) const
Returns the paperspace unit value for this AcDbAnnotationScale object. More...
virtual Acad::ErrorStatus  | getScale (double &) const
Returns the annotation scale for this AcDbAnnotationScale object. More...
virtual bool  | matchScaleId (Adesk::LongPtr) const
Determines whether an annotation scale object matches this one, based on the unique identifier. More...
virtual Acad::ErrorStatus  | setDrawingUnits (const double)
Sets the drawing unit value for this AcDbAnnotationScale object. More...
virtual Acad::ErrorStatus  | setName (const AcString &)
Sets the name value for this AcDbAnnotationScale object. More...
virtual Acad::ErrorStatus  | setPaperUnits (double)
Sets the paperspace unit value for this AcDbAnnotationScale object. More...
virtual Adesk::LongPtr  | uniqueIdentifier () const
Returns the unique identifier value for this AcDbAnnotationScale object. More...
 Public Member Functions inherited from AcDbObjectContext
virtual AcString  | collectionName () const =0
virtual Acad::ErrorStatus  | getName (AcString &) const =0
virtual Acad::ErrorStatus  | setName (const AcString &)=0
virtual Adesk::LongPtr  | uniqueIdentifier () const =0
 virtual  | ~AcDbObjectContext ()
Destructor.
 Public Member Functions inherited from AcRxObject
virtual AcRxObject *  | clone () const
Exported and implemented. More...
 virtual AcRx::Ordering  | comparedTo (const AcRxObject *) const
Exported and implemented.
virtual Acad::ErrorStatus  | copyFrom (const AcRxObject *)
Exported and implemented. More...
 virtual AcRxClass *  | isA () const
Exported and implemented.
virtual Adesk::Boolean  | isEqualTo (const AcRxObject *) const
Exported and implemented. More...
bool  | isKindOf (const AcRxClass *) const
Checks the object class. More...
AcRxObject *  | queryX (const AcRxClass *) const
returns the protocol extension object assigned to this class or a parent class. More...
AcRxObject *  | x (const AcRxClass *) const
returns the protocol extension object assigned to this class or a parent class. More...
 virtual  | ~AcRxObject ()
Destructor.
 Protected Member Functions
AcDbAnnotationScale (bool)
 Protected Member Functions inherited from AcRxObject
AcRxObject ()
Exported and implemented.
 Additional Inherited Members
 Static Public Member Functions inherited from AcRxObject
 static AcRxObject *  | cast (const AcRxObject *)
 static AcRxClass *  | desc ()
Exported and implemented.
 Static Public Member Functions inherited from AcHeapOperators
 static void  | operator delete (void *)
_
 static void  | operator delete (void *, const char *, int)
 static void  | operator delete (void *, void *)
 static void  | operator delete[] (void *)
_
 static void  | operator delete[] (void *, const char *, int)
 static void *  | operator new (size_t)
_
 static void *  | operator new (size_t, const char *, int)
 static void *  | operator new (size_t, void *p)
 static void *  | operator new[] (size_t)
_
 static void *  | operator new[] (size_t, const char *, int)
 Public Attributes inherited from AcDbObjectContext
AcDbObjectContext
Standard Contructor.
Detailed Description
_
Member Function Documentation
◆ collectionName()
 UX_EXPORT_FUNCTION AcString AcDbAnnotationScale::collectionName  |  ( |   | ) |   const
virtual
Returns the collection name for this AcDbAnnotationScale object.
Returns
Adesk::LongPtr (32/64 bit) identifier value
Implements AcDbObjectContext.
◆ copyFrom()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbAnnotationScale::copyFrom  |  ( |  const AcRxObject *  |  source | )
virtual
Reimplemented from AcRxObject.
◆ getDrawingUnits()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbAnnotationScale::getDrawingUnits  |  ( |  double &  |  units | ) |   const
virtual
Returns the drawing unit value for this AcDbAnnotationScale object.
Parameters
[out] | units | gets the drawing unit value for this annotation scale object
Returns
Adesk::eOk, or error status
◆ getIsTemporaryScale()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbAnnotationScale::getIsTemporaryScale  |  ( |  bool &  |  isTemporary | ) |   const
virtual
Retrusn whether this annotation scale object is a temporary object.
Parameters
[out] | isTemporary | specifying whether this annotation scale object is temporary
Returns
Acad::eOk, or error status
◆ getName()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbAnnotationScale::getName  |  ( |  AcString &  |  annoName | ) |   const
virtual
Returns the name value for this AcDbAnnotationScale object.
Parameters
[out] | annoName | gets the name of the annotation scale
Returns
Adesk::eOk, or error status
Implements AcDbObjectContext.
◆ getPaperUnits()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbAnnotationScale::getPaperUnits  |  ( |  double &  |  units | ) |   const
virtual
Returns the paperspace unit value for this AcDbAnnotationScale object.
Parameters
[out] | units | gets the paperspace unit value for this annotation scale object
Returns
Adesk::eOk, or error status
◆ getScale()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbAnnotationScale::getScale  |  ( |  double &  |  scale | ) |   const
virtual
Returns the annotation scale for this AcDbAnnotationScale object.
Parameters
[out] | scale | gets the annotation scale factor for this annotation scale object
Returns
Adesk::eOk, or error status
◆ matchScaleId()
 UX_EXPORT_FUNCTION bool AcDbAnnotationScale::matchScaleId  |  ( |  Adesk::LongPtr  |  idScale | ) |   const
virtual
Determines whether an annotation scale object matches this one, based on the unique identifier.
Parameters
[in] | idScale | unique identifier of anotehr annotation scale object
Returns
true/false
◆ setDrawingUnits()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbAnnotationScale::setDrawingUnits  |  ( |  const double  |  units | )
virtual
Sets the drawing unit value for this AcDbAnnotationScale object.
Parameters
[in] | units | specifies the drawing unit value for this annotation scale object
Returns
Adesk::eOk, or error status
◆ setName()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbAnnotationScale::setName  |  ( |  const AcString &  |  annoName | )
virtual
Sets the name value for this AcDbAnnotationScale object.
Parameters
[out] | annoName | gets the name of the annotation scale
Returns
Adesk::LongPtr (32/64 bit) identifier value
Implements AcDbObjectContext.
◆ setPaperUnits()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbAnnotationScale::setPaperUnits  |  ( |  double  |  units | )
virtual
Sets the paperspace unit value for this AcDbAnnotationScale object.
Parameters
[in] | units | specifies the paperspace unit value for this annotation scale object
Returns
Adesk::eOk, or error status
◆ uniqueIdentifier()
 UX_EXPORT_FUNCTION Adesk::LongPtr AcDbAnnotationScale::uniqueIdentifier  |  ( |   | ) |   const
virtual
Returns the unique identifier value for this AcDbAnnotationScale object.
Returns
Adesk::LongPtr (32/64 bit) identifier value
Implements AcDbObjectContext.