Public Types | Public Member Functions | Public Attributes | Protected Member Functions | List of all members
AcDbDimAssoc Class Reference
_ More...
#include <AcDbDimAssoc.h>
 Public Types
enum  | { kMaxPointRefs = 4 }
enum  | AssocFlags { kFirstPointRef = 1 , kSecondPointRef = 2 , kThirdPointRef = 4 , kFourthPointRef = 8 }
enum  | PointType {
 kXline1Point = 0 , kXline2Point , kOriginPoint = 0 , kDefiningPoint ,
 kXline1Start = 0 , kXline1End , kXline2Start , kXline2End ,
 kVertexPoint = 2 , kChordPoint = 0 , kCenterPoint , kFarChordPoint = 1 ,
 kOverrideCenterPoint , kAngLineStart = 2 , kJogPoint , kAngLineEnd = 3 ,
 kLeaderPoint = 0
 }
enum  | RotatedDimType { kUnknown = 0 , kParallel , kPerpendicular }
 Public Types inherited from AcGiDrawable
enum  | DrawableType {
 kGeometry = 0 , kDistantLight , kPointLight , kSpotLight ,
 kAmbientLight , kSolidBackground , kGradientBackground , kImageBackground ,
 kGroundPlaneBackground , kViewport
 }
enum  | SetAttributesFlags {
 kDrawableNone = 0 , kDrawableIsAnEntity = 1 , kDrawableUsesNesting = 2 , kDrawableIsCompoundObject = 4 ,
 kDrawableViewIndependentViewportDraw = 8 , kDrawableIsInvisible = 16 , kDrawableHasAttributes = 32 , kDrawableRegenTypeDependentGeometry = 64 ,
 kDrawableIsDimension = 133 , kDrawableRegenDraw = 256 , kDrawableStandardDisplaySingleLOD = 512 , kDrawableShadedDisplaySingleLOD = 1024 ,
 kDrawableViewDependentViewportDraw = 2048 , kDrawableBlockDependentViewportDraw = 4096 , kDrawableIsExternalReference = 8192 , kDrawableNotPlottable = 16384 ,
 kDrawableNotAllowLCS = 32768 , kDrawableMergeControlOff = 65536 , kThreadedWorldDrawViewportDraw = 131072
 }
 Public Member Functions
Acad::ErrorStatus  | addToDimensionReactor (bool=true)
Establishes or removes the reactor association between the dimension entity and this AcDbDimAssoc object. More...
Acad::ErrorStatus  | addToPointRefReactor ()
Establishes the reactor association between the referenced geometry and the dimension entity. More...
int  | assocFlag ()
Returns the active point reference type(s). More...
bool  | assocFlag (int) const
Returns whether the specified point reference type is enabled or disabled. More...
AcDbObjectId  | dimObjId () const
With this function we could know the ID of object AcDbDimension. More...
virtual Acad::ErrorStatus  | dwgInFields (AcDbDwgFiler *)
virtual Acad::ErrorStatus  | dwgOutFields (AcDbDwgFiler *) const
virtual Acad::ErrorStatus  | dxfInFields (AcDbDxfFiler *)
virtual Acad::ErrorStatus  | dxfOutFields (AcDbDxfFiler *) const
Acad::ErrorStatus  | getDimAssocGeomIds (AcDbObjectIdArray &) const
Returns the array of all geometric entities as referenced by all point reference type(s) from this AcDbDimAssoc object. More...
 bool  | hasOopsWatcher () const
bool  | isAllGeomErased () const
Returns whether all referenced geometric entities are erased or not. More...
bool  | isTransSpatial () const
Returns the current value of a flag noting whether the dimension is associated to geometry in a different space. More...
virtual void  | modifiedGraphics (const AcDbEntity *pObj)
const AcDbPointRef *  | pointRef (int) const
this function will be return the reference point coresponding point reference index More...
Acad::ErrorStatus  | post (AcDbObjectId, AcDbObjectId &, bool=true)
Posts this AcDbDimAssoc object to the database and associates it with the specified dimension. More...
Acad::ErrorStatus  | removeAssociativity (bool=true)
Specifies whether the associativity is removed or not. More...
 void  | removeOopsWatcher ()
Acad::ErrorStatus  | removePointRef (int)
Removes the specified point reference type(s) from this AcDbDimAssoc object. More...
 Acad::ErrorStatus  | restoreAssocFromOopsWatcher ()
 RotatedDimType  | rotatedDimType () const
void  | setAssocFlag (int)
Specifies the point reference type(s) being active. More...
Acad::ErrorStatus  | setAssocFlag (int, bool)
Enabes or disables the specified point reference type. More...
Acad::ErrorStatus  | setDimObjId (const AcDbObjectId &)
This function set the associated dimension entity. More...
Acad::ErrorStatus  | setPointRef (int, AcDbPointRef *)
This function set the reference point corresponding point reference object. More...
 Acad::ErrorStatus  | setRotatedDimType (RotatedDimType)
Acad::ErrorStatus  | setTransSpatial (bool)
This function sets a flag noting whether the dimension is associated to geometry in a different space. More...
Acad::ErrorStatus  | startCmdWatcher ()
Starts monitoring the changes to referenced geometric entities. More...
 Acad::ErrorStatus  | startOopsWatcher (bool=true)
virtual Acad::ErrorStatus  | swapReferences (const AcDbIdMapping &)
 Acad::ErrorStatus  | updateAssociativity (const AcDbObjectIdArray &)
Acad::ErrorStatus  | updateDimension (bool=true, bool=false)
This function updates the dimension or leader when its associated geometry has changed. More...
 void  | updateDueToMirror (bool)
 Acad::ErrorStatus  | updateFillet (const AcDbObjectIdArray &)
 Acad::ErrorStatus  | updateSubentPath (AcDbIdMapping &)
 Acad::ErrorStatus  | updateXrefSubentPath ()
 virtual  | ~AcDbDimAssoc ()
Destructor.
 Public Member Functions inherited from AcDbObject
virtual Acad::ErrorStatus  | addPersistentReactor (AcDbObjectId)
Adds a persistent reactor to this object reactor list. More...
Acad::ErrorStatus  | addReactor (AcDbObjectReactor *) const
Adds a transient reactor to this object. More...
virtual Acad::ErrorStatus  | applyPartialUndo (AcDbDwgFiler *, AcRxClass *)
This function is called during Undo operations on objects, that use the 'Partial Undo meachanism'; this is, this object is opened with assertWriteEnabled(Adesk::kFalse) to indicate that custom Undo filing is used rather than the default Undo filing. More...
 void  | assertNotifyEnabled () const
 void  | assertReadEnabled () const
 void  | assertWriteEnabled (Adesk::Boolean=Adesk::kTrue, Adesk::Boolean=Adesk::kTrue)
virtual Acad::ErrorStatus  | audit (AcDbAuditInfo *)
Performs the audit operation for this object. More...
Acad::ErrorStatus  | cancel ()
Reverts all changes since the object had been opened and closes the object. More...
virtual void  | cancelled (const AcDbObject *)
A handler function for persistent reactors. More...
virtual AcRxObject *  | clone () const
Creates a shallow clone of this object. More...
Acad::ErrorStatus  | close ()
Closes the object. More...
Acad::ErrorStatus  | closeAndPage (Adesk::Boolean=Adesk::kTrue)
Closes the object. More...
virtual Acad::ErrorStatus  | composeForLoad (AcDb::OdaSaveType, AcDb::AcDbDwgVersion)
This function is intended for future MT file loading support. More...
virtual void  | copied (const AcDbObject *, const AcDbObject *)
A handler function for persistent reactors. More...
virtual Acad::ErrorStatus  | copyFrom (const AcRxObject *)
Copies the pSrc object information in this object. More...
Acad::ErrorStatus  | createExtensionDictionary ()
Creates a dictionary as extension dictionary for this object. More...
AcDbDatabase *  | database () const
Returns the database that contains this object. More...
virtual Acad::ErrorStatus  | decomposeForSave (AcDb::AcDbDwgVersion, AcDbObject *&, AcDbObjectId &, Adesk::Boolean &)
This function is called during dwg and dxf output, to allow a custom object to decompose itself, due to provided dwg/dxf target file version. More...
virtual Acad::ErrorStatus  | deepClone (AcDbObject *, AcDbObject *&, AcDbIdMapping &, Adesk::Boolean=Adesk::kTrue) const final
Clones this object, appends it to the owner pOwner and adds an AcDbIdPair record to the idMap. More...
void  | disableUndoRecording (Adesk::Boolean)
Disables or enables the undo recording for the object. More...
Acad::ErrorStatus  | downgradeOpen ()
Sets the open mode for an object opened for write to be opened for read. More...
Acad::ErrorStatus  | downgradeToNotify (Adesk::Boolean)
Sets the open mode for an object opened for write to be opened for notify. More...
virtual AcGiDrawable *  | drawable ()
Retrieves the AcGiDrawable instance of this object. More...
Acad::ErrorStatus  | dwgIn (AcDbDwgFiler *)
Calls the object's dwgInFields function, and reads any XData if present. More...
virtual Acad::ErrorStatus  | dwgInFields (AcDbDwgFiler *)
Reads the object from the DWG filer. More...
Acad::ErrorStatus  | dwgOut (AcDbDwgFiler *) const
Calls the object's dwgOutFields function, and writes any XData if present. More...
virtual Acad::ErrorStatus  | dwgOutFields (AcDbDwgFiler *) const
Writes the object to the DWG filer. More...
Acad::ErrorStatus  | dxfIn (AcDbDxfFiler *)
Calls the object's dxfInFields function, and reads any XData if present. More...
virtual Acad::ErrorStatus  | dxfInFields (AcDbDxfFiler *)
Reads the object from the DXF filer. More...
Acad::ErrorStatus  | dxfOut (AcDbDxfFiler *, Adesk::Boolean, Adesk::uchar *) const
Calls the object's dxfOutFields function, and writes any XData if present. More...
virtual Acad::ErrorStatus  | dxfOutFields (AcDbDxfFiler *) const
Writes the object to the DXF filer. More...
Acad::ErrorStatus  | erase (Adesk::Boolean=Adesk::kTrue)
Sets the bit that indicates that the object is erased. More...
virtual void  | erased (const AcDbObject *, Adesk::Boolean)
A handler function for persistent reactors. More...
AcDbObjectId  | extensionDictionary () const
Returns the object id of the extension dictionary for this object. More...
void  | getAcDbHandle (AcDbHandle &) const
Returns handle of this object. More...
Acad::ErrorStatus  | getBinaryData (const ACHAR *, Adesk::Int32 &, char *&) const
Creates a copy of the binary data stored as chunks of maximum 127 bytes in the resbuf chain of this object's extension dictionary xrecord entry given by entryName. More...
int  | getBrxOpenCount () const
This function returns the number of open BRX instances for this object. More...
int  | getBrxOpenState () const
This function returns the BRX object open state flags as bitfields, for diagnostic purpose. More...
virtual Acad::ErrorStatus  | getClassID (CLSID *) const final
Gets the COM wrapper Class ID for this entity. More...
int  | getCustomObjectState () const
This function returns the custom object status : 1=isCustomObject 2=DifferentialUndoDisabled. More...
Acad::ErrorStatus  | getField (const ACHAR *, AcDbField *&, AcDb::OpenMode) const
Retrieves the specified Field from this object, and opens it in mode. More...
Acad::ErrorStatus  | getField (const ACHAR *, AcDbObjectId &) const
Gets the pszPropName field object from field dictionary of this AcDbObject object, using pszPropName as key. More...
AcDbObjectId  | getFieldDictionary () const
Returns the Field dictionary associated with this object,. More...
Acad::ErrorStatus  | getFieldDictionary (AcDbDictionary *&, AcDb::OpenMode) const
Gets and opens the field dictionary for this. More...
Acad::ErrorStatus  | getObjectBirthVersion (AcDb::AcDbDwgVersion &, AcDb::MaintenanceReleaseVersion &)
This function is currently not supported by the CAD engine, always returns Acad::eOk, and 'kDHL_CURRENT' + 'kMReleaseCurrent' results. More...
virtual Acad::ErrorStatus  | getObjectSaveVersion (const AcDbDwgFiler *, AcDb::AcDbDwgVersion &, AcDb::MaintenanceReleaseVersion &)
Returns the DWG version for saving the object. More...
virtual Acad::ErrorStatus  | getObjectSaveVersion (const AcDbDxfFiler *, AcDb::AcDbDwgVersion &, AcDb::MaintenanceReleaseVersion &)
Returns the DWG version for saving the object. More...
int  | getOdaOpenCount () const
This function returns the number of open ODA instances for this object. More...
int  | getOdaOpenState () const
This function returns the ODA object open state flags as bitfields, for diagnostic purpose. More...
virtual void  | goodbye (const AcDbObject *)
A handler function for persistent reactors. More...
Acad::ErrorStatus  | handOverTo (AcDbObject *, Adesk::Boolean=Adesk::kTrue, Adesk::Boolean=Adesk::kTrue)
Hands over objects identity to another object. More...
bool  | hasFields () const
Return true if this object has single or multiple fields associated with him. More...
bool  | hasPersistentReactor (AcDbObjectId) const
Checks the input objectId in this object reactor list. More...
bool  | hasSaveVersionOverride ()
This function indicates whether this object overrides the filer's save version. More...
virtual AcDbObjectId  | id () const
Returns the database id of this object. More...
Adesk::Boolean  | isAcDbObjectIdsInFlux () const
Checks whether a deep clone operation was completed. More...
Adesk::Boolean  | isAProxy () const
Adesk::Boolean  | isCancelling () const
Adesk::Boolean  | isErased () const
Returns whether this object is erased. More...
Adesk::Boolean  | isEraseStatusToggled () const
Checks whether the object erase status has been toggled. More...
Adesk::Boolean  | isModified () const
Returns whether this object's assertWriteEnabled() has been called since it was opened. More...
Adesk::Boolean  | isModifiedGraphics () const
Checks whether this object graphics will be updated when the object is closed. More...
Adesk::Boolean  | isModifiedXData () const
Checks whether this object's xData was modified. More...
Adesk::Boolean  | isNewObject () const
Returns true if and only if this object has not been closed since it was created. More...
Adesk::Boolean  | isNotifyEnabled () const
Returns whether this object is opened for notify. More...
Adesk::Boolean  | isNotifying () const
virtual Adesk::Boolean  | isPersistent () const
Returns the 'persistent' status of a database object. More...
Adesk::Boolean  | isReadEnabled () const
Returns whether this object is opened for read. More...
 Adesk::Boolean  | isReallyClosing () const
Checks whether the next close call will completely close this object return true if on the next call the object will be completely closed false otherwise.
Adesk::Boolean  | isTransactionResident () const
Gets the object transaction status. More...
Adesk::Boolean  | isUndoing () const
bool  | isUndoRecordingDisabled () const
Returns whether the undo recording for the object is enabled or not. More...
Adesk::Boolean  | isWriteEnabled () const
Returns whether this object is opened for write. More...
virtual AcDb::DuplicateRecordCloning  | mergeStyle () const
Returns the object's merge behavior during cloning. More...
virtual void  | modified (const AcDbObject *)
A handler function for persistent reactors. More...
virtual void  | modifiedGraphics (const AcDbEntity *)
A handler function for persistent reactors. More...
virtual void  | modifiedXData (const AcDbObject *)
A handler function for persistent reactors. More...
virtual void  | modifyUndone (const AcDbObject *)
A handler function for persistent reactors. More...
virtual void  | objectClosed (const AcDbObjectId)
A handler function for persistent reactors. More...
AcDbObjectId  | objectId () const
Returns object id. More...
virtual void  | openedForModify (const AcDbObject *)
A handler function for persistent reactors. More...
AcDbObjectId  | ownerId () const
Returns object id of the owner. More...
AcDbVoidPtrArray *  | reactors ()
Gets the object pointers to reactors. More...
const AcDbVoidPtrArray *  | reactors () const
Gets the object pointers to reactors. More...
virtual void  | reappended (const AcDbObject *)
A handler function for persistent reactors. More...
 virtual void  | recvPropagateModify (const AcDbObject *)
Not implemented yet.
Acad::ErrorStatus  | releaseExtensionDictionary ()
Removes the extension dictionary associated with this object. More...
virtual Acad::ErrorStatus  | removeField (AcDbObjectId)
Removes the Field specified by acFieldId from this object. More...
virtual Acad::ErrorStatus  | removeField (const ACHAR *)
Removes the Field specified by szKeyString from this object. More...
virtual Acad::ErrorStatus  | removeField (const ACHAR *, AcDbObjectId &)
Removes the Field specified by acPszKeyString from this object, and returns its ObjectId value. More...
virtual Acad::ErrorStatus  | removePersistentReactor (AcDbObjectId)
Removes a persistent reactor from this object reactor list. More...
Acad::ErrorStatus  | removeReactor (AcDbObjectReactor *) const
Removes a transient reactor to this object. More...
void  | setAcDbObjectIdsInFlux ()
Call this function to indicate that the object IDs of this object and its sub-objects (if any) are not yet valid. More...
Acad::ErrorStatus  | setBinaryData (const ACHAR *, Adesk::Int32, const char *)
Creates a copy of the binary data, divides it in up to 127 bytes binary chunks and
 sets them as resbufs in the resbuf chain of this object's extension dictionary xrecord entry given by entryName. More...
virtual Acad::ErrorStatus  | setField (const ACHAR *, AcDbField *, AcDbObjectId &)
Adds the pAcField field object to field dictionary of this AcDbObject object, using pKey as key. More...
void  | setHasSaveVersionOverride (bool)
This function can be called to specify that the object has a "save version override". More...
virtual Acad::ErrorStatus  | setOwnerId (AcDbObjectId)
Sets the ownerId data member of the object to be objId. More...
virtual Acad::ErrorStatus  | setXData (const resbuf *)
Sets/removes xData associated with this object. More...
virtual Acad::ErrorStatus  | subCancel ()
Possibility to veto a cancel operation from within custom entities. More...
virtual Acad::ErrorStatus  | subClose ()
virtual Acad::ErrorStatus  | subErase (Adesk::Boolean)
This hook is called during an AcDbObject::erase call, before any actual erase operation is performed. More...
 virtual Acad::ErrorStatus  | subHandOverTo (AcDbObject *)
virtual void  | subObjModified (const AcDbObject *, const AcDbObject *)
A handler function for persistent reactors. More...
 virtual Acad::ErrorStatus  | subOpen (AcDb::OpenMode)
virtual Acad::ErrorStatus  | subSwapIdWith (AcDbObjectId, Adesk::Boolean=Adesk::kFalse, Adesk::Boolean=Adesk::kFalse)
This hook is called during an AcDbObject::swapIdWith() call, before any actual swap operation is performed. More...
Acad::ErrorStatus  | swapIdWith (AcDbObjectId, Adesk::Boolean=Adesk::kFalse, Adesk::Boolean=Adesk::kFalse)
Swaps the object id's between the object identified by param swapId and this object. More...
virtual Acad::ErrorStatus  | swapReferences (const AcDbIdMapping &)
Not implemented yet. More...
virtual void  | unappended (const AcDbObject *)
A handler function for persistent reactors. More...
AcDbDwgFiler *  | undoFiler ()
Gets the undo filer for this object. More...
Acad::ErrorStatus  | upgradeFromNotify (Adesk::Boolean &)
Upgrades the open status of this object to AcDb::kForWrite, if this object is already open (either in AcDb::kForRead, AcDb::kForNotify or AcDb::kForWrite) More...
Acad::ErrorStatus  | upgradeOpen ()
Changes the objects open mode to AcDb::kForWrite and sends notifications. More...
virtual Acad::ErrorStatus  | wblockClone (AcRxObject *, AcDbObject *&, AcDbIdMapping &, Adesk::Boolean=Adesk::kTrue) const final
Clones this object, appends it to the owner pOwner and adds an AcDbIdPair record to the idMap. More...
virtual resbuf *  | xData (const ACHAR *=NULL) const
Returns the xData associated with this object. More...
Acad::ErrorStatus  | xDataTransformBy (const AcGeMatrix3d &)
Transforms the extended data according to parameter transformation matrix. More...
 virtual void  | xmitPropagateModify () const
Not implemented yet.
 virtual  | ~AcDbObject ()
Destructor.
 Public Member Functions inherited from AcGiDrawable
virtual bool  | bounds (AcDbExtents &) const
virtual DrawableType  | drawableType () const
 virtual AcGiDrawStream *  | drawStream () const
 AcGsNode *  | gsNode () const
virtual AcDbObjectId  | id () const =0
virtual Adesk::Boolean  | isPersistent () const =0
virtual Adesk::UInt32  | regenSupportFlags () const final
Returns whether and to which level this object supports MultiThreading. More...
 virtual Adesk::Boolean  | RolloverHit (Adesk::ULongPtr, Adesk::ULongPtr, Adesk::Boolean)
 virtual Adesk::UInt32  | setAttributes (AcGiDrawableTraits *) final
 virtual void  | setDrawStream (AcGiDrawStream *)
 void  | setGsNode (AcGsNode *)
 virtual void  | viewportDraw (AcGiViewportDraw *) final
 virtual Adesk::UInt32  | viewportDrawLogicalFlags (AcGiViewportDraw *) final
 virtual Adesk::Boolean  | worldDraw (AcGiWorldDraw *) final
 Public Member Functions inherited from AcRxObject
virtual AcRxObject *  | clone () const
Exported and implemented. More...
 virtual AcRx::Ordering  | comparedTo (const AcRxObject *) const
Exported and implemented.
virtual Acad::ErrorStatus  | copyFrom (const AcRxObject *)
Exported and implemented. More...
 virtual AcRxClass *  | isA () const
Exported and implemented.
virtual Adesk::Boolean  | isEqualTo (const AcRxObject *) const
Exported and implemented. More...
bool  | isKindOf (const AcRxClass *) const
Checks the object class. More...
AcRxObject *  | queryX (const AcRxClass *) const
returns the protocol extension object assigned to this class or a parent class. More...
AcRxObject *  | x (const AcRxClass *) const
returns the protocol extension object assigned to this class or a parent class. More...
 virtual  | ~AcRxObject ()
Destructor.
 Public Attributes
AcDbDimAssoc
Default constructor.
 Protected Member Functions
 Acad::ErrorStatus  | calculate2LineAngDimArcLocation (const AcGePoint3d *, const AcGePoint3d &, const AcGePoint3d &, const AcGePoint3d *, const AcGeVector3d &, AcGePoint3d &, AcGePoint3d &)
 Acad::ErrorStatus  | calculate3PointAngDimArcLocation (const AcGePoint3d *, const AcGePoint3d &, const AcGePoint3d &, const AcGePoint3d *, const AcGeVector3d &, AcGePoint3d &, AcGePoint3d &)
 bool  | isPointBetweenRays (const AcGePoint3d &, const AcGePoint3d &, const AcGePoint3d &, const AcGePoint3d &, const AcGeVector3d &)
 Acad::ErrorStatus  | removeDimExtDict ()
 Acad::ErrorStatus  | setPointRefReactor (int, bool=true)
 Acad::ErrorStatus  | updateDimension (AcDb2LineAngularDimension *, AcGePoint3d *, bool=true)
 Acad::ErrorStatus  | updateDimension (AcDb3PointAngularDimension *, AcGePoint3d *, bool=true)
 Acad::ErrorStatus  | updateDimension (AcDbAlignedDimension *, AcGePoint3d *, bool=true)
 Acad::ErrorStatus  | updateDimension (AcDbArcDimension *, AcGePoint3d *, bool=true)
 Acad::ErrorStatus  | updateDimension (AcDbDiametricDimension *, AcGePoint3d *, bool=true)
 Acad::ErrorStatus  | updateDimension (AcDbLeader *, AcGePoint3d *, bool=true)
 Acad::ErrorStatus  | updateDimension (AcDbMLeader *, AcGePoint3d *, bool=true)
 Acad::ErrorStatus  | updateDimension (AcDbOrdinateDimension *, AcGePoint3d *, bool=true)
 Acad::ErrorStatus  | updateDimension (AcDbRadialDimension *, AcGePoint3d *, bool=true)
 Acad::ErrorStatus  | updateDimension (AcDbRadialDimensionLarge *, AcGePoint3d *, bool=true)
 Acad::ErrorStatus  | updateDimension (AcDbRotatedDimension *, AcGePoint3d *, bool=true)
 Acad::ErrorStatus  | updateDimLineAndTextLocation (AcDb2LineAngularDimension *, const AcGePoint3d *, const AcGePoint3d *)
 Acad::ErrorStatus  | updateDimLineAndTextLocation (AcDb3PointAngularDimension *, const AcGePoint3d *, const AcGePoint3d *)
 Acad::ErrorStatus  | updateDimLineAndTextLocation (AcDbAlignedDimension *, const AcGePoint3d *, const AcGePoint3d *)
 Acad::ErrorStatus  | updateDimLineAndTextLocation (AcDbArcDimension *, const AcGePoint3d *, const AcGePoint3d *)
 Acad::ErrorStatus  | updateDimLineAndTextLocation (AcDbRotatedDimension *, const AcGePoint3d *, const AcGePoint3d *)
 Protected Member Functions inherited from AcDbObject
virtual Acad::ErrorStatus  | subDeepClone (AcDbObject *, AcDbObject *&, AcDbIdMapping &, Adesk::Boolean=true) const
virtual Acad::ErrorStatus  | subGetClassID (CLSID *) const
virtual Adesk::UInt32  | subSetAttributes (AcGiDrawableTraits *)
Sets the values of this object's subentity traits and returns with the calling object's subentity traits. More...
virtual void  | subViewportDraw (AcGiViewportDraw *)
virtual Adesk::UInt32  | subViewportDrawLogicalFlags (AcGiViewportDraw *)
virtual Acad::ErrorStatus  | subWblockClone (AcRxObject *, AcDbObject *&, AcDbIdMapping &, Adesk::Boolean=true) const
virtual Adesk::Boolean  | subWorldDraw (AcGiWorldDraw *)
 Protected Member Functions inherited from AcGiDrawable
virtual Adesk::UInt32  | subRegenSupportFlags () const
Returns whether and to which level this object supports MultiThreading. More...
virtual Adesk::UInt32  | subSetAttributes (AcGiDrawableTraits *)=0
virtual void  | subViewportDraw (AcGiViewportDraw *)=0
 virtual Adesk::UInt32  | subViewportDrawLogicalFlags (AcGiViewportDraw *)
virtual Adesk::Boolean  | subWorldDraw (AcGiWorldDraw *)=0
 Protected Member Functions inherited from AcRxObject
AcRxObject ()
Exported and implemented.
 Additional Inherited Members
 Static Public Member Functions inherited from AcRxObject
 static AcRxObject *  | cast (const AcRxObject *)
 static AcRxClass *  | desc ()
Exported and implemented.
 Static Public Member Functions inherited from AcHeapOperators
 static void  | operator delete (void *)
_
 static void  | operator delete (void *, const char *, int)
 static void  | operator delete (void *, void *)
 static void  | operator delete[] (void *)
_
 static void  | operator delete[] (void *, const char *, int)
 static void *  | operator new (size_t)
_
 static void *  | operator new (size_t, const char *, int)
 static void *  | operator new (size_t, void *p)
 static void *  | operator new[] (size_t)
_
 static void *  | operator new[] (size_t, const char *, int)
Detailed Description
_
Member Function Documentation
◆ addToDimensionReactor()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbDimAssoc::addToDimensionReactor  |  ( |  bool  |  doAdd = true | )
Establishes or removes the reactor association between the dimension entity and this AcDbDimAssoc object.
Parameters
[in] | doAdd | - true to add the reactor, false to remove
Returns
Acad::eOk if successful, appropriate error status otherwise
◆ addToPointRefReactor()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbDimAssoc::addToPointRefReactor  |  ( |   | )
Establishes the reactor association between the referenced geometry and the dimension entity.
Returns
Acad::eOk if successful, appropriate error status otherwise
◆ assocFlag() [1/2]
 UX_EXPORT_FUNCTION int AcDbDimAssoc::assocFlag  |  ( |   | )
Returns the active point reference type(s).
Returns
int - the active point reference type(s), bit combination of AssocFlags values
◆ assocFlag() [2/2]
 UX_EXPORT_FUNCTION bool AcDbDimAssoc::assocFlag  |  ( |  int  |  pointType | ) |   const
Returns whether the specified point reference type is enabled or disabled.
Parameters
[in] | pointType | - specifies the point reference type (one of AcDbDimAssoc::PointType)
Returns
true if the specified point reference type is enabled, false otherwise
◆ dimObjId()
 UX_EXPORT_FUNCTION AcDbObjectId AcDbDimAssoc::dimObjId  |  ( |   | ) |   const
With this function we could know the ID of object AcDbDimension.
Returns
◆ dwgInFields()
 Acad::ErrorStatus AcDbDimAssoc::dwgInFields  |  ( |  AcDbDwgFiler *  |   | )
virtual
Reimplemented from AcDbObject.
◆ dwgOutFields()
 Acad::ErrorStatus AcDbDimAssoc::dwgOutFields  |  ( |  AcDbDwgFiler *  |   | ) |   const
virtual
Reimplemented from AcDbObject.
◆ dxfInFields()
 Acad::ErrorStatus AcDbDimAssoc::dxfInFields  |  ( |  AcDbDxfFiler *  |   | )
virtual
Reimplemented from AcDbObject.
◆ dxfOutFields()
 Acad::ErrorStatus AcDbDimAssoc::dxfOutFields  |  ( |  AcDbDxfFiler *  |   | ) |   const
virtual
Reimplemented from AcDbObject.
◆ getDimAssocGeomIds()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbDimAssoc::getDimAssocGeomIds  |  ( |  AcDbObjectIdArray &  |  assocGeomIds | ) |   const
Returns the array of all geometric entities as referenced by all point reference type(s) from this AcDbDimAssoc object.
Parameters
[out] | assocGeomIds | - array of AcDbObjectId of all referenced geometric entities used
Returns
Acad::eOk if successful, appropriate error status otherwise
◆ isAllGeomErased()
 UX_EXPORT_FUNCTION bool AcDbDimAssoc::isAllGeomErased  |  ( |   | ) |   const
Returns whether all referenced geometric entities are erased or not.
Returns
true if all geometric entities are erased, false otherwise
◆ isTransSpatial()
 UX_EXPORT_FUNCTION bool AcDbDimAssoc::isTransSpatial  |  ( |   | ) |   const
Returns the current value of a flag noting whether the dimension is associated to geometry in a different space.
Returns
true if the dimension in paper space is associated to geometry in model space; false if the dimension is associated to geometry in the same space.
Date
2019-10-25 alexandrum created and implemented
◆ modifiedGraphics()
 void AcDbDimAssoc::modifiedGraphics  |  ( |  const AcDbEntity *  |  pObj | )
virtual
Reimplemented from AcDbObject.
◆ pointRef()
 UX_EXPORT_FUNCTION const AcDbPointRef * AcDbDimAssoc::pointRef  |  ( |  int  |  pointType | ) |   const
this function will be return the reference point coresponding point reference index
Parameters
[in] | pointType | This value could be a value from PointType enum
Returns
reference point
◆ post()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbDimAssoc::post  |  ( |  AcDbObjectId  |  dimensionId,
|  AcDbObjectId &  |  dimAssocId,
|  bool  |  activate = true
)
Posts this AcDbDimAssoc object to the database and associates it with the specified dimension.
Parameters
[in] | dimensionId | - the dimension entity used by this AcDbDimAssoc
[out] | dimAssocId | - returns the AcDbObjectId of this AcDbDimAssoc object
[in] | activate | - true to active the monitoring, false otherwise (NOTE : ignored, monitoring is always active in BricsCAD)
Returns
Acad::eOk if successful, appropriate error status otherwise
◆ removeAssociativity()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbDimAssoc::removeAssociativity  |  ( |  bool  |  force = true | )
Specifies whether the associativity is removed or not.
Parameters
[in] | force | : true to remove associativity
Returns
Acad::eOk if successful, appropriate error status otherwise
◆ removePointRef()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbDimAssoc::removePointRef  |  ( |  int  |  pointType | )
Removes the specified point reference type(s) from this AcDbDimAssoc object.
Parameters
[in] | pointType | - specifies the point reference type (one of AcDbDimAssoc::PointType)
Returns
Acad::eOk if successful, appropriate error status otherwise
◆ setAssocFlag() [1/2]
 UX_EXPORT_FUNCTION void AcDbDimAssoc::setAssocFlag  |  ( |  int  |  indexFlag | )
Specifies the point reference type(s) being active.
Parameters
[in] | indexFlag | - specifies the point reference type(s), bit combination of AssocFlags values
◆ setAssocFlag() [2/2]
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbDimAssoc::setAssocFlag  |  ( |  int  |  pointType,
|  bool  |  enable
)
Enabes or disables the specified point reference type.
Parameters
[in] | pointType | - specifies the point reference type (one of AcDbDimAssoc::PointType)
[in] | enable | - true to set associativity, false to remove it
Returns
Acad::eOk if successful, appropriate error status otherwise
◆ setDimObjId()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbDimAssoc::setDimObjId  |  ( |  const AcDbObjectId &  |  idDimAssociativ | )
This function set the associated dimension entity.
Parameters
[in] | idDimAssociativ | Id
Returns
Acad::eOk if successful, appropriate error status otherwise
◆ setPointRef()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbDimAssoc::setPointRef  |  ( |  int  |  pointType,
|  AcDbPointRef *  |  pointRef
)
This function set the reference point corresponding point reference object.
Parameters
[in] | pointType | This value could be a value from PointType enum
[in] | pointRef | reference point object
Returns
Acad::eOk if successful or eInvalidInput for a incorect pointType
◆ setTransSpatial()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbDimAssoc::setTransSpatial  |  ( |  bool  |  value | )
This function sets a flag noting whether the dimension is associated to geometry in a different space.
Parameters
[in] | value | : true if the dimension is associated to geometry in a different space, false if the dimension is in the same space
Returns
Acad::eOk if successful, appropriate error status otherwise
◆ startCmdWatcher()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbDimAssoc::startCmdWatcher  |  ( |   | )
Starts monitoring the changes to referenced geometric entities.
NOTE : monitoring is automatically enabled in BricsCAD/Teigha !
Returns
Acad::eOk if monitoring has started, error status otherwise
◆ swapReferences()
 Acad::ErrorStatus AcDbDimAssoc::swapReferences  |  ( |  const AcDbIdMapping &  |  idMap | )
virtual
Reimplemented from AcDbObject.
◆ updateDimension()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbDimAssoc::updateDimension  |  ( |  bool  |  update = true,
|  bool  |  skipReactors = false
)
This function updates the dimension or leader when its associated geometry has changed.
Parameters
[in] | update | : input true to add the reactor, false to remove it
[in] | skipReactors | : input true to skip the reactor, false to check it
Returns
Acad::eOk if successful, appropriate error status otherwise