Public Types | Public Member Functions | List of all members
AcDbDetailViewStyle Class Reference
 Public Types
enum  | IdentifierPlacement { kOutsideBoundary = 0 , kOutsideBoundaryWithLeader , kOnBoundary , kOnBoundaryWithLeader }
enum  | ModelEdge { kSmooth = 0 , kSmoothWithBorder , kSmoothWithConnectionLine , kJagged }
 Public Types inherited from AcDbModelDocViewStyle
enum  | AttachmentPoint { kAboveView = 0 , kBelowView = 1 }
enum  | TextAlignment { kTextAlignmentLeft = 0 , kTextAlignmentCenter = 1 , kTextAlignmentRight = 2 }
 Public Types inherited from AcGiDrawable
enum  | DrawableType {
 kGeometry = 0 , kDistantLight , kPointLight , kSpotLight ,
 kAmbientLight , kSolidBackground , kGradientBackground , kImageBackground ,
 kGroundPlaneBackground , kViewport
 }
enum  | SetAttributesFlags {
 kDrawableNone = 0 , kDrawableIsAnEntity = 1 , kDrawableUsesNesting = 2 , kDrawableIsCompoundObject = 4 ,
 kDrawableViewIndependentViewportDraw = 8 , kDrawableIsInvisible = 16 , kDrawableHasAttributes = 32 , kDrawableRegenTypeDependentGeometry = 64 ,
 kDrawableIsDimension = 133 , kDrawableRegenDraw = 256 , kDrawableStandardDisplaySingleLOD = 512 , kDrawableShadedDisplaySingleLOD = 1024 ,
 kDrawableViewDependentViewportDraw = 2048 , kDrawableBlockDependentViewportDraw = 4096 , kDrawableIsExternalReference = 8192 , kDrawableNotPlottable = 16384 ,
 kDrawableNotAllowLCS = 32768 , kDrawableMergeControlOff = 65536 , kThreadedWorldDrawViewportDraw = 131072
 }
 Public Member Functions
AcCmColor  | arrowSymbolColor () const
Returns the arrow symbol color. More...
AcDbObjectId  | arrowSymbolId () const
Returns the object ID of the block representing the arrow start symbol. More...
double  | arrowSymbolSize () const
Returns the arrow symbol size. More...
AcCmColor  | borderLineColor () const
Returns the color of the view style border. More...
AcDbObjectId  | borderLineTypeId () const
Returns the object ID of the linetype assigned to the view style border. More...
AcDb::LineWeight  | borderLineWeight () const
Returns the lineweight of the view style border. More...
AcCmColor  | boundaryLineColor () const
Returns the view style boundary color. More...
AcDbObjectId  | boundaryLineTypeId () const
Returns the object ID of the linetype assigned to the view style boundary. More...
AcDb::LineWeight  | boundaryLineWeight () const
Returns the lineweight of the view style boundary. More...
AcCmColor  | connectionLineColor () const
Returns the color of the view style connection line. More...
AcDbObjectId  | connectionLineTypeId () const
Returns the object ID of the linetype assigned to the view style connection line. More...
AcDb::LineWeight  | connectionLineWeight () const
Returns the connection line lineweight. More...
Acad::ErrorStatus  | getViewLabelPattern (AcString &, AcDbField *=NULL) const
Returns the view label pattern and, optionally, master field. More...
AcCmColor  | identifierColor () const
Returns the color of the view style identifier. More...
double  | identifierHeight () const
Returns the view style identifier text height. More...
double  | identifierOffset () const
Returns the relative offset between the identifier arrow & extension line An offset of 0 implies the arrow is at the start of the extension line An offset of 1 implies the arrow is at the end of the extension line. More...
AcDbDetailViewStyle::IdentifierPlacement  | identifierPlacement () const
Returns an enum describing the identifier position. More...
AcDbObjectId  | identifierStyleId () const
Returns the object ID of the identifier text style. More...
AcDbDetailViewStyle::ModelEdge  | modelEdge () const
Returns an enum describing the edge style of the model view. More...
Acad::ErrorStatus  | setArrowSymbolColor (const AcCmColor &)
Sets the color of the block representing the arrow symbol. More...
Acad::ErrorStatus  | setArrowSymbolId (const AcDbObjectId &)
Sets the block table record used to represent the arrow start symbol. More...
Acad::ErrorStatus  | setArrowSymbolSize (double)
Sets the arrow symbol size. More...
Acad::ErrorStatus  | setBorderLineColor (const AcCmColor &)
Sets the color of the view style border. More...
Acad::ErrorStatus  | setBorderLineTypeId (const AcDbObjectId &)
Assigns the linetype with the supplied object ID to the view style border. More...
Acad::ErrorStatus  | setBorderLineWeight (AcDb::LineWeight)
Sets the lineweight of the view style border. More...
Acad::ErrorStatus  | setBoundaryLineColor (const AcCmColor &)
Sets the color of the view style boundary. More...
Acad::ErrorStatus  | setBoundaryLineTypeId (const AcDbObjectId &)
Assigns the linetype with the supplied object ID to the view style boundary. More...
Acad::ErrorStatus  | setBoundaryLineWeight (AcDb::LineWeight)
Sets the lineweight of the view style boundary. More...
Acad::ErrorStatus  | setConnectionLineColor (const AcCmColor &)
Sets the color of the view style connection line. More...
Acad::ErrorStatus  | setConnectionLineTypeId (const AcDbObjectId &)
Assigns the linetype with the supplied object ID to the view style connection line. More...
Acad::ErrorStatus  | setConnectionLineWeight (AcDb::LineWeight)
Assigns a new lineweight to the view style connection line. More...
Acad::ErrorStatus  | setIdentifierColor (const AcCmColor &)
Sets the view style identifier color. More...
Acad::ErrorStatus  | setIdentifierHeight (double)
Sets the text height of the view style identifier. More...
Acad::ErrorStatus  | setIdentifierOffset (double)
Sets the relative offset between the identifier arrow & extension line An offset of 0 implies the arrow is at the start of the extension line An offset of 1 implies the arrow is at the end of the extension line. More...
Acad::ErrorStatus  | setIdentifierPlacement (AcDbDetailViewStyle::IdentifierPlacement)
Sets the position of the view style identifier. More...
Acad::ErrorStatus  | setIdentifierStyleId (const AcDbObjectId &)
Assigns the text style with the supplied object ID to the identifier. More...
Acad::ErrorStatus  | setModelEdge (AcDbDetailViewStyle::ModelEdge)
Sets the edge style of the model view. More...
Acad::ErrorStatus  | setShowArrows (bool)
Controls whether arrow symbols are displayed by view style. More...
Acad::ErrorStatus  | setShowViewLabel (bool)
Controls the display of the view label. More...
Acad::ErrorStatus  | setViewLabelAlignment (AcDbModelDocViewStyle::TextAlignment)
Sets the alignment of the view label text. More...
Acad::ErrorStatus  | setViewLabelAttachment (AcDbModelDocViewStyle::AttachmentPoint)
Sets the attachment position of the view label. More...
Acad::ErrorStatus  | setViewLabelOffset (double)
Sets the view label offset. More...
Acad::ErrorStatus  | setViewLabelPattern (const ACHAR *, const AcDbField *=NULL)
Sets the view label pattern and, optionally, child fields. More...
Acad::ErrorStatus  | setViewLabelTextColor (const AcCmColor &)
Sets the view label text color. More...
Acad::ErrorStatus  | setViewLabelTextHeight (double)
Sets the view label text height. More...
Acad::ErrorStatus  | setViewLabelTextStyleId (const AcDbObjectId &)
Assigns the text style with the supplied object ID to the view label. More...
bool  | showArrows () const
Indicates whether arrow symbols are displayed by view style. More...
bool  | showViewLabel () const
Indicates whether the view label is displayed. More...
AcDbModelDocViewStyle::TextAlignment  | viewLabelAlignment () const
Returns the view label alignment. More...
AcDbModelDocViewStyle::AttachmentPoint  | viewLabelAttachment () const
Returns an enum describing the attachment position of the view label. More...
double  | viewLabelOffset () const
Returns the view label offset. More...
const ACHAR *  | viewLabelPattern () const
Returns the view label pattern. More...
AcCmColor  | viewLabelTextColor () const
Returns the view label text color. More...
double  | viewLabelTextHeight () const
Returns the view label text height. More...
AcDbObjectId  | viewLabelTextStyleId () const
Returns the object ID of the text style assigned to the view label. More...
 Public Member Functions inherited from AcDbModelDocViewStyle
 AcString  | defaultViewName (int) const
virtual const ACHAR *  | description (void) const
Returns the description of the Model Doc View Style. More...
virtual void  | getDescription (AcString &) const
Returns the description of the Model Doc View Style. More...
virtual Acad::ErrorStatus  | getName (AcString &) const
Returns the name of the Model Doc View Style. More...
 bool  | isModifiedForRecompute () const
 bool  | isViewNameValid (const ACHAR *) const
Acad::ErrorStatus  | postViewStyleToDb (AcDbDatabase *, const ACHAR *, AcDbObjectId &)
Adds the Model Doc View Style to the supplied database and returns the corresponding Object ID. More...
void  | setDatabaseDefaults (AcDbDatabase *)
Sets the properties of the object to those given by the supplied database parameter. More...
virtual Acad::ErrorStatus  | setDescription (const ACHAR *)
Sets the description of the Model Doc View Style. More...
virtual Acad::ErrorStatus  | setName (const ACHAR *)
Sets the name of the Model Doc View Style. More...
 Public Member Functions inherited from AcDbObject
virtual Acad::ErrorStatus  | addPersistentReactor (AcDbObjectId)
Adds a persistent reactor to this object reactor list. More...
Acad::ErrorStatus  | addReactor (AcDbObjectReactor *) const
Adds a transient reactor to this object. More...
virtual Acad::ErrorStatus  | applyPartialUndo (AcDbDwgFiler *, AcRxClass *)
This function is called during Undo operations on objects, that use the 'Partial Undo meachanism'; this is, this object is opened with assertWriteEnabled(Adesk::kFalse) to indicate that custom Undo filing is used rather than the default Undo filing. More...
 void  | assertNotifyEnabled () const
 void  | assertReadEnabled () const
 void  | assertWriteEnabled (Adesk::Boolean=Adesk::kTrue, Adesk::Boolean=Adesk::kTrue)
virtual Acad::ErrorStatus  | audit (AcDbAuditInfo *)
Performs the audit operation for this object. More...
Acad::ErrorStatus  | cancel ()
Reverts all changes since the object had been opened and closes the object. More...
virtual void  | cancelled (const AcDbObject *)
A handler function for persistent reactors. More...
virtual AcRxObject *  | clone () const
Creates a shallow clone of this object. More...
Acad::ErrorStatus  | close ()
Closes the object. More...
Acad::ErrorStatus  | closeAndPage (Adesk::Boolean=Adesk::kTrue)
Closes the object. More...
virtual Acad::ErrorStatus  | composeForLoad (AcDb::OdaSaveType, AcDb::AcDbDwgVersion)
This function is intended for future MT file loading support. More...
virtual void  | copied (const AcDbObject *, const AcDbObject *)
A handler function for persistent reactors. More...
virtual Acad::ErrorStatus  | copyFrom (const AcRxObject *)
Copies the pSrc object information in this object. More...
Acad::ErrorStatus  | createExtensionDictionary ()
Creates a dictionary as extension dictionary for this object. More...
AcDbDatabase *  | database () const
Returns the database that contains this object. More...
virtual Acad::ErrorStatus  | decomposeForSave (AcDb::AcDbDwgVersion, AcDbObject *&, AcDbObjectId &, Adesk::Boolean &)
This function is called during dwg and dxf output, to allow a custom object to decompose itself, due to provided dwg/dxf target file version. More...
virtual Acad::ErrorStatus  | deepClone (AcDbObject *, AcDbObject *&, AcDbIdMapping &, Adesk::Boolean=Adesk::kTrue) const final
Clones this object, appends it to the owner pOwner and adds an AcDbIdPair record to the idMap. More...
void  | disableUndoRecording (Adesk::Boolean)
Disables or enables the undo recording for the object. More...
Acad::ErrorStatus  | downgradeOpen ()
Sets the open mode for an object opened for write to be opened for read. More...
Acad::ErrorStatus  | downgradeToNotify (Adesk::Boolean)
Sets the open mode for an object opened for write to be opened for notify. More...
virtual AcGiDrawable *  | drawable ()
Retrieves the AcGiDrawable instance of this object. More...
Acad::ErrorStatus  | dwgIn (AcDbDwgFiler *)
Calls the object's dwgInFields function, and reads any XData if present. More...
virtual Acad::ErrorStatus  | dwgInFields (AcDbDwgFiler *)
Reads the object from the DWG filer. More...
Acad::ErrorStatus  | dwgOut (AcDbDwgFiler *) const
Calls the object's dwgOutFields function, and writes any XData if present. More...
virtual Acad::ErrorStatus  | dwgOutFields (AcDbDwgFiler *) const
Writes the object to the DWG filer. More...
Acad::ErrorStatus  | dxfIn (AcDbDxfFiler *)
Calls the object's dxfInFields function, and reads any XData if present. More...
virtual Acad::ErrorStatus  | dxfInFields (AcDbDxfFiler *)
Reads the object from the DXF filer. More...
Acad::ErrorStatus  | dxfOut (AcDbDxfFiler *, Adesk::Boolean, Adesk::uchar *) const
Calls the object's dxfOutFields function, and writes any XData if present. More...
virtual Acad::ErrorStatus  | dxfOutFields (AcDbDxfFiler *) const
Writes the object to the DXF filer. More...
Acad::ErrorStatus  | erase (Adesk::Boolean=Adesk::kTrue)
Sets the bit that indicates that the object is erased. More...
virtual void  | erased (const AcDbObject *, Adesk::Boolean)
A handler function for persistent reactors. More...
AcDbObjectId  | extensionDictionary () const
Returns the object id of the extension dictionary for this object. More...
void  | getAcDbHandle (AcDbHandle &) const
Returns handle of this object. More...
Acad::ErrorStatus  | getBinaryData (const ACHAR *, Adesk::Int32 &, char *&) const
Creates a copy of the binary data stored as chunks of maximum 127 bytes in the resbuf chain of this object's extension dictionary xrecord entry given by entryName. More...
int  | getBrxOpenCount () const
This function returns the number of open BRX instances for this object. More...
int  | getBrxOpenState () const
This function returns the BRX object open state flags as bitfields, for diagnostic purpose. More...
virtual Acad::ErrorStatus  | getClassID (CLSID *) const final
Gets the COM wrapper Class ID for this entity. More...
int  | getCustomObjectState () const
This function returns the custom object status : 1=isCustomObject 2=DifferentialUndoDisabled. More...
Acad::ErrorStatus  | getField (const ACHAR *, AcDbField *&, AcDb::OpenMode) const
Retrieves the specified Field from this object, and opens it in mode. More...
Acad::ErrorStatus  | getField (const ACHAR *, AcDbObjectId &) const
Gets the pszPropName field object from field dictionary of this AcDbObject object, using pszPropName as key. More...
AcDbObjectId  | getFieldDictionary () const
Returns the Field dictionary associated with this object,. More...
Acad::ErrorStatus  | getFieldDictionary (AcDbDictionary *&, AcDb::OpenMode) const
Gets and opens the field dictionary for this. More...
Acad::ErrorStatus  | getObjectBirthVersion (AcDb::AcDbDwgVersion &, AcDb::MaintenanceReleaseVersion &)
This function is currently not supported by the CAD engine, always returns Acad::eOk, and 'kDHL_CURRENT' + 'kMReleaseCurrent' results. More...
virtual Acad::ErrorStatus  | getObjectSaveVersion (const AcDbDwgFiler *, AcDb::AcDbDwgVersion &, AcDb::MaintenanceReleaseVersion &)
Returns the DWG version for saving the object. More...
virtual Acad::ErrorStatus  | getObjectSaveVersion (const AcDbDxfFiler *, AcDb::AcDbDwgVersion &, AcDb::MaintenanceReleaseVersion &)
Returns the DWG version for saving the object. More...
int  | getOdaOpenCount () const
This function returns the number of open ODA instances for this object. More...
int  | getOdaOpenState () const
This function returns the ODA object open state flags as bitfields, for diagnostic purpose. More...
virtual void  | goodbye (const AcDbObject *)
A handler function for persistent reactors. More...
Acad::ErrorStatus  | handOverTo (AcDbObject *, Adesk::Boolean=Adesk::kTrue, Adesk::Boolean=Adesk::kTrue)
Hands over objects identity to another object. More...
bool  | hasFields () const
Return true if this object has single or multiple fields associated with him. More...
bool  | hasPersistentReactor (AcDbObjectId) const
Checks the input objectId in this object reactor list. More...
bool  | hasSaveVersionOverride ()
This function indicates whether this object overrides the filer's save version. More...
virtual AcDbObjectId  | id () const
Returns the database id of this object. More...
Adesk::Boolean  | isAcDbObjectIdsInFlux () const
Checks whether a deep clone operation was completed. More...
Adesk::Boolean  | isAProxy () const
Adesk::Boolean  | isCancelling () const
Adesk::Boolean  | isErased () const
Returns whether this object is erased. More...
Adesk::Boolean  | isEraseStatusToggled () const
Checks whether the object erase status has been toggled. More...
Adesk::Boolean  | isModified () const
Returns whether this object's assertWriteEnabled() has been called since it was opened. More...
Adesk::Boolean  | isModifiedGraphics () const
Checks whether this object graphics will be updated when the object is closed. More...
Adesk::Boolean  | isModifiedXData () const
Checks whether this object's xData was modified. More...
Adesk::Boolean  | isNewObject () const
Returns true if and only if this object has not been closed since it was created. More...
Adesk::Boolean  | isNotifyEnabled () const
Returns whether this object is opened for notify. More...
Adesk::Boolean  | isNotifying () const
virtual Adesk::Boolean  | isPersistent () const
Returns the 'persistent' status of a database object. More...
Adesk::Boolean  | isReadEnabled () const
Returns whether this object is opened for read. More...
 Adesk::Boolean  | isReallyClosing () const
Checks whether the next close call will completely close this object return true if on the next call the object will be completely closed false otherwise.
Adesk::Boolean  | isTransactionResident () const
Gets the object transaction status. More...
Adesk::Boolean  | isUndoing () const
bool  | isUndoRecordingDisabled () const
Returns whether the undo recording for the object is enabled or not. More...
Adesk::Boolean  | isWriteEnabled () const
Returns whether this object is opened for write. More...
virtual AcDb::DuplicateRecordCloning  | mergeStyle () const
Returns the object's merge behavior during cloning. More...
virtual void  | modified (const AcDbObject *)
A handler function for persistent reactors. More...
virtual void  | modifiedGraphics (const AcDbEntity *)
A handler function for persistent reactors. More...
virtual void  | modifiedXData (const AcDbObject *)
A handler function for persistent reactors. More...
virtual void  | modifyUndone (const AcDbObject *)
A handler function for persistent reactors. More...
virtual void  | objectClosed (const AcDbObjectId)
A handler function for persistent reactors. More...
AcDbObjectId  | objectId () const
Returns object id. More...
virtual void  | openedForModify (const AcDbObject *)
A handler function for persistent reactors. More...
AcDbObjectId  | ownerId () const
Returns object id of the owner. More...
AcDbVoidPtrArray *  | reactors ()
Gets the object pointers to reactors. More...
const AcDbVoidPtrArray *  | reactors () const
Gets the object pointers to reactors. More...
virtual void  | reappended (const AcDbObject *)
A handler function for persistent reactors. More...
 virtual void  | recvPropagateModify (const AcDbObject *)
Not implemented yet.
Acad::ErrorStatus  | releaseExtensionDictionary ()
Removes the extension dictionary associated with this object. More...
virtual Acad::ErrorStatus  | removeField (AcDbObjectId)
Removes the Field specified by acFieldId from this object. More...
virtual Acad::ErrorStatus  | removeField (const ACHAR *)
Removes the Field specified by szKeyString from this object. More...
virtual Acad::ErrorStatus  | removeField (const ACHAR *, AcDbObjectId &)
Removes the Field specified by acPszKeyString from this object, and returns its ObjectId value. More...
virtual Acad::ErrorStatus  | removePersistentReactor (AcDbObjectId)
Removes a persistent reactor from this object reactor list. More...
Acad::ErrorStatus  | removeReactor (AcDbObjectReactor *) const
Removes a transient reactor to this object. More...
void  | setAcDbObjectIdsInFlux ()
Call this function to indicate that the object IDs of this object and its sub-objects (if any) are not yet valid. More...
Acad::ErrorStatus  | setBinaryData (const ACHAR *, Adesk::Int32, const char *)
Creates a copy of the binary data, divides it in up to 127 bytes binary chunks and
 sets them as resbufs in the resbuf chain of this object's extension dictionary xrecord entry given by entryName. More...
virtual Acad::ErrorStatus  | setField (const ACHAR *, AcDbField *, AcDbObjectId &)
Adds the pAcField field object to field dictionary of this AcDbObject object, using pKey as key. More...
void  | setHasSaveVersionOverride (bool)
This function can be called to specify that the object has a "save version override". More...
virtual Acad::ErrorStatus  | setOwnerId (AcDbObjectId)
Sets the ownerId data member of the object to be objId. More...
virtual Acad::ErrorStatus  | setXData (const resbuf *)
Sets/removes xData associated with this object. More...
virtual Acad::ErrorStatus  | subCancel ()
Possibility to veto a cancel operation from within custom entities. More...
virtual Acad::ErrorStatus  | subClose ()
virtual Acad::ErrorStatus  | subErase (Adesk::Boolean)
This hook is called during an AcDbObject::erase call, before any actual erase operation is performed. More...
 virtual Acad::ErrorStatus  | subHandOverTo (AcDbObject *)
virtual void  | subObjModified (const AcDbObject *, const AcDbObject *)
A handler function for persistent reactors. More...
 virtual Acad::ErrorStatus  | subOpen (AcDb::OpenMode)
virtual Acad::ErrorStatus  | subSwapIdWith (AcDbObjectId, Adesk::Boolean=Adesk::kFalse, Adesk::Boolean=Adesk::kFalse)
This hook is called during an AcDbObject::swapIdWith() call, before any actual swap operation is performed. More...
Acad::ErrorStatus  | swapIdWith (AcDbObjectId, Adesk::Boolean=Adesk::kFalse, Adesk::Boolean=Adesk::kFalse)
Swaps the object id's between the object identified by param swapId and this object. More...
virtual Acad::ErrorStatus  | swapReferences (const AcDbIdMapping &)
Not implemented yet. More...
virtual void  | unappended (const AcDbObject *)
A handler function for persistent reactors. More...
AcDbDwgFiler *  | undoFiler ()
Gets the undo filer for this object. More...
Acad::ErrorStatus  | upgradeFromNotify (Adesk::Boolean &)
Upgrades the open status of this object to AcDb::kForWrite, if this object is already open (either in AcDb::kForRead, AcDb::kForNotify or AcDb::kForWrite) More...
Acad::ErrorStatus  | upgradeOpen ()
Changes the objects open mode to AcDb::kForWrite and sends notifications. More...
virtual Acad::ErrorStatus  | wblockClone (AcRxObject *, AcDbObject *&, AcDbIdMapping &, Adesk::Boolean=Adesk::kTrue) const final
Clones this object, appends it to the owner pOwner and adds an AcDbIdPair record to the idMap. More...
virtual resbuf *  | xData (const ACHAR *=NULL) const
Returns the xData associated with this object. More...
Acad::ErrorStatus  | xDataTransformBy (const AcGeMatrix3d &)
Transforms the extended data according to parameter transformation matrix. More...
 virtual void  | xmitPropagateModify () const
Not implemented yet.
 virtual  | ~AcDbObject ()
Destructor.
 Public Member Functions inherited from AcGiDrawable
virtual bool  | bounds (AcDbExtents &) const
virtual DrawableType  | drawableType () const
 virtual AcGiDrawStream *  | drawStream () const
 AcGsNode *  | gsNode () const
virtual AcDbObjectId  | id () const =0
virtual Adesk::Boolean  | isPersistent () const =0
virtual Adesk::UInt32  | regenSupportFlags () const final
Returns whether and to which level this object supports MultiThreading. More...
 virtual Adesk::Boolean  | RolloverHit (Adesk::ULongPtr, Adesk::ULongPtr, Adesk::Boolean)
 virtual Adesk::UInt32  | setAttributes (AcGiDrawableTraits *) final
 virtual void  | setDrawStream (AcGiDrawStream *)
 void  | setGsNode (AcGsNode *)
 virtual void  | viewportDraw (AcGiViewportDraw *) final
 virtual Adesk::UInt32  | viewportDrawLogicalFlags (AcGiViewportDraw *) final
 virtual Adesk::Boolean  | worldDraw (AcGiWorldDraw *) final
 Public Member Functions inherited from AcRxObject
virtual AcRxObject *  | clone () const
Exported and implemented. More...
 virtual AcRx::Ordering  | comparedTo (const AcRxObject *) const
Exported and implemented.
virtual Acad::ErrorStatus  | copyFrom (const AcRxObject *)
Exported and implemented. More...
 virtual AcRxClass *  | isA () const
Exported and implemented.
virtual Adesk::Boolean  | isEqualTo (const AcRxObject *) const
Exported and implemented. More...
bool  | isKindOf (const AcRxClass *) const
Checks the object class. More...
AcRxObject *  | queryX (const AcRxClass *) const
returns the protocol extension object assigned to this class or a parent class. More...
AcRxObject *  | x (const AcRxClass *) const
returns the protocol extension object assigned to this class or a parent class. More...
 virtual  | ~AcRxObject ()
Destructor.
 Additional Inherited Members
 Static Public Member Functions inherited from AcDbModelDocViewStyle
 static AcGePoint3d  | calculateViewLabelPosition (AcGeVector2d &, AcDbMText::AttachmentPoint &, AcDbModelDocViewStyle::AttachmentPoint, double, const AcGePoint3d &, const AcGePoint3d &)
 static AcGeVector2d  | setViewLabelPosition (AcDbMText *, AcDbModelDocViewStyle::AttachmentPoint, double, const AcGePoint3d &, const AcGePoint3d &)
 static AcGeVector2d  | updateViewLabelPosition (AcDbMText *, AcDbModelDocViewStyle::AttachmentPoint &, const AcGePoint3d &, const AcGePoint3d &)
 Static Public Member Functions inherited from AcRxObject
 static AcRxObject *  | cast (const AcRxObject *)
 static AcRxClass *  | desc ()
Exported and implemented.
 Static Public Member Functions inherited from AcHeapOperators
 static void  | operator delete (void *)
_
 static void  | operator delete (void *, const char *, int)
 static void  | operator delete (void *, void *)
 static void  | operator delete[] (void *)
_
 static void  | operator delete[] (void *, const char *, int)
 static void *  | operator new (size_t)
_
 static void *  | operator new (size_t, const char *, int)
 static void *  | operator new (size_t, void *p)
 static void *  | operator new[] (size_t)
_
 static void *  | operator new[] (size_t, const char *, int)
 Protected Member Functions inherited from AcDbObject
virtual Acad::ErrorStatus  | subDeepClone (AcDbObject *, AcDbObject *&, AcDbIdMapping &, Adesk::Boolean=true) const
virtual Acad::ErrorStatus  | subGetClassID (CLSID *) const
virtual Adesk::UInt32  | subSetAttributes (AcGiDrawableTraits *)
Sets the values of this object's subentity traits and returns with the calling object's subentity traits. More...
virtual void  | subViewportDraw (AcGiViewportDraw *)
virtual Adesk::UInt32  | subViewportDrawLogicalFlags (AcGiViewportDraw *)
virtual Acad::ErrorStatus  | subWblockClone (AcRxObject *, AcDbObject *&, AcDbIdMapping &, Adesk::Boolean=true) const
virtual Adesk::Boolean  | subWorldDraw (AcGiWorldDraw *)
 Protected Member Functions inherited from AcGiDrawable
virtual Adesk::UInt32  | subRegenSupportFlags () const
Returns whether and to which level this object supports MultiThreading. More...
virtual Adesk::UInt32  | subSetAttributes (AcGiDrawableTraits *)=0
virtual void  | subViewportDraw (AcGiViewportDraw *)=0
 virtual Adesk::UInt32  | subViewportDrawLogicalFlags (AcGiViewportDraw *)
virtual Adesk::Boolean  | subWorldDraw (AcGiWorldDraw *)=0
 Protected Member Functions inherited from AcRxObject
AcRxObject ()
Exported and implemented.
Member Function Documentation
◆ arrowSymbolColor()
 UX_EXPORT_FUNCTION AcCmColor AcDbDetailViewStyle::arrowSymbolColor  |  ( |   | ) |   const
Returns the arrow symbol color.
Returns
AcCmColor object representing the arrow symbol color
Date
2023-12-14 leem implemented
◆ arrowSymbolId()
 UX_EXPORT_FUNCTION AcDbObjectId AcDbDetailViewStyle::arrowSymbolId  |  ( |   | ) |   const
Returns the object ID of the block representing the arrow start symbol.
Returns
Object ID of the block representing the arrow start symbol
Date
2023-12-14 leem implemented
◆ arrowSymbolSize()
 UX_EXPORT_FUNCTION double AcDbDetailViewStyle::arrowSymbolSize  |  ( |   | ) |   const
Returns the arrow symbol size.
Returns
Arrow symbol size
Date
2023-12-14 leem implemented
◆ borderLineColor()
 UX_EXPORT_FUNCTION AcCmColor AcDbDetailViewStyle::borderLineColor  |  ( |   | ) |   const
Returns the color of the view style border.
Returns
Color of the view style border
Date
2023-12-14 leem implemented
◆ borderLineTypeId()
 UX_EXPORT_FUNCTION AcDbObjectId AcDbDetailViewStyle::borderLineTypeId  |  ( |   | ) |   const
Returns the object ID of the linetype assigned to the view style border.
Returns
Object ID of the linetype assigned to the view style border
Date
2023-12-14 leem implemented
◆ borderLineWeight()
 UX_EXPORT_FUNCTION AcDb::LineWeight AcDbDetailViewStyle::borderLineWeight  |  ( |   | ) |   const
Returns the lineweight of the view style border.
Returns
Lineweight of the view style border
Date
2023-12-14 leem implemented
◆ boundaryLineColor()
 UX_EXPORT_FUNCTION AcCmColor AcDbDetailViewStyle::boundaryLineColor  |  ( |   | ) |   const
Returns the view style boundary color.
Returns
View style boundary color
Date
2023-12-14 leem implemented
◆ boundaryLineTypeId()
 UX_EXPORT_FUNCTION AcDbObjectId AcDbDetailViewStyle::boundaryLineTypeId  |  ( |   | ) |   const
Returns the object ID of the linetype assigned to the view style boundary.
Returns
Object ID of the linetype assigned to the view style boundary
Date
2023-12-14 leem implemented
◆ boundaryLineWeight()
 UX_EXPORT_FUNCTION AcDb::LineWeight AcDbDetailViewStyle::boundaryLineWeight  |  ( |   | ) |   const
Returns the lineweight of the view style boundary.
Returns
Lineweight of the view style boundary
Date
2023-12-14 leem implemented
◆ connectionLineColor()
 UX_EXPORT_FUNCTION AcCmColor AcDbDetailViewStyle::connectionLineColor  |  ( |   | ) |   const
Returns the color of the view style connection line.
Returns
Color of the view style connection line
Date
2023-12-14 leem implemented
◆ connectionLineTypeId()
 UX_EXPORT_FUNCTION AcDbObjectId AcDbDetailViewStyle::connectionLineTypeId  |  ( |   | ) |   const
Returns the object ID of the linetype assigned to the view style connection line.
Returns
Object ID of the view style connection line linetype
Date
2023-12-14 leem implemented
◆ connectionLineWeight()
 UX_EXPORT_FUNCTION AcDb::LineWeight AcDbDetailViewStyle::connectionLineWeight  |  ( |   | ) |   const
Returns the connection line lineweight.
Returns
connection line lineweight
Date
2023-12-14 leem implemented
◆ getViewLabelPattern()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbDetailViewStyle::getViewLabelPattern  |  ( |  AcString &  |  labelPattern,
|  AcDbField *  |  pField = NULL
) |   |  const
Returns the view label pattern and, optionally, master field.
Parameters
[out] | labelPattern | - view label pattern
[out] | pField | - if supplied and the label uses fields, the master field including child fields
Returns
Acad::eOk if successful; else error status
Date
2023-12-14 leem implemented
◆ identifierColor()
 UX_EXPORT_FUNCTION AcCmColor AcDbDetailViewStyle::identifierColor  |  ( |   | ) |   const
Returns the color of the view style identifier.
Returns
View style identifier color
Date
2023-12-14 leem implemented
◆ identifierHeight()
 UX_EXPORT_FUNCTION double AcDbDetailViewStyle::identifierHeight  |  ( |   | ) |   const
Returns the view style identifier text height.
Returns
View style identifier text height
Date
2023-12-14 leem implemented
◆ identifierOffset()
 UX_EXPORT_FUNCTION double AcDbDetailViewStyle::identifierOffset  |  ( |   | ) |   const
Returns the relative offset between the identifier arrow & extension line An offset of 0 implies the arrow is at the start of the extension line An offset of 1 implies the arrow is at the end of the extension line.
Returns
Relative value between 0 & 1
Date
2023-12-14 leem implemented
◆ identifierPlacement()
 UX_EXPORT_FUNCTION AcDbDetailViewStyle::IdentifierPlacement AcDbDetailViewStyle::identifierPlacement  |  ( |   | ) |   const
Returns an enum describing the identifier position.
Returns
IdentifierPlacement enum describing the identifier position
Date
2023-12-14 leem implemented
◆ identifierStyleId()
 UX_EXPORT_FUNCTION AcDbObjectId AcDbDetailViewStyle::identifierStyleId  |  ( |   | ) |   const
Returns the object ID of the identifier text style.
Returns
Object ID of the identifier text style
Date
2023-12-14 leem implemented
◆ modelEdge()
 UX_EXPORT_FUNCTION AcDbDetailViewStyle::ModelEdge AcDbDetailViewStyle::modelEdge  |  ( |   | ) |   const
Returns an enum describing the edge style of the model view.
Returns
Enum describing the edge style of the model view
Date
2023-12-14 leem implemented
◆ setArrowSymbolColor()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbDetailViewStyle::setArrowSymbolColor  |  ( |  const AcCmColor &  |  color | )
Sets the color of the block representing the arrow symbol.
Parameters
[in] | color | - new color for arrow symbol
Returns
Acad::eOk if successful; else error status
Date
2023-12-14 leem implemented
◆ setArrowSymbolId()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbDetailViewStyle::setArrowSymbolId  |  ( |  const AcDbObjectId &  |  objId | )
Sets the block table record used to represent the arrow start symbol.
Parameters
[in] | objId | - Block table record object ID for new arrow start symbol
Returns
Acad::eOk if successful; else error status
Date
2023-12-14 leem implemented
◆ setArrowSymbolSize()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbDetailViewStyle::setArrowSymbolSize  |  ( |  double  |  size | )
Sets the arrow symbol size.
Parameters
[in] | size | - new arrow symbol size
Returns
Acad::eOk if successful; else error status
Date
2023-12-14 leem implemented
◆ setBorderLineColor()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbDetailViewStyle::setBorderLineColor  |  ( |  const AcCmColor &  |  color | )
Sets the color of the view style border.
Parameters
[in] | color | - new color for view style border
Returns
Acad::eOk if successful; else error status
Date
2023-12-14 leem implemented
◆ setBorderLineTypeId()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbDetailViewStyle::setBorderLineTypeId  |  ( |  const AcDbObjectId &  |  objId | )
Assigns the linetype with the supplied object ID to the view style border.
Parameters
[in] | objId | - object ID of linetype to assign
Returns
Acad::eOk if successful; else error status
Date
2023-12-14 leem implemented
◆ setBorderLineWeight()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbDetailViewStyle::setBorderLineWeight  |  ( |  AcDb::LineWeight  |  lw | )
Sets the lineweight of the view style border.
Parameters
[in] | lw | - new lineweight for the view style border
Returns
Acad::eOk if successful; else error status
Date
2023-12-14 leem implemented
◆ setBoundaryLineColor()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbDetailViewStyle::setBoundaryLineColor  |  ( |  const AcCmColor &  |  color | )
Sets the color of the view style boundary.
Parameters
[in] | color | - new view style boundary color
Returns
Acad::eOk if successful; else error status
Date
2023-12-14 leem implemented
◆ setBoundaryLineTypeId()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbDetailViewStyle::setBoundaryLineTypeId  |  ( |  const AcDbObjectId &  |  objId | )
Assigns the linetype with the supplied object ID to the view style boundary.
Parameters
[in] | objId | - object ID of linetype to assign
Returns
Acad::eOk if successful; else error status
Date
2023-12-14 leem implemented
◆ setBoundaryLineWeight()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbDetailViewStyle::setBoundaryLineWeight  |  ( |  AcDb::LineWeight  |  lw | )
Sets the lineweight of the view style boundary.
Parameters
[in] | lw | - new lineweight for view style boundary
Returns
Acad::eOk if successful; else error status
Date
2023-12-14 leem implemented
◆ setConnectionLineColor()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbDetailViewStyle::setConnectionLineColor  |  ( |  const AcCmColor &  |  color | )
Sets the color of the view style connection line.
Parameters
[in] | color | - new connection line color
Returns
Acad::eOk if successful; else error status
Date
2023-12-14 leem implemented
◆ setConnectionLineTypeId()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbDetailViewStyle::setConnectionLineTypeId  |  ( |  const AcDbObjectId &  |  objId | )
Assigns the linetype with the supplied object ID to the view style connection line.
Parameters
[in] | objId | - object ID of linetype to assign
Returns
Acad::eOk if successful; else error status
Date
2023-12-14 leem implemented
◆ setConnectionLineWeight()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbDetailViewStyle::setConnectionLineWeight  |  ( |  AcDb::LineWeight  |  lw | )
Assigns a new lineweight to the view style connection line.
Parameters
[in] | lw | - new lineweight to assign to the view style connection line
Returns
Acad::eOk if successful; else error status
Date
2023-12-14 leem implemented
◆ setIdentifierColor()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbDetailViewStyle::setIdentifierColor  |  ( |  const AcCmColor &  |  color | )
Sets the view style identifier color.
Parameters
[in] | color | - new view style identifier color
Returns
Acad::eOk if successful; else error status
Date
2023-12-14 leem implemented
◆ setIdentifierHeight()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbDetailViewStyle::setIdentifierHeight  |  ( |  double  |  textHeight | )
Sets the text height of the view style identifier.
Parameters
[in] | textHeight | - new identifier text height
Returns
Acad::eOk if successful; else error status
Date
2023-12-14 leem implemented
◆ setIdentifierOffset()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbDetailViewStyle::setIdentifierOffset  |  ( |  double  |  offset | )
Sets the relative offset between the identifier arrow & extension line An offset of 0 implies the arrow is at the start of the extension line An offset of 1 implies the arrow is at the end of the extension line.
Parameters
[in] | offset | - Value between 0 & 1
Returns
Acad::eOk if successful; else error status
Date
2023-12-14 leem implemented
◆ setIdentifierPlacement()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbDetailViewStyle::setIdentifierPlacement  |  ( |  AcDbDetailViewStyle::IdentifierPlacement  |  place | )
Sets the position of the view style identifier.
Parameters
[in] | place | - enum describing new identifier position
Returns
Acad::eOk if successful; else error status
Date
2023-12-14 leem implemented
◆ setIdentifierStyleId()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbDetailViewStyle::setIdentifierStyleId  |  ( |  const AcDbObjectId &  |  objId | )
Assigns the text style with the supplied object ID to the identifier.
Parameters
[in] | objId | - object ID of new identifier text style
Returns
Acad::eOk if successful; else error status
Date
2023-12-14 leem implemented
◆ setModelEdge()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbDetailViewStyle::setModelEdge  |  ( |  AcDbDetailViewStyle::ModelEdge  |  edge | )
Sets the edge style of the model view.
Parameters
[in] | edge | - enum describing model view edge style
Returns
Acad::eOk if successful; else error status
Date
2023-12-14 leem implemented
◆ setShowArrows()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbDetailViewStyle::setShowArrows  |  ( |  bool  |  showArrows | )
Controls whether arrow symbols are displayed by view style.
Parameters
[in] | showArrows | - if true, arrow symbols are displayed
Returns
Acad::eOk if successful; else error status
Date
2023-12-14 leem implemented
◆ setShowViewLabel()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbDetailViewStyle::setShowViewLabel  |  ( |  bool  |  showLabel | )
Controls the display of the view label.
Parameters
[in] | showLabel | - if true, view label is shown
Returns
Acad::eOk if successful; else error status
Date
2023-12-14 leem implemented
◆ setViewLabelAlignment()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbDetailViewStyle::setViewLabelAlignment  |  ( |  AcDbModelDocViewStyle::TextAlignment  |  textAlignment | )
Sets the alignment of the view label text.
Parameters
[in] | textAlignment | - enum describing new text alignment
Returns
Acad::eOk if successful; else error status
Date
2023-12-14 leem implemented
◆ setViewLabelAttachment()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbDetailViewStyle::setViewLabelAttachment  |  ( |  AcDbModelDocViewStyle::AttachmentPoint  |  attachmentPoint | )
Sets the attachment position of the view label.
Parameters
[in] | attachmentPoint | - enum describing new attachment position
Returns
Acad::eOk if successful; else error status
Date
2023-12-14 leem implemented
◆ setViewLabelOffset()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbDetailViewStyle::setViewLabelOffset  |  ( |  double  |  labelOffset | )
Sets the view label offset.
Parameters
[in] | labelOffset | - new view label offset
Returns
Acad::eOk if successful; else error status
Date
2023-12-14 leem implemented
◆ setViewLabelPattern()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbDetailViewStyle::setViewLabelPattern  |  ( |  const ACHAR *  |  labelPattern,
|  const AcDbField *  |  pField = NULL
)
Sets the view label pattern and, optionally, child fields.
Parameters
[in] | labelPattern | - new view label pattern
[in] | pField | - if supplied and contains child fields, the pattern will be obtained from the field
Returns
Acad::eOk if successful; else error status
Date
2023-12-14 leem implemented
◆ setViewLabelTextColor()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbDetailViewStyle::setViewLabelTextColor  |  ( |  const AcCmColor &  |  color | )
Sets the view label text color.
Parameters
[in] | color | - new view label text color
Returns
Acad::eOk if successful; else error status
Date
2023-12-14 leem implemented
◆ setViewLabelTextHeight()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbDetailViewStyle::setViewLabelTextHeight  |  ( |  double  |  textHeight | )
Sets the view label text height.
Parameters
[in] | textHeight | - new view label text height
Returns
Acad::eOk if successful; else error status
Date
2023-12-14 leem implemented
◆ setViewLabelTextStyleId()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbDetailViewStyle::setViewLabelTextStyleId  |  ( |  const AcDbObjectId &  |  objId | )
Assigns the text style with the supplied object ID to the view label.
Parameters
[in] | objId | - text style object ID
Returns
Acad::eOk if successful; else error status
Date
2023-12-14 leem implemented
◆ showArrows()
 UX_EXPORT_FUNCTION bool AcDbDetailViewStyle::showArrows  |  ( |   | ) |   const
Indicates whether arrow symbols are displayed by view style.
Returns
true if arrow symbols are displayed, else false
Date
2023-12-14 leem implemented
◆ showViewLabel()
 UX_EXPORT_FUNCTION bool AcDbDetailViewStyle::showViewLabel  |  ( |   | ) |   const
Indicates whether the view label is displayed.
Returns
true if view label is displayed; else false
Date
2023-12-14 leem implemented
◆ viewLabelAlignment()
 UX_EXPORT_FUNCTION AcDbModelDocViewStyle::TextAlignment AcDbDetailViewStyle::viewLabelAlignment  |  ( |   | ) |   const
Returns the view label alignment.
Returns
View label alignment
Date
2023-12-14 leem implemented
◆ viewLabelAttachment()
 UX_EXPORT_FUNCTION AcDbModelDocViewStyle::AttachmentPoint AcDbDetailViewStyle::viewLabelAttachment  |  ( |   | ) |   const
Returns an enum describing the attachment position of the view label.
Returns
Enum describing the attachment position of the view label
Date
2023-12-14 leem implemented
◆ viewLabelOffset()
 UX_EXPORT_FUNCTION double AcDbDetailViewStyle::viewLabelOffset  |  ( |   | ) |   const
Returns the view label offset.
Returns
View label offset
Date
2023-12-14 leem implemented
◆ viewLabelPattern()
 UX_EXPORT_FUNCTION const ACHAR * AcDbDetailViewStyle::viewLabelPattern  |  ( |   | ) |   const
Returns the view label pattern.
Returns
View label pattern
Date
2023-12-14 leem implemented
◆ viewLabelTextColor()
 UX_EXPORT_FUNCTION AcCmColor AcDbDetailViewStyle::viewLabelTextColor  |  ( |   | ) |   const
Returns the view label text color.
Returns
View label text color
Date
2023-12-14 leem implemented
◆ viewLabelTextHeight()
 UX_EXPORT_FUNCTION double AcDbDetailViewStyle::viewLabelTextHeight  |  ( |   | ) |   const
Returns the view label text height.
Returns
View label text height
Date
2023-12-14 leem implemented
◆ viewLabelTextStyleId()
 UX_EXPORT_FUNCTION AcDbObjectId AcDbDetailViewStyle::viewLabelTextStyleId  |  ( |   | ) |   const
Returns the object ID of the text style assigned to the view label.
Returns
Object ID of the text style assigned to the view label
Date
2023-12-14 leem implemented