Public Member Functions | List of all members
AcDbDatabaseReactor Class Reference
_ More...
#include <AcDbDatabaseReactor.h>
 Public Member Functions
virtual void  | goodbye (const AcDbDatabase *)
Gives the notification to the AcDbDatabaseReactor derived class, when an database has been removed from memory. More...
virtual void  | headerSysVarChanged (const AcDbDatabase *, const ACHAR *, Adesk::Boolean)
Gives the notification to the AcDbDatabaseReactor derived class, when a system variable was changed (for database variables) More...
virtual void  | headerSysVarWillChange (const AcDbDatabase *, const ACHAR *)
Gives the notification to the AcDbDatabaseReactor derived class, when a system variable will change (for database variables) More...
virtual void  | objectAppended (const AcDbDatabase *, const AcDbObject *)
Gives the notification to the AcDbDatabaseReactor derived class, when an object was appended to the database. More...
virtual void  | objectErased (const AcDbDatabase *, const AcDbObject *, Adesk::Boolean)
Gives the notification to the AcDbDatabaseReactor derived class, when an object was erased. More...
virtual void  | objectModified (const AcDbDatabase *, const AcDbObject *)
Gives the notification to the AcDbDatabaseReactor derived class, when an object was modified. More...
virtual void  | objectOpenedForModify (const AcDbDatabase *, const AcDbObject *)
Gives the notification to the AcDbDatabaseReactor derived class, when an object was opened for modify (before modification happens) More...
virtual void  | objectReAppended (const AcDbDatabase *, const AcDbObject *)
Gives the notification to the AcDbDatabaseReactor derived class, when an object was re-appended to the database (by redo operation) More...
virtual void  | objectUnAppended (const AcDbDatabase *, const AcDbObject *)
Gives the notification to the AcDbDatabaseReactor derived class, when an object was un-appended to the database (by undo operation) More...
virtual void  | proxyResurrectionCompleted (const AcDbDatabase *, const ACHAR *, AcDbObjectIdArray &)
Gives the notification to the AcDbDatabaseReactor derived class, when proxy resurrection has been finished. More...
 Public Member Functions inherited from AcRxObject
virtual AcRxObject *  | clone () const
Exported and implemented. More...
 virtual AcRx::Ordering  | comparedTo (const AcRxObject *) const
Exported and implemented.
virtual Acad::ErrorStatus  | copyFrom (const AcRxObject *)
Exported and implemented. More...
 virtual AcRxClass *  | isA () const
Exported and implemented.
virtual Adesk::Boolean  | isEqualTo (const AcRxObject *) const
Exported and implemented. More...
bool  | isKindOf (const AcRxClass *) const
Checks the object class. More...
AcRxObject *  | queryX (const AcRxClass *) const
returns the protocol extension object assigned to this class or a parent class. More...
AcRxObject *  | x (const AcRxClass *) const
returns the protocol extension object assigned to this class or a parent class. More...
 virtual  | ~AcRxObject ()
Destructor.
 Additional Inherited Members
 Static Public Member Functions inherited from AcRxObject
 static AcRxObject *  | cast (const AcRxObject *)
 static AcRxClass *  | desc ()
Exported and implemented.
 Protected Member Functions inherited from AcRxObject
AcRxObject ()
Exported and implemented.
Detailed Description
_
Member Function Documentation
◆ goodbye()
 UX_EXPORT_FUNCTION void AcDbDatabaseReactor::goodbye  |  ( |  const AcDbDatabase *  |  drawing | )
virtual
Gives the notification to the AcDbDatabaseReactor derived class, when an database has been removed from memory.
Parameters
[in] | drawing | Database in which the modification took place
◆ headerSysVarChanged()
 UX_EXPORT_FUNCTION void AcDbDatabaseReactor::headerSysVarChanged  |  ( |  const AcDbDatabase *  |  drawing,
|  const ACHAR *  |  varName,
|  Adesk::Boolean  |  bResult
)
virtual
Gives the notification to the AcDbDatabaseReactor derived class, when a system variable was changed (for database variables)
Parameters
[in] | drawing | Database in which the modification took place
[in] | varName | the database variable which was changed
[in] | bResult | indicates whether the database variable was successfully changed
◆ headerSysVarWillChange()
 UX_EXPORT_FUNCTION void AcDbDatabaseReactor::headerSysVarWillChange  |  ( |  const AcDbDatabase *  |  drawing,
|  const ACHAR *  |  varName
)
virtual
Gives the notification to the AcDbDatabaseReactor derived class, when a system variable will change (for database variables)
Parameters
[in] | drawing | Database in which the modification took place
[in] | varName | the database variable which is about to be changed
◆ objectAppended()
 UX_EXPORT_FUNCTION void AcDbDatabaseReactor::objectAppended  |  ( |  const AcDbDatabase *  |  drawing,
|  const AcDbObject *  |  pObject
)
virtual
Gives the notification to the AcDbDatabaseReactor derived class, when an object was appended to the database.
Parameters
[in] | drawing | Database in which the modification took place
[in] | pObject | Object, which was appended
◆ objectErased()
 UX_EXPORT_FUNCTION void AcDbDatabaseReactor::objectErased  |  ( |  const AcDbDatabase *  |  drawing,
|  const AcDbObject *  |  pObject,
|  Adesk::Boolean  |  eraseStatus
)
virtual
Gives the notification to the AcDbDatabaseReactor derived class, when an object was erased.
Parameters
[in] | drawing | Database in which pOdObj was erased/unerased
[in] | pObject | Object, which was erased/unerased
[in] | eraseStatus | flag, whether operation was for erasing or for unerasing.
◆ objectModified()
 UX_EXPORT_FUNCTION void AcDbDatabaseReactor::objectModified  |  ( |  const AcDbDatabase *  |  drawing,
|  const AcDbObject *  |  pObject
)
virtual
Gives the notification to the AcDbDatabaseReactor derived class, when an object was modified.
Parameters
[in] | drawing | Database in which the modification took place
[in] | pObject | Object, which was modified
◆ objectOpenedForModify()
 UX_EXPORT_FUNCTION void AcDbDatabaseReactor::objectOpenedForModify  |  ( |  const AcDbDatabase *  |  drawing,
|  const AcDbObject *  |  pObject
)
virtual
Gives the notification to the AcDbDatabaseReactor derived class, when an object was opened for modify (before modification happens)
Parameters
[in] | drawing | Database in which the modification took place
[in] | pObject | Object, which was unappended
◆ objectReAppended()
 UX_EXPORT_FUNCTION void AcDbDatabaseReactor::objectReAppended  |  ( |  const AcDbDatabase *  |  drawing,
|  const AcDbObject *  |  pObject
)
virtual
Gives the notification to the AcDbDatabaseReactor derived class, when an object was re-appended to the database (by redo operation)
Parameters
[in] | drawing | Database in which the modification took place
[in] | pObject | Object, which was unappended
◆ objectUnAppended()
 UX_EXPORT_FUNCTION void AcDbDatabaseReactor::objectUnAppended  |  ( |  const AcDbDatabase *  |  drawing,
|  const AcDbObject *  |  pObject
)
virtual
Gives the notification to the AcDbDatabaseReactor derived class, when an object was un-appended to the database (by undo operation)
Parameters
[in] | drawing | Database in which the modification took place
[in] | pObject | Object, which was unappended
◆ proxyResurrectionCompleted()
 UX_EXPORT_FUNCTION void AcDbDatabaseReactor::proxyResurrectionCompleted  |  ( |  const AcDbDatabase *  |  drawing,
|  const ACHAR *  |  name,
|  AcDbObjectIdArray &  |  objectArray
)
virtual
Gives the notification to the AcDbDatabaseReactor derived class, when proxy resurrection has been finished.
Parameters
[in] | drawing | Database in which the modification took place
[in] | name | of the application where the objects belong to
[in] | objectArray | array of ObjectIDs of resurrected drawing objects