Public Types | Public Member Functions | Public Attributes | Protected Member Functions | List of all members
AcDbViewport Class Reference
_ More...
#include <AcDbViewport.h>
 Public Types
enum  | ShadePlotType {
 kAsDisplayed = 0 , kWireframe , kHidden , kRendered ,
 kVisualStyle , kRenderPreset
 }
enum  | StandardScaleType {
 kScaleToFit = 0 , kCustomScale , k1_1 , k1_2 ,
 k1_4 , k1_5 , k1_8 , k1_10 ,
 k1_16 , k1_20 , k1_30 , k1_40 ,
 k1_50 , k1_100 , k2_1 , k4_1 ,
 k8_1 , k10_1 , k100_1 , k1_128in_1ft ,
 k1_64in_1ft , k1_32in_1ft , k1_16in_1ft , k3_32in_1ft ,
 k1_8in_1ft , k3_16in_1ft , k1_4in_1ft , k3_8in_1ft ,
 k1_2in_1ft , k3_4in_1ft , k1in_1ft , k1and1_2in_1ft ,
 k3in_1ft , k6in_1ft , k1ft_1ft
 }
 Public Types inherited from AcDbEntity
enum  | VisualStyleType { kFullVisualStyle = 0 , kFaceVisualStyle = 1 , kEdgeVisualStyle = 2 }
 Public Types inherited from AcGiDrawable
enum  | DrawableType {
 kGeometry = 0 , kDistantLight , kPointLight , kSpotLight ,
 kAmbientLight , kSolidBackground , kGradientBackground , kImageBackground ,
 kGroundPlaneBackground , kViewport
 }
enum  | SetAttributesFlags {
 kDrawableNone = 0 , kDrawableIsAnEntity = 1 , kDrawableUsesNesting = 2 , kDrawableIsCompoundObject = 4 ,
 kDrawableViewIndependentViewportDraw = 8 , kDrawableIsInvisible = 16 , kDrawableHasAttributes = 32 , kDrawableRegenTypeDependentGeometry = 64 ,
 kDrawableIsDimension = 133 , kDrawableRegenDraw = 256 , kDrawableStandardDisplaySingleLOD = 512 , kDrawableShadedDisplaySingleLOD = 1024 ,
 kDrawableViewDependentViewportDraw = 2048 , kDrawableBlockDependentViewportDraw = 4096 , kDrawableIsExternalReference = 8192 , kDrawableNotPlottable = 16384 ,
 kDrawableNotAllowLCS = 32768 , kDrawableMergeControlOff = 65536 , kThreadedWorldDrawViewportDraw = 131072
 }
 Public Member Functions
AcCmColor  | ambientLightColor () const
Gets this vieport's view ambient light color. More...
AcDbAnnotationScale *  | annotationScale () const
Returns a clone of the AcDbAnnotationscale, which is associated with this viewport; calling application MUST explicitly delete the returned object. More...
double  | backClipDistance () const
Gets the target - back clip plane distance. More...
AcDbObjectId  | background () const
Returns the AcDbObjectId of assigned background object. More...
double  | brightness () const
Gets this vieport's view bightness. More...
AcGePoint3d  | centerPoint () const
Gets this Viewport center point. More...
Adesk::UInt16  | circleSides () const
Gets the circle zoom percent of this viewport. More...
double  | contrast () const
Gets this vieport's view contrast. More...
virtual void  | copied (const AcDbObject *, const AcDbObject *)
double  | customScale () const
Returns the custom scale for this Viewport's view. More...
AcGiViewportTraits::DefaultLightingType  | defaultLightingType () const
Gets this vieport's view default lighting type. More...
Acad::ErrorStatus  | effectivePlotStyleSheet (const ACHAR *&)
Returns the effective PlotStyle sheet name. More...
double  | elevation () const
Gets this vieport's view elevation. More...
virtual void  | erased (const AcDbObject *, Adesk::Boolean)
Acad::ErrorStatus  | freezeLayersInViewport (const AcDbObjectIdArray &)
Freezes the given Layers in this Viewport. More...
double  | frontClipDistance () const
Gets the target - front clip plane distance. More...
Acad::ErrorStatus  | getFrozenLayerList (AcDbObjectIdArray &) const
Returns the list of Layers which are currently frozen in this Viewport. More...
 Acad::ErrorStatus  | getLabelBlock (AcDbObjectId &) const
 Acad::ErrorStatus  | getModelView (AcDbXrefObjectId &) const
 Acad::ErrorStatus  | getSheetView (AcDbObjectId &) const
 Acad::ErrorStatus  | getThumbnail (BITMAPINFO *&) const
Acad::ErrorStatus  | getUcs (AcGePoint3d &, AcGeVector3d &, AcGeVector3d &) const
Gets the origin, X-axis, and Y-Axis of the UCS associated with this Viewport. More...
AcGeVector2d  | gridIncrement () const
Gets the X and Y spacing of the grid as a AcGeVector2d object. More...
 Adesk::UInt16  | gridMajor () const
double  | height () const
Gets the height for this Viewport's view. More...
bool  | hiddenLinesRemoved () const
Checks if this viewport is set to remove the hidden lines during plotting. More...
bool  | isBackClipOn () const
Returns whether the back clipping for this Viewport is currently active (on) More...
bool  | isDefaultLightingOn () const
Checks if default lighting is enabled for this vieport's view. More...
bool  | isFastZoomOn () const
Returns whether the 'Fast-Zoom' for this Viewport's view is on or off. More...
bool  | isFrontClipAtEyeOn () const
Returns whether the front clipping plane is currently located at camera position. More...
bool  | isFrontClipOn () const
Returns whether the front clipping for this Viewport is currently active (on) More...
 bool  | isGridAdaptive () const
 bool  | isGridBoundToLimits () const
 bool  | isGridFollow () const
bool  | isGridOn () const
Returns whether the Viewport's grid is displayed. More...
 bool  | isGridSubdivisionRestricted () const
bool  | isLayerFrozenInViewport (const AcDbObjectId &) const
Test whether a given Layer is frozen in this Viewport. More...
bool  | isLocked () const
Returns whether the Viewport's scale is locked. More...
bool  | isNonRectClipOn () const
Returns whether the non-rectangular clipping is active for this Viewport. More...
bool  | isOn () const
Returns whether the Viewport is active and on the active layout. More...
bool  | isPerspectiveOn () const
Returns whether the Viewport is in perspective view mode currently. More...
bool  | isSnapIsometric () const
Checks if this viewport has isometric snap mode set. More...
bool  | isSnapOn () const
Checks if this viewport has snap mode turned on. More...
bool  | isTransparent () const
Returns whether the Viewport is set to transparent mode. More...
bool  | isUcsFollowModeOn () const
Returns whether the Viewport will create a plan view whenever the UCS changes. More...
bool  | isUcsIconAtOrigin () const
Checks if this viewport has UcsIconAtOrigin mode on. More...
bool  | isUcsIconVisible () const
Checks if this viewport has UcsIconVisible mode set on. More...
bool  | isUcsOrthographic (AcDb::OrthographicView &) const
Returns whether this viewport uses an UCS with an orthographic view. More...
bool  | isUcsSavedWithViewport () const
Returns whether the Viewport will also save and restore the current UCS whenever the view is saved. More...
bool  | isViewOrthographic (AcDb::OrthographicView &) const
Checks whether the view is orthographic with respect to UCSBASE. More...
double  | lensLength () const
Returns the lense length when the Viewport is in perspective view mode. More...
virtual void  | modified (const AcDbObject *)
AcDbObjectId  | nonRectClipEntityId () const
Returns the clipping entity for this Viewport. More...
Adesk::Int16  | number () const
Returns the ID number of this Viewport. More...
 bool  | plotAsRaster () const
Acad::ErrorStatus  | plotStyleSheet (ACHAR *&) const
Returns the associated PlotStyle sheet name. More...
Acad::ErrorStatus  | plotStyleSheet (const ACHAR *&) const
Returns the associated PlotStyle sheet name. More...
 bool  | plotWireframe () const
Acad::ErrorStatus  | removeHiddenLines ()
Makes this viewport to remove hidden lines during plotting. More...
 Acad::ErrorStatus  | removeLabelBlock ()
 Acad::ErrorStatus  | removeModelView ()
 Acad::ErrorStatus  | removeSheetView ()
AcDbAbstractViewTableRecord::RenderMode  | renderMode () const
Gets this vieport's view render mode. More...
Acad::ErrorStatus  | setAmbientLightColor (const AcCmColor &)
Sets the ambient light color using the AcCmColor object passed in. More...
Acad::ErrorStatus  | setAnnotationScale (const AcDbAnnotationScale *)
Sets the AcDbAnnotationscale, which is associated with this viewport. More...
Acad::ErrorStatus  | setBackClipDistance (double)
Sets the distance between the target and the back clip plane. More...
Acad::ErrorStatus  | setBackClipOff ()
Sets the 'use back clip plane' off for this Viewport's view. More...
Acad::ErrorStatus  | setBackClipOn ()
Sets the 'use back clip plane' on for this Viewport's view. More...
Acad::ErrorStatus  | setBackground (AcDbObjectId)
Sets the AcDbAnnotationscale, which is associated with this viewport. More...
Acad::ErrorStatus  | setBrightness (double)
Sets the brightness for this viewport's view. More...
Acad::ErrorStatus  | setCenterPoint (const AcGePoint3d &)
Sets the center point for this Viewport's view. More...
Acad::ErrorStatus  | setCircleSides (Adesk::UInt16)
Sets this viewport's circle zoom percent. More...
Acad::ErrorStatus  | setContrast (double)
Sets the contrast for this viewport's view. More...
Acad::ErrorStatus  | setCustomScale (double)
Sets the custom scale for this Viewport's view. More...
Acad::ErrorStatus  | setDefaultLightingOn (bool)
Enables or disables the default lighting. More...
Acad::ErrorStatus  | setDefaultLightingType (AcGiViewportTraits::DefaultLightingType)
Sets the type of the default lighting for this viewport. More...
Acad::ErrorStatus  | setElevation (double)
Sets the elevation of the UCS for this viewport's view. More...
Acad::ErrorStatus  | setFastZoomOff ()
Sets the 'Fast-Zoom' off for this Viewport's view. More...
Acad::ErrorStatus  | setFastZoomOn ()
Sets the 'Fast-Zoom' on for this Viewport's view. More...
Acad::ErrorStatus  | setFrontClipAtEyeOff ()
Sets the 'use front clip at eye position plane' off for this Viewport's view. More...
Acad::ErrorStatus  | setFrontClipAtEyeOn ()
Sets the 'use front clip at eye position plane' on for this Viewport's view. More...
Acad::ErrorStatus  | setFrontClipDistance (double)
Sets the distance between the target and the front clip plane. More...
Acad::ErrorStatus  | setFrontClipOff ()
Sets the 'use front clip plane' off for this Viewport's view. More...
Acad::ErrorStatus  | setFrontClipOn ()
Sets the ' use front clip plane' on for this Viewport's view. More...
 Acad::ErrorStatus  | setGridAdaptive (bool)
 Acad::ErrorStatus  | setGridBoundToLimits (bool)
 Acad::ErrorStatus  | setGridFollow (bool)
Acad::ErrorStatus  | setGridIncrement (const AcGeVector2d &)
Sets the X and Y spacings of the grid, using X and Y coordinates of spacingVect. More...
 Acad::ErrorStatus  | setGridMajor (Adesk::UInt16)
Acad::ErrorStatus  | setGridOff ()
Sets the grid off for this Viewport's view. More...
Acad::ErrorStatus  | setGridOn ()
Sets the grid on for this Viewport's view. More...
 Acad::ErrorStatus  | setGridSubdivisionRestricted (bool)
Acad::ErrorStatus  | setHeight (double)
Sets the height for this Viewport's view. More...
 Acad::ErrorStatus  | setLabelBlock (AcDbObjectId)
Acad::ErrorStatus  | setLensLength (double)
Sets the new lens length for this Viewport's view. More...
Acad::ErrorStatus  | setLocked ()
Locks the Vipewport's view scale. More...
 Acad::ErrorStatus  | setModelView (const AcDbXrefObjectId &)
Acad::ErrorStatus  | setNonRectClipEntityId (AcDbObjectId)
Sets the clipping entity for this Viewport. More...
Acad::ErrorStatus  | setNonRectClipOff ()
Sets the non-rectangular clipping off for this Viewport's view. More...
Acad::ErrorStatus  | setNonRectClipOn ()
Sets the non-rectangular clipping on for this Viewport's view. More...
Acad::ErrorStatus  | setOff ()
Sets the Viewport UCS off. More...
Acad::ErrorStatus  | setOn ()
Sets the Viewport UCS on. More...
Acad::ErrorStatus  | setOpaque ()
Sets the opaque view mode on for this Viewport's view. More...
Acad::ErrorStatus  | setPerspectiveOff ()
Sets the perspective view mode off for this Viewport's view. More...
Acad::ErrorStatus  | setPerspectiveOn ()
Sets the perspective view mode on for this Viewport's view. More...
Acad::ErrorStatus  | setPlotStyleSheet (const ACHAR *)
Assigns the PlotStyle sheet name to this viewport. More...
void  | setRenderMode (AcDbAbstractViewTableRecord::RenderMode)
Sets the render mode for this viewport. More...
Acad::ErrorStatus  | setShadePlot (const ShadePlotType)
Sets the shade plot mode for this Viewport. More...
Acad::ErrorStatus  | setShadePlot (const ShadePlotType, const AcDbObjectId)
Sets the shade plot mode for this Viewport. More...
 Acad::ErrorStatus  | setSheetView (AcDbObjectId)
Acad::ErrorStatus  | setSnapAngle (double)
Sets this viewport's snap angle. More...
Acad::ErrorStatus  | setSnapBasePoint (const AcGePoint2d &)
Sets this viewport's base point. More...
Acad::ErrorStatus  | setSnapIncrement (const AcGeVector2d &)
Sets the X and Y spacing of the snap grid, using X and Y coordinates of spacingVect. More...
Acad::ErrorStatus  | setSnapIsometric ()
Sets this viewport to isometric mode. More...
Acad::ErrorStatus  | setSnapIsoPair (Adesk::UInt16)
Sets this viewport's snap isoPair. More...
Acad::ErrorStatus  | setSnapOff ()
Sets snap mode off for this viewport. More...
Acad::ErrorStatus  | setSnapOn ()
Sets snap mode on for this viewport. More...
Acad::ErrorStatus  | setSnapStandard ()
Sets this viewport to standard mode. More...
Acad::ErrorStatus  | setStandardScale (const StandardScaleType)
Sets the viewport scale. More...
Acad::ErrorStatus  | setSun (AcDbObjectId &, AcDbObject *)
The function associates an sun object with this viewport. More...
 Acad::ErrorStatus  | setThumbnail (const BITMAPINFO *)
Acad::ErrorStatus  | setTransparent ()
Sets the transparent view mode on for this Viewport's view. More...
Acad::ErrorStatus  | setTwistAngle (double)
Sets this viewport's view twist angle. More...
Acad::ErrorStatus  | setUcs (AcDb::OrthographicView)
Sets this viewport to use an UCS based on the specified orthographic view. More...
Acad::ErrorStatus  | setUcs (const AcDbObjectId &)
Sets the Vipewport's UCS to the named UCS given by its AcDbUcsTableRecord. More...
Acad::ErrorStatus  | setUcs (const AcGePoint3d &, const AcGeVector3d &, const AcGeVector3d &)
Sets the current UCS for this Viewport's view. More...
Acad::ErrorStatus  | setUcsFollowModeOff ()
Sets the 'plan view after UCS change' off for this Viewport's view. More...
Acad::ErrorStatus  | setUcsFollowModeOn ()
Sets the 'plan view after UCS change' on for this Viewport's view. More...
Acad::ErrorStatus  | setUcsIconAtCorner ()
Sets ucsIconAtCorner mode for this viewport. More...
Acad::ErrorStatus  | setUcsIconAtOrigin ()
Sets ucsIconAtOrigin mode for this viewport. More...
Acad::ErrorStatus  | setUcsIconInvisible ()
Sets the ucs icon invisible for this viewport. More...
Acad::ErrorStatus  | setUcsIconVisible ()
Sets ucs icon visible for this viewport. More...
void  | setUcsPerViewport (bool)
Sets the 'UCS per Viewport' on or off for this Viewport. More...
Acad::ErrorStatus  | setUcsToWorld ()
Sets the Viewport's view UCS to the Wolrd UCS. More...
Acad::ErrorStatus  | setUnlocked ()
Unlocks the Vipewport's view scale. More...
Acad::ErrorStatus  | setViewCenter (const AcGePoint2d &)
Sets the view center for this Viewport's view. More...
 Acad::ErrorStatus  | setViewDirection (AcDb::OrthographicView)
Acad::ErrorStatus  | setViewDirection (const AcGeVector3d &)
Sets the view direction (from target to camera) for this Viewport's view. More...
Acad::ErrorStatus  | setViewHeight (double)
Sets the view height for this Viewport's view. More...
Acad::ErrorStatus  | setViewTarget (const AcGePoint3d &)
Sets the new view target point (in WCS) for this Viewport's view. More...
Acad::ErrorStatus  | setVisualStyle (const AcDbObjectId)
Sets the visual style using the id passed in. More...
Acad::ErrorStatus  | setWidth (double)
Sets the width for this Viewport's view. More...
ShadePlotType  | shadePlot () const
Returns the Viewport's shade plot mode. More...
AcDbObjectId  | shadePlotId () const
Returns the AcDbObjectId of the used visual style or render setting for this Viewport's shade plot mode. More...
Acad::ErrorStatus  | showHiddenLines ()
Makes this viewport show hidden lines during plotting. More...
double  | snapAngle () const
Gets the value of the snap angle for this viewport (in radians). More...
AcGePoint2d  | snapBasePoint () const
Gets the snap base point of this viewport. More...
AcGeVector2d  | snapIncrement () const
Gets the X and Y spacing of the snap grid as a AcGeVector2d object. More...
Adesk::UInt16  | snapIsoPair () const
Gets the snap IsoPair value for this viewport. More...
StandardScaleType  | standardScale () const
Gets the viewport scale. More...
virtual void  | subObjModified (const AcDbObject *, const AcDbObject *)
AcDbObjectId  | sunId () const
The function returns an id.This id was created for associates a sun object with this viewport. More...
 Acad::ErrorStatus  | syncModelView ()
Acad::ErrorStatus  | thawAllLayersInViewport ()
Thaws the all Layers in this Viewport. More...
Acad::ErrorStatus  | thawLayersInViewport (const AcDbObjectIdArray &)
Thaws the given Layers in this Viewport. More...
double  | twistAngle () const
Gets this vieport's view twist anagle. More...
AcDbObjectId  | ucsName () const
Returns the Object Id of the UCS' AcDbUcsTableRecord, if the Viewport is using a named UCS. More...
Acad::ErrorStatus  | updateDisplay () const
Updates the display of this Viewport. More...
AcGePoint2d  | viewCenter () const
Returns the view center of this Viewport. More...
AcGeVector3d  | viewDirection () const
Returns the 3d vector of this view direction (in Modelspace WCS) More...
double  | viewHeight () const
Returns the height of this viewport's modelspace view. More...
AcGePoint3d  | viewTarget () const
Returns the Target viewpoint of this Viewport. More...
AcDbObjectId  | visualStyle () const
Gets this vieport's view visual style. More...
double  | width () const
Gets this Viewport width. More...
 Public Member Functions inherited from AcDbEntity
 virtual Acad::ErrorStatus  | addSubentPaths (const AcDbFullSubentPathArray &) final
virtual Acad::ErrorStatus  | applyPartialUndo (AcDbDwgFiler *, AcRxClass *)
virtual Acad::ErrorStatus  | audit (AcDbAuditInfo *)
AcDbObjectId  | blockId () const
Returns the Object ID of the BlockTableRecord that owns this entity. More...
Acad::ErrorStatus  | boundingBoxIntersectWith (const AcDbEntity *, AcDb::Intersect, AcGePoint3dArray &, Adesk::GsMarker, Adesk::GsMarker) const
Finds the intersection between the edges of the bounding box for this entity and the pOhter entity. More...
Acad::ErrorStatus  | boundingBoxIntersectWith (const AcDbEntity *, AcDb::Intersect, const AcGePlane &, AcGePoint3dArray &, Adesk::GsMarker, Adesk::GsMarker) const
First, the function projects the other entity and the bounding box of this entity on plane specified by plane. More...
virtual bool  | bounds (AcDbExtents &) const
Returns the extents of this entity as AcDbExtents. More...
virtual bool  | castShadows () const
Checks if this entity is able to cast shadows. More...
virtual Adesk::Boolean  | cloneMeForDragging () final
Checks if a clone will be created for this entity in case of a drag operation. More...
 virtual AcDb::CollisionType  | collisionType () const
AcCmColor  | color () const
Returns the true color information of the entity. More...
Adesk::UInt16  | colorIndex () const
Returns the color number in a range from 0 to 256. More...
 virtual Acad::ErrorStatus  | deleteSubentPaths (const AcDbFullSubentPathArray &) final
virtual void  | dragStatus (const AcDb::DragStat)
Acad::ErrorStatus  | draw ()
Draws or redraws the entity on screen. More...
virtual AcGiDrawable *  | drawable ()
virtual Acad::ErrorStatus  | dwgInFields (AcDbDwgFiler *)
virtual Acad::ErrorStatus  | dwgOutFields (AcDbDwgFiler *) const
virtual Acad::ErrorStatus  | dxfInFields (AcDbDxfFiler *)
virtual Acad::ErrorStatus  | dxfOutFields (AcDbDxfFiler *) const
AcCmEntityColor  | entityColor () const
Returns the lightweight color information of the entity. More...
virtual Acad::ErrorStatus  | explode (AcDbVoidPtrArray &) const final
virtual Acad::ErrorStatus  | getCompoundObjectTransform (AcGeMatrix3d &) const final
It is used for object without geometry like AcDbMleader. More...
virtual void  | getEcs (AcGeMatrix3d &) const
Returns the transformation matrix from OCS (Object Coordinate System) to WCS (World Coordinate System). More...
virtual Acad::ErrorStatus  | getGeomExtents (AcDbExtents &) const final
Returns extents of this entity. More...
 virtual Acad::ErrorStatus  | getGripEntityUCS (const void *, AcGeVector3d &, AcGePoint3d &, AcGeVector3d &) const final
 virtual Acad::ErrorStatus  | getGripPoints (AcDbGripDataPtrArray &, const double, const int, const AcGeVector3d &, const int) const final
virtual Acad::ErrorStatus  | getGripPoints (AcGePoint3dArray &, AcDbIntArray &, AcDbIntArray &) const final
Append grip points to the specified array. More...
 virtual Acad::ErrorStatus  | getGripPointsAtSubentPath (const AcDbFullSubentPath &, AcDbGripDataPtrArray &, const double, const int, const AcGeVector3d &, const int) const final
virtual Acad::ErrorStatus  | getGsMarkersAtSubentPath (const AcDbFullSubentPath &, AcArray< Adesk::GsMarker > &) const final
virtual Acad::ErrorStatus  | getMaterialMapper (AcGiMapper &) const
virtual Acad::ErrorStatus  | getOsnapPoints (AcDb::OsnapMode, Adesk::GsMarker, const AcGePoint3d &, const AcGePoint3d &, const AcGeMatrix3d &, AcGePoint3dArray &, AcDbIntArray &) const final
Gets the entity osnap points. More...
virtual Acad::ErrorStatus  | getOsnapPoints (AcDb::OsnapMode, Adesk::GsMarker, const AcGePoint3d &, const AcGePoint3d &, const AcGeMatrix3d &, AcGePoint3dArray &, AcDbIntArray &, const AcGeMatrix3d &) const final
Gets the entity osnap points. More...
virtual Acad::ErrorStatus  | getPlane (AcGePlane &, AcDb::Planarity &) const
Returns the plane that contains this entity. More...
AcDb::PlotStyleNameType  | getPlotStyleNameId (AcDbObjectId &) const
Returns the plot style name type and its associated id. More...
virtual Acad::ErrorStatus  | getStretchPoints (AcGePoint3dArray &) const final
Append stretch points to the specified array. More...
 virtual Acad::ErrorStatus  | getSubentClassId (const AcDbFullSubentPath &, CLSID *) const final
 virtual Acad::ErrorStatus  | getSubentPathGeomExtents (const AcDbFullSubentPath &, AcDbExtents &) const final
virtual Acad::ErrorStatus  | getSubentPathsAtGsMarker (AcDb::SubentType, Adesk::GsMarker, const AcGePoint3d &, const AcGeMatrix3d &, int &, AcDbFullSubentPath *&, int=0, AcDbObjectId *=NULL) const final
Gets the subentity paths appropriate for the passed in gs marker. More...
virtual Acad::ErrorStatus  | getTransformedCopy (const AcGeMatrix3d &, AcDbEntity *&) const final
Creates a copy of the current entity applying the transformation matrix. More...
 virtual void  | gripStatus (const AcDb::GripStat) final
 virtual bool  | hideMeForDragging () const final
virtual Acad::ErrorStatus  | highlight (const AcDbFullSubentPath &=kNullSubent, const Adesk::Boolean=Adesk::kFalse) const final
Highlights part of, or entire entity. More...
virtual Acad::ErrorStatus  | intersectWith (const AcDbEntity *, AcDb::Intersect, AcGePoint3dArray &, Adesk::GsMarker=0, Adesk::GsMarker=0) const final
Finds the intersection between this entity and the pOhter entity. More...
virtual Acad::ErrorStatus  | intersectWith (const AcDbEntity *, AcDb::Intersect, const AcGePlane &, AcGePoint3dArray &, Adesk::GsMarker=0, Adesk::GsMarker=0) const final
Projects this entity and the pOhter entity on plane, finds the intersection points between these projections and then projects back the points onto the caller entity. More...
 virtual bool  | isContentSnappable () const final
virtual Adesk::Boolean  | isPlanar () const
ACHAR *  | layer () const
Returns the layername. More...
AcDbObjectId  | layerId () const
Returns the Object ID of the LayerTableRecord referenced by this entity. More...
ACHAR *  | linetype () const
Gets the linetype value. More...
AcDbObjectId  | linetypeId () const
Gets the linetypeId value. More...
 double  | linetypeScale () const
returns the linetype scale factor for the entity
AcDb::LineWeight  | lineWeight () const
Gets the entity line weight. More...
virtual void  | list () const final
Prints the properties in drawing window. More...
ACHAR *  | material () const
Gets the material assigned to this entity. More...
AcDbObjectId  | materialId () const
Gets the AcDbObjectId of the material assigned to this entity. More...
virtual Acad::ErrorStatus  | moveGripPointsAt (const AcDbIntArray &, const AcGeVector3d &) final
Move the grip points pointed by the indexes specified in indexArray using the translationVector param direction and length Override this method in custom entities to define your own behaviour. More...
 virtual Acad::ErrorStatus  | moveGripPointsAt (const AcDbVoidPtrArray &, const AcGeVector3d &, const int) final
 virtual Acad::ErrorStatus  | moveGripPointsAtSubentPaths (const AcDbFullSubentPathArray &, const AcDbVoidPtrArray &, const AcGeVector3d &, const int) final
virtual Acad::ErrorStatus  | moveStretchPointsAt (const AcDbIntArray &, const AcGeVector3d &) final
Move the stretch points pointed by the indexes specified in indexArray with the offest specified by translationVector Override this method in custom entities to define your own behaviour. More...
ACHAR *  | plotStyleName () const
Returns the name of the plotStyleName string associated with this entity (DXF 390). More...
virtual bool  | receiveShadows () const
Checks if this entity is able to receive shadows. More...
void  | recordGraphicsModified (Adesk::Boolean=Adesk::kTrue)
Controls the entity display update when closing it Entities not updated when closed are updated at the first regen. More...
virtual void  | saveAs (AcGiWorldDraw *, AcDb::SaveType)
Generates the graphics primitives when a DWG save requiring proxy graphics to be saved is made. More...
virtual void  | setCastShadows (bool)
Sets this entity's flag regarding casting shadows. More...
virtual Acad::ErrorStatus  | setColor (const AcCmColor &, Adesk::Boolean=Adesk::kTrue)
Sets the color information of this entity from an AcCmColor instance. More...
virtual Acad::ErrorStatus  | setColor (const AcCmColor &, bool, AcDbDatabase *)
Sets the color property of this entity from an AcCmColor instance. More...
virtual Acad::ErrorStatus  | setColorIndex (Adesk::UInt16, Adesk::Boolean=Adesk::kTrue)
Sets the color index of this entity (DXF 62). More...
void  | setDatabaseDefaults ()
Applies the default properties of the entities database to this entity. More...
void  | setDatabaseDefaults (AcDbDatabase *)
Applies the default properties of the specified database to this entity. More...
virtual Acad::ErrorStatus  | setLayer (AcDbObjectId, Adesk::Boolean=Adesk::kTrue, bool=false)
Sets the layer to be referenced by this entity (DXF 8). More...
virtual Acad::ErrorStatus  | setLayer (const ACHAR *, Adesk::Boolean=Adesk::kTrue, bool=false)
Sets the layer to be referenced by this entity (DXF 8). More...
virtual Acad::ErrorStatus  | setLinetype (AcDbObjectId, Adesk::Boolean=Adesk::kTrue)
Sets the entities linetype to ltypeObjectId. More...
virtual Acad::ErrorStatus  | setLinetype (const ACHAR *, Adesk::Boolean=Adesk::kTrue)
Sets the entities linetype to the linetpye referenced by layerName. More...
virtual Acad::ErrorStatus  | setLinetypeScale (double, Adesk::Boolean=Adesk::kTrue)
sets value as entity linetype scale factor More...
virtual Acad::ErrorStatus  | setLineWeight (AcDb::LineWeight, Adesk::Boolean=Adesk::kTrue)
Sets the entity line weight. More...
virtual Acad::ErrorStatus  | setMaterial (AcDbObjectId, Adesk::Boolean=Adesk::kTrue)
Not implemented yet. More...
virtual Acad::ErrorStatus  | setMaterial (const ACHAR *, Adesk::Boolean=Adesk::kTrue)
Assigns the material to the entity. More...
virtual Acad::ErrorStatus  | setMaterialMapper (const AcGiMapper &, Adesk::Boolean=Adesk::kTrue)
It is used for apply material (scale, rotation, projection, mode overrides) to an identity.If it is used AcGiMapper::kIdentity it will apply for entity a default mapper. More...
virtual Acad::ErrorStatus  | setPlotStyleName (AcDb::PlotStyleNameType, AcDbObjectId=AcDbObjectId::kNull, Adesk::Boolean=Adesk::kTrue)
Sets the plot style of this entity. More...
virtual Acad::ErrorStatus  | setPlotStyleName (const ACHAR *, Adesk::Boolean=Adesk::kTrue)
Sets the plot style of this entity. More...
Acad::ErrorStatus  | setPropertiesFrom (const AcDbEntity *, Adesk::Boolean=Adesk::kTrue)
Copies the properties color, layer, linetype, linetypescale and visibility from the source entity pEntity to this entity. More...
virtual void  | setReceiveShadows (bool)
Sets this entity's flag regarding receiving shadows. More...
virtual Acad::ErrorStatus  | setTransparency (const AcCmTransparency &, Adesk::Boolean=Adesk::kTrue)
Sets the transparency setting of this entity, and returns eOk if successful. More...
virtual Acad::ErrorStatus  | setVisibility (AcDb::Visibility, Adesk::Boolean=Adesk::kTrue) final
notyetdocumented. More...
 virtual Acad::ErrorStatus  | setVisualStyle (AcDbObjectId, VisualStyleType=kFullVisualStyle, Adesk::Boolean=true)
 virtual void  | subentGripStatus (const AcDb::GripStat, const AcDbFullSubentPath &) final
virtual AcDbEntity *  | subentPtr (const AcDbFullSubentPath &) const final
Creates an entity as a copy of the subentity given by acSubentPath. More...
virtual void  | subSetDatabaseDefaults (AcDbDatabase *)
This function is called by AcDbEntity::setDatabaseDefaults(), to allow custom entities to set their related sub entities, if any; default implementation does nothing. More...
virtual Acad::ErrorStatus  | transformBy (const AcGeMatrix3d &) final
Applies given transformation (matrix) to the entity. More...
 virtual Acad::ErrorStatus  | transformSubentPathsBy (const AcDbFullSubentPathArray &, const AcGeMatrix3d &) final
 AcCmTransparency  | transparency () const
Returns the transparency setting of this entity.
virtual Acad::ErrorStatus  | unhighlight (const AcDbFullSubentPath &=kNullSubent, const Adesk::Boolean=Adesk::kFalse) const final
Unhighlights previously highlighted part of entity, or entire entity. More...
AcDb::Visibility  | visibility () const
Gets the visibility state. More...
 AcDbObjectId  | visualStyleId (VisualStyleType=kFullVisualStyle) const
 Public Member Functions inherited from AcDbObject
virtual Acad::ErrorStatus  | addPersistentReactor (AcDbObjectId)
Adds a persistent reactor to this object reactor list. More...
Acad::ErrorStatus  | addReactor (AcDbObjectReactor *) const
Adds a transient reactor to this object. More...
virtual Acad::ErrorStatus  | applyPartialUndo (AcDbDwgFiler *, AcRxClass *)
This function is called during Undo operations on objects, that use the 'Partial Undo meachanism'; this is, this object is opened with assertWriteEnabled(Adesk::kFalse) to indicate that custom Undo filing is used rather than the default Undo filing. More...
 void  | assertNotifyEnabled () const
 void  | assertReadEnabled () const
 void  | assertWriteEnabled (Adesk::Boolean=Adesk::kTrue, Adesk::Boolean=Adesk::kTrue)
virtual Acad::ErrorStatus  | audit (AcDbAuditInfo *)
Performs the audit operation for this object. More...
Acad::ErrorStatus  | cancel ()
Reverts all changes since the object had been opened and closes the object. More...
virtual void  | cancelled (const AcDbObject *)
A handler function for persistent reactors. More...
virtual AcRxObject *  | clone () const
Creates a shallow clone of this object. More...
Acad::ErrorStatus  | close ()
Closes the object. More...
Acad::ErrorStatus  | closeAndPage (Adesk::Boolean=Adesk::kTrue)
Closes the object. More...
virtual Acad::ErrorStatus  | composeForLoad (AcDb::OdaSaveType, AcDb::AcDbDwgVersion)
This function is intended for future MT file loading support. More...
virtual void  | copied (const AcDbObject *, const AcDbObject *)
A handler function for persistent reactors. More...
virtual Acad::ErrorStatus  | copyFrom (const AcRxObject *)
Copies the pSrc object information in this object. More...
Acad::ErrorStatus  | createExtensionDictionary ()
Creates a dictionary as extension dictionary for this object. More...
AcDbDatabase *  | database () const
Returns the database that contains this object. More...
virtual Acad::ErrorStatus  | decomposeForSave (AcDb::AcDbDwgVersion, AcDbObject *&, AcDbObjectId &, Adesk::Boolean &)
This function is called during dwg and dxf output, to allow a custom object to decompose itself, due to provided dwg/dxf target file version. More...
virtual Acad::ErrorStatus  | deepClone (AcDbObject *, AcDbObject *&, AcDbIdMapping &, Adesk::Boolean=Adesk::kTrue) const final
Clones this object, appends it to the owner pOwner and adds an AcDbIdPair record to the idMap. More...
void  | disableUndoRecording (Adesk::Boolean)
Disables or enables the undo recording for the object. More...
Acad::ErrorStatus  | downgradeOpen ()
Sets the open mode for an object opened for write to be opened for read. More...
Acad::ErrorStatus  | downgradeToNotify (Adesk::Boolean)
Sets the open mode for an object opened for write to be opened for notify. More...
virtual AcGiDrawable *  | drawable ()
Retrieves the AcGiDrawable instance of this object. More...
Acad::ErrorStatus  | dwgIn (AcDbDwgFiler *)
Calls the object's dwgInFields function, and reads any XData if present. More...
virtual Acad::ErrorStatus  | dwgInFields (AcDbDwgFiler *)
Reads the object from the DWG filer. More...
Acad::ErrorStatus  | dwgOut (AcDbDwgFiler *) const
Calls the object's dwgOutFields function, and writes any XData if present. More...
virtual Acad::ErrorStatus  | dwgOutFields (AcDbDwgFiler *) const
Writes the object to the DWG filer. More...
Acad::ErrorStatus  | dxfIn (AcDbDxfFiler *)
Calls the object's dxfInFields function, and reads any XData if present. More...
virtual Acad::ErrorStatus  | dxfInFields (AcDbDxfFiler *)
Reads the object from the DXF filer. More...
Acad::ErrorStatus  | dxfOut (AcDbDxfFiler *, Adesk::Boolean, Adesk::uchar *) const
Calls the object's dxfOutFields function, and writes any XData if present. More...
virtual Acad::ErrorStatus  | dxfOutFields (AcDbDxfFiler *) const
Writes the object to the DXF filer. More...
Acad::ErrorStatus  | erase (Adesk::Boolean=Adesk::kTrue)
Sets the bit that indicates that the object is erased. More...
virtual void  | erased (const AcDbObject *, Adesk::Boolean)
A handler function for persistent reactors. More...
AcDbObjectId  | extensionDictionary () const
Returns the object id of the extension dictionary for this object. More...
void  | getAcDbHandle (AcDbHandle &) const
Returns handle of this object. More...
Acad::ErrorStatus  | getBinaryData (const ACHAR *, Adesk::Int32 &, char *&) const
Creates a copy of the binary data stored as chunks of maximum 127 bytes in the resbuf chain of this object's extension dictionary xrecord entry given by entryName. More...
int  | getBrxOpenCount () const
This function returns the number of open BRX instances for this object. More...
int  | getBrxOpenState () const
This function returns the BRX object open state flags as bitfields, for diagnostic purpose. More...
virtual Acad::ErrorStatus  | getClassID (CLSID *) const final
Gets the COM wrapper Class ID for this entity. More...
int  | getCustomObjectState () const
This function returns the custom object status : 1=isCustomObject 2=DifferentialUndoDisabled. More...
Acad::ErrorStatus  | getField (const ACHAR *, AcDbField *&, AcDb::OpenMode) const
Retrieves the specified Field from this object, and opens it in mode. More...
Acad::ErrorStatus  | getField (const ACHAR *, AcDbObjectId &) const
Gets the pszPropName field object from field dictionary of this AcDbObject object, using pszPropName as key. More...
AcDbObjectId  | getFieldDictionary () const
Returns the Field dictionary associated with this object,. More...
Acad::ErrorStatus  | getFieldDictionary (AcDbDictionary *&, AcDb::OpenMode) const
Gets and opens the field dictionary for this. More...
Acad::ErrorStatus  | getObjectBirthVersion (AcDb::AcDbDwgVersion &, AcDb::MaintenanceReleaseVersion &)
This function is currently not supported by the CAD engine, always returns Acad::eOk, and 'kDHL_CURRENT' + 'kMReleaseCurrent' results. More...
virtual Acad::ErrorStatus  | getObjectSaveVersion (const AcDbDwgFiler *, AcDb::AcDbDwgVersion &, AcDb::MaintenanceReleaseVersion &)
Returns the DWG version for saving the object. More...
virtual Acad::ErrorStatus  | getObjectSaveVersion (const AcDbDxfFiler *, AcDb::AcDbDwgVersion &, AcDb::MaintenanceReleaseVersion &)
Returns the DWG version for saving the object. More...
int  | getOdaOpenCount () const
This function returns the number of open ODA instances for this object. More...
int  | getOdaOpenState () const
This function returns the ODA object open state flags as bitfields, for diagnostic purpose. More...
virtual void  | goodbye (const AcDbObject *)
A handler function for persistent reactors. More...
Acad::ErrorStatus  | handOverTo (AcDbObject *, Adesk::Boolean=Adesk::kTrue, Adesk::Boolean=Adesk::kTrue)
Hands over objects identity to another object. More...
bool  | hasFields () const
Return true if this object has single or multiple fields associated with him. More...
bool  | hasPersistentReactor (AcDbObjectId) const
Checks the input objectId in this object reactor list. More...
bool  | hasSaveVersionOverride ()
This function indicates whether this object overrides the filer's save version. More...
virtual AcDbObjectId  | id () const
Returns the database id of this object. More...
Adesk::Boolean  | isAcDbObjectIdsInFlux () const
Checks whether a deep clone operation was completed. More...
Adesk::Boolean  | isAProxy () const
Adesk::Boolean  | isCancelling () const
Adesk::Boolean  | isErased () const
Returns whether this object is erased. More...
Adesk::Boolean  | isEraseStatusToggled () const
Checks whether the object erase status has been toggled. More...
Adesk::Boolean  | isModified () const
Returns whether this object's assertWriteEnabled() has been called since it was opened. More...
Adesk::Boolean  | isModifiedGraphics () const
Checks whether this object graphics will be updated when the object is closed. More...
Adesk::Boolean  | isModifiedXData () const
Checks whether this object's xData was modified. More...
Adesk::Boolean  | isNewObject () const
Returns true if and only if this object has not been closed since it was created. More...
Adesk::Boolean  | isNotifyEnabled () const
Returns whether this object is opened for notify. More...
Adesk::Boolean  | isNotifying () const
virtual Adesk::Boolean  | isPersistent () const
Returns the 'persistent' status of a database object. More...
Adesk::Boolean  | isReadEnabled () const
Returns whether this object is opened for read. More...
 Adesk::Boolean  | isReallyClosing () const
Checks whether the next close call will completely close this object return true if on the next call the object will be completely closed false otherwise.
Adesk::Boolean  | isTransactionResident () const
Gets the object transaction status. More...
Adesk::Boolean  | isUndoing () const
bool  | isUndoRecordingDisabled () const
Returns whether the undo recording for the object is enabled or not. More...
Adesk::Boolean  | isWriteEnabled () const
Returns whether this object is opened for write. More...
virtual AcDb::DuplicateRecordCloning  | mergeStyle () const
Returns the object's merge behavior during cloning. More...
virtual void  | modified (const AcDbObject *)
A handler function for persistent reactors. More...
virtual void  | modifiedGraphics (const AcDbEntity *)
A handler function for persistent reactors. More...
virtual void  | modifiedXData (const AcDbObject *)
A handler function for persistent reactors. More...
virtual void  | modifyUndone (const AcDbObject *)
A handler function for persistent reactors. More...
virtual void  | objectClosed (const AcDbObjectId)
A handler function for persistent reactors. More...
AcDbObjectId  | objectId () const
Returns object id. More...
virtual void  | openedForModify (const AcDbObject *)
A handler function for persistent reactors. More...
AcDbObjectId  | ownerId () const
Returns object id of the owner. More...
AcDbVoidPtrArray *  | reactors ()
Gets the object pointers to reactors. More...
const AcDbVoidPtrArray *  | reactors () const
Gets the object pointers to reactors. More...
virtual void  | reappended (const AcDbObject *)
A handler function for persistent reactors. More...
 virtual void  | recvPropagateModify (const AcDbObject *)
Not implemented yet.
Acad::ErrorStatus  | releaseExtensionDictionary ()
Removes the extension dictionary associated with this object. More...
virtual Acad::ErrorStatus  | removeField (AcDbObjectId)
Removes the Field specified by acFieldId from this object. More...
virtual Acad::ErrorStatus  | removeField (const ACHAR *)
Removes the Field specified by szKeyString from this object. More...
virtual Acad::ErrorStatus  | removeField (const ACHAR *, AcDbObjectId &)
Removes the Field specified by acPszKeyString from this object, and returns its ObjectId value. More...
virtual Acad::ErrorStatus  | removePersistentReactor (AcDbObjectId)
Removes a persistent reactor from this object reactor list. More...
Acad::ErrorStatus  | removeReactor (AcDbObjectReactor *) const
Removes a transient reactor to this object. More...
void  | setAcDbObjectIdsInFlux ()
Call this function to indicate that the object IDs of this object and its sub-objects (if any) are not yet valid. More...
Acad::ErrorStatus  | setBinaryData (const ACHAR *, Adesk::Int32, const char *)
Creates a copy of the binary data, divides it in up to 127 bytes binary chunks and
 sets them as resbufs in the resbuf chain of this object's extension dictionary xrecord entry given by entryName. More...
virtual Acad::ErrorStatus  | setField (const ACHAR *, AcDbField *, AcDbObjectId &)
Adds the pAcField field object to field dictionary of this AcDbObject object, using pKey as key. More...
void  | setHasSaveVersionOverride (bool)
This function can be called to specify that the object has a "save version override". More...
virtual Acad::ErrorStatus  | setOwnerId (AcDbObjectId)
Sets the ownerId data member of the object to be objId. More...
virtual Acad::ErrorStatus  | setXData (const resbuf *)
Sets/removes xData associated with this object. More...
virtual Acad::ErrorStatus  | subCancel ()
Possibility to veto a cancel operation from within custom entities. More...
virtual Acad::ErrorStatus  | subClose ()
virtual Acad::ErrorStatus  | subErase (Adesk::Boolean)
This hook is called during an AcDbObject::erase call, before any actual erase operation is performed. More...
 virtual Acad::ErrorStatus  | subHandOverTo (AcDbObject *)
virtual void  | subObjModified (const AcDbObject *, const AcDbObject *)
A handler function for persistent reactors. More...
 virtual Acad::ErrorStatus  | subOpen (AcDb::OpenMode)
virtual Acad::ErrorStatus  | subSwapIdWith (AcDbObjectId, Adesk::Boolean=Adesk::kFalse, Adesk::Boolean=Adesk::kFalse)
This hook is called during an AcDbObject::swapIdWith() call, before any actual swap operation is performed. More...
Acad::ErrorStatus  | swapIdWith (AcDbObjectId, Adesk::Boolean=Adesk::kFalse, Adesk::Boolean=Adesk::kFalse)
Swaps the object id's between the object identified by param swapId and this object. More...
virtual Acad::ErrorStatus  | swapReferences (const AcDbIdMapping &)
Not implemented yet. More...
virtual void  | unappended (const AcDbObject *)
A handler function for persistent reactors. More...
AcDbDwgFiler *  | undoFiler ()
Gets the undo filer for this object. More...
Acad::ErrorStatus  | upgradeFromNotify (Adesk::Boolean &)
Upgrades the open status of this object to AcDb::kForWrite, if this object is already open (either in AcDb::kForRead, AcDb::kForNotify or AcDb::kForWrite) More...
Acad::ErrorStatus  | upgradeOpen ()
Changes the objects open mode to AcDb::kForWrite and sends notifications. More...
virtual Acad::ErrorStatus  | wblockClone (AcRxObject *, AcDbObject *&, AcDbIdMapping &, Adesk::Boolean=Adesk::kTrue) const final
Clones this object, appends it to the owner pOwner and adds an AcDbIdPair record to the idMap. More...
virtual resbuf *  | xData (const ACHAR *=NULL) const
Returns the xData associated with this object. More...
Acad::ErrorStatus  | xDataTransformBy (const AcGeMatrix3d &)
Transforms the extended data according to parameter transformation matrix. More...
 virtual void  | xmitPropagateModify () const
Not implemented yet.
 virtual  | ~AcDbObject ()
Destructor.
 Public Member Functions inherited from AcGiDrawable
virtual bool  | bounds (AcDbExtents &) const
virtual DrawableType  | drawableType () const
 virtual AcGiDrawStream *  | drawStream () const
 AcGsNode *  | gsNode () const
virtual AcDbObjectId  | id () const =0
virtual Adesk::Boolean  | isPersistent () const =0
virtual Adesk::UInt32  | regenSupportFlags () const final
Returns whether and to which level this object supports MultiThreading. More...
 virtual Adesk::Boolean  | RolloverHit (Adesk::ULongPtr, Adesk::ULongPtr, Adesk::Boolean)
 virtual Adesk::UInt32  | setAttributes (AcGiDrawableTraits *) final
 virtual void  | setDrawStream (AcGiDrawStream *)
 void  | setGsNode (AcGsNode *)
 virtual void  | viewportDraw (AcGiViewportDraw *) final
 virtual Adesk::UInt32  | viewportDrawLogicalFlags (AcGiViewportDraw *) final
 virtual Adesk::Boolean  | worldDraw (AcGiWorldDraw *) final
 Public Member Functions inherited from AcRxObject
virtual AcRxObject *  | clone () const
Exported and implemented. More...
 virtual AcRx::Ordering  | comparedTo (const AcRxObject *) const
Exported and implemented.
virtual Acad::ErrorStatus  | copyFrom (const AcRxObject *)
Exported and implemented. More...
 virtual AcRxClass *  | isA () const
Exported and implemented.
virtual Adesk::Boolean  | isEqualTo (const AcRxObject *) const
Exported and implemented. More...
bool  | isKindOf (const AcRxClass *) const
Checks the object class. More...
AcRxObject *  | queryX (const AcRxClass *) const
returns the protocol extension object assigned to this class or a parent class. More...
AcRxObject *  | x (const AcRxClass *) const
returns the protocol extension object assigned to this class or a parent class. More...
 virtual  | ~AcRxObject ()
Destructor.
 Public Attributes
AcDbViewport
Default constructor.
 Public Attributes inherited from AcDbEntity
AcDbEntity
This protected constructor sets the initial value for color to 257, and for the objectids for layer and linetype to AcDbObjectId::kNull. More...
 Protected Member Functions
virtual Acad::ErrorStatus  | subGetTransformedCopy (const AcGeMatrix3d &, AcDbEntity *&) const
virtual Adesk::UInt32  | subSetAttributes (AcGiDrawableTraits *)
virtual Adesk::Boolean  | subWorldDraw (AcGiWorldDraw *)
 Protected Member Functions inherited from AcDbEntity
 virtual Acad::ErrorStatus  | subAddSubentPaths (const AcDbFullSubentPathArray &)
 virtual Adesk::Boolean  | subCloneMeForDragging ()
 virtual Acad::ErrorStatus  | subDeleteSubentPaths (const AcDbFullSubentPathArray &)
virtual Acad::ErrorStatus  | subExplode (AcDbVoidPtrArray &) const
 virtual Acad::ErrorStatus  | subGetCompoundObjectTransform (AcGeMatrix3d &) const
virtual Acad::ErrorStatus  | subGetGeomExtents (AcDbExtents &) const
virtual Acad::ErrorStatus  | subGetGripEntityUCS (const void *, AcGeVector3d &, AcGePoint3d &, AcGeVector3d &) const
virtual Acad::ErrorStatus  | subGetGripPoints (AcDbGripDataPtrArray &, const double, const int, const AcGeVector3d &, const int) const
virtual Acad::ErrorStatus  | subGetGripPoints (AcGePoint3dArray &, AcDbIntArray &, AcDbIntArray &) const
 virtual Acad::ErrorStatus  | subGetGripPointsAtSubentPath (const AcDbFullSubentPath &, AcDbGripDataPtrArray &, const double, const int, const AcGeVector3d &, const int) const
virtual Acad::ErrorStatus  | subGetGsMarkersAtSubentPath (const AcDbFullSubentPath &, AcArray< Adesk::GsMarker > &) const
virtual Acad::ErrorStatus  | subGetOsnapPoints (AcDb::OsnapMode, Adesk::GsMarker, const AcGePoint3d &, const AcGePoint3d &, const AcGeMatrix3d &, AcGePoint3dArray &, AcDbIntArray &) const
 virtual Acad::ErrorStatus  | subGetOsnapPoints (AcDb::OsnapMode, Adesk::GsMarker, const AcGePoint3d &, const AcGePoint3d &, const AcGeMatrix3d &, AcGePoint3dArray &, AcDbIntArray &, const AcGeMatrix3d &) const
virtual Acad::ErrorStatus  | subGetStretchPoints (AcGePoint3dArray &) const
 virtual Acad::ErrorStatus  | subGetSubentClassId (const AcDbFullSubentPath &, CLSID *) const
 virtual Acad::ErrorStatus  | subGetSubentPathGeomExtents (const AcDbFullSubentPath &, AcDbExtents &) const
virtual Acad::ErrorStatus  | subGetSubentPathsAtGsMarker (AcDb::SubentType, Adesk::GsMarker, const AcGePoint3d &, const AcGeMatrix3d &, int &, AcDbFullSubentPath *&, int=0, AcDbObjectId *=nullptr) const
virtual Acad::ErrorStatus  | subGetTransformedCopy (const AcGeMatrix3d &, AcDbEntity *&) const
virtual void  | subGripStatus (const AcDb::GripStat)
 virtual bool  | subHideMeForDragging () const
virtual Acad::ErrorStatus  | subHighlight (const AcDbFullSubentPath &=kNullSubent, const Adesk::Boolean=false) const
virtual Acad::ErrorStatus  | subIntersectWith (const AcDbEntity *, AcDb::Intersect, AcGePoint3dArray &, Adesk::GsMarker=0, Adesk::GsMarker=0) const
virtual Acad::ErrorStatus  | subIntersectWith (const AcDbEntity *, AcDb::Intersect, const AcGePlane &, AcGePoint3dArray &, Adesk::GsMarker=0, Adesk::GsMarker=0) const
virtual bool  | subIsContentSnappable () const
virtual void  | subList () const
virtual Acad::ErrorStatus  | subMoveGripPointsAt (const AcDbIntArray &, const AcGeVector3d &)
virtual Acad::ErrorStatus  | subMoveGripPointsAt (const AcDbVoidPtrArray &, const AcGeVector3d &, const int)
 virtual Acad::ErrorStatus  | subMoveGripPointsAtSubentPaths (const AcDbFullSubentPathArray &, const AcDbVoidPtrArray &, const AcGeVector3d &, const int)
virtual Acad::ErrorStatus  | subMoveStretchPointsAt (const AcDbIntArray &, const AcGeVector3d &)
virtual Adesk::UInt32  | subSetAttributes (AcGiDrawableTraits *)
Sets the values of this object's subentity traits and returns with the calling object's subentity traits. More...
virtual Acad::ErrorStatus  | subSetVisibility (AcDb::Visibility, Adesk::Boolean=true)
 virtual void  | subSubentGripStatus (const AcDb::GripStat, const AcDbFullSubentPath &)
virtual AcDbEntity *  | subSubentPtr (const AcDbFullSubentPath &) const
virtual Acad::ErrorStatus  | subTransformBy (const AcGeMatrix3d &)
 virtual Acad::ErrorStatus  | subTransformSubentPathsBy (const AcDbFullSubentPathArray &, const AcGeMatrix3d &)
virtual Acad::ErrorStatus  | subUnhighlight (const AcDbFullSubentPath &=kNullSubent, const Adesk::Boolean=false) const
virtual void  | subViewportDraw (AcGiViewportDraw *)
 virtual AcDb::Visibility  | subVisibility () const
virtual Adesk::Boolean  | subWorldDraw (AcGiWorldDraw *)
 Protected Member Functions inherited from AcDbObject
virtual Acad::ErrorStatus  | subDeepClone (AcDbObject *, AcDbObject *&, AcDbIdMapping &, Adesk::Boolean=true) const
virtual Acad::ErrorStatus  | subGetClassID (CLSID *) const
virtual Adesk::UInt32  | subSetAttributes (AcGiDrawableTraits *)
Sets the values of this object's subentity traits and returns with the calling object's subentity traits. More...
virtual void  | subViewportDraw (AcGiViewportDraw *)
virtual Adesk::UInt32  | subViewportDrawLogicalFlags (AcGiViewportDraw *)
virtual Acad::ErrorStatus  | subWblockClone (AcRxObject *, AcDbObject *&, AcDbIdMapping &, Adesk::Boolean=true) const
virtual Adesk::Boolean  | subWorldDraw (AcGiWorldDraw *)
 Protected Member Functions inherited from AcGiDrawable
virtual Adesk::UInt32  | subRegenSupportFlags () const
Returns whether and to which level this object supports MultiThreading. More...
virtual Adesk::UInt32  | subSetAttributes (AcGiDrawableTraits *)=0
virtual void  | subViewportDraw (AcGiViewportDraw *)=0
 virtual Adesk::UInt32  | subViewportDrawLogicalFlags (AcGiViewportDraw *)
virtual Adesk::Boolean  | subWorldDraw (AcGiWorldDraw *)=0
 Protected Member Functions inherited from AcRxObject
AcRxObject ()
Exported and implemented.
 Additional Inherited Members
 Static Public Member Functions inherited from AcRxObject
 static AcRxObject *  | cast (const AcRxObject *)
 static AcRxClass *  | desc ()
Exported and implemented.
 Static Public Member Functions inherited from AcHeapOperators
 static void  | operator delete (void *)
_
 static void  | operator delete (void *, const char *, int)
 static void  | operator delete (void *, void *)
 static void  | operator delete[] (void *)
_
 static void  | operator delete[] (void *, const char *, int)
 static void *  | operator new (size_t)
_
 static void *  | operator new (size_t, const char *, int)
 static void *  | operator new (size_t, void *p)
 static void *  | operator new[] (size_t)
_
 static void *  | operator new[] (size_t, const char *, int)
Detailed Description
_
Member Function Documentation
◆ ambientLightColor()
 UX_EXPORT_FUNCTION AcCmColor AcDbViewport::ambientLightColor  |  ( |   | ) |   const
Gets this vieport's view ambient light color.
Returns
AcCmColor object
◆ annotationScale()
 UX_EXPORT_FUNCTION AcDbAnnotationScale * AcDbViewport::annotationScale  |  ( |   | ) |   const
Returns a clone of the AcDbAnnotationscale, which is associated with this viewport; calling application MUST explicitly delete the returned object.
Returns
clone of the AcDbAnnotationScale instance, associated with this viewport
◆ backClipDistance()
 UX_EXPORT_FUNCTION double AcDbViewport::backClipDistance  |  ( |   | ) |   const
Gets the target - back clip plane distance.
Returns
positive if target is behind the back clip plane, negative otherwise
◆ background()
 UX_EXPORT_FUNCTION AcDbObjectId AcDbViewport::background  |  ( |   | ) |   const
Returns the AcDbObjectId of assigned background object.
Returns
AcDbObjectId of background object
◆ brightness()
 UX_EXPORT_FUNCTION double AcDbViewport::brightness  |  ( |   | ) |   const
Gets this vieport's view bightness.
Returns
brightness factor
◆ centerPoint()
 UX_EXPORT_FUNCTION AcGePoint3d AcDbViewport::centerPoint  |  ( |   | ) |   const
Gets this Viewport center point.
Returns
center point as 3d point
◆ circleSides()
 UX_EXPORT_FUNCTION Adesk::UInt16 AcDbViewport::circleSides  |  ( |   | ) |   const
Gets the circle zoom percent of this viewport.
Returns
circle zoom percent
◆ contrast()
 UX_EXPORT_FUNCTION double AcDbViewport::contrast  |  ( |   | ) |   const
Gets this vieport's view contrast.
Returns
contrast factor
◆ copied()
 UX_EXPORT_FUNCTION void AcDbViewport::copied  |  ( |  const AcDbObject *  |  objToCopy,
|  const AcDbObject *  |  copiedObj
)
virtual
See also
AcDbEntity::copied(const AcDbObject*, const AcDbObject*)
Reimplemented from AcDbObject.
◆ customScale()
 UX_EXPORT_FUNCTION double AcDbViewport::customScale  |  ( |   | ) |   const
Returns the custom scale for this Viewport's view.
Returns
custom view scale
◆ defaultLightingType()
 UX_EXPORT_FUNCTION AcGiViewportTraits::DefaultLightingType AcDbViewport::defaultLightingType  |  ( |   | ) |   const
Gets this vieport's view default lighting type.
Returns
one or two distant lights
◆ effectivePlotStyleSheet()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbViewport::effectivePlotStyleSheet  |  ( |  const ACHAR *&  |  sheetName | )
Returns the effective PlotStyle sheet name.
Parameters
[out] | sheetName | - the name of the PlotStyle sheet (not to be released)
Returns
Acad::eOk for success, or error status
◆ elevation()
 UX_EXPORT_FUNCTION double AcDbViewport::elevation  |  ( |   | ) |   const
Gets this vieport's view elevation.
Returns
elevation of the UCS plane
◆ erased()
 UX_EXPORT_FUNCTION void AcDbViewport::erased  |  ( |  const AcDbObject *  |  erasedObj,
|  Adesk::Boolean  |  bIsErased
)
virtual
See also
AcDbEntity::erased(const AcDbObject*, Adesk::Boolean)
Date
2008-12-06 lucd implemented
Reimplemented from AcDbObject.
◆ freezeLayersInViewport()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbViewport::freezeLayersInViewport  |  ( |  const AcDbObjectIdArray &  |  arLayerIds | )
Freezes the given Layers in this Viewport.
Parameters
[in] | arLayerIds | list of layers to freeze
Returns
eOk if successful
◆ frontClipDistance()
 UX_EXPORT_FUNCTION double AcDbViewport::frontClipDistance  |  ( |   | ) |   const
Gets the target - front clip plane distance.
Returns
positive if target is behind the front clip plane, negative otherwise
◆ getFrozenLayerList()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbViewport::getFrozenLayerList  |  ( |  AcDbObjectIdArray &  |  arLayerIds | ) |   const
Returns the list of Layers which are currently frozen in this Viewport.
Parameters
[in,out] | arLayerIds | list of frozen layers
Returns
eOk if successful
Remarks
the 'arLayerIds' is not initially cleared - application should provide an empty array
◆ getUcs()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbViewport::getUcs  |  ( |  AcGePoint3d &  |  originPoint,
|  AcGeVector3d &  |  xVec,
|  AcGeVector3d &  |  yVec
) |   |  const
Gets the origin, X-axis, and Y-Axis of the UCS associated with this Viewport.
Parameters
[out] | originPoint | UCS origin
[out] | xVec | UCS X axis
[out] | yVec | UCS Y axis
Returns
Acad::eOk if successful
◆ gridIncrement()
 UX_EXPORT_FUNCTION AcGeVector2d AcDbViewport::gridIncrement  |  ( |   | ) |   const
Gets the X and Y spacing of the grid as a AcGeVector2d object.
Returns
vector storing X and Y grid spacing as X and Y coordinates, respectively
◆ height()
 UX_EXPORT_FUNCTION double AcDbViewport::height  |  ( |   | ) |   const
Gets the height for this Viewport's view.
Returns
viewport height
◆ hiddenLinesRemoved()
 UX_EXPORT_FUNCTION bool AcDbViewport::hiddenLinesRemoved  |  ( |   | ) |   const
Checks if this viewport is set to remove the hidden lines during plotting.
Returns
true if hidden lines are set to be removed, false otherwise
◆ isBackClipOn()
 UX_EXPORT_FUNCTION bool AcDbViewport::isBackClipOn  |  ( |   | ) |   const
Returns whether the back clipping for this Viewport is currently active (on)
Returns
true, if the back clipping is active, false otherwise
◆ isDefaultLightingOn()
 UX_EXPORT_FUNCTION bool AcDbViewport::isDefaultLightingOn  |  ( |   | ) |   const
Checks if default lighting is enabled for this vieport's view.
Returns
true if default lighting is on, false otherwise
◆ isFastZoomOn()
 UX_EXPORT_FUNCTION bool AcDbViewport::isFastZoomOn  |  ( |   | ) |   const
Returns whether the 'Fast-Zoom' for this Viewport's view is on or off.
Returns
always true
◆ isFrontClipAtEyeOn()
 UX_EXPORT_FUNCTION bool AcDbViewport::isFrontClipAtEyeOn  |  ( |   | ) |   const
Returns whether the front clipping plane is currently located at camera position.
Returns
true, if the front clipping plane is currently located at camera position, false otherwise
◆ isFrontClipOn()
 UX_EXPORT_FUNCTION bool AcDbViewport::isFrontClipOn  |  ( |   | ) |   const
Returns whether the front clipping for this Viewport is currently active (on)
Returns
true, if the front clipping is active, false otherwise
◆ isGridOn()
 UX_EXPORT_FUNCTION bool AcDbViewport::isGridOn  |  ( |   | ) |   const
Returns whether the Viewport's grid is displayed.
Returns
true, if the Viewport's grid is displayed; false otherwise
◆ isLayerFrozenInViewport()
 UX_EXPORT_FUNCTION bool AcDbViewport::isLayerFrozenInViewport  |  ( |  const AcDbObjectId &  |  layerId | ) |   const
Test whether a given Layer is frozen in this Viewport.
Parameters
[in] | layerId | ObjectId of the Layer to test
Returns
true if the Layer is frozen, otherwise false
◆ isLocked()
 UX_EXPORT_FUNCTION bool AcDbViewport::isLocked  |  ( |   | ) |   const
Returns whether the Viewport's scale is locked.
Returns
true, if the Viewport's scale is locked, false otherwise
◆ isNonRectClipOn()
 UX_EXPORT_FUNCTION bool AcDbViewport::isNonRectClipOn  |  ( |   | ) |   const
Returns whether the non-rectangular clipping is active for this Viewport.
Returns
true, if the non-rectangular clipping is active; false otherwise
◆ isOn()
 UX_EXPORT_FUNCTION bool AcDbViewport::isOn  |  ( |   | ) |   const
Returns whether the Viewport is active and on the active layout.
Returns
true, if the the Viewport is on the active layout and active
◆ isPerspectiveOn()
 UX_EXPORT_FUNCTION bool AcDbViewport::isPerspectiveOn  |  ( |   | ) |   const
Returns whether the Viewport is in perspective view mode currently.
Returns
true, if the Viewport is in perspective view
◆ isSnapIsometric()
 UX_EXPORT_FUNCTION bool AcDbViewport::isSnapIsometric  |  ( |   | ) |   const
Checks if this viewport has isometric snap mode set.
Returns
true if snap mode is isometric, false otherwise
◆ isSnapOn()
 UX_EXPORT_FUNCTION bool AcDbViewport::isSnapOn  |  ( |   | ) |   const
Checks if this viewport has snap mode turned on.
Returns
trie if snap mode is on, false otherwise
◆ isTransparent()
 UX_EXPORT_FUNCTION bool AcDbViewport::isTransparent  |  ( |   | ) |   const
Returns whether the Viewport is set to transparent mode.
Returns
true, if the Viewport is set to transparent; false otherwise
◆ isUcsFollowModeOn()
 UX_EXPORT_FUNCTION bool AcDbViewport::isUcsFollowModeOn  |  ( |   | ) |   const
Returns whether the Viewport will create a plan view whenever the UCS changes.
Returns
true, if the Viewport will create a plan after UCS changes, false otherwise
◆ isUcsIconAtOrigin()
 UX_EXPORT_FUNCTION bool AcDbViewport::isUcsIconAtOrigin  |  ( |   | ) |   const
Checks if this viewport has UcsIconAtOrigin mode on.
Returns
true if UcsIconAtOrigin is on, false otherwise
◆ isUcsIconVisible()
 UX_EXPORT_FUNCTION bool AcDbViewport::isUcsIconVisible  |  ( |   | ) |   const
Checks if this viewport has UcsIconVisible mode set on.
Returns
true if UcsIconVisible mode is on, false otherwise
◆ isUcsOrthographic()
 UX_EXPORT_FUNCTION bool AcDbViewport::isUcsOrthographic  |  ( |  AcDb::OrthographicView &  |  viewType | ) |   const
Returns whether this viewport uses an UCS with an orthographic view.
Returns
bool - true, if the viewport uses an UCS with an orthographic view
◆ isUcsSavedWithViewport()
 UX_EXPORT_FUNCTION bool AcDbViewport::isUcsSavedWithViewport  |  ( |   | ) |   const
Returns whether the Viewport will also save and restore the current UCS whenever the view is saved.
Returns
true, if the Viewport will save and restore the UCS along with the view
◆ isViewOrthographic()
 UX_EXPORT_FUNCTION bool AcDbViewport::isViewOrthographic  |  ( |  AcDb::OrthographicView &  |  viewType | ) |   const
Checks whether the view is orthographic with respect to UCSBASE.
Parameters
[out] | viewType | the orthographic view direction
Returns
bool - true, if the viewport is orthographic
◆ lensLength()
 UX_EXPORT_FUNCTION double AcDbViewport::lensLength  |  ( |   | ) |   const
Returns the lense length when the Viewport is in perspective view mode.
Returns
lense length
◆ modified()
 void AcDbViewport::modified  |  ( |  const AcDbObject *  |   | )
virtual
Reimplemented from AcDbObject.
◆ nonRectClipEntityId()
 UX_EXPORT_FUNCTION AcDbObjectId AcDbViewport::nonRectClipEntityId  |  ( |   | ) |   const
Returns the clipping entity for this Viewport.
Returns
Acad::eOk if successful, error status otherwise
◆ number()
 UX_EXPORT_FUNCTION Adesk::Int16 AcDbViewport::number  |  ( |   | ) |   const
Returns the ID number of this Viewport.
Returns
target viewport
◆ plotStyleSheet() [1/2]
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbViewport::plotStyleSheet  |  ( |  ACHAR *&  |  sheetName | ) |   const
Returns the associated PlotStyle sheet name.
Parameters
[out] | sheetName | - the name of the PlotStyle sheet (to be released by 'acutDelString()')
Returns
Acad::eOk for success, or error status
◆ plotStyleSheet() [2/2]
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbViewport::plotStyleSheet  |  ( |  const ACHAR *&  |  sheetName | ) |   const
Returns the associated PlotStyle sheet name.
Parameters
[out] | sheetName | - the name of the PlotStyle sheet (not to be released)
Returns
Acad::eOk for success, or error status
◆ removeHiddenLines()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbViewport::removeHiddenLines  |  ( |   | )
Makes this viewport to remove hidden lines during plotting.
Returns
Acad::eOk if successful
◆ renderMode()
 UX_EXPORT_FUNCTION AcDbAbstractViewTableRecord::RenderMode AcDbViewport::renderMode  |  ( |   | ) |   const
Gets this vieport's view render mode.
Returns
mode used to render shading
◆ setAmbientLightColor()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbViewport::setAmbientLightColor  |  ( |  const AcCmColor &  |  color | )
Sets the ambient light color using the AcCmColor object passed in.
Parameters
[in] | color | value to be set
Returns
Acad::eOk if successful
◆ setAnnotationScale()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbViewport::setAnnotationScale  |  ( |  const AcDbAnnotationScale *  |  pAnnoScale | )
Sets the AcDbAnnotationscale, which is associated with this viewport.
Parameters
[in] | AcDbAnnotationScale | object to be set for this viewport
Returns
Acad::eOk for success, or error status
◆ setBackClipDistance()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbViewport::setBackClipDistance  |  ( |  double  |  value | )
Sets the distance between the target and the back clip plane.
Parameters
[in] | value | positive: target is behind the back clip plane, negative: otherwise
Returns
Acad::eOk if successful
◆ setBackClipOff()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbViewport::setBackClipOff  |  ( |   | )
Sets the 'use back clip plane' off for this Viewport's view.
Returns
Acad::eOk if successful
◆ setBackClipOn()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbViewport::setBackClipOn  |  ( |   | )
Sets the 'use back clip plane' on for this Viewport's view.
Returns
Acad::eOk if successful
◆ setBackground()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbViewport::setBackground  |  ( |  AcDbObjectId  |  idBackground | )
Sets the AcDbAnnotationscale, which is associated with this viewport.
Parameters
[in] | AcDbAnnotationScale | object to be set for this viewport
Returns
Acad::eOk for success, or error status
◆ setBrightness()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbViewport::setBrightness  |  ( |  double  |  brightness | )
Sets the brightness for this viewport's view.
Parameters
[in] | brightness | value to be set
Returns
Acad::eOk if successful,
 Acad::eOutOfRange if value is not in the [-10.0, 10.0] interval
◆ setCenterPoint()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbViewport::setCenterPoint  |  ( |  const AcGePoint3d &  |  centerPoint | )
Sets the center point for this Viewport's view.
Parameters
[in] | centerPoint | viewport center
Returns
Acad::eOk if successful
◆ setCircleSides()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbViewport::setCircleSides  |  ( |  Adesk::UInt16  |  value | )
Sets this viewport's circle zoom percent.
Parameters
[in] | value | circle zoom percent
Returns
Acad::eOk if successful,
 Acad::eInvalidInput if value is not between 1 and 20000
◆ setContrast()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbViewport::setContrast  |  ( |  double  |  contrast | )
Sets the contrast for this viewport's view.
Parameters
[in] | contrast | value to be set
Returns
Acad::eOk if successful,
 Acad::eOutOfRange if value is not in the [-10.0, 10.0] interval
◆ setCustomScale()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbViewport::setCustomScale  |  ( |  double  |  customViewScale | )
Sets the custom scale for this Viewport's view.
Parameters
[in] | customViewScale | custom view scale
Returns
Acad::eOk if successful, error status otherwise
◆ setDefaultLightingOn()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbViewport::setDefaultLightingOn  |  ( |  bool  |  enable | )
Enables or disables the default lighting.
Parameters
[in] | brightness | if true enables default lighting, if false disables it
Returns
Acad::eOk if successful
◆ setDefaultLightingType()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbViewport::setDefaultLightingType  |  ( |  AcGiViewportTraits::DefaultLightingType  |  type | )
Sets the type of the default lighting for this viewport.
Parameters
[in] | type | value to be set
Returns
Acad::eOk if successful
◆ setElevation()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbViewport::setElevation  |  ( |  double  |  elevation | )
Sets the elevation of the UCS for this viewport's view.
Parameters
[in] | elevation | value to be set
Returns
Acad::eOk if successful
◆ setFastZoomOff()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbViewport::setFastZoomOff  |  ( |   | )
Sets the 'Fast-Zoom' off for this Viewport's view.
Returns
Acad::eOk if successful
◆ setFastZoomOn()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbViewport::setFastZoomOn  |  ( |   | )
Sets the 'Fast-Zoom' on for this Viewport's view.
Returns
Acad::eOk if successful
◆ setFrontClipAtEyeOff()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbViewport::setFrontClipAtEyeOff  |  ( |   | )
Sets the 'use front clip at eye position plane' off for this Viewport's view.
Returns
Acad::eOk if successful
◆ setFrontClipAtEyeOn()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbViewport::setFrontClipAtEyeOn  |  ( |   | )
Sets the 'use front clip at eye position plane' on for this Viewport's view.
Returns
Acad::eOk if successful
◆ setFrontClipDistance()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbViewport::setFrontClipDistance  |  ( |  double  |  value | )
Sets the distance between the target and the front clip plane.
Parameters
[in] | value | positive: target is behind the back clip plane, negative: otherwise
Returns
Acad::eOk if successful
◆ setFrontClipOff()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbViewport::setFrontClipOff  |  ( |   | )
Sets the 'use front clip plane' off for this Viewport's view.
Returns
Acad::eOk if successful
◆ setFrontClipOn()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbViewport::setFrontClipOn  |  ( |   | )
Sets the ' use front clip plane' on for this Viewport's view.
Returns
Acad::eOk if successful
◆ setGridIncrement()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbViewport::setGridIncrement  |  ( |  const AcGeVector2d &  |  spacingVect | )
Sets the X and Y spacings of the grid, using X and Y coordinates of spacingVect.
Parameters
[in] | spacingVect | vector containing X and Y spacing values for the grid
Returns
Acad::eOk if successful,
 Acad::eInvalidInput if X or Y values are less than zero
◆ setGridOff()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbViewport::setGridOff  |  ( |   | )
Sets the grid off for this Viewport's view.
Returns
Acad::eOk if successful
◆ setGridOn()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbViewport::setGridOn  |  ( |   | )
Sets the grid on for this Viewport's view.
Returns
Acad::eOk if successful
◆ setHeight()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbViewport::setHeight  |  ( |  double  |  value | )
Sets the height for this Viewport's view.
Parameters
[in] | value | viewport height
Returns
Acad::eOk if successful
◆ setLensLength()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbViewport::setLensLength  |  ( |  double  |  lenseLength | )
Sets the new lens length for this Viewport's view.
Parameters
[in] | lenseLength | the new lens length for the view, to be used when in perspective mode
Returns
Acad::eOk if successful
◆ setLocked()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbViewport::setLocked  |  ( |   | )
Locks the Vipewport's view scale.
Returns
Acad::eOk if successful, error status otherwise
◆ setNonRectClipEntityId()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbViewport::setNonRectClipEntityId  |  ( |  AcDbObjectId  |  clipObjectId | )
Sets the clipping entity for this Viewport.
Parameters
[in] | of | the clipping entity to be used
Returns
Acad::eOk if successful, error status otherwise
◆ setNonRectClipOff()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbViewport::setNonRectClipOff  |  ( |   | )
Sets the non-rectangular clipping off for this Viewport's view.
Returns
Acad::eOk if successful
◆ setNonRectClipOn()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbViewport::setNonRectClipOn  |  ( |   | )
Sets the non-rectangular clipping on for this Viewport's view.
Returns
Acad::eOk if successful
◆ setOff()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbViewport::setOff  |  ( |   | )
Sets the Viewport UCS off.
Returns
Acad::eOk if successful
◆ setOn()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbViewport::setOn  |  ( |   | )
Sets the Viewport UCS on.
Returns
Acad::eOk if successful
◆ setOpaque()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbViewport::setOpaque  |  ( |   | )
Sets the opaque view mode on for this Viewport's view.
Returns
Acad::eOk if successful
◆ setPerspectiveOff()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbViewport::setPerspectiveOff  |  ( |   | )
Sets the perspective view mode off for this Viewport's view.
Returns
Acad::eOk if successful
◆ setPerspectiveOn()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbViewport::setPerspectiveOn  |  ( |   | )
Sets the perspective view mode on for this Viewport's view.
Returns
Acad::eOk if successful
◆ setPlotStyleSheet()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbViewport::setPlotStyleSheet  |  ( |  const ACHAR *  |  sheetName | )
Assigns the PlotStyle sheet name to this viewport.
Parameters
[in] | sheetName | - the name of the PlotStyle sheet
Returns
Acad::eOk for success, or error status
◆ setRenderMode()
 UX_EXPORT_FUNCTION void AcDbViewport::setRenderMode  |  ( |  AcDbAbstractViewTableRecord::RenderMode  |  rm | )
Sets the render mode for this viewport.
Parameters
[in] | rm | value to be set
Returns
Acad::eOk if successful
◆ setShadePlot() [1/2]
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbViewport::setShadePlot  |  ( |  const  |  ShadePlotType | )
Sets the shade plot mode for this Viewport.
Parameters
[in] | AcDbViewport::ShadePlotType | shade plot mode to be used for this Viewport
Returns
Acad::eOk if successful, error status otherwise
◆ setShadePlot() [2/2]
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbViewport::setShadePlot  |  ( |  const  |  ShadePlotType,
|  const AcDbObjectId  |  shadePlotId
)
Sets the shade plot mode for this Viewport.
Parameters
[in] | AcDbViewport::ShadePlotType | shade plot mode to be used for this Viewport
[in] | of | the AcDbVisualStyle or AcDbRenderSettings object to be used
Returns
Acad::eOk if successful, error status otherwise
Remarks
if ShadePlotType is not kVisualStyle or kRenderPreset, the AcDbObjectId shadePlotId is ignored
◆ setSnapAngle()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbViewport::setSnapAngle  |  ( |  double  |  ang | )
Sets this viewport's snap angle.
Parameters
[in] | ang | value to set (in radians)
Returns
Acad::eOk if successful
◆ setSnapBasePoint()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbViewport::setSnapBasePoint  |  ( |  const AcGePoint2d &  |  point | )
Sets this viewport's base point.
Parameters
[in] | point | value for base point
Returns
Acad::eOk if successful
◆ setSnapIncrement()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbViewport::setSnapIncrement  |  ( |  const AcGeVector2d &  |  spacingVect | )
Sets the X and Y spacing of the snap grid, using X and Y coordinates of spacingVect.
Parameters
[in] | spacingVect | vector containing X and Y spacing values for the snap grid
Returns
Acad::eOk if successful,
 Acad::eInvalidInput if X or Y are less than 1.0E-13
◆ setSnapIsometric()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbViewport::setSnapIsometric  |  ( |   | )
Sets this viewport to isometric mode.
Returns
Acad::eOk if successful
◆ setSnapIsoPair()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbViewport::setSnapIsoPair  |  ( |  Adesk::UInt16  |  isoPair | )
Sets this viewport's snap isoPair.
Parameters
[in] | isoPair | value to set (0, 1 or 2)
Returns
Acad::eOk if successful,
 Acad::eInvalidInput if value is other than 0, 1 or 2
◆ setSnapOff()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbViewport::setSnapOff  |  ( |   | )
Sets snap mode off for this viewport.
Returns
Acad::eOk if successful
◆ setSnapOn()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbViewport::setSnapOn  |  ( |   | )
Sets snap mode on for this viewport.
Returns
Acad::eOk if successful,
 Acad::eInvalidContext if snap increment is not greater than zero
◆ setSnapStandard()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbViewport::setSnapStandard  |  ( |   | )
Sets this viewport to standard mode.
Returns
Acad::eOk if successful
◆ setStandardScale()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbViewport::setStandardScale  |  ( |  const StandardScaleType  |  scale | )
Sets the viewport scale.
Parameters
in | - scale = one of the predefined StandardScaleType values
◆ setSun()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbViewport::setSun  |  ( |  AcDbObjectId &  |  id,
|  AcDbObject *  |  pObjAcDbSun
)
The function associates an sun object with this viewport.
It associate an id for this.
Parameters
out | ID of the AcDbSun's object
in | pointer to the AcDbSun's object
Returns
Acad::eOk if successful and the object isn't associated with a different viewport. errorcode otherwise
◆ setTransparent()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbViewport::setTransparent  |  ( |   | )
Sets the transparent view mode on for this Viewport's view.
Returns
Acad::eOk if successful
◆ setTwistAngle()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbViewport::setTwistAngle  |  ( |  double  |  ang | )
Sets this viewport's view twist angle.
Parameters
[in] | ang | value to set (in radians)
Returns
Acad::eOk if successful
◆ setUcs() [1/3]
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbViewport::setUcs  |  ( |  AcDb::OrthographicView  |  viewType | )
Sets this viewport to use an UCS based on the specified orthographic view.
Parameters
[in] | viewType | - determines the UCS to be used
Returns
Acad::eOk, if successfull, or error status
◆ setUcs() [2/3]
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbViewport::setUcs  |  ( |  const AcDbObjectId &  |  ucsId | )
Sets the Vipewport's UCS to the named UCS given by its AcDbUcsTableRecord.
Parameters
[in] | of | the named UCS to set for the Viewport's current UCS
Returns
Acad::eOk if successful, error status otherwise
◆ setUcs() [3/3]
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbViewport::setUcs  |  ( |  const AcGePoint3d &  |  originPoint,
|  const AcGeVector3d &  |  xVec,
|  const AcGeVector3d &  |  yVec
)
Sets the current UCS for this Viewport's view.
Returns
Acad::eOk if successful
◆ setUcsFollowModeOff()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbViewport::setUcsFollowModeOff  |  ( |   | )
Sets the 'plan view after UCS change' off for this Viewport's view.
Returns
Acad::eOk if successful
◆ setUcsFollowModeOn()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbViewport::setUcsFollowModeOn  |  ( |   | )
Sets the 'plan view after UCS change' on for this Viewport's view.
Returns
Acad::eOk if successful
◆ setUcsIconAtCorner()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbViewport::setUcsIconAtCorner  |  ( |   | )
Sets ucsIconAtCorner mode for this viewport.
Returns
Acad::eOk if successful
◆ setUcsIconAtOrigin()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbViewport::setUcsIconAtOrigin  |  ( |   | )
Sets ucsIconAtOrigin mode for this viewport.
Returns
Acad::eOk if successful
◆ setUcsIconInvisible()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbViewport::setUcsIconInvisible  |  ( |   | )
Sets the ucs icon invisible for this viewport.
Returns
Acad::eOk if successful
◆ setUcsIconVisible()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbViewport::setUcsIconVisible  |  ( |   | )
Sets ucs icon visible for this viewport.
Returns
Acad::eOk if successful
◆ setUcsPerViewport()
 UX_EXPORT_FUNCTION void AcDbViewport::setUcsPerViewport  |  ( |  bool  |  ucsPerVP | )
Sets the 'UCS per Viewport' on or off for this Viewport.
Parameters
[in] | ucsPerVP
Remarks
if 'ucsPerVP' is true, then the UCS for the view is stored, when the Viewport is deactivated, and restored when the Viewport is activated (each view has its own UCS)
◆ setUcsToWorld()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbViewport::setUcsToWorld  |  ( |   | )
Sets the Viewport's view UCS to the Wolrd UCS.
Returns
Acad::eOk if successful, error status otherwise
◆ setUnlocked()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbViewport::setUnlocked  |  ( |   | )
Unlocks the Vipewport's view scale.
Returns
Acad::eOk if successful, error status otherwise
◆ setViewCenter()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbViewport::setViewCenter  |  ( |  const AcGePoint2d &  |  viewCenter | )
Sets the view center for this Viewport's view.
Parameters
[in] | viewCenter | view center for the Viewport's view
Returns
Acad::eOk if successful
◆ setViewDirection()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbViewport::setViewDirection  |  ( |  const AcGeVector3d &  |  viewDirection | )
Sets the view direction (from target to camera) for this Viewport's view.
Parameters
[in] | viewDirection | the new view direction to be used for the view
Remarks
the view direction vector is expressed in WCS; using new 'viewDirection', the camera is moved, target is constant
Returns
Acad::eOk if successful
◆ setViewHeight()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbViewport::setViewHeight  |  ( |  double  |  height | )
Sets the view height for this Viewport's view.
Parameters
[in] | height | the new height for the view
Returns
Acad::eOk if successful,
 Acad::eInvalidInput if height is not greater than zero
◆ setViewTarget()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbViewport::setViewTarget  |  ( |  const AcGePoint3d &  |  viewTarget | )
Sets the new view target point (in WCS) for this Viewport's view.
Parameters
[in] | viewTarget | the new target point for the view
Returns
Acad::eOk if successful
◆ setVisualStyle()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbViewport::setVisualStyle  |  ( |  const AcDbObjectId  |  id | )
Sets the visual style using the id passed in.
Parameters
[in] | id | object id of the visual style to be set
Returns
Acad::eOk if successful ,
 Acad::eNullObjectId if id passed in is null
◆ setWidth()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbViewport::setWidth  |  ( |  double  |  value | )
Sets the width for this Viewport's view.
Parameters
[in] | value | viewport width
Returns
Acad::eOk if successful
◆ shadePlot()
 UX_EXPORT_FUNCTION AcDbViewport::ShadePlotType AcDbViewport::shadePlot  |  ( |   | ) |   const
Returns the Viewport's shade plot mode.
Returns
shade plot type of this Viewport's current shade plot mode
◆ shadePlotId()
 UX_EXPORT_FUNCTION AcDbObjectId AcDbViewport::shadePlotId  |  ( |   | ) |   const
Returns the AcDbObjectId of the used visual style or render setting for this Viewport's shade plot mode.
Returns
object id of the VisualStyle or RenderSetting if successful, AcDbObjectId::kNull otherwise
Remarks
the returned Object ID refers to the used AcDbVisualStyle or AcDbRenderSettings object used shaded plot
◆ showHiddenLines()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbViewport::showHiddenLines  |  ( |   | )
Makes this viewport show hidden lines during plotting.
Returns
Acad::eOk if successful
◆ snapAngle()
 UX_EXPORT_FUNCTION double AcDbViewport::snapAngle  |  ( |   | ) |   const
Gets the value of the snap angle for this viewport (in radians).
Returns
snap angle
◆ snapBasePoint()
 UX_EXPORT_FUNCTION AcGePoint2d AcDbViewport::snapBasePoint  |  ( |   | ) |   const
Gets the snap base point of this viewport.
Returns
snap base point
◆ snapIncrement()
 UX_EXPORT_FUNCTION AcGeVector2d AcDbViewport::snapIncrement  |  ( |   | ) |   const
Gets the X and Y spacing of the snap grid as a AcGeVector2d object.
Returns
vector storing X and Y snap grid spacing as X and Y coordinates, respectively
◆ snapIsoPair()
 UX_EXPORT_FUNCTION Adesk::UInt16 AcDbViewport::snapIsoPair  |  ( |   | ) |   const
Gets the snap IsoPair value for this viewport.
Returns
IsoPair value
◆ standardScale()
 UX_EXPORT_FUNCTION AcDbViewport::StandardScaleType AcDbViewport::standardScale  |  ( |   | ) |   const
Gets the viewport scale.
Returns
scale one of the predefined StandardScaleType values
◆ subGetTransformedCopy()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbViewport::subGetTransformedCopy  |  ( |  const AcGeMatrix3d &  |  matrix,
|  AcDbEntity *&  |  resultEntity
) |   |  const
protectedvirtual
Reimplemented from AcDbEntity.
◆ subObjModified()
 void AcDbViewport::subObjModified  |  ( |  const AcDbObject *  |  pDbObj,
|  const AcDbObject *  |  pSubObj
)
virtual
Reimplemented from AcDbObject.
◆ subSetAttributes()
 UX_EXPORT_FUNCTION Adesk::UInt32 AcDbViewport::subSetAttributes  |  ( |  AcGiDrawableTraits *  |  pFeatures | )
protectedvirtual
Parameters
[in] | pFeatures
Returns
Remarks
not yet implemented.
Reimplemented from AcDbEntity.
◆ subWorldDraw()
 UX_EXPORT_FUNCTION Adesk::Boolean AcDbViewport::subWorldDraw  |  ( |  AcGiWorldDraw *  |  pWd | )
protectedvirtual
Reimplemented from AcDbEntity.
◆ sunId()
 UX_EXPORT_FUNCTION AcDbObjectId AcDbViewport::sunId  |  ( |   | ) |   const
The function returns an id.This id was created for associates a sun object with this viewport.
Returns
the object Id of an AcDbSun object otherwise kNULL
◆ thawAllLayersInViewport()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbViewport::thawAllLayersInViewport  |  ( |   | )
Thaws the all Layers in this Viewport.
Returns
eOk if successful
◆ thawLayersInViewport()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbViewport::thawLayersInViewport  |  ( |  const AcDbObjectIdArray &  |  arLayerIds | )
Thaws the given Layers in this Viewport.
Parameters
[in] | arLayerIds | list of layers to thaw
Returns
eOk if successful
◆ twistAngle()
 UX_EXPORT_FUNCTION double AcDbViewport::twistAngle  |  ( |   | ) |   const
Gets this vieport's view twist anagle.
Returns
twist angle (in radians)
◆ ucsName()
 UX_EXPORT_FUNCTION AcDbObjectId AcDbViewport::ucsName  |  ( |   | ) |   const
Returns the Object Id of the UCS' AcDbUcsTableRecord, if the Viewport is using a named UCS.
Returns
object id of the names UCS which is currently the active UCS, AcDbObjectId::kNull otherwise
◆ updateDisplay()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbViewport::updateDisplay  |  ( |   | ) |   const
Updates the display of this Viewport.
Returns
eOk if successful
◆ viewCenter()
 UX_EXPORT_FUNCTION AcGePoint2d AcDbViewport::viewCenter  |  ( |   | ) |   const
Returns the view center of this Viewport.
Parameters
[in]
return center of the Viewport's view (in Display Coordinate System)
◆ viewDirection()
 UX_EXPORT_FUNCTION AcGeVector3d AcDbViewport::viewDirection  |  ( |   | ) |   const
Returns the 3d vector of this view direction (in Modelspace WCS)
Returns
view direction vector (vector from view's target to camera location)
◆ viewHeight()
 UX_EXPORT_FUNCTION double AcDbViewport::viewHeight  |  ( |   | ) |   const
Returns the height of this viewport's modelspace view.
Returns
height of the viewport's modelspace view (in Display Coordinate System)
◆ viewTarget()
 UX_EXPORT_FUNCTION AcGePoint3d AcDbViewport::viewTarget  |  ( |   | ) |   const
Returns the Target viewpoint of this Viewport.
Returns
target viewport
◆ visualStyle()
 UX_EXPORT_FUNCTION AcDbObjectId AcDbViewport::visualStyle  |  ( |   | ) |   const
Gets this vieport's view visual style.
Returns
visual style's id
◆ width()
 UX_EXPORT_FUNCTION double AcDbViewport::width  |  ( |   | ) |   const
Gets this Viewport width.
Returns
viewport width