Public Member Functions | List of all members
AcDbLayoutManagerReactor Class Reference
_ More...
#include <AcDbLayoutManagerReactor.h>
 Public Member Functions
virtual void  | abortLayoutCopied (const ACHAR *, const AcDbObjectId &)
Notification is sent when the layout manager aborts the copy process of the specified layout. More...
virtual void  | abortLayoutRemoved (const ACHAR *, const AcDbObjectId &)
Notification is sent when the layout manager aborts the remove process of the specified layout. More...
virtual void  | abortLayoutRename (const ACHAR *, const ACHAR *, const AcDbObjectId &)
Notification is sent when the layout manager aborts the rename process of the specified layout. More...
virtual void  | layoutCopied (const ACHAR *, const AcDbObjectId &, const ACHAR *, const AcDbObjectId &)
Notification is sent when the layout manager has succeeded copying the specified layout. More...
virtual void  | layoutCreated (const ACHAR *, const AcDbObjectId &)
Notification is sent when the layout manager has succeeded creating the specified layout. More...
virtual void  | layoutRemoved (const ACHAR *, const AcDbObjectId &)
Notification is sent when the layout manager has succeeded removing the specified layout. More...
virtual void  | layoutRenamed (const ACHAR *, const ACHAR *, const AcDbObjectId &)
Notification is sent when the layout manager has succeeded renaming the specified layout. More...
 virtual void  | layoutsReordered ()
Notification is sent when tab reordering occurs.
virtual void  | layoutSwitched (const ACHAR *, const AcDbObjectId &)
Notification is sent when the layout manager has succeeded switching the specified layout. More...
virtual void  | layoutToBeCopied (const ACHAR *, const AcDbObjectId &)
Notification is sent when the layout manager is about to copy the specified layout. More...
virtual void  | layoutToBeRemoved (const ACHAR *, const AcDbObjectId &)
Notification is sent when the layout manager is about to remove the specified layout. More...
virtual void  | layoutToBeRenamed (const ACHAR *, const ACHAR *, const AcDbObjectId &)
Notification is sent when the layout manager is about to rename the specified layout. More...
virtual void  | plotStyleTableChanged (const ACHAR *, const AcDbObjectId &)
Notification is sent when the plot style table of the specified layout has changed. More...
 Public Member Functions inherited from AcRxObject
virtual AcRxObject *  | clone () const
Exported and implemented. More...
 virtual AcRx::Ordering  | comparedTo (const AcRxObject *) const
Exported and implemented.
virtual Acad::ErrorStatus  | copyFrom (const AcRxObject *)
Exported and implemented. More...
 virtual AcRxClass *  | isA () const
Exported and implemented.
virtual Adesk::Boolean  | isEqualTo (const AcRxObject *) const
Exported and implemented. More...
bool  | isKindOf (const AcRxClass *) const
Checks the object class. More...
AcRxObject *  | queryX (const AcRxClass *) const
returns the protocol extension object assigned to this class or a parent class. More...
AcRxObject *  | x (const AcRxClass *) const
returns the protocol extension object assigned to this class or a parent class. More...
 virtual  | ~AcRxObject ()
Destructor.
 Additional Inherited Members
 Static Public Member Functions inherited from AcRxObject
 static AcRxObject *  | cast (const AcRxObject *)
 static AcRxClass *  | desc ()
Exported and implemented.
 Protected Member Functions inherited from AcRxObject
AcRxObject ()
Exported and implemented.
Detailed Description
_
Member Function Documentation
◆ abortLayoutCopied()
 UX_EXPORT_FUNCTION void AcDbLayoutManagerReactor::abortLayoutCopied  |  ( |  const ACHAR *  |  pLayoutName,
|  const AcDbObjectId &  |  layoutObjId
)
virtual
Notification is sent when the layout manager aborts the copy process of the specified layout.
Parameters
[in] | pLayoutName | the name of the layout
[in] | layoutObjId | the object id of the layout
◆ abortLayoutRemoved()
 UX_EXPORT_FUNCTION void AcDbLayoutManagerReactor::abortLayoutRemoved  |  ( |  const ACHAR *  |  pLayoutName,
|  const AcDbObjectId &  |  layoutObjId
)
virtual
Notification is sent when the layout manager aborts the remove process of the specified layout.
Parameters
[in] | pLayoutName | the name of the layout
[in] | layoutObjId | the object id of the layout
◆ abortLayoutRename()
 UX_EXPORT_FUNCTION void AcDbLayoutManagerReactor::abortLayoutRename  |  ( |  const ACHAR *  |  pOldLayoutName,
|  const ACHAR *  |  pNewLayoutName,
|  const AcDbObjectId &  |  layoutObjId
)
virtual
Notification is sent when the layout manager aborts the rename process of the specified layout.
Parameters
[in] | pOldLayoutName | the old name of the layout
[in] | pNewLayoutName | the new name of the layout
[in] | layoutObjId | the object id of the layout
◆ layoutCopied()
 UX_EXPORT_FUNCTION void AcDbLayoutManagerReactor::layoutCopied  |  ( |  const ACHAR *  |  pOldLayoutName,
|  const AcDbObjectId &  |  oldLayoutObjId,
|  const ACHAR *  |  pNewLayoutName,
|  const AcDbObjectId &  |  newLayoutObjId
)
virtual
Notification is sent when the layout manager has succeeded copying the specified layout.
Parameters
[in] | pOldLayoutName | the name of the copied layout
[in] | oldLayoutObjId | the object id of the copied layout
[in] | pNewLayoutName | the name of the new copy of the layout
[in] | newLayoutObjId | the object id of the new copy of the layout
◆ layoutCreated()
 UX_EXPORT_FUNCTION void AcDbLayoutManagerReactor::layoutCreated  |  ( |  const ACHAR *  |  pLayoutName,
|  const AcDbObjectId &  |  layoutObjId
)
virtual
Notification is sent when the layout manager has succeeded creating the specified layout.
Parameters
[in] | pLayoutName | the name of the newly created layout
[in] | layoutObjId | the object id of the newly created layout
◆ layoutRemoved()
 UX_EXPORT_FUNCTION void AcDbLayoutManagerReactor::layoutRemoved  |  ( |  const ACHAR *  |  pLayoutName,
|  const AcDbObjectId &  |  layoutObjId
)
virtual
Notification is sent when the layout manager has succeeded removing the specified layout.
Parameters
[in] | pLayoutName | the name of the removed layout
[in] | layoutObjId | the object id of the removed layout
◆ layoutRenamed()
 UX_EXPORT_FUNCTION void AcDbLayoutManagerReactor::layoutRenamed  |  ( |  const ACHAR *  |  pOldLayoutName,
|  const ACHAR *  |  pNewLayoutName,
|  const AcDbObjectId &  |  layoutObjId
)
virtual
Notification is sent when the layout manager has succeeded renaming the specified layout.
Parameters
[in] | pOldLayoutName | the old name of the renamed layout
[in] | pNewLayoutName | the new name of the renamed layout
[in] | layoutObjId | the object id of the renamed layout
◆ layoutSwitched()
 UX_EXPORT_FUNCTION void AcDbLayoutManagerReactor::layoutSwitched  |  ( |  const ACHAR *  |  pLayoutName,
|  const AcDbObjectId &  |  layoutObjId
)
virtual
Notification is sent when the layout manager has succeeded switching the specified layout.
Parameters
[in] | pLayoutName | the name of the layout set as current
[in] | layoutObjId | the object id of the layout set as current
◆ layoutToBeCopied()
 UX_EXPORT_FUNCTION void AcDbLayoutManagerReactor::layoutToBeCopied  |  ( |  const ACHAR *  |  pLayoutName,
|  const AcDbObjectId &  |  layoutObjId
)
virtual
Notification is sent when the layout manager is about to copy the specified layout.
Parameters
[in] | pLayoutName | the name of the layout to be copied
[in] | layoutObjId | the object id of the layout to be copied
◆ layoutToBeRemoved()
 UX_EXPORT_FUNCTION void AcDbLayoutManagerReactor::layoutToBeRemoved  |  ( |  const ACHAR *  |  ,
|  const AcDbObjectId &
)
virtual
Notification is sent when the layout manager is about to remove the specified layout.
Parameters
[in] | pLayoutName | the name of the layout to be removed
[in] | layoutObjId | the object id of the layout to be removed
◆ layoutToBeRenamed()
 UX_EXPORT_FUNCTION void AcDbLayoutManagerReactor::layoutToBeRenamed  |  ( |  const ACHAR *  |  pOldLayoutName,
|  const ACHAR *  |  pNewLayoutName,
|  const AcDbObjectId &  |  layoutObjId
)
virtual
Notification is sent when the layout manager is about to rename the specified layout.
Parameters
[in] | pOldLayoutName | the name of the layout to be removed
[in] | pNewLayoutName | the new name of the layout to be removed
[in] | layoutObjId | the object id of the layout to be removed
◆ plotStyleTableChanged()
 UX_EXPORT_FUNCTION void AcDbLayoutManagerReactor::plotStyleTableChanged  |  ( |  const ACHAR *  |  pTableName,
|  const AcDbObjectId &  |  layoutObjId
)
virtual
Notification is sent when the plot style table of the specified layout has changed.
Parameters
[in] | pTableName | the name of the plot style table
[in] | layoutObjId | the object id of the layout to be removed