Public Member Functions | Public Attributes | Protected Member Functions | List of all members
AcDbBlockReference Class Reference
_ More...
#include <AcDbBlockReference.h>
 Public Member Functions
AcDbBlockReference (const AcGePoint3d &, AcDbObjectId)
Acad::ErrorStatus  | appendAttribute (AcDbAttribute *)
Appends the specified attribute pAcAttrib to the attribute list of this block reference. More...
Acad::ErrorStatus  | appendAttribute (AcDbObjectId &, AcDbAttribute *)
Appends the specified Attribute to the attribute list of this block reference and returns the objectId of the newly added attribute. More...
AcDbObjectIterator *  | attributeIterator () const
Returns an attribute iterator. More...
AcDbObjectId  | blockTableRecord () const
Returns the object id of the corresponding block definition (DXF -2). More...
AcGeMatrix3d  | blockTransform () const
Returns an object AcGeMatrix3d representing the MCS for the block reference. More...
virtual Acad::ErrorStatus  | explodeToOwnerSpace () const
Explodes the current AcDbBlockReference and adds the exploded entities to the owner of this block reference. More...
Acad::ErrorStatus  | geomExtentsBestFit (AcDbExtents &, const AcGeMatrix3d &=AcGeMatrix3d::kIdentity) const
Calculates and returns the extents of the block table record that is referenced. More...
virtual Acad::ErrorStatus  | getPlane (AcGePlane &, AcDb::Planarity &) const
Returns plane information. More...
virtual Adesk::Boolean  | isPlanar () const
 AcGeMatrix3d  | nonAnnotationBlockTransform () const
 AcGeScale3d  | nonAnnotationScaleFactors () const
AcGeVector3d  | normal () const
Returns the normal in WCS (DXF 210). More...
Acad::ErrorStatus  | openAttribute (AcDbAttribute *&, AcDbObjectId, AcDb::OpenMode, bool=false)
Opens an attribute owned by this block reference. More...
Acad::ErrorStatus  | openSequenceEnd (AcDbSequenceEnd *&, AcDb::OpenMode)
Opens the SequenceEnd entity for this block reference. More...
virtual AcGePoint3d  | position () const
Returns the insertion Point in WCS (DXF 10). More...
double  | rotation () const
Returns the rotation in radians (DXF 50). More...
 AcGeScale3d  | scaleFactors () const
Returns an object AcGeScale3d representing the 3d scale for the block reference.
virtual Acad::ErrorStatus  | setBlockTableRecord (AcDbObjectId)
Sets the block definition (DXF -2). More...
virtual Acad::ErrorStatus  | setBlockTransform (const AcGeMatrix3d &)
Sets the block MCS to the specified in acMatrix3d. More...
virtual Acad::ErrorStatus  | setNormal (const AcGeVector3d &)
Sets the normal in WCS (DXF 210). More...
virtual Acad::ErrorStatus  | setPosition (const AcGePoint3d &)
Sets the insertion point (DXF 10). More...
virtual Acad::ErrorStatus  | setRotation (double)
Sets the rotation in radians (DXF 50). More...
virtual Acad::ErrorStatus  | setScaleFactors (const AcGeScale3d &)
Sets the block reference to the scale specified by scale3d. More...
virtual Adesk::Boolean  | treatAsAcDbBlockRefForExplode () const
Affects the way the command EXPLODE behaves with custom entities derived from AcDbBlockReference. More...
~AcDbBlockReference ()
destructor.
 Public Member Functions inherited from AcDbEntity
 virtual Acad::ErrorStatus  | addSubentPaths (const AcDbFullSubentPathArray &) final
virtual Acad::ErrorStatus  | applyPartialUndo (AcDbDwgFiler *, AcRxClass *)
virtual Acad::ErrorStatus  | audit (AcDbAuditInfo *)
AcDbObjectId  | blockId () const
Returns the Object ID of the BlockTableRecord that owns this entity. More...
Acad::ErrorStatus  | boundingBoxIntersectWith (const AcDbEntity *, AcDb::Intersect, AcGePoint3dArray &, Adesk::GsMarker, Adesk::GsMarker) const
Finds the intersection between the edges of the bounding box for this entity and the pOhter entity. More...
Acad::ErrorStatus  | boundingBoxIntersectWith (const AcDbEntity *, AcDb::Intersect, const AcGePlane &, AcGePoint3dArray &, Adesk::GsMarker, Adesk::GsMarker) const
First, the function projects the other entity and the bounding box of this entity on plane specified by plane. More...
virtual bool  | bounds (AcDbExtents &) const
Returns the extents of this entity as AcDbExtents. More...
virtual bool  | castShadows () const
Checks if this entity is able to cast shadows. More...
virtual Adesk::Boolean  | cloneMeForDragging () final
Checks if a clone will be created for this entity in case of a drag operation. More...
 virtual AcDb::CollisionType  | collisionType () const
AcCmColor  | color () const
Returns the true color information of the entity. More...
Adesk::UInt16  | colorIndex () const
Returns the color number in a range from 0 to 256. More...
 virtual Acad::ErrorStatus  | deleteSubentPaths (const AcDbFullSubentPathArray &) final
virtual void  | dragStatus (const AcDb::DragStat)
Acad::ErrorStatus  | draw ()
Draws or redraws the entity on screen. More...
virtual AcGiDrawable *  | drawable ()
virtual Acad::ErrorStatus  | dwgInFields (AcDbDwgFiler *)
virtual Acad::ErrorStatus  | dwgOutFields (AcDbDwgFiler *) const
virtual Acad::ErrorStatus  | dxfInFields (AcDbDxfFiler *)
virtual Acad::ErrorStatus  | dxfOutFields (AcDbDxfFiler *) const
AcCmEntityColor  | entityColor () const
Returns the lightweight color information of the entity. More...
virtual Acad::ErrorStatus  | explode (AcDbVoidPtrArray &) const final
virtual Acad::ErrorStatus  | getCompoundObjectTransform (AcGeMatrix3d &) const final
It is used for object without geometry like AcDbMleader. More...
virtual void  | getEcs (AcGeMatrix3d &) const
Returns the transformation matrix from OCS (Object Coordinate System) to WCS (World Coordinate System). More...
virtual Acad::ErrorStatus  | getGeomExtents (AcDbExtents &) const final
Returns extents of this entity. More...
 virtual Acad::ErrorStatus  | getGripEntityUCS (const void *, AcGeVector3d &, AcGePoint3d &, AcGeVector3d &) const final
 virtual Acad::ErrorStatus  | getGripPoints (AcDbGripDataPtrArray &, const double, const int, const AcGeVector3d &, const int) const final
virtual Acad::ErrorStatus  | getGripPoints (AcGePoint3dArray &, AcDbIntArray &, AcDbIntArray &) const final
Append grip points to the specified array. More...
 virtual Acad::ErrorStatus  | getGripPointsAtSubentPath (const AcDbFullSubentPath &, AcDbGripDataPtrArray &, const double, const int, const AcGeVector3d &, const int) const final
virtual Acad::ErrorStatus  | getGsMarkersAtSubentPath (const AcDbFullSubentPath &, AcArray< Adesk::GsMarker > &) const final
virtual Acad::ErrorStatus  | getMaterialMapper (AcGiMapper &) const
virtual Acad::ErrorStatus  | getOsnapPoints (AcDb::OsnapMode, Adesk::GsMarker, const AcGePoint3d &, const AcGePoint3d &, const AcGeMatrix3d &, AcGePoint3dArray &, AcDbIntArray &) const final
Gets the entity osnap points. More...
virtual Acad::ErrorStatus  | getOsnapPoints (AcDb::OsnapMode, Adesk::GsMarker, const AcGePoint3d &, const AcGePoint3d &, const AcGeMatrix3d &, AcGePoint3dArray &, AcDbIntArray &, const AcGeMatrix3d &) const final
Gets the entity osnap points. More...
virtual Acad::ErrorStatus  | getPlane (AcGePlane &, AcDb::Planarity &) const
Returns the plane that contains this entity. More...
AcDb::PlotStyleNameType  | getPlotStyleNameId (AcDbObjectId &) const
Returns the plot style name type and its associated id. More...
virtual Acad::ErrorStatus  | getStretchPoints (AcGePoint3dArray &) const final
Append stretch points to the specified array. More...
 virtual Acad::ErrorStatus  | getSubentClassId (const AcDbFullSubentPath &, CLSID *) const final
 virtual Acad::ErrorStatus  | getSubentPathGeomExtents (const AcDbFullSubentPath &, AcDbExtents &) const final
virtual Acad::ErrorStatus  | getSubentPathsAtGsMarker (AcDb::SubentType, Adesk::GsMarker, const AcGePoint3d &, const AcGeMatrix3d &, int &, AcDbFullSubentPath *&, int=0, AcDbObjectId *=NULL) const final
Gets the subentity paths appropriate for the passed in gs marker. More...
virtual Acad::ErrorStatus  | getTransformedCopy (const AcGeMatrix3d &, AcDbEntity *&) const final
Creates a copy of the current entity applying the transformation matrix. More...
 virtual void  | gripStatus (const AcDb::GripStat) final
virtual AcGsNode *  | gsNode () const
 virtual bool  | hideMeForDragging () const final
virtual Acad::ErrorStatus  | highlight (const AcDbFullSubentPath &=kNullSubent, const Adesk::Boolean=Adesk::kFalse) const final
Highlights part of, or entire entity. More...
virtual Acad::ErrorStatus  | intersectWith (const AcDbEntity *, AcDb::Intersect, AcGePoint3dArray &, Adesk::GsMarker=0, Adesk::GsMarker=0) const final
Finds the intersection between this entity and the pOhter entity. More...
virtual Acad::ErrorStatus  | intersectWith (const AcDbEntity *, AcDb::Intersect, const AcGePlane &, AcGePoint3dArray &, Adesk::GsMarker=0, Adesk::GsMarker=0) const final
Projects this entity and the pOhter entity on plane, finds the intersection points between these projections and then projects back the points onto the caller entity. More...
 virtual bool  | isContentSnappable () const final
virtual Adesk::Boolean  | isPlanar () const
ACHAR *  | layer () const
Returns the layername. More...
AcDbObjectId  | layerId () const
Returns the Object ID of the LayerTableRecord referenced by this entity. More...
ACHAR *  | linetype () const
Gets the linetype value. More...
AcDbObjectId  | linetypeId () const
Gets the linetypeId value. More...
 double  | linetypeScale () const
returns the linetype scale factor for the entity
AcDb::LineWeight  | lineWeight () const
Gets the entity line weight. More...
virtual void  | list () const final
Prints the properties in drawing window. More...
ACHAR *  | material () const
Gets the material assigned to this entity. More...
AcDbObjectId  | materialId () const
Gets the AcDbObjectId of the material assigned to this entity. More...
virtual Acad::ErrorStatus  | moveGripPointsAt (const AcDbIntArray &, const AcGeVector3d &) final
Move the grip points pointed by the indexes specified in indexArray using the translationVector param direction and length Override this method in custom entities to define your own behaviour. More...
 virtual Acad::ErrorStatus  | moveGripPointsAt (const AcDbVoidPtrArray &, const AcGeVector3d &, const int) final
 virtual Acad::ErrorStatus  | moveGripPointsAtSubentPaths (const AcDbFullSubentPathArray &, const AcDbVoidPtrArray &, const AcGeVector3d &, const int) final
virtual Acad::ErrorStatus  | moveStretchPointsAt (const AcDbIntArray &, const AcGeVector3d &) final
Move the stretch points pointed by the indexes specified in indexArray with the offest specified by translationVector Override this method in custom entities to define your own behaviour. More...
ACHAR *  | plotStyleName () const
Returns the name of the plotStyleName string associated with this entity (DXF 390). More...
virtual bool  | receiveShadows () const
Checks if this entity is able to receive shadows. More...
void  | recordGraphicsModified (Adesk::Boolean=Adesk::kTrue)
Controls the entity display update when closing it Entities not updated when closed are updated at the first regen. More...
virtual void  | saveAs (AcGiWorldDraw *, AcDb::SaveType)
Generates the graphics primitives when a DWG save requiring proxy graphics to be saved is made. More...
virtual void  | setCastShadows (bool)
Sets this entity's flag regarding casting shadows. More...
virtual Acad::ErrorStatus  | setColor (const AcCmColor &, Adesk::Boolean=Adesk::kTrue)
Sets the color information of this entity from an AcCmColor instance. More...
virtual Acad::ErrorStatus  | setColor (const AcCmColor &, bool, AcDbDatabase *)
Sets the color property of this entity from an AcCmColor instance. More...
virtual Acad::ErrorStatus  | setColorIndex (Adesk::UInt16, Adesk::Boolean=Adesk::kTrue)
Sets the color index of this entity (DXF 62). More...
void  | setDatabaseDefaults ()
Applies the default properties of the entities database to this entity. More...
void  | setDatabaseDefaults (AcDbDatabase *)
Applies the default properties of the specified database to this entity. More...
virtual void  | setGsNode (AcGsNode *)
virtual Acad::ErrorStatus  | setLayer (AcDbObjectId, Adesk::Boolean=Adesk::kTrue, bool=false)
Sets the layer to be referenced by this entity (DXF 8). More...
virtual Acad::ErrorStatus  | setLayer (const ACHAR *, Adesk::Boolean=Adesk::kTrue, bool=false)
Sets the layer to be referenced by this entity (DXF 8). More...
virtual Acad::ErrorStatus  | setLinetype (AcDbObjectId, Adesk::Boolean=Adesk::kTrue)
Sets the entities linetype to ltypeObjectId. More...
virtual Acad::ErrorStatus  | setLinetype (const ACHAR *, Adesk::Boolean=Adesk::kTrue)
Sets the entities linetype to the linetpye referenced by layerName. More...
virtual Acad::ErrorStatus  | setLinetypeScale (double, Adesk::Boolean=Adesk::kTrue)
sets value as entity linetype scale factor More...
virtual Acad::ErrorStatus  | setLineWeight (AcDb::LineWeight, Adesk::Boolean=Adesk::kTrue)
Sets the entity line weight. More...
virtual Acad::ErrorStatus  | setMaterial (AcDbObjectId, Adesk::Boolean=Adesk::kTrue)
Not implemented yet. More...
virtual Acad::ErrorStatus  | setMaterial (const ACHAR *, Adesk::Boolean=Adesk::kTrue)
Assigns the material to the entity. More...
virtual Acad::ErrorStatus  | setMaterialMapper (const AcGiMapper &, Adesk::Boolean=Adesk::kTrue)
It is used for apply material (scale, rotation, projection, mode overrides) to an identity.If it is used AcGiMapper::kIdentity it will apply for entity a default mapper. More...
virtual Acad::ErrorStatus  | setPlotStyleName (AcDb::PlotStyleNameType, AcDbObjectId=AcDbObjectId::kNull, Adesk::Boolean=Adesk::kTrue)
Sets the plot style of this entity. More...
virtual Acad::ErrorStatus  | setPlotStyleName (const ACHAR *, Adesk::Boolean=Adesk::kTrue)
Sets the plot style of this entity. More...
Acad::ErrorStatus  | setPropertiesFrom (const AcDbEntity *, Adesk::Boolean=Adesk::kTrue)
Copies the properties color, layer, linetype, linetypescale and visibility from the source entity pEntity to this entity. More...
virtual void  | setReceiveShadows (bool)
Sets this entity's flag regarding receiving shadows. More...
virtual Acad::ErrorStatus  | setTransparency (const AcCmTransparency &, Adesk::Boolean=Adesk::kTrue)
Sets the transparency setting of this entity, and returns eOk if successful. More...
virtual Acad::ErrorStatus  | setVisibility (AcDb::Visibility, Adesk::Boolean=Adesk::kTrue) final
notyetdocumented. More...
 virtual Acad::ErrorStatus  | setVisualStyle (AcDbObjectId, VisualStyleType=kFullVisualStyle, Adesk::Boolean=true)
 virtual void  | subentGripStatus (const AcDb::GripStat, const AcDbFullSubentPath &) final
virtual AcDbEntity *  | subentPtr (const AcDbFullSubentPath &) const final
Creates an entity as a copy of the subentity given by acSubentPath. More...
virtual void  | subSetDatabaseDefaults (AcDbDatabase *)
This function is called by AcDbEntity::setDatabaseDefaults(), to allow custom entities to set their related sub entities, if any; default implementation does nothing. More...
virtual Acad::ErrorStatus  | transformBy (const AcGeMatrix3d &) final
Applies given transformation (matrix) to the entity. More...
 virtual Acad::ErrorStatus  | transformSubentPathsBy (const AcDbFullSubentPathArray &, const AcGeMatrix3d &) final
 AcCmTransparency  | transparency () const
Returns the transparency setting of this entity.
virtual Acad::ErrorStatus  | unhighlight (const AcDbFullSubentPath &=kNullSubent, const Adesk::Boolean=Adesk::kFalse) const final
Unhighlights previously highlighted part of entity, or entire entity. More...
AcDb::Visibility  | visibility () const
Gets the visibility state. More...
 AcDbObjectId  | visualStyleId (VisualStyleType=kFullVisualStyle) const
 Public Member Functions inherited from AcDbObject
virtual void  | addPersistentReactor (AcDbObjectId)
Adds a persistent reactor to this object reactor list. More...
void  | addReactor (AcDbObjectReactor *) const
Adds a transient reactor to this object. More...
virtual Acad::ErrorStatus  | applyPartialUndo (AcDbDwgFiler *, AcRxClass *)
This function is called during Undo operations on objects, that use the 'Partial Undo meachanism'; this is, this object is opened with assertWriteEnabled(Adesk::kFalse) to indicate that custom Undo filing is used rather than the default Undo filing. More...
 void  | assertNotifyEnabled () const
 void  | assertReadEnabled () const
 void  | assertWriteEnabled (Adesk::Boolean=Adesk::kTrue, Adesk::Boolean=Adesk::kTrue)
virtual Acad::ErrorStatus  | audit (AcDbAuditInfo *)
Performs the audit operation for this object. More...
Acad::ErrorStatus  | cancel ()
Reverts all changes since the object had been opened and closes the object. More...
virtual void  | cancelled (const AcDbObject *)
A handler function for persistent reactors. More...
virtual AcRxObject *  | clone () const
Creates a shallow clone of this object. More...
Acad::ErrorStatus  | close ()
Closes the object. More...
Acad::ErrorStatus  | closeAndPage (Adesk::Boolean=Adesk::kTrue)
Closes the object. More...
virtual Acad::ErrorStatus  | composeForLoad (AcDb::OdaSaveType, AcDb::AcDbDwgVersion)
This function is intended for future MT file loading support. More...
virtual void  | copied (const AcDbObject *, const AcDbObject *)
A handler function for persistent reactors. More...
virtual Acad::ErrorStatus  | copyFrom (const AcRxObject *)
Copies the pSrc object information in this object. More...
Acad::ErrorStatus  | createExtensionDictionary ()
Creates a dictionary as extension dictionary for this object. More...
AcDbDatabase *  | database () const
Returns the database that contains this object. More...
virtual Acad::ErrorStatus  | decomposeForSave (AcDb::AcDbDwgVersion, AcDbObject *&, AcDbObjectId &, Adesk::Boolean &)
This function is called during dwg and dxf output, to allow a custom object to decompose itself, due to provided dwg/dxf target file version. More...
virtual Acad::ErrorStatus  | deepClone (AcDbObject *, AcDbObject *&, AcDbIdMapping &, Adesk::Boolean=Adesk::kTrue) const final
Clones this object, appends it to the owner pOwner and adds an AcDbIdPair record to the idMap. More...
void  | disableUndoRecording (Adesk::Boolean)
Disables or enables the undo recording for the object. More...
Acad::ErrorStatus  | downgradeOpen ()
Sets the open mode for an object opened for write to be opened for read. More...
Acad::ErrorStatus  | downgradeToNotify (Adesk::Boolean)
Sets the open mode for an object opened for write to be opened for notify. More...
virtual AcGiDrawable *  | drawable ()
Retrieves the AcGiDrawable instance of this object. More...
Acad::ErrorStatus  | dwgIn (AcDbDwgFiler *)
Calls the object's dwgInFields function, and reads any XData if present. More...
virtual Acad::ErrorStatus  | dwgInFields (AcDbDwgFiler *)
Reads the object from the DWG filer. More...
Acad::ErrorStatus  | dwgOut (AcDbDwgFiler *) const
Calls the object's dwgOutFields function, and writes any XData if present. More...
virtual Acad::ErrorStatus  | dwgOutFields (AcDbDwgFiler *) const
Writes the object to the DWG filer. More...
Acad::ErrorStatus  | dxfIn (AcDbDxfFiler *)
Calls the object's dxfInFields function, and reads any XData if present. More...
virtual Acad::ErrorStatus  | dxfInFields (AcDbDxfFiler *)
Reads the object from the DXF filer. More...
Acad::ErrorStatus  | dxfOut (AcDbDxfFiler *, Adesk::Boolean, Adesk::uchar *) const
Calls the object's dxfOutFields function, and writes any XData if present. More...
virtual Acad::ErrorStatus  | dxfOutFields (AcDbDxfFiler *) const
Writes the object to the DXF filer. More...
Acad::ErrorStatus  | erase (Adesk::Boolean=Adesk::kTrue)
Sets the bit that indicates that the object is erased. More...
virtual void  | erased (const AcDbObject *, Adesk::Boolean=Adesk::kTrue)
A handler function for persistent reactors. More...
AcDbObjectId  | extensionDictionary () const
Returns the object id of the extension dictionary for this object. More...
void  | getAcDbHandle (AcDbHandle &) const
Returns handle of this object. More...
Acad::ErrorStatus  | getBinaryData (const ACHAR *, Adesk::Int32 &, char *&) const
Creates a copy of the binary data stored as chunks of maximum 127 bytes in the resbuf chain of this object's extension dictionary xrecord entry given by entryName. More...
int  | getBrxOpenCount () const
This function returns the number of open BRX instances for this object. More...
int  | getBrxOpenState () const
This function returns the BRX object open state flags as bitfields, for diagnostic purpose. More...
virtual Acad::ErrorStatus  | getClassID (CLSID *) const final
Gets the COM wrapper Class ID for this entity. More...
int  | getCustomObjectState () const
This function returns the custom object status : 1=isCustomObject 2=DifferentialUndoDisabled. More...
Acad::ErrorStatus  | getField (const ACHAR *, AcDbField *&, AcDb::OpenMode) const
Retrieves the specified Field from this object, and opens it in mode. More...
Acad::ErrorStatus  | getField (const ACHAR *, AcDbObjectId &) const
Gets the pszPropName field object from field dictionary of this AcDbObject object, using pszPropName as key. More...
AcDbObjectId  | getFieldDictionary () const
Returns the Field dictionary associated with this object,. More...
Acad::ErrorStatus  | getFieldDictionary (AcDbDictionary *&, AcDb::OpenMode) const
Gets and opens the field dictionary for this. More...
Acad::ErrorStatus  | getObjectBirthVersion (AcDb::AcDbDwgVersion &, AcDb::MaintenanceReleaseVersion &)
This function is currently not supported by the CAD engine, always returns Acad::eOk, and 'kDHL_CURRENT' + 'kMReleaseCurrent' results. More...
virtual Acad::ErrorStatus  | getObjectSaveVersion (const AcDbDwgFiler *, AcDb::AcDbDwgVersion &, AcDb::MaintenanceReleaseVersion &)
Returns the DWG version for saving the object. More...
virtual Acad::ErrorStatus  | getObjectSaveVersion (const AcDbDxfFiler *, AcDb::AcDbDwgVersion &, AcDb::MaintenanceReleaseVersion &)
Returns the DWG version for saving the object. More...
int  | getOdaOpenCount () const
This function returns the number of open ODA instances for this object. More...
int  | getOdaOpenState () const
This function returns the ODA object open state flags as bitfields, for diagnostic purpose. More...
virtual void  | goodbye (const AcDbObject *)
A handler function for persistent reactors. More...
virtual AcGsNode *  | gsNode () const
Gets the AcGsNode (graphics cache) for this entity. More...
Acad::ErrorStatus  | handOverTo (AcDbObject *, Adesk::Boolean=Adesk::kTrue, Adesk::Boolean=Adesk::kTrue)
Hands over objects identity to another object. More...
bool  | hasFields () const
Return true if this object has single or multiple fields associated with him. More...
bool  | hasPersistentReactor (AcDbObjectId) const
Checks the input objectId in this object reactor list. More...
bool  | hasSaveVersionOverride ()
This function indicates whether this object overrides the filer's save version. More...
virtual AcDbObjectId  | id () const
Returns the database id of this object. More...
Adesk::Boolean  | isAcDbObjectIdsInFlux () const
Checks whether a deep clone operation was completed. More...
Adesk::Boolean  | isAProxy () const
Adesk::Boolean  | isCancelling () const
Adesk::Boolean  | isErased () const
Returns whether this object is erased. More...
Adesk::Boolean  | isEraseStatusToggled () const
Checks whether the object erase status has been toggled. More...
Adesk::Boolean  | isModified () const
Returns whether this object's assertWriteEnabled() has been called since it was opened. More...
Adesk::Boolean  | isModifiedGraphics () const
Checks whether this object graphics will be updated when the object is closed. More...
Adesk::Boolean  | isModifiedXData () const
Checks whether this object's xData was modified. More...
Adesk::Boolean  | isNewObject () const
Returns true if and only if this object has not been closed since it was created. More...
Adesk::Boolean  | isNotifyEnabled () const
Returns whether this object is opened for notify. More...
Adesk::Boolean  | isNotifying () const
virtual Adesk::Boolean  | isPersistent () const
Returns the 'persistent' status of a database object. More...
Adesk::Boolean  | isReadEnabled () const
Returns whether this object is opened for read. More...
 Adesk::Boolean  | isReallyClosing () const
Checks whether the next close call will completely close this object return true if on the next call the object will be completely closed false otherwise.
Adesk::Boolean  | isTransactionResident () const
Gets the object transaction status. More...
Adesk::Boolean  | isUndoing () const
bool  | isUndoRecordingDisabled () const
Returns whether the undo recording for the object is enabled or not. More...
Adesk::Boolean  | isWriteEnabled () const
Returns whether this object is opened for write. More...
virtual AcDb::DuplicateRecordCloning  | mergeStyle () const
Returns the object's merge behavior during cloning. More...
virtual void  | modified (const AcDbObject *)
A handler function for persistent reactors. More...
virtual void  | modifiedGraphics (const AcDbEntity *)
A handler function for persistent reactors. More...
virtual void  | modifiedXData (const AcDbObject *)
A handler function for persistent reactors. More...
virtual void  | modifyUndone (const AcDbObject *)
A handler function for persistent reactors. More...
virtual void  | objectClosed (const AcDbObjectId)
A handler function for persistent reactors. More...
AcDbObjectId  | objectId () const
Returns object id. More...
virtual void  | openedForModify (const AcDbObject *)
A handler function for persistent reactors. More...
AcDbObjectId  | ownerId () const
Returns object id of the owner. More...
AcDbVoidPtrArray *  | reactors ()
Gets the object pointers to reactors. More...
const AcDbVoidPtrArray *  | reactors () const
Gets the object pointers to reactors. More...
virtual void  | reappended (const AcDbObject *)
A handler function for persistent reactors. More...
 virtual void  | recvPropagateModify (const AcDbObject *)
Not implemented yet.
Acad::ErrorStatus  | releaseExtensionDictionary ()
Removes the extension dictionary associated with this object. More...
virtual Acad::ErrorStatus  | removeField (AcDbObjectId)
Removes the Field specified by acFieldId from this object. More...
virtual Acad::ErrorStatus  | removeField (const ACHAR *)
Removes the Field specified by szKeyString from this object. More...
virtual Acad::ErrorStatus  | removeField (const ACHAR *, AcDbObjectId &)
Removes the Field specified by acPszKeyString from this object, and returns its ObjectId value. More...
virtual Acad::ErrorStatus  | removePersistentReactor (AcDbObjectId)
Removes a persistent reactor from this object reactor list. More...
void  | removeReactor (AcDbObjectReactor *) const
Removes a transient reactor to this object. More...
void  | setAcDbObjectIdsInFlux ()
Call this function to indicate that the object IDs of this object and its sub-objects (if any) are not yet valid. More...
Acad::ErrorStatus  | setBinaryData (const ACHAR *, Adesk::Int32, const char *)
Creates a copy of the binary data, divides it in up to 127 bytes binary chunks and
 sets them as resbufs in the resbuf chain of this object's extension dictionary xrecord entry given by entryName. More...
virtual Acad::ErrorStatus  | setField (const ACHAR *, AcDbField *, AcDbObjectId &)
Adds the pAcField field object to field dictionary of this AcDbObject object, using pKey as key. More...
virtual void  | setGsNode (AcGsNode *)
Gets the AcGsNode (graphics cache) for this entity. More...
void  | setHasSaveVersionOverride (bool)
This function can be called to specify that the object has a "save version override". More...
virtual Acad::ErrorStatus  | setOwnerId (AcDbObjectId)
Sets the ownerId data member of the object to be objId. More...
virtual Acad::ErrorStatus  | setXData (const resbuf *)
Sets/removes xData associated with this object. More...
virtual Acad::ErrorStatus  | subCancel ()
Possibility to veto a cancel operation from within custom entities. More...
virtual Acad::ErrorStatus  | subClose ()
virtual Acad::ErrorStatus  | subErase (Adesk::Boolean)
This hook is called during an AcDbObject::erase call, before any actual erase operation is performed. More...
 virtual Acad::ErrorStatus  | subHandOverTo (AcDbObject *)
virtual void  | subObjModified (const AcDbObject *, const AcDbObject *)
A handler function for persistent reactors. More...
 virtual Acad::ErrorStatus  | subOpen (AcDb::OpenMode)
virtual Acad::ErrorStatus  | subSwapIdWith (AcDbObjectId, Adesk::Boolean=Adesk::kFalse, Adesk::Boolean=Adesk::kFalse)
This hook is called during an AcDbObject::swapIdWith() call, before any actual swap operation is performed. More...
Acad::ErrorStatus  | swapIdWith (AcDbObjectId, Adesk::Boolean=Adesk::kFalse, Adesk::Boolean=Adesk::kFalse)
Swaps the object id's between the object identified by param swapId and this object. More...
virtual Acad::ErrorStatus  | swapReferences (const AcDbIdMapping &)
Not implemented yet. More...
virtual void  | unappended (const AcDbObject *)
A handler function for persistent reactors. More...
AcDbDwgFiler *  | undoFiler ()
Gets the undo filer for this object. More...
Acad::ErrorStatus  | upgradeFromNotify (Adesk::Boolean &)
Upgrades the open status of this object to AcDb::kForWrite, if this object is already open (either in AcDb::kForRead, AcDb::kForNotify or AcDb::kForWrite) More...
Acad::ErrorStatus  | upgradeOpen ()
Changes the objects open mode to AcDb::kForWrite and sends notifications. More...
virtual Acad::ErrorStatus  | wblockClone (AcRxObject *, AcDbObject *&, AcDbIdMapping &, Adesk::Boolean=Adesk::kTrue) const final
Clones this object, appends it to the owner pOwner and adds an AcDbIdPair record to the idMap. More...
virtual resbuf *  | xData (const ACHAR *=NULL) const
Returns the xData associated with this object. More...
Acad::ErrorStatus  | xDataTransformBy (const AcGeMatrix3d &)
Transforms the extended data according to parameter transformation matrix. More...
 virtual void  | xmitPropagateModify () const
Not implemented yet.
 virtual  | ~AcDbObject ()
Destructor.
 Public Member Functions inherited from AcGiDrawable
virtual bool  | bounds (AcDbExtents &) const
virtual DrawableType  | drawableType () const
 virtual AcGiDrawStream *  | drawStream () const
virtual AcGsNode *  | gsNode () const =0
virtual AcDbObjectId  | id () const =0
virtual Adesk::Boolean  | isPersistent () const =0
virtual Adesk::UInt32  | regenSupportFlags () const final
Returns whether and to which level this object supports MultiThreading. More...
 virtual Adesk::Boolean  | RolloverHit (Adesk::ULongPtr, Adesk::ULongPtr, Adesk::Boolean)
 virtual Adesk::UInt32  | setAttributes (AcGiDrawableTraits *) final
 virtual void  | setDrawStream (AcGiDrawStream *)
virtual void  | setGsNode (AcGsNode *)=0
 virtual void  | viewportDraw (AcGiViewportDraw *) final
 virtual Adesk::UInt32  | viewportDrawLogicalFlags (AcGiViewportDraw *) final
 virtual Adesk::Boolean  | worldDraw (AcGiWorldDraw *) final
 Public Member Functions inherited from AcRxObject
virtual AcRxObject *  | clone () const
Exported and implemented. More...
 virtual AcRx::Ordering  | comparedTo (const AcRxObject *) const
Exported and implemented.
virtual Acad::ErrorStatus  | copyFrom (const AcRxObject *)
Exported and implemented. More...
 virtual AcRxClass *  | isA () const
Exported and implemented.
virtual Adesk::Boolean  | isEqualTo (const AcRxObject *) const
Exported and implemented. More...
bool  | isKindOf (const AcRxClass *) const
Checks the object class. More...
AcRxObject *  | queryX (const AcRxClass *) const
returns the protocol extension object assigned to this class or a parent class. More...
AcRxObject *  | x (const AcRxClass *) const
returns the protocol extension object assigned to this class or a parent class. More...
 virtual  | ~AcRxObject ()
Destructor.
 Public Attributes
AcDbBlockReference
Default constructor. More...
 Public Attributes inherited from AcDbEntity
AcDbEntity
This protected constructor sets the initial value for color to 257, and for the objectids for layer and linetype to AcDbObjectId::kNull. More...
 Protected Member Functions
virtual Acad::ErrorStatus  | subGetClassID (CLSID *) const
Gets the COM wrapper Class ID for this entity. More...
virtual Acad::ErrorStatus  | subGetGsMarkersAtSubentPath (const AcDbFullSubentPath &, AcArray< Adesk::GsMarker > &) const
getGsMarkersAtSubentPath. More...
virtual Acad::ErrorStatus  | subGetSubentPathsAtGsMarker (AcDb::SubentType, Adesk::GsMarker, const AcGePoint3d &, const AcGeMatrix3d &, int &, AcDbFullSubentPath *&, int=0, AcDbObjectId *=NULL) const
getSubentPathsAtGsMarker. More...
virtual Acad::ErrorStatus  | subGetTransformedCopy (const AcGeMatrix3d &, AcDbEntity *&) const
virtual void  | subGripStatus (const AcDb::GripStat)
gripStatus. More...
virtual Acad::ErrorStatus  | subHighlight (const AcDbFullSubentPath &=kNullSubent, const Adesk::Boolean=Adesk::kFalse) const
Highlights this insert or part of it. More...
virtual AcDbEntity *  | subSubentPtr (const AcDbFullSubentPath &) const
subentPtr. More...
virtual Acad::ErrorStatus  | subUnhighlight (const AcDbFullSubentPath &=kNullSubent, const Adesk::Boolean=Adesk::kFalse) const
Unhighlights this insert or part of it. More...
virtual Adesk::Boolean  | subWorldDraw (AcGiWorldDraw *)
Creates a viewport-independent graphical representation of the object. More...
 Protected Member Functions inherited from AcDbEntity
 virtual Acad::ErrorStatus  | subAddSubentPaths (const AcDbFullSubentPathArray &)
 virtual Adesk::Boolean  | subCloneMeForDragging ()
 virtual Acad::ErrorStatus  | subDeleteSubentPaths (const AcDbFullSubentPathArray &)
virtual Acad::ErrorStatus  | subExplode (AcDbVoidPtrArray &) const
 virtual Acad::ErrorStatus  | subGetCompoundObjectTransform (AcGeMatrix3d &) const
virtual Acad::ErrorStatus  | subGetGeomExtents (AcDbExtents &) const
virtual Acad::ErrorStatus  | subGetGripEntityUCS (const void *, AcGeVector3d &, AcGePoint3d &, AcGeVector3d &) const
virtual Acad::ErrorStatus  | subGetGripPoints (AcDbGripDataPtrArray &, const double, const int, const AcGeVector3d &, const int) const
virtual Acad::ErrorStatus  | subGetGripPoints (AcGePoint3dArray &, AcDbIntArray &, AcDbIntArray &) const
 virtual Acad::ErrorStatus  | subGetGripPointsAtSubentPath (const AcDbFullSubentPath &, AcDbGripDataPtrArray &, const double, const int, const AcGeVector3d &, const int) const
virtual Acad::ErrorStatus  | subGetGsMarkersAtSubentPath (const AcDbFullSubentPath &, AcArray< Adesk::GsMarker > &) const
virtual Acad::ErrorStatus  | subGetOsnapPoints (AcDb::OsnapMode, Adesk::GsMarker, const AcGePoint3d &, const AcGePoint3d &, const AcGeMatrix3d &, AcGePoint3dArray &, AcDbIntArray &) const
 virtual Acad::ErrorStatus  | subGetOsnapPoints (AcDb::OsnapMode, Adesk::GsMarker, const AcGePoint3d &, const AcGePoint3d &, const AcGeMatrix3d &, AcGePoint3dArray &, AcDbIntArray &, const AcGeMatrix3d &) const
virtual Acad::ErrorStatus  | subGetStretchPoints (AcGePoint3dArray &) const
 virtual Acad::ErrorStatus  | subGetSubentClassId (const AcDbFullSubentPath &, CLSID *) const
 virtual Acad::ErrorStatus  | subGetSubentPathGeomExtents (const AcDbFullSubentPath &, AcDbExtents &) const
virtual Acad::ErrorStatus  | subGetSubentPathsAtGsMarker (AcDb::SubentType, Adesk::GsMarker, const AcGePoint3d &, const AcGeMatrix3d &, int &, AcDbFullSubentPath *&, int=0, AcDbObjectId *=nullptr) const
virtual Acad::ErrorStatus  | subGetTransformedCopy (const AcGeMatrix3d &, AcDbEntity *&) const
virtual void  | subGripStatus (const AcDb::GripStat)
 virtual bool  | subHideMeForDragging () const
virtual Acad::ErrorStatus  | subHighlight (const AcDbFullSubentPath &=kNullSubent, const Adesk::Boolean=false) const
virtual Acad::ErrorStatus  | subIntersectWith (const AcDbEntity *, AcDb::Intersect, AcGePoint3dArray &, Adesk::GsMarker=0, Adesk::GsMarker=0) const
virtual Acad::ErrorStatus  | subIntersectWith (const AcDbEntity *, AcDb::Intersect, const AcGePlane &, AcGePoint3dArray &, Adesk::GsMarker=0, Adesk::GsMarker=0) const
virtual bool  | subIsContentSnappable () const
virtual void  | subList () const
virtual Acad::ErrorStatus  | subMoveGripPointsAt (const AcDbIntArray &, const AcGeVector3d &)
virtual Acad::ErrorStatus  | subMoveGripPointsAt (const AcDbVoidPtrArray &, const AcGeVector3d &, const int)
 virtual Acad::ErrorStatus  | subMoveGripPointsAtSubentPaths (const AcDbFullSubentPathArray &, const AcDbVoidPtrArray &, const AcGeVector3d &, const int)
virtual Acad::ErrorStatus  | subMoveStretchPointsAt (const AcDbIntArray &, const AcGeVector3d &)
virtual Adesk::UInt32  | subSetAttributes (AcGiDrawableTraits *)
Sets the values of this object's subentity traits and returns with the calling object's subentity traits. More...
virtual Acad::ErrorStatus  | subSetVisibility (AcDb::Visibility, Adesk::Boolean=true)
 virtual void  | subSubentGripStatus (const AcDb::GripStat, const AcDbFullSubentPath &)
virtual AcDbEntity *  | subSubentPtr (const AcDbFullSubentPath &) const
virtual Acad::ErrorStatus  | subTransformBy (const AcGeMatrix3d &)
 virtual Acad::ErrorStatus  | subTransformSubentPathsBy (const AcDbFullSubentPathArray &, const AcGeMatrix3d &)
virtual Acad::ErrorStatus  | subUnhighlight (const AcDbFullSubentPath &=kNullSubent, const Adesk::Boolean=false) const
virtual void  | subViewportDraw (AcGiViewportDraw *)
 virtual AcDb::Visibility  | subVisibility () const
virtual Adesk::Boolean  | subWorldDraw (AcGiWorldDraw *)
 Protected Member Functions inherited from AcDbObject
virtual Acad::ErrorStatus  | subDeepClone (AcDbObject *, AcDbObject *&, AcDbIdMapping &, Adesk::Boolean=true) const
virtual Acad::ErrorStatus  | subGetClassID (CLSID *) const
virtual Adesk::UInt32  | subSetAttributes (AcGiDrawableTraits *)
Sets the values of this object's subentity traits and returns with the calling object's subentity traits. More...
virtual void  | subViewportDraw (AcGiViewportDraw *)
virtual Adesk::UInt32  | subViewportDrawLogicalFlags (AcGiViewportDraw *)
virtual Acad::ErrorStatus  | subWblockClone (AcRxObject *, AcDbObject *&, AcDbIdMapping &, Adesk::Boolean=true) const
virtual Adesk::Boolean  | subWorldDraw (AcGiWorldDraw *)
 Protected Member Functions inherited from AcGiDrawable
virtual Adesk::UInt32  | subRegenSupportFlags () const
Returns whether and to which level this object supports MultiThreading. More...
virtual Adesk::UInt32  | subSetAttributes (AcGiDrawableTraits *)=0
virtual void  | subViewportDraw (AcGiViewportDraw *)=0
 virtual Adesk::UInt32  | subViewportDrawLogicalFlags (AcGiViewportDraw *)
virtual Adesk::Boolean  | subWorldDraw (AcGiWorldDraw *)=0
 Protected Member Functions inherited from AcRxObject
AcRxObject ()
Exported and implemented.
 Additional Inherited Members
 Public Types inherited from AcDbEntity
enum  | VisualStyleType { kFullVisualStyle = 0 , kFaceVisualStyle = 1 , kEdgeVisualStyle = 2 }
 Public Types inherited from AcGiDrawable
enum  | DrawableType {
 kGeometry = 0 , kDistantLight , kPointLight , kSpotLight ,
 kAmbientLight , kSolidBackground , kGradientBackground , kImageBackground ,
 kGroundPlaneBackground , kViewport
 }
enum  | SetAttributesFlags {
 kDrawableNone = 0 , kDrawableIsAnEntity = 1 , kDrawableUsesNesting = 2 , kDrawableIsCompoundObject = 4 ,
 kDrawableViewIndependentViewportDraw = 8 , kDrawableIsInvisible = 16 , kDrawableHasAttributes = 32 , kDrawableRegenTypeDependentGeometry = 64 ,
 kDrawableIsDimension = 133 , kDrawableRegenDraw = 256 , kDrawableStandardDisplaySingleLOD = 512 , kDrawableShadedDisplaySingleLOD = 1024 ,
 kDrawableViewDependentViewportDraw = 2048 , kDrawableBlockDependentViewportDraw = 4096 , kDrawableIsExternalReference = 8192 , kDrawableNotPlottable = 16384 ,
 kDrawableNotAllowLCS = 32768 , kDrawableMergeControlOff = 65536 , kThreadedWorldDrawViewportDraw = 131072
 }
 Static Public Member Functions inherited from AcRxObject
 static AcRxObject *  | cast (const AcRxObject *)
 static AcRxClass *  | desc ()
Exported and implemented.
 Static Public Member Functions inherited from AcHeapOperators
 static void  | operator delete (void *)
_
 static void  | operator delete (void *, const char *, int)
 static void  | operator delete (void *, void *)
 static void  | operator delete[] (void *)
_
 static void  | operator delete[] (void *, const char *, int)
 static void *  | operator new (size_t)
_
 static void *  | operator new (size_t, const char *, int)
 static void *  | operator new (size_t, void *p)
 static void *  | operator new[] (size_t)
_
 static void *  | operator new[] (size_t, const char *, int)
Detailed Description
_
Member Function Documentation
◆ appendAttribute() [1/2]
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbBlockReference::appendAttribute  |  ( |  AcDbAttribute *  |  pAcAttrib | )
Appends the specified attribute pAcAttrib to the attribute list of this block reference.
If this block reference is database resident, the attribute pAcAttrib is already added to the database. In this case the calling code has to close pAcAttrib. If this block reference is not yet database resident, the attribute will be added to the database, as soon as the block reference is added to the database.
Parameters
[in] | pAcAttrib | Attribute to add
Returns
Acad::eOk if succesfull
 Acad::eIllegalEntityType if this class is a derived class
◆ appendAttribute() [2/2]
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbBlockReference::appendAttribute  |  ( |  AcDbObjectId &  |  acId,
|  AcDbAttribute *  |  pAcAttrib
)
Appends the specified Attribute to the attribute list of this block reference and returns the objectId of the newly added attribute.
This block reference becomes the owner of the passed in attribute, and the attribute is added to the database to which this block reference belongs. This block reference must be added to a database before calling this function. The attribute pAcAttrib is still open after this function and has to be closed by the calling code.
Parameters
[out] | acId | object id of the attribute appended
[in] | pAcAttrib | Attribute to append to the block
Returns
Acad::eNoDatabase if the block reference is not database resident
 Acad::eIllegalEntityType if this class is a derived class
 Acad::eOk else.
◆ attributeIterator()
 UX_EXPORT_FUNCTION AcDbObjectIterator * AcDbBlockReference::attributeIterator  |  ( |   | ) |   const
Returns an attribute iterator.
Returns
Attribute iterator.
◆ blockTableRecord()
 UX_EXPORT_FUNCTION AcDbObjectId AcDbBlockReference::blockTableRecord  |  ( |   | ) |   const
Returns the object id of the corresponding block definition (DXF -2).
Returns
AcDbBlockTableRecord object id
◆ blockTransform()
 UX_EXPORT_FUNCTION AcGeMatrix3d AcDbBlockReference::blockTransform  |  ( |   | ) |   const
Returns an object AcGeMatrix3d representing the MCS for the block reference.
Returns
MCS matrix
◆ explodeToOwnerSpace()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbBlockReference::explodeToOwnerSpace  |  ( |   | ) |   const
virtual
Explodes the current AcDbBlockReference and adds the exploded entities to the owner of this block reference.
Returns
Acad::eOk if successful
 Acad::eNotInDatabase if current AcDbBlockReference is not database resident
 Acad::eInvalidInput if current AcDbBlockReference is not uniformly scaled Acad::eWrongDatabase if AcDbBlockReference resides in a different database than its corresponding AcDbBlockTableRecord
◆ geomExtentsBestFit()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbBlockReference::geomExtentsBestFit  |  ( |  AcDbExtents &  |  ext,
|  const AcGeMatrix3d &  |  trMat = AcGeMatrix3d::kIdentity
) |   |  const
Calculates and returns the extents of the block table record that is referenced.
Parameters
[out] | ext | WCS extents of this AcDbBlockReference
[in] | trMat | transformation matrix to be applied on this AcDbBlockReference
Returns
Acad::eOk if successful
 Acad::eInvalidInput if AcDbBlockReference has nonuniform transfromations
◆ getPlane()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbBlockReference::getPlane  |  ( |  AcGePlane &  |  plane,
|  AcDb::Planarity &  |  planarity
) |   |  const
virtual
Returns plane information.
Parameters
[out] | plane | not used, if planarity is AcDb::kNonPlanar
the inserts plane, if planarity is AcDb::kPlanar
an arbitrary plane, if planarity is AcDb::kLinear
[out] | planarity | one of AcDb::kNonPlanar, AcDb::kPlanar, AcDb::kLinear
Returns
Acad::eOk or appropriate error status
Reimplemented from AcDbEntity.
◆ isPlanar()
 DOIT UX_EXPORT_FUNCTION Adesk::Boolean AcDbBlockReference::isPlanar  |  ( |   | ) |   const
virtual
Reimplemented from AcDbEntity.
◆ normal()
 UX_EXPORT_FUNCTION AcGeVector3d AcDbBlockReference::normal  |  ( |   | ) |   const
Returns the normal in WCS (DXF 210).
Returns
normal
◆ openAttribute()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbBlockReference::openAttribute  |  ( |  AcDbAttribute *&  |  pAtt,
|  AcDbObjectId  |  attid,
|  AcDb::OpenMode  |  mode,
|  bool  |  openErased = false
)
Opens an attribute owned by this block reference.
Parameters
[out] | pAtt | pointer to opened attribute
[in] | attid | Id of the attribute to be opened
[in] | mode | Mode in which the attribute is to be opened
[in] | openErased | If true, an erased attribute will be opened too, otherwise not.
Returns
one of: Acad::eOk, Acad::eWasErased, Acad::eAtMaxReaders, Acad::eWasNotifying
 Acad::eWasOpenForUndo, Acad::eWasOpenForWrite, Acad::eNullObjectId
◆ openSequenceEnd()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbBlockReference::openSequenceEnd  |  ( |  AcDbSequenceEnd *&  |  pSeqEnd,
|  AcDb::OpenMode  |  mode
)
Opens the SequenceEnd entity for this block reference.
Parameters
[out] | pSeqEnd | pointer to opened sequenceend entity.
[in] | mode | Mode in which to open the SequenceEnd entity.
Returns
one of: Acad::eOk, Acad::eWasErased, Acad::eAtMaxReaders, Acad::eWasNotifying
 Acad::eWasOpenForUndo, Acad::eWasOpenForWrite, Acad::eNotThatKindOfClass
◆ position()
 UX_EXPORT_FUNCTION AcGePoint3d AcDbBlockReference::position  |  ( |   | ) |   const
virtual
Returns the insertion Point in WCS (DXF 10).
Returns
Insertion point
◆ rotation()
 UX_EXPORT_FUNCTION double AcDbBlockReference::rotation  |  ( |   | ) |   const
Returns the rotation in radians (DXF 50).
Returns
rotation.
◆ setBlockTableRecord()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbBlockReference::setBlockTableRecord  |  ( |  AcDbObjectId  |  acId | )
virtual
Sets the block definition (DXF -2).
Parameters
[in] | acId | Object id of a AcDbBlockTableRecord
Returns
Acad::eOk
◆ setBlockTransform()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbBlockReference::setBlockTransform  |  ( |  const AcGeMatrix3d &  |  acMatrix3d | )
virtual
Sets the block MCS to the specified in acMatrix3d.
Parameters
[in] | acMatrix3d | the MCS to use
Returns
Acad::eOk if succesfull
 Acad::eCannotScaleNonUniformly when the block only can be scaled uniformly
◆ setNormal()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbBlockReference::setNormal  |  ( |  const AcGeVector3d &  |  acVector | )
virtual
Sets the normal in WCS (DXF 210).
Parameters
[in] | acVector | normal
Returns
one of Acad::eInvalidInput, Acad::eOk
Reimplemented in AcDbTable.
◆ setPosition()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbBlockReference::setPosition  |  ( |  const AcGePoint3d &  |  acPoint | )
virtual
Sets the insertion point (DXF 10).
Parameters
[in] | acPoint | insertion point (WCS)
Returns
one of Acad::eInvalidInput, Acad::eOk
Reimplemented in AcDbTable.
◆ setRotation()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbBlockReference::setRotation  |  ( |  double  |  rotation | )
virtual
Sets the rotation in radians (DXF 50).
Parameters
[in] | rotation
Returns
Reimplemented in AcDbTable.
◆ setScaleFactors()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbBlockReference::setScaleFactors  |  ( |  const AcGeScale3d &  |  factors | )
virtual
Sets the block reference to the scale specified by scale3d.
Parameters
[in] | factors | the 3d Scale to use
Returns
Acad::eOk if succesfull
 Acad::eInvalidInput if any x,y or z scale is zero
 Acad::eCannotScaleNonUniformly when the block only can be scaled uniformly
◆ subGetClassID()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbBlockReference::subGetClassID  |  ( |  CLSID *  |  pClassId | ) |   const
protectedvirtual
Gets the COM wrapper Class ID for this entity.
Parameters
[out] | pClassId
Reimplemented from AcDbObject.
◆ subGetGsMarkersAtSubentPath()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbBlockReference::subGetGsMarkersAtSubentPath  |  ( |  const AcDbFullSubentPath &  |  subentId,
|  AcArray< Adesk::GsMarker > &  |  MarkerArray
) |   |  const
protectedvirtual
getGsMarkersAtSubentPath.
Parameters
[in] | subentId
[in] | gsMarkerArray
Returns
ErrorStatus
Remarks
exported but not yet implemented.
Reimplemented from AcDbEntity.
◆ subGetSubentPathsAtGsMarker()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbBlockReference::subGetSubentPathsAtGsMarker  |  ( |  AcDb::SubentType  |  eSubentType,
|  Adesk::GsMarker  |  gsMarker,
|  const AcGePoint3d &  |  PntIn,
|  const AcGeMatrix3d &  |  transformationMatrix,
|  int &  |  pathCnt,
|  AcDbFullSubentPath *&  |  pSubentPathArr,
|  int  |  insCnt = 0,
|  AcDbObjectId *  |  pContainerArray = NULL
) |   |  const
protectedvirtual
getSubentPathsAtGsMarker.
Parameters
[in] | eSubentType
[in] | gsMarker
[in] | PntIn
[in] | transformationMatrix
[in] | pathCnt
[in] | pSubentPathArr
[in] | insCnt
[in] | pContainerArray
Returns
ErrorStatus
Remarks
exported but not yet implemented.
Reimplemented from AcDbEntity.
◆ subGetTransformedCopy()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbBlockReference::subGetTransformedCopy  |  ( |  const AcGeMatrix3d &  |  matrix,
|  AcDbEntity *&  |  resultEntity
) |   |  const
protectedvirtual
Reimplemented from AcDbEntity.
Reimplemented in AcDbTable.
◆ subGripStatus()
 UX_EXPORT_FUNCTION void AcDbBlockReference::subGripStatus  |  ( |  const AcDb::GripStat  |  gripStatus | )
protectedvirtual
gripStatus.
Parameters
[in] | gripStatus
Remarks
exported but not yet implemented.
Reimplemented from AcDbEntity.
◆ subHighlight()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbBlockReference::subHighlight  |  ( |  const AcDbFullSubentPath &  |  subentId = kNullSubent,
|  const Adesk::Boolean  |  inAllViewports = Adesk::kFalse
) |   |  const
protectedvirtual
Highlights this insert or part of it.
If the specified object is already highlighted nothing happens.
Parameters
[in] | subentId | The subentity to be highlighted, or AcDbSubentId::kNullSubentId, to highlight this whole insert.
[in] | inAllViewports | highlight in all viewports
Returns
Acad::eOk or status returned by getGsMarkersAtSubentPath().
Reimplemented from AcDbEntity.
◆ subSubentPtr()
 UX_EXPORT_FUNCTION AcDbEntity * AcDbBlockReference::subSubentPtr  |  ( |  const AcDbFullSubentPath &  |  subentId | ) |   const
protectedvirtual
subentPtr.
Parameters
[in] | subentId
Returns
Entitypointer
Reimplemented from AcDbEntity.
◆ subUnhighlight()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbBlockReference::subUnhighlight  |  ( |  const AcDbFullSubentPath &  |  subentId = kNullSubent,
|  const Adesk::Boolean  |  inAllViewports = Adesk::kFalse
) |   |  const
protectedvirtual
Unhighlights this insert or part of it.
If the specified object is not highlighted nothing happens.
Parameters
[in] | subentId | The subentity to be unhighlighted, or AcDbSubentId::kNullSubentId, to unhighlight this whole insert.
[in] | inAllViewports | unhighlight in all viewports
Returns
Acad::eOk or status returned by getGsMarkersAtSubentPath().
Reimplemented from AcDbEntity.
◆ subWorldDraw()
 UX_EXPORT_FUNCTION Adesk::Boolean AcDbBlockReference::subWorldDraw  |  ( |  AcGiWorldDraw *  |  pWd | )
protectedvirtual
Creates a viewport-independent graphical representation of the object.
Parameters
[in] | pWd | Pointer to initialized AcGiWorldDraw interface.
Returns
if false, viewportDraw() must be called, if true the graphical representation is viewport-independent.
Reimplemented from AcDbEntity.
Reimplemented in AcDbTable.
◆ treatAsAcDbBlockRefForExplode()
 UX_EXPORT_FUNCTION Adesk::Boolean AcDbBlockReference::treatAsAcDbBlockRefForExplode  |  ( |   | ) |   const
virtual
Affects the way the command EXPLODE behaves with custom entities derived from AcDbBlockReference.
If this function is overridden to return Adesk::kTrue, the EXPLODE command will use the standard explode method for AcDbBlockTableReference (cloning the entities of the referenced AcDbBlockTableRecord to the owner AcDbBlockTableRecord). If the function is left to its default return value (Adesk::kFalse), then the EXPLODE command will use the overridden explode() method of the custom AcDbBlockReference.
Returns
default implementation returns Adesk::kFalse
Member Data Documentation
◆ AcDbBlockReference
 UX_EXPORT_FUNCTION AcDbBlockReference::AcDbBlockReference
Default constructor.
Initializing constructor.
Constructs an insert associated with a block definition and an insertion point
Parameters
[in] | insPt | insertion point in WCS
[in] | blockDef | Id of Associated Block Definition (An AcDbBlockTableRecord)