Public Member Functions | List of all members
AcDbSubentityOverrule Class Reference
_ More...
#include <AcDbSubentityOverrule.h>
 Public Member Functions
 virtual Acad::ErrorStatus  | addSubentPaths (AcDbEntity *, const AcDbFullSubentPathArray &)
 virtual Acad::ErrorStatus  | deleteSubentPaths (AcDbEntity *, const AcDbFullSubentPathArray &)
 virtual Acad::ErrorStatus  | getCompoundObjectTransform (const AcDbEntity *, AcGeMatrix3d &)
 virtual Acad::ErrorStatus  | getGripPointsAtSubentPath (const AcDbEntity *, const AcDbFullSubentPath &, AcDbGripDataPtrArray &, const double, const int, const AcGeVector3d &, const int)
 virtual Acad::ErrorStatus  | getGsMarkersAtSubentPath (const AcDbEntity *, const AcDbFullSubentPath &, AcArray< Adesk::GsMarker > &)
 virtual Acad::ErrorStatus  | getSubentClassId (const AcDbEntity *, const AcDbFullSubentPath &, CLSID *)
 virtual Acad::ErrorStatus  | getSubentPathGeomExtents (const AcDbEntity *, const AcDbFullSubentPath &, AcDbExtents &)
 virtual Acad::ErrorStatus  | getSubentPathsAtGsMarker (const AcDbEntity *, AcDb::SubentType, Adesk::GsMarker, const AcGePoint3d &, const AcGeMatrix3d &, int &, AcDbFullSubentPath *&, int=0, AcDbObjectId *=NULL)
 virtual Acad::ErrorStatus  | moveGripPointsAtSubentPaths (AcDbEntity *, const AcDbFullSubentPathArray &, const AcDbVoidPtrArray &, const AcGeVector3d &, const int)
 virtual void  | subentGripStatus (AcDbEntity *, const AcDb::GripStat, const AcDbFullSubentPath &)
 virtual AcDbEntity *  | subentPtr (const AcDbEntity *, const AcDbFullSubentPath &)
 virtual Acad::ErrorStatus  | transformSubentPathsBy (AcDbEntity *, const AcDbFullSubentPathArray &, const AcGeMatrix3d &)
 Public Member Functions inherited from AcRxOverrule
 virtual bool  | isApplicable (const AcRxObject *) const =0
 Public Member Functions inherited from AcRxObject
virtual AcRxObject *  | clone () const
Exported and implemented. More...
 virtual AcRx::Ordering  | comparedTo (const AcRxObject *) const
Exported and implemented.
virtual Acad::ErrorStatus  | copyFrom (const AcRxObject *)
Exported and implemented. More...
 virtual AcRxClass *  | isA () const
Exported and implemented.
virtual Adesk::Boolean  | isEqualTo (const AcRxObject *) const
Exported and implemented. More...
bool  | isKindOf (const AcRxClass *) const
Checks the object class. More...
AcRxObject *  | queryX (const AcRxClass *) const
returns the protocol extension object assigned to this class or a parent class. More...
AcRxObject *  | x (const AcRxClass *) const
returns the protocol extension object assigned to this class or a parent class. More...
 virtual  | ~AcRxObject ()
Destructor.
 Additional Inherited Members
 Static Public Member Functions inherited from AcRxOverrule
 static Acad::ErrorStatus  | addOverrule (AcRxClass *, AcRxOverrule *, bool=false)
 static bool  | hasOverrule (const AcRxObject *, AcRxClass *)
 static bool  | isOverruling (void)
 static Acad::ErrorStatus  | removeOverrule (AcRxClass *, AcRxOverrule *)
 static void  | setIsOverruling (bool)
 Static Public Member Functions inherited from AcRxObject
 static AcRxObject *  | cast (const AcRxObject *)
 static AcRxClass *  | desc ()
Exported and implemented.
 Protected Member Functions inherited from AcRxObject
AcRxObject ()
Exported and implemented.
Detailed Description
_