Public Member Functions | List of all members
AcDbUnderlayItem Class Referenceabstract
_ More...
#include <AcDbUnderlayItem.h>
 Public Member Functions
 virtual Acad::ErrorStatus  | draw (AcGiWorldDraw *, AcGiViewportDraw *, const AcDbUnderlayDrawContext &) const =0
 virtual Acad::ErrorStatus  | getExtents (AcGePoint2d &, AcGePoint2d &) const =0
virtual AcString  | getName () const =0
Returns the name of this underlay item. More...
 virtual Acad::ErrorStatus  | getOsnapPoints (const AcGeMatrix3d &, AcDb::OsnapMode, Adesk::GsMarker, const AcGePoint3d &, const AcGePoint3d &, const AcGeMatrix3d &, AcGePoint3dArray &, AcDbIntArray &) const =0
 virtual AcDbEntity *  | getSubEntityAtGsMarker (const AcGeMatrix3d &, Adesk::GsMarker) const =0
 virtual Acad::ErrorStatus  | getThumbnail (BITMAPINFO *&) const =0
 virtual AcDb::UnitsValue  | getUnits () const =0
 virtual Acad::ErrorStatus  | intersectWith (const AcGeMatrix3d &, const AcDbEntity *, AcDb::Intersect, const AcGePlane *, AcGePoint3dArray &, Adesk::GsMarker, Adesk::GsMarker) const =0
 virtual AcGeMatrix3d  | modelTransform () const =0
 virtual bool  | usingPartialContent () const =0
 int  | version () const
 virtual  | ~AcDbUnderlayItem ()=0
Destructor.
 Public Member Functions inherited from AcRxObject
virtual AcRxObject *  | clone () const
Exported and implemented. More...
 virtual AcRx::Ordering  | comparedTo (const AcRxObject *) const
Exported and implemented.
virtual Acad::ErrorStatus  | copyFrom (const AcRxObject *)
Exported and implemented. More...
 virtual AcRxClass *  | isA () const
Exported and implemented.
virtual Adesk::Boolean  | isEqualTo (const AcRxObject *) const
Exported and implemented. More...
bool  | isKindOf (const AcRxClass *) const
Checks the object class. More...
AcRxObject *  | queryX (const AcRxClass *) const
returns the protocol extension object assigned to this class or a parent class. More...
AcRxObject *  | x (const AcRxClass *) const
returns the protocol extension object assigned to this class or a parent class. More...
 virtual  | ~AcRxObject ()
Destructor.
 Additional Inherited Members
 Static Public Member Functions inherited from AcRxObject
 static AcRxObject *  | cast (const AcRxObject *)
 static AcRxClass *  | desc ()
Exported and implemented.
 Protected Member Functions inherited from AcRxObject
AcRxObject ()
Exported and implemented.
Detailed Description
_
Member Function Documentation
◆ getName()
 UX_EXPORT_FUNCTION AcString AcDbUnderlayItem::getName  |  ( |   | ) |   const
pure virtual
Returns the name of this underlay item.
Returns
AcString name string