Public Member Functions | List of all members
AcDbPathRef Class Reference
_ More...
#include <AcDbPathRef.h>
 Public Member Functions
AcDbPathRef (const AcArray< AcDbEdgeRef > &)
AcDbPathRef (const AcDbFullSubentPathArray &edgeSubentPathArr, const AcDbFullSubentPathArray &faceSubentPathArr)
AcDbPathRef (const AcDbPathRef &)
virtual Acad::ErrorStatus  | copyFrom (const AcRxObject *)
virtual AcDbEntity *  | createEntity () const
 const AcArray< AcDbEdgeRef > &  | edgeRefs () const
virtual Acad::ErrorStatus  | evaluateAndCacheGeometry ()
 Acad::ErrorStatus  | getEntityArray (AcArray< AcDbEntity * > &entities, bool) const
virtual bool  | isEmpty () const
 bool  | isEqualTo (const AcGeCurve3d *)
 bool  | isReferencePath ()
virtual bool  | isValid () const
virtual void  | reset ()
 void  | setEdgeRefs (const AcArray< AcDbEdgeRef > &)
virtual AcDbEntity *  | createEntity () const =0
virtual Acad::ErrorStatus  | evaluateAndCacheGeometry ()=0
virtual bool  | isEmpty () const =0
virtual bool  | isValid () const =0
virtual void  | reset ()=0
 Public Member Functions inherited from AcRxObject
virtual AcRxObject *  | clone () const
Exported and implemented. More...
 virtual AcRx::Ordering  | comparedTo (const AcRxObject *) const
Exported and implemented.
virtual Acad::ErrorStatus  | copyFrom (const AcRxObject *)
Exported and implemented. More...
 virtual AcRxClass *  | isA () const
Exported and implemented.
virtual Adesk::Boolean  | isEqualTo (const AcRxObject *) const
Exported and implemented. More...
bool  | isKindOf (const AcRxClass *) const
Checks the object class. More...
AcRxObject *  | queryX (const AcRxClass *) const
returns the protocol extension object assigned to this class or a parent class. More...
AcRxObject *  | x (const AcRxClass *) const
returns the protocol extension object assigned to this class or a parent class. More...
 virtual  | ~AcRxObject ()
Destructor.
 Additional Inherited Members
 Static Public Member Functions inherited from AcRxObject
 static AcRxObject *  | cast (const AcRxObject *)
 static AcRxClass *  | desc ()
Exported and implemented.
 Protected Member Functions inherited from AcRxObject
AcRxObject ()
Exported and implemented.
Detailed Description
_
Member Function Documentation
◆ copyFrom()
 virtual Acad::ErrorStatus AcDbPathRef::copyFrom  |  ( |  const AcRxObject *  |   | )
virtual
Reimplemented from AcRxObject.
◆ createEntity()
 virtual AcDbEntity * AcDbPathRef::createEntity  |  ( |   | ) |   const
virtual
Implements AcDbGeomRef.
◆ evaluateAndCacheGeometry()
 virtual Acad::ErrorStatus AcDbPathRef::evaluateAndCacheGeometry  |  ( |   | )
virtual
Implements AcDbGeomRef.
◆ isEmpty()
 virtual bool AcDbPathRef::isEmpty  |  ( |   | ) |   const
virtual
Implements AcDbGeomRef.
◆ isValid()
 virtual bool AcDbPathRef::isValid  |  ( |   | ) |   const
virtual
Implements AcDbGeomRef.
◆ reset()
 virtual void AcDbPathRef::reset  |  ( |   | )
virtual
Implements AcDbGeomRef.