Public Types | Public Member Functions | Static Public Member Functions | Public Attributes | List of all members
AcDbRasterImageDef Class Reference
_ More...
#include <AcDbRasterImageDef.h>
 Public Types
enum  | { kMaxSuggestNameSize = 2049 }
enum  | Units {
 kNone = 0 , kMillimeter , kCentimeter , kMeter ,
 kKilometer , kInch , kFoot , kYard ,
 kMile , kMicroinches , kMils , kAngstroms ,
 kNanometers , kMicrons , kDecimeters , kDekameters ,
 kHectometers , kGigameters , kAstronomical , kLightYears ,
 kParsecs
 }
 Public Types inherited from AcGiDrawable
enum  | DrawableType {
 kGeometry = 0 , kDistantLight , kPointLight , kSpotLight ,
 kAmbientLight , kSolidBackground , kGradientBackground , kImageBackground ,
 kGroundPlaneBackground , kViewport
 }
enum  | SetAttributesFlags {
 kDrawableNone = 0 , kDrawableIsAnEntity = 1 , kDrawableUsesNesting = 2 , kDrawableIsCompoundObject = 4 ,
 kDrawableViewIndependentViewportDraw = 8 , kDrawableIsInvisible = 16 , kDrawableHasAttributes = 32 , kDrawableRegenTypeDependentGeometry = 64 ,
 kDrawableIsDimension = 133 , kDrawableRegenDraw = 256 , kDrawableStandardDisplaySingleLOD = 512 , kDrawableShadedDisplaySingleLOD = 1024 ,
 kDrawableViewDependentViewportDraw = 2048 , kDrawableBlockDependentViewportDraw = 4096 , kDrawableIsExternalReference = 8192 , kDrawableNotPlottable = 16384 ,
 kDrawableNotAllowLCS = 32768 , kDrawableMergeControlOff = 65536 , kThreadedWorldDrawViewportDraw = 131072
 }
 Public Member Functions
virtual const ACHAR *  | activeFileName () const
Returns the current active file that is used to define the raster image. More...
virtual Acad::ErrorStatus  | closeImage ()
Closes the open image. More...
virtual int  | colorDepth () const
Returns the color depth (bit per pixel) for the RasterImage. More...
 virtual void *  | createThumbnailBitmap (BITMAPINFO *&, Adesk::UInt8=50, Adesk::UInt8=50, Adesk::UInt8=0)
virtual Acad::ErrorStatus  | dwgInFields (AcDbDwgFiler *)
virtual Acad::ErrorStatus  | dwgOutFields (AcDbDwgFiler *) const
virtual Acad::ErrorStatus  | dxfInFields (AcDbDxfFiler *)
virtual Acad::ErrorStatus  | dxfOutFields (AcDbDxfFiler *) const
virtual Acad::ErrorStatus  | embed ()
Embeds the RasterImageDefinition into the database - currently not implemented. More...
virtual int  | entityCount (Adesk::Boolean *=NULL) const
Returns the number of AcDbRasterImage entities which are set for More...
 virtual Atil::FileReadDescriptor *  | fileDescCopy () const
virtual const ACHAR *  | fileType () const
Returns the current image file format. More...
 virtual IAcReadStream *  | getReadStream ()
 virtual Atil::Image *  | imageCopy (Adesk::Boolean=Adesk::kTrue) const
virtual Adesk::Boolean  | imageModified () const
Gets modified status of the image. More...
virtual Adesk::Boolean  | isEmbedded () const
Embeds the RasterImageDefinition into the database - currently not implemented. More...
virtual Adesk::Boolean  | isLoaded () const
Returns whether the image is already loaded. More...
virtual Acad::ErrorStatus  | load ()
Sets the image source file "lazy loading" on. More...
 virtual Acad::ErrorStatus  | loadThumbnail (Adesk::UInt16 &, Adesk::UInt16 &, Adesk::UInt8 *=NULL, int=0)
 virtual AcGiSentScanLines *  | makeScanLines (const AcGiRequestScanLines *, const AcGeMatrix2d &, AcGePoint2dArray *=NULL, Adesk::Boolean=Adesk::kFalse, Adesk::Boolean=Adesk::kFalse, const double=50.0, const double=50.0, const double=0.0) const
virtual Acad::ErrorStatus  | openImage (Atil::Image *&)
Opens the image for direct image operations. More...
 virtual AcGiImageOrg  | organization () const
virtual AcGeVector2d  | resolutionMMPerPixel () const
Gets the size of a image pixel in mm. More...
virtual Units  | resolutionUnits () const
Returns the units of resolution. More...
virtual const ACHAR *  | searchForActivePath ()
Returns the actual found location of the active image file. More...
virtual Acad::ErrorStatus  | setActiveFileName (const ACHAR *)
Sets the current active file to be the one used to define the raster image. More...
virtual Acad::ErrorStatus  | setImage (const Atil::Image *, const Atil::FileReadDescriptor *, Adesk::Boolean=Adesk::kTrue)
Sets a new image for direct image operations. More...
virtual Acad::ErrorStatus  | setImageModified (Adesk::Boolean)
Marks the open image as modified or unmodified More...
virtual Acad::ErrorStatus  | setResolutionMMPerPixel (const AcGeVector2d &)
Sets the width and height of a pixel in millimeters. More...
virtual void  | setResolutionUnits (Units)
Sets the resolution units. More...
virtual Acad::ErrorStatus  | setSourceFileName (const ACHAR *)
Sets the image file path. More...
 virtual Acad::ErrorStatus  | setUndoStoreSize (unsigned int=10)
virtual AcGeVector2d  | size () const
Gets the size of a image in pixels. More...
virtual const ACHAR *  | sourceFileName () const
Returns the location of a specified image file. More...
virtual Acad::ErrorStatus  | subClose ()
virtual Acad::ErrorStatus  | subErase (Adesk::Boolean)
 virtual unsigned int  | undoStoreSize () const
virtual Acad::ErrorStatus  | unload (Adesk::Boolean=Adesk::kTrue)
Unloads the raster image data without deleting the definition. More...
 virtual Acad::ErrorStatus  | unloadThumbnail ()
 virtual void  | updateEntities () const
Updates image entities after changes to this image definition.
 Public Member Functions inherited from AcDbObject
virtual void  | addPersistentReactor (AcDbObjectId)
Adds a persistent reactor to this object reactor list. More...
void  | addReactor (AcDbObjectReactor *) const
Adds a transient reactor to this object. More...
virtual Acad::ErrorStatus  | applyPartialUndo (AcDbDwgFiler *, AcRxClass *)
This function is called during Undo operations on objects, that use the 'Partial Undo meachanism'; this is, this object is opened with assertWriteEnabled(Adesk::kFalse) to indicate that custom Undo filing is used rather than the default Undo filing. More...
 void  | assertNotifyEnabled () const
 void  | assertReadEnabled () const
 void  | assertWriteEnabled (Adesk::Boolean=Adesk::kTrue, Adesk::Boolean=Adesk::kTrue)
virtual Acad::ErrorStatus  | audit (AcDbAuditInfo *)
Performs the audit operation for this object. More...
Acad::ErrorStatus  | cancel ()
Reverts all changes since the object had been opened and closes the object. More...
virtual void  | cancelled (const AcDbObject *)
A handler function for persistent reactors. More...
virtual AcRxObject *  | clone () const
Creates a shallow clone of this object. More...
Acad::ErrorStatus  | close ()
Closes the object. More...
Acad::ErrorStatus  | closeAndPage (Adesk::Boolean=Adesk::kTrue)
Closes the object. More...
virtual Acad::ErrorStatus  | composeForLoad (AcDb::OdaSaveType, AcDb::AcDbDwgVersion)
This function is intended for future MT file loading support. More...
virtual void  | copied (const AcDbObject *, const AcDbObject *)
A handler function for persistent reactors. More...
virtual Acad::ErrorStatus  | copyFrom (const AcRxObject *)
Copies the pSrc object information in this object. More...
Acad::ErrorStatus  | createExtensionDictionary ()
Creates a dictionary as extension dictionary for this object. More...
AcDbDatabase *  | database () const
Returns the database that contains this object. More...
virtual Acad::ErrorStatus  | decomposeForSave (AcDb::AcDbDwgVersion, AcDbObject *&, AcDbObjectId &, Adesk::Boolean &)
This function is called during dwg and dxf output, to allow a custom object to decompose itself, due to provided dwg/dxf target file version. More...
virtual Acad::ErrorStatus  | deepClone (AcDbObject *, AcDbObject *&, AcDbIdMapping &, Adesk::Boolean=Adesk::kTrue) const final
Clones this object, appends it to the owner pOwner and adds an AcDbIdPair record to the idMap. More...
void  | disableUndoRecording (Adesk::Boolean)
Disables or enables the undo recording for the object. More...
Acad::ErrorStatus  | downgradeOpen ()
Sets the open mode for an object opened for write to be opened for read. More...
Acad::ErrorStatus  | downgradeToNotify (Adesk::Boolean)
Sets the open mode for an object opened for write to be opened for notify. More...
virtual AcGiDrawable *  | drawable ()
Retrieves the AcGiDrawable instance of this object. More...
Acad::ErrorStatus  | dwgIn (AcDbDwgFiler *)
Calls the object's dwgInFields function, and reads any XData if present. More...
virtual Acad::ErrorStatus  | dwgInFields (AcDbDwgFiler *)
Reads the object from the DWG filer. More...
Acad::ErrorStatus  | dwgOut (AcDbDwgFiler *) const
Calls the object's dwgOutFields function, and writes any XData if present. More...
virtual Acad::ErrorStatus  | dwgOutFields (AcDbDwgFiler *) const
Writes the object to the DWG filer. More...
Acad::ErrorStatus  | dxfIn (AcDbDxfFiler *)
Calls the object's dxfInFields function, and reads any XData if present. More...
virtual Acad::ErrorStatus  | dxfInFields (AcDbDxfFiler *)
Reads the object from the DXF filer. More...
Acad::ErrorStatus  | dxfOut (AcDbDxfFiler *, Adesk::Boolean, Adesk::uchar *) const
Calls the object's dxfOutFields function, and writes any XData if present. More...
virtual Acad::ErrorStatus  | dxfOutFields (AcDbDxfFiler *) const
Writes the object to the DXF filer. More...
Acad::ErrorStatus  | erase (Adesk::Boolean=Adesk::kTrue)
Sets the bit that indicates that the object is erased. More...
virtual void  | erased (const AcDbObject *, Adesk::Boolean=Adesk::kTrue)
A handler function for persistent reactors. More...
AcDbObjectId  | extensionDictionary () const
Returns the object id of the extension dictionary for this object. More...
void  | getAcDbHandle (AcDbHandle &) const
Returns handle of this object. More...
Acad::ErrorStatus  | getBinaryData (const ACHAR *, Adesk::Int32 &, char *&) const
Creates a copy of the binary data stored as chunks of maximum 127 bytes in the resbuf chain of this object's extension dictionary xrecord entry given by entryName. More...
int  | getBrxOpenCount () const
This function returns the number of open BRX instances for this object. More...
int  | getBrxOpenState () const
This function returns the BRX object open state flags as bitfields, for diagnostic purpose. More...
virtual Acad::ErrorStatus  | getClassID (CLSID *) const final
Gets the COM wrapper Class ID for this entity. More...
int  | getCustomObjectState () const
This function returns the custom object status : 1=isCustomObject 2=DifferentialUndoDisabled. More...
Acad::ErrorStatus  | getField (const ACHAR *, AcDbField *&, AcDb::OpenMode) const
Retrieves the specified Field from this object, and opens it in mode. More...
Acad::ErrorStatus  | getField (const ACHAR *, AcDbObjectId &) const
Gets the pszPropName field object from field dictionary of this AcDbObject object, using pszPropName as key. More...
AcDbObjectId  | getFieldDictionary () const
Returns the Field dictionary associated with this object,. More...
Acad::ErrorStatus  | getFieldDictionary (AcDbDictionary *&, AcDb::OpenMode) const
Gets and opens the field dictionary for this. More...
Acad::ErrorStatus  | getObjectBirthVersion (AcDb::AcDbDwgVersion &, AcDb::MaintenanceReleaseVersion &)
This function is currently not supported by the CAD engine, always returns Acad::eOk, and 'kDHL_CURRENT' + 'kMReleaseCurrent' results. More...
virtual Acad::ErrorStatus  | getObjectSaveVersion (const AcDbDwgFiler *, AcDb::AcDbDwgVersion &, AcDb::MaintenanceReleaseVersion &)
Returns the DWG version for saving the object. More...
virtual Acad::ErrorStatus  | getObjectSaveVersion (const AcDbDxfFiler *, AcDb::AcDbDwgVersion &, AcDb::MaintenanceReleaseVersion &)
Returns the DWG version for saving the object. More...
int  | getOdaOpenCount () const
This function returns the number of open ODA instances for this object. More...
int  | getOdaOpenState () const
This function returns the ODA object open state flags as bitfields, for diagnostic purpose. More...
virtual void  | goodbye (const AcDbObject *)
A handler function for persistent reactors. More...
virtual AcGsNode *  | gsNode () const
Gets the AcGsNode (graphics cache) for this entity. More...
Acad::ErrorStatus  | handOverTo (AcDbObject *, Adesk::Boolean=Adesk::kTrue, Adesk::Boolean=Adesk::kTrue)
Hands over objects identity to another object. More...
bool  | hasFields () const
Return true if this object has single or multiple fields associated with him. More...
bool  | hasPersistentReactor (AcDbObjectId) const
Checks the input objectId in this object reactor list. More...
bool  | hasSaveVersionOverride ()
This function indicates whether this object overrides the filer's save version. More...
virtual AcDbObjectId  | id () const
Returns the database id of this object. More...
Adesk::Boolean  | isAcDbObjectIdsInFlux () const
Checks whether a deep clone operation was completed. More...
Adesk::Boolean  | isAProxy () const
Adesk::Boolean  | isCancelling () const
Adesk::Boolean  | isErased () const
Returns whether this object is erased. More...
Adesk::Boolean  | isEraseStatusToggled () const
Checks whether the object erase status has been toggled. More...
Adesk::Boolean  | isModified () const
Returns whether this object's assertWriteEnabled() has been called since it was opened. More...
Adesk::Boolean  | isModifiedGraphics () const
Checks whether this object graphics will be updated when the object is closed. More...
Adesk::Boolean  | isModifiedXData () const
Checks whether this object's xData was modified. More...
Adesk::Boolean  | isNewObject () const
Returns true if and only if this object has not been closed since it was created. More...
Adesk::Boolean  | isNotifyEnabled () const
Returns whether this object is opened for notify. More...
Adesk::Boolean  | isNotifying () const
virtual Adesk::Boolean  | isPersistent () const
Returns the 'persistent' status of a database object. More...
Adesk::Boolean  | isReadEnabled () const
Returns whether this object is opened for read. More...
 Adesk::Boolean  | isReallyClosing () const
Checks whether the next close call will completely close this object return true if on the next call the object will be completely closed false otherwise.
Adesk::Boolean  | isTransactionResident () const
Gets the object transaction status. More...
Adesk::Boolean  | isUndoing () const
bool  | isUndoRecordingDisabled () const
Returns whether the undo recording for the object is enabled or not. More...
Adesk::Boolean  | isWriteEnabled () const
Returns whether this object is opened for write. More...
virtual AcDb::DuplicateRecordCloning  | mergeStyle () const
Returns the object's merge behavior during cloning. More...
virtual void  | modified (const AcDbObject *)
A handler function for persistent reactors. More...
virtual void  | modifiedGraphics (const AcDbEntity *)
A handler function for persistent reactors. More...
virtual void  | modifiedXData (const AcDbObject *)
A handler function for persistent reactors. More...
virtual void  | modifyUndone (const AcDbObject *)
A handler function for persistent reactors. More...
virtual void  | objectClosed (const AcDbObjectId)
A handler function for persistent reactors. More...
AcDbObjectId  | objectId () const
Returns object id. More...
virtual void  | openedForModify (const AcDbObject *)
A handler function for persistent reactors. More...
AcDbObjectId  | ownerId () const
Returns object id of the owner. More...
AcDbVoidPtrArray *  | reactors ()
Gets the object pointers to reactors. More...
const AcDbVoidPtrArray *  | reactors () const
Gets the object pointers to reactors. More...
virtual void  | reappended (const AcDbObject *)
A handler function for persistent reactors. More...
 virtual void  | recvPropagateModify (const AcDbObject *)
Not implemented yet.
Acad::ErrorStatus  | releaseExtensionDictionary ()
Removes the extension dictionary associated with this object. More...
virtual Acad::ErrorStatus  | removeField (AcDbObjectId)
Removes the Field specified by acFieldId from this object. More...
virtual Acad::ErrorStatus  | removeField (const ACHAR *)
Removes the Field specified by szKeyString from this object. More...
virtual Acad::ErrorStatus  | removeField (const ACHAR *, AcDbObjectId &)
Removes the Field specified by acPszKeyString from this object, and returns its ObjectId value. More...
virtual Acad::ErrorStatus  | removePersistentReactor (AcDbObjectId)
Removes a persistent reactor from this object reactor list. More...
void  | removeReactor (AcDbObjectReactor *) const
Removes a transient reactor to this object. More...
void  | setAcDbObjectIdsInFlux ()
Call this function to indicate that the object IDs of this object and its sub-objects (if any) are not yet valid. More...
Acad::ErrorStatus  | setBinaryData (const ACHAR *, Adesk::Int32, const char *)
Creates a copy of the binary data, divides it in up to 127 bytes binary chunks and
 sets them as resbufs in the resbuf chain of this object's extension dictionary xrecord entry given by entryName. More...
virtual Acad::ErrorStatus  | setField (const ACHAR *, AcDbField *, AcDbObjectId &)
Adds the pAcField field object to field dictionary of this AcDbObject object, using pKey as key. More...
virtual void  | setGsNode (AcGsNode *)
Gets the AcGsNode (graphics cache) for this entity. More...
void  | setHasSaveVersionOverride (bool)
This function can be called to specify that the object has a "save version override". More...
virtual Acad::ErrorStatus  | setOwnerId (AcDbObjectId)
Sets the ownerId data member of the object to be objId. More...
virtual Acad::ErrorStatus  | setXData (const resbuf *)
Sets/removes xData associated with this object. More...
virtual Acad::ErrorStatus  | subCancel ()
Possibility to veto a cancel operation from within custom entities. More...
virtual Acad::ErrorStatus  | subClose ()
virtual Acad::ErrorStatus  | subErase (Adesk::Boolean)
This hook is called during an AcDbObject::erase call, before any actual erase operation is performed. More...
 virtual Acad::ErrorStatus  | subHandOverTo (AcDbObject *)
virtual void  | subObjModified (const AcDbObject *, const AcDbObject *)
A handler function for persistent reactors. More...
 virtual Acad::ErrorStatus  | subOpen (AcDb::OpenMode)
virtual Acad::ErrorStatus  | subSwapIdWith (AcDbObjectId, Adesk::Boolean=Adesk::kFalse, Adesk::Boolean=Adesk::kFalse)
This hook is called during an AcDbObject::swapIdWith() call, before any actual swap operation is performed. More...
Acad::ErrorStatus  | swapIdWith (AcDbObjectId, Adesk::Boolean=Adesk::kFalse, Adesk::Boolean=Adesk::kFalse)
Swaps the object id's between the object identified by param swapId and this object. More...
virtual Acad::ErrorStatus  | swapReferences (const AcDbIdMapping &)
Not implemented yet. More...
virtual void  | unappended (const AcDbObject *)
A handler function for persistent reactors. More...
AcDbDwgFiler *  | undoFiler ()
Gets the undo filer for this object. More...
Acad::ErrorStatus  | upgradeFromNotify (Adesk::Boolean &)
Upgrades the open status of this object to AcDb::kForWrite, if this object is already open (either in AcDb::kForRead, AcDb::kForNotify or AcDb::kForWrite) More...
Acad::ErrorStatus  | upgradeOpen ()
Changes the objects open mode to AcDb::kForWrite and sends notifications. More...
virtual Acad::ErrorStatus  | wblockClone (AcRxObject *, AcDbObject *&, AcDbIdMapping &, Adesk::Boolean=Adesk::kTrue) const final
Clones this object, appends it to the owner pOwner and adds an AcDbIdPair record to the idMap. More...
virtual resbuf *  | xData (const ACHAR *=NULL) const
Returns the xData associated with this object. More...
Acad::ErrorStatus  | xDataTransformBy (const AcGeMatrix3d &)
Transforms the extended data according to parameter transformation matrix. More...
 virtual void  | xmitPropagateModify () const
Not implemented yet.
 virtual  | ~AcDbObject ()
Destructor.
 Public Member Functions inherited from AcGiDrawable
virtual bool  | bounds (AcDbExtents &) const
virtual DrawableType  | drawableType () const
 virtual AcGiDrawStream *  | drawStream () const
virtual AcGsNode *  | gsNode () const =0
virtual AcDbObjectId  | id () const =0
virtual Adesk::Boolean  | isPersistent () const =0
virtual Adesk::UInt32  | regenSupportFlags () const final
Returns whether and to which level this object supports MultiThreading. More...
 virtual Adesk::Boolean  | RolloverHit (Adesk::ULongPtr, Adesk::ULongPtr, Adesk::Boolean)
 virtual Adesk::UInt32  | setAttributes (AcGiDrawableTraits *) final
 virtual void  | setDrawStream (AcGiDrawStream *)
virtual void  | setGsNode (AcGsNode *)=0
 virtual void  | viewportDraw (AcGiViewportDraw *) final
 virtual Adesk::UInt32  | viewportDrawLogicalFlags (AcGiViewportDraw *) final
 virtual Adesk::Boolean  | worldDraw (AcGiWorldDraw *) final
 Public Member Functions inherited from AcRxObject
virtual AcRxObject *  | clone () const
Exported and implemented. More...
 virtual AcRx::Ordering  | comparedTo (const AcRxObject *) const
Exported and implemented.
virtual Acad::ErrorStatus  | copyFrom (const AcRxObject *)
Exported and implemented. More...
 virtual AcRxClass *  | isA () const
Exported and implemented.
virtual Adesk::Boolean  | isEqualTo (const AcRxObject *) const
Exported and implemented. More...
bool  | isKindOf (const AcRxClass *) const
Checks the object class. More...
AcRxObject *  | queryX (const AcRxClass *) const
returns the protocol extension object assigned to this class or a parent class. More...
AcRxObject *  | x (const AcRxClass *) const
returns the protocol extension object assigned to this class or a parent class. More...
 virtual  | ~AcRxObject ()
Destructor.
 Static Public Member Functions
static ClassVersion  | classVersion ()
Returns the current class version. More...
static Acad::ErrorStatus  | createImageDictionary (AcDbDatabase *, AcDbObjectId &)
Creates a new image dictionary. More...
static AcDbObjectId  | imageDictionary (AcDbDatabase *)
Gets the image dictionary object ID. More...
static Acad::ErrorStatus  | suggestName (AcDbDictionary *, const ACHAR *, ACHAR *)
Transforms the input image name/path string pImageName into a valid string key pSuggestedName for the image dictionary pImageDict. More...
 Static Public Member Functions inherited from AcRxObject
 static AcRxObject *  | cast (const AcRxObject *)
 static AcRxClass *  | desc ()
Exported and implemented.
 Static Public Member Functions inherited from AcHeapOperators
 static void  | operator delete (void *)
_
 static void  | operator delete (void *, const char *, int)
 static void  | operator delete (void *, void *)
 static void  | operator delete[] (void *)
_
 static void  | operator delete[] (void *, const char *, int)
 static void *  | operator new (size_t)
_
 static void *  | operator new (size_t, const char *, int)
 static void *  | operator new (size_t, void *p)
 static void *  | operator new[] (size_t)
_
 static void *  | operator new[] (size_t, const char *, int)
 Public Attributes
AcDbRasterImageDef
Default constructor.
 Additional Inherited Members
 Protected Member Functions inherited from AcDbObject
virtual Acad::ErrorStatus  | subDeepClone (AcDbObject *, AcDbObject *&, AcDbIdMapping &, Adesk::Boolean=true) const
virtual Acad::ErrorStatus  | subGetClassID (CLSID *) const
virtual Adesk::UInt32  | subSetAttributes (AcGiDrawableTraits *)
Sets the values of this object's subentity traits and returns with the calling object's subentity traits. More...
virtual void  | subViewportDraw (AcGiViewportDraw *)
virtual Adesk::UInt32  | subViewportDrawLogicalFlags (AcGiViewportDraw *)
virtual Acad::ErrorStatus  | subWblockClone (AcRxObject *, AcDbObject *&, AcDbIdMapping &, Adesk::Boolean=true) const
virtual Adesk::Boolean  | subWorldDraw (AcGiWorldDraw *)
 Protected Member Functions inherited from AcGiDrawable
virtual Adesk::UInt32  | subRegenSupportFlags () const
Returns whether and to which level this object supports MultiThreading. More...
virtual Adesk::UInt32  | subSetAttributes (AcGiDrawableTraits *)=0
virtual void  | subViewportDraw (AcGiViewportDraw *)=0
 virtual Adesk::UInt32  | subViewportDrawLogicalFlags (AcGiViewportDraw *)
virtual Adesk::Boolean  | subWorldDraw (AcGiWorldDraw *)=0
 Protected Member Functions inherited from AcRxObject
AcRxObject ()
Exported and implemented.
Detailed Description
_
Member Function Documentation
◆ activeFileName()
 UX_EXPORT_FUNCTION const ACHAR * AcDbRasterImageDef::activeFileName  |  ( |   | ) |   const
virtual
Returns the current active file that is used to define the raster image.
Returns
active file name
◆ classVersion()
 UX_EXPORT_FUNCTION ClassVersion AcDbRasterImageDef::classVersion  |  ( |   | )
static
Returns the current class version.
Returns
Class version
◆ closeImage()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbRasterImageDef::closeImage  |  ( |   | )
virtual
Closes the open image.
Returns
Acad::eOk if successful, or an error code (eNotOpenForWrite if the image was not open).
◆ colorDepth()
 UX_EXPORT_FUNCTION int AcDbRasterImageDef::colorDepth  |  ( |   | ) |   const
virtual
Returns the color depth (bit per pixel) for the RasterImage.
Returns
bits per pixel
◆ createImageDictionary()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbRasterImageDef::createImageDictionary  |  ( |  AcDbDatabase *  |  pAcDb,
|  AcDbObjectId &  |  id
)
static
Creates a new image dictionary.
Parameters
[in] | pAcDb | dictionary database owner
[out] | id | dictionary object id
Returns
Acad::eOk if successful
errorcode otherwise
◆ dwgInFields()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbRasterImageDef::dwgInFields  |  ( |  AcDbDwgFiler *  |  dwgFiler | )
virtual
See also
AcDbObject::dwgInFields(AcDbDwgFiler*)
Reimplemented from AcDbObject.
◆ dwgOutFields()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbRasterImageDef::dwgOutFields  |  ( |  AcDbDwgFiler *  |  dwgFiler | ) |   const
virtual
See also
AcDbObject::dwgOutFields(AcDbDwgFiler*)
Reimplemented from AcDbObject.
◆ dxfInFields()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbRasterImageDef::dxfInFields  |  ( |  AcDbDxfFiler *  |  dxfFiler | )
virtual
See also
AcDbObject::dxfInFields(AcDbDxfFiler*)
Reimplemented from AcDbObject.
◆ dxfOutFields()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbRasterImageDef::dxfOutFields  |  ( |  AcDbDxfFiler *  |  dxfFiler | ) |   const
virtual
See also
AcDbObject::dxfOutFields(AcDbDxfFiler*)
Reimplemented from AcDbObject.
◆ embed()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbRasterImageDef::embed  |  ( |   | )
virtual
Embeds the RasterImageDefinition into the database - currently not implemented.
Returns
Acad::eNotImplementedYet always
◆ entityCount()
 UX_EXPORT_FUNCTION int AcDbRasterImageDef::entityCount  |  ( |  Adesk::Boolean *  |  onLockedLayers = NULL | ) |   const
virtual
Returns the number of AcDbRasterImage entities which are set for
*this raster definition object
Parameters
[out] | onLockedLayers | returns Adesk::kTrue if it is not NULL and if at least one of the found image entities is on a locked layer, otherwise Adesk::kFalse.
Returns
number of AcDbRasterImage building this AcDbRasterImageDef
◆ fileType()
 UX_EXPORT_FUNCTION const ACHAR * AcDbRasterImageDef::fileType  |  ( |   | ) |   const
virtual
Returns the current image file format.
Returns
file type such as BMP, JPG, GIF, PNG, etc.
◆ imageDictionary()
 UX_EXPORT_FUNCTION AcDbObjectId AcDbRasterImageDef::imageDictionary  |  ( |  AcDbDatabase *  |  pAcDb | )
static
Gets the image dictionary object ID.
Parameters
[in] | pAcDb | dictionary database owner
Returns
dictionary object id if this exists 0 otherwise
◆ imageModified()
 UX_EXPORT_FUNCTION Adesk::Boolean AcDbRasterImageDef::imageModified  |  ( |   | ) |   const
virtual
Gets modified status of the image.
Returns
Adesk::kTrue if the image is marked as modified
◆ isEmbedded()
 UX_EXPORT_FUNCTION Adesk::Boolean AcDbRasterImageDef::isEmbedded  |  ( |   | ) |   const
virtual
Embeds the RasterImageDefinition into the database - currently not implemented.
Returns
true if image data is embedded in the database
◆ isLoaded()
 UX_EXPORT_FUNCTION Adesk::Boolean AcDbRasterImageDef::isLoaded  |  ( |   | ) |   const
virtual
Returns whether the image is already loaded.
Returns
Adesk::kTrue or Adesk::kFalse
◆ load()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbRasterImageDef::load  |  ( |   | )
virtual
Sets the image source file "lazy loading" on.
Returns
Acad::eOk if successful,
Acad::eFileAccessErr,
Acad::eInvalidInput otherwise
◆ openImage()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbRasterImageDef::openImage  |  ( |  Atil::Image *&  |  image | )
virtual
Opens the image for direct image operations.
.*
Parameters
[out] | image | the attached image
Returns
Acad::eOk if successful, or an error code.
◆ resolutionMMPerPixel()
 UX_EXPORT_FUNCTION AcGeVector2d AcDbRasterImageDef::resolutionMMPerPixel  |  ( |   | ) |   const
virtual
Gets the size of a image pixel in mm.
Returns
AcGeVector2d vector:
x coordinate = pixel height
y coordinate = pixel width
◆ resolutionUnits()
 UX_EXPORT_FUNCTION AcDbRasterImageDef::Units AcDbRasterImageDef::resolutionUnits  |  ( |   | ) |   const
virtual
Returns the units of resolution.
Returns
kNone if the image is not loaded or has no resolution info, otherwise the appropriate resolution unit
◆ searchForActivePath()
 UX_EXPORT_FUNCTION const ACHAR * AcDbRasterImageDef::searchForActivePath  |  ( |   | )
virtual
Returns the actual found location of the active image file.
Returns
first found path of active image filename
◆ setActiveFileName()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbRasterImageDef::setActiveFileName  |  ( |  const ACHAR *  |  fileName | )
virtual
Sets the current active file to be the one used to define the raster image.
.* Note that this is made without changing the actual source file name. .*
Parameters
[in] | fileName | the path to image file
Returns
Acad::eOk if file name is a valid image, Acad::eInvalidInput otherwise
◆ setImage()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbRasterImageDef::setImage  |  ( |  const Atil::Image *  |  image,
|  const Atil::FileReadDescriptor *  |  filedesc,
|  Adesk::Boolean  |  modifyDb = Adesk::kTrue
)
virtual
Sets a new image for direct image operations.
.*
Parameters
[in] | image | the new image .*
[in] | filedesc | image source file .*
[in] | modifyDb | Adesk::kTrue if database should be modified (required for undo)
Returns
Acad::eOk if successful, or an error code.
◆ setImageModified()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbRasterImageDef::setImageModified  |  ( |  Adesk::Boolean  |  modified | )
virtual
Marks the open image as modified or unmodified
*
Parameters
[in] | modifed | Adesk::kTrue to mark the image as modified, Adesk::kFalse to mark as unmodified
Returns
Acad::eOk if successful, or an error code (eNotApplicable if the image is not open).
◆ setResolutionMMPerPixel()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbRasterImageDef::setResolutionMMPerPixel  |  ( |  const AcGeVector2d &  |  mmPP | )
virtual
Sets the width and height of a pixel in millimeters.
Parameters
[in] | mmPP | pixel width and height
Returns
the appropriate error status
◆ setResolutionUnits()
 UX_EXPORT_FUNCTION void AcDbRasterImageDef::setResolutionUnits  |  ( |  AcDbRasterImageDef::Units  |  unit | )
virtual
Sets the resolution units.
Parameters
[in] | unit | the resolution unit
◆ setSourceFileName()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbRasterImageDef::setSourceFileName  |  ( |  const ACHAR *  |  pathFileName | )
virtual
Sets the image file path.
Parameters
[in] | pathFileName | path
Returns
Acad::eOk if successful
errorcode otherwise
◆ size()
 UX_EXPORT_FUNCTION AcGeVector2d AcDbRasterImageDef::size  |  ( |   | ) |   const
virtual
Gets the size of a image in pixels.
Returns
AcGeVector2d vector:
x coordinate = image height
y coordinate = image width
◆ sourceFileName()
 UX_EXPORT_FUNCTION const ACHAR * AcDbRasterImageDef::sourceFileName  |  ( |   | ) |   const
virtual
Returns the location of a specified image file.
Returns
location of the image
◆ subClose()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbRasterImageDef::subClose  |  ( |   | )
virtual
See also
AcDbObject::subClose()
Reimplemented from AcDbObject.
◆ subErase()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbRasterImageDef::subErase  |  ( |  Adesk::Boolean  |  bErase | )
virtual
See also
AcDbObject::subErase(Adesk::Boolean bErase)
Reimplemented from AcDbObject.
◆ suggestName()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbRasterImageDef::suggestName  |  ( |  AcDbDictionary *  |  pImageDict,
|  const ACHAR *  |  pImageName,
|  ACHAR *  |  pSuggestedName
)
static
Transforms the input image name/path string pImageName into a valid string key pSuggestedName for the image dictionary pImageDict.
Parameters
[in] | pImageDict | pointer to the image dictionary that must be already opened for reading
[in] | pImageName | pointer to the string containing the name or path of the desired image
[out] | pSuggestedName | returned string containing a valid entry in the image dictionary or BADFILENAME if the input string can't be parsed
Returns
always Acad::eOk
◆ unload()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbRasterImageDef::unload  |  ( |  Adesk::Boolean  |  record = Adesk::kTrue | )
virtual
Unloads the raster image data without deleting the definition.
Returns
Acad::eOk if successful