Public Member Functions | List of all members
AcDbPointCloudColorRamp Class Reference
 Public Member Functions
 AcCmEntityColor  | color (int) const
 Acad::ErrorStatus  | dwgInFields (AcDbDwgFiler *)
 Acad::ErrorStatus  | dwgOutFields (AcDbDwgFiler *) const
 Acad::ErrorStatus  | dxfInFields (AcDbDxfFiler *)
 Acad::ErrorStatus  | dxfOutFields (AcDbDxfFiler *) const
 const AcString  | name () const
 Adesk::Int32  | numColors () const
 void  | setColor (int, AcCmEntityColor)
 void  | setFrom (const AcDbPointCloudColorRamp *)
 Acad::ErrorStatus  | setName (const AcString &)
 Acad::ErrorStatus  | setNumColors (Adesk::Int32)
 void  | setVisibility (int, bool)
 bool  | visibility (int) const