Public Member Functions | Public Attributes | Protected Member Functions | List of all members
AcDbOsnapPointRef Class Reference
_ More...
#include <AcDbOsnapPointRef.h>
 Public Member Functions
AcDbOsnapPointRef (AcDbPointRef::OsnapType, const AcDbFullSubentPath *, const AcDbFullSubentPath *=NULL, const AcGePoint3d *=NULL, AcDbPointRef *=NULL)
AcDbOsnapPointRef (const AcDbOsnapPointRef &)
AcDbOsnapPointRef (const AcGePoint3d &)
virtual Acad::ErrorStatus  | copyFrom (const AcRxObject *)
virtual Acad::ErrorStatus  | dwgInFields (AcDbDwgFiler *, AcDbDatabase *)
virtual Acad::ErrorStatus  | dwgOutFields (AcDbDwgFiler *, AcDbDatabase *) const
virtual Acad::ErrorStatus  | dxfInFields (AcDbDxfFiler *, AcDbDatabase *)
virtual Acad::ErrorStatus  | dxfOutFields (AcDbDxfFiler *, AcDbDatabase *) const
 Acad::ErrorStatus  | evalPoint (AcDbPointRef::OsnapType, const AcGePoint3d &, AcGePoint3d &)
virtual Acad::ErrorStatus  | evalPoint (AcGePoint3d &)
virtual Acad::ErrorStatus  | getEntities (AcDbFullSubentPathArray &, bool=true) const
Acad::ErrorStatus  | getIdPath (AcDbFullSubentPath &) const
Gets the associated subentity path. More...
 Acad::ErrorStatus  | getIntIdPath (AcDbFullSubentPath &) const
 Acad::ErrorStatus  | getXrefHandles (AcDbHandleArrayPtRef &) const
 Acad::ErrorStatus  | getXrefIntHandles (AcDbHandleArrayPtRef &) const
virtual bool  | isGeomErased () const
virtual bool  | isXrefObj (AcDbObjectIdArray &, AcDbObjectIdArray &, bool=true) const
 AcDbPointRef *  | lastPointRef () const
double  | nearPointParam () const
Gets near point curve parameter. More...
 AcDbOsnapPointRef &  | operator= (const AcDbOsnapPointRef &)
virtual AcDbPointRef &  | operator= (const AcDbPointRef &)
AcDbPointRef::OsnapType  | osnapType () const
Gets the osnap type. More...
AcGePoint3d  | point () const
Gets the osnap point. More...
Acad::ErrorStatus  | setIdPath (const AcDbFullSubentPath &)
Sets the associated subentity path. More...
 Acad::ErrorStatus  | setIntIdPath (const AcDbFullSubentPath &)
 Acad::ErrorStatus  | setLastPointRef (AcDbPointRef *)
Acad::ErrorStatus  | setNearPointParam (double)
Sets the near point curve parameter. More...
Acad::ErrorStatus  | setOsnapType (AcDbPointRef::OsnapType)
Sets the osnap type. More...
Acad::ErrorStatus  | setPoint (const AcGePoint3d &)
Sets the osnap point. More...
 Acad::ErrorStatus  | setXrefHandles (const AcDbHandleArrayPtRef &)
 Acad::ErrorStatus  | setXrefIntHandles (const AcDbHandleArrayPtRef &)
virtual void  | updateDueToMirror (bool=false)
virtual Acad::ErrorStatus  | updateSubentPath (AcDbIdMapping &)
virtual Acad::ErrorStatus  | updateXrefSubentPath ()
 virtual  | ~AcDbOsnapPointRef ()
Destructor.
 Public Member Functions inherited from AcDbPointRef
 virtual Acad::ErrorStatus  | deepClone (AcRxObject *, AcDbObject *&, AcDbIdMapping &, Adesk::Boolean=Adesk::kTrue) const
 virtual Acad::ErrorStatus  | dwgInFields (AcDbDwgFiler *, AcDbDatabase *)=0
 virtual Acad::ErrorStatus  | dwgOutFields (AcDbDwgFiler *, AcDbDatabase *) const =0
 virtual Acad::ErrorStatus  | dxfInFields (AcDbDxfFiler *, AcDbDatabase *)=0
 virtual Acad::ErrorStatus  | dxfOutFields (AcDbDxfFiler *, AcDbDatabase *) const =0
 virtual Acad::ErrorStatus  | evalPoint (AcGePoint3d &)=0
 virtual Acad::ErrorStatus  | getEntities (AcDbFullSubentPathArray &, bool=true) const =0
 virtual bool  | isGeomErased () const =0
 virtual bool  | isXrefObj (AcDbObjectIdArray &, AcDbObjectIdArray &, bool=true) const =0
 virtual AcDbPointRef &  | operator= (const AcDbPointRef &)
 virtual Acad::ErrorStatus  | subErase (Adesk::Boolean)
 virtual void  | updateDueToMirror (bool=false)=0
 virtual Acad::ErrorStatus  | updateSubentPath (AcDbIdMapping &)=0
 virtual Acad::ErrorStatus  | updateXrefSubentPath ()=0
 virtual Acad::ErrorStatus  | wblockClone (AcRxObject *, AcDbObject *&, AcDbIdMapping &, Adesk::Boolean=Adesk::kTrue) const
 Public Member Functions inherited from AcRxObject
virtual AcRxObject *  | clone () const
Exported and implemented. More...
 virtual AcRx::Ordering  | comparedTo (const AcRxObject *) const
Exported and implemented.
virtual Acad::ErrorStatus  | copyFrom (const AcRxObject *)
Exported and implemented. More...
 virtual AcRxClass *  | isA () const
Exported and implemented.
virtual Adesk::Boolean  | isEqualTo (const AcRxObject *) const
Exported and implemented. More...
bool  | isKindOf (const AcRxClass *) const
Checks the object class. More...
AcRxObject *  | queryX (const AcRxClass *) const
returns the protocol extension object assigned to this class or a parent class. More...
AcRxObject *  | x (const AcRxClass *) const
returns the protocol extension object assigned to this class or a parent class. More...
 virtual  | ~AcRxObject ()
Destructor.
 Public Attributes
AcDbOsnapPointRef
Default constructor. More...
 Protected Member Functions
 Acad::ErrorStatus  | evalPointGuts (AcDbPointRef::OsnapType, const AcGePoint3d &, const AcGePoint3d &, AcGePoint3d &)
 double  | findNearPointParam (const AcGePoint3d &) const
 bool  | getEllipseParams (double &, double &) const
 Acad::ErrorStatus  | getIntPoints (const AcDbEntity *, const AcDbEntity *, AcDb::Intersect, AcGePoint3dArray &, int=0, int=0) const
 bool  | isTransSpatial (bool=true) const
 AcGePoint3d  | nearPoint ()
 Acad::ErrorStatus  | updateSubentPathGuts (AcDbFullSubentPath &, AcDbIdMapping &)
 Protected Member Functions inherited from AcRxObject
AcRxObject ()
Exported and implemented.
 Additional Inherited Members
 Public Types inherited from AcDbPointRef
enum  | OsnapType {
 kOsnapNone = 0 , kOsnapEnd , kOsnapMid , kOsnapCen ,
 kOsnapNode , kOsnapQuad , kOsnapInt , kOsnapIns ,
 kOsnapPerp , kOsnapTan , kOsnapNear , kOsnapApint ,
 kOsnapStart = 13 , kOsnapCentroid
 }
 Static Public Member Functions inherited from AcDbPointRef
 static bool  | calcTransform (const AcDbObjectIdArray &, AcGeMatrix3d &)
 static Acad::ErrorStatus  | dwgInFields (AcDbDwgFiler *, AcDbDatabase *, AcDbPointRef *&)
 static Acad::ErrorStatus  | dwgOutFields (AcDbDwgFiler *, AcDbDatabase *, const AcDbPointRef *)
 static Acad::ErrorStatus  | dxfInFields (AcDbDxfFiler *, AcDbDatabase *, AcDbPointRef *&)
 static Acad::ErrorStatus  | dxfOutFields (AcDbDxfFiler *, AcDbDatabase *, const AcDbPointRef *)
 static AcGeMatrix3d  | mswcsToPswcs (const AcDbViewport *)
 static AcDbEntity *  | subentPtr (const AcDbFullSubentPath &, bool &, bool &, bool &)
 static AcGeMatrix3d  | wcsToDcsMatrix (const AcDbViewport *)
 Static Public Member Functions inherited from AcRxObject
 static AcRxObject *  | cast (const AcRxObject *)
 static AcRxClass *  | desc ()
Exported and implemented.
Detailed Description
_
Member Function Documentation
◆ copyFrom()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbOsnapPointRef::copyFrom  |  ( |  const AcRxObject *  |  pSrc | )
virtual
Reimplemented from AcRxObject.
◆ dwgInFields()
 Acad::ErrorStatus AcDbOsnapPointRef::dwgInFields  |  ( |  AcDbDwgFiler *  |  filer,
|  AcDbDatabase *  |  pDb
)
virtual
Implements AcDbPointRef.
◆ dwgOutFields()
 Acad::ErrorStatus AcDbOsnapPointRef::dwgOutFields  |  ( |  AcDbDwgFiler *  |  filer,
|  AcDbDatabase *  |  pDb
) |   |  const
virtual
Implements AcDbPointRef.
◆ dxfInFields()
 Acad::ErrorStatus AcDbOsnapPointRef::dxfInFields  |  ( |  AcDbDxfFiler *  |  filer,
|  AcDbDatabase *  |  pDb
)
virtual
Implements AcDbPointRef.
◆ dxfOutFields()
 Acad::ErrorStatus AcDbOsnapPointRef::dxfOutFields  |  ( |  AcDbDxfFiler *  |  filer,
|  AcDbDatabase *  |  pDb
) |   |  const
virtual
Implements AcDbPointRef.
◆ evalPoint()
 Acad::ErrorStatus AcDbOsnapPointRef::evalPoint  |  ( |  AcGePoint3d &  |  pt | )
virtual
Implements AcDbPointRef.
◆ getEntities()
 Acad::ErrorStatus AcDbOsnapPointRef::getEntities  |  ( |  AcDbFullSubentPathArray &  |  ents,
|  bool  |  getLastPtRef = true
) |   |  const
virtual
Implements AcDbPointRef.
◆ getIdPath()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbOsnapPointRef::getIdPath  |  ( |  AcDbFullSubentPath &  |  path | ) |   const
Gets the associated subentity path.
Parameters
[out] | path | subentity path
Returns
eOk if successful
◆ isGeomErased()
 bool AcDbOsnapPointRef::isGeomErased  |  ( |   | ) |   const
virtual
Implements AcDbPointRef.
◆ isXrefObj()
 bool AcDbOsnapPointRef::isXrefObj  |  ( |  AcDbObjectIdArray &  |  ids1,
|  AcDbObjectIdArray &  |  ids2,
|  bool  |  isMainObj = true
) |   |  const
virtual
Implements AcDbPointRef.
◆ nearPointParam()
 UX_EXPORT_FUNCTION double AcDbOsnapPointRef::nearPointParam  |  ( |   | ) |   const
Gets near point curve parameter.
Returns
near point curve parameter
◆ operator=()
 AcDbPointRef & AcDbOsnapPointRef::operator=  |  ( |  const AcDbPointRef &  |  src | )
virtual
Reimplemented from AcDbPointRef.
◆ osnapType()
 UX_EXPORT_FUNCTION AcDbPointRef::OsnapType AcDbOsnapPointRef::osnapType  |  ( |   | ) |   const
Gets the osnap type.
Returns
osnap type
◆ point()
 UX_EXPORT_FUNCTION AcGePoint3d AcDbOsnapPointRef::point  |  ( |   | ) |   const
Gets the osnap point.
Parameters
[in] | oType | osnap type
Returns
eOk if successful
◆ setIdPath()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbOsnapPointRef::setIdPath  |  ( |  const AcDbFullSubentPath &  |  path | )
Sets the associated subentity path.
Parameters
[in] | path | subentity path
Returns
eOk if successful
◆ setNearPointParam()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbOsnapPointRef::setNearPointParam  |  ( |  double  |  param | )
Sets the near point curve parameter.
Parameters
[in] | param | near point curve parameter
Returns
eOk if successful
◆ setOsnapType()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbOsnapPointRef::setOsnapType  |  ( |  AcDbPointRef::OsnapType  |  oType | )
Sets the osnap type.
Parameters
[in] | oType | osnap type
Returns
eOk if successful
◆ setPoint()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbOsnapPointRef::setPoint  |  ( |  const AcGePoint3d &  |  pt | )
Sets the osnap point.
Parameters
[in] | pt | osnap point
Returns
eOk if successful
◆ updateDueToMirror()
 void AcDbOsnapPointRef::updateDueToMirror  |  ( |  bool  |  inMirror = false | )
virtual
Implements AcDbPointRef.
◆ updateSubentPath()
 Acad::ErrorStatus AcDbOsnapPointRef::updateSubentPath  |  ( |  AcDbIdMapping &  |  idMap | )
virtual
Implements AcDbPointRef.
◆ updateXrefSubentPath()
 Acad::ErrorStatus AcDbOsnapPointRef::updateXrefSubentPath  |  ( |   | )
virtual
Implements AcDbPointRef.
Member Data Documentation
◆ AcDbOsnapPointRef
 AcDbOsnapPointRef::AcDbOsnapPointRef
Default constructor.
constructor
Parameters
[in] | oType | OsnapType for object
[in] | pObjectPath | the main id path for object
[in] | intObjFullSubentPath | the secondary id path for object
[in] | pRefPoint | reference point for object
[in] | pLastPointRef | secondary reference point for object