Public Member Functions | Public Attributes | Protected Member Functions | List of all members
AcDbSubentRef Class Reference
_ More...
#include <AcDbSubentRef.h>
 Public Member Functions
AcDbSubentRef (const AcDbCompoundObjectId &, const AcDbSubentId &=kNullSubentId)
virtual Acad::ErrorStatus  | copyFrom (const AcRxObject *)
Initializes this reference using a given object. More...
virtual AcDbEntity *  | createEntity () const
Creates an entity using this subent reference. More...
virtual const AcDbCompoundObjectId &  | entity () const
Returns an object ID of the compounded entity. More...
virtual Acad::ErrorStatus  | evaluateAndCacheGeometry ()
Evaluates and caches the geometry. More...
virtual bool  | isEmpty () const
Returns boolean value indicating if the AcDbSubentRef is empty. More...
virtual bool  | isValid () const
Returns boolean value indicating if the AcDbSubentRef is valid. More...
AcDbSubentRef &  | operator= (const AcDbSubentRef &)
Creates AcDbSubentRef using other AcDbSubentRef. More...
virtual void  | reset ()
Resets this subent reference. More...
virtual AcDbSubentId  | subentId () const
Returns an subent ID. More...
virtual AcDbEntity *  | createEntity () const =0
virtual Acad::ErrorStatus  | evaluateAndCacheGeometry ()=0
virtual bool  | isEmpty () const =0
virtual bool  | isValid () const =0
virtual void  | reset ()=0
 Public Member Functions inherited from AcRxObject
virtual AcRxObject *  | clone () const
Exported and implemented. More...
 virtual AcRx::Ordering  | comparedTo (const AcRxObject *) const
Exported and implemented.
virtual Acad::ErrorStatus  | copyFrom (const AcRxObject *)
Exported and implemented. More...
 virtual AcRxClass *  | isA () const
Exported and implemented.
virtual Adesk::Boolean  | isEqualTo (const AcRxObject *) const
Exported and implemented. More...
bool  | isKindOf (const AcRxClass *) const
Checks the object class. More...
AcRxObject *  | queryX (const AcRxClass *) const
returns the protocol extension object assigned to this class or a parent class. More...
AcRxObject *  | x (const AcRxClass *) const
returns the protocol extension object assigned to this class or a parent class. More...
 virtual  | ~AcRxObject ()
Destructor.
 Public Attributes
AcDbSubentRef
Default constructor. More...
 Protected Member Functions
void  | setEntity (const AcDbCompoundObjectId &)
Sets the compounded entity using an object ID. More...
void  | setFromSubentPath (const AcDbFullSubentPath &)
Sets the AcDbCompoundObjectId and AcDbSubentId parameters of this entity from AcDbFullSubentPath. More...
void  | setSubent (const AcDbSubentId &)
Sets an subent ID. More...
 Protected Member Functions inherited from AcRxObject
AcRxObject ()
Exported and implemented.
 Additional Inherited Members
 Static Public Member Functions inherited from AcRxObject
 static AcRxObject *  | cast (const AcRxObject *)
 static AcRxClass *  | desc ()
Exported and implemented.
Detailed Description
_
Member Function Documentation
◆ copyFrom()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbSubentRef::copyFrom  |  ( |  const AcRxObject *  |  pAcSource | )
virtual
Initializes this reference using a given object.
Parameters
[in] | pAcSource | - subentity reference that will be copied.
Returns
Acad::eOk for success, error status otherwise
Reimplemented from AcRxObject.
Reimplemented in AcDbEdgeRef.
◆ createEntity()
 UX_EXPORT_FUNCTION AcDbEntity * AcDbSubentRef::createEntity  |  ( |   | ) |   const
virtual
Creates an entity using this subent reference.
Returns
a AcDbEntity.
Implements AcDbGeomRef.
Reimplemented in AcDbEdgeRef.
◆ entity()
 UX_EXPORT_FUNCTION const AcDbCompoundObjectId & AcDbSubentRef::entity  |  ( |   | ) |   const
virtual
Returns an object ID of the compounded entity.
Returns
AcDbCompoundObjectId entity
◆ evaluateAndCacheGeometry()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbSubentRef::evaluateAndCacheGeometry  |  ( |   | )
virtual
Evaluates and caches the geometry.
Returns
Acad::eOk for success, error status otherwise
Implements AcDbGeomRef.
Reimplemented in AcDbEdgeRef.
◆ isEmpty()
 UX_EXPORT_FUNCTION bool AcDbSubentRef::isEmpty  |  ( |   | ) |   const
virtual
Returns boolean value indicating if the AcDbSubentRef is empty.
Returns
true if empty, false otherwise
Implements AcDbGeomRef.
Reimplemented in AcDbEdgeRef.
◆ isValid()
 UX_EXPORT_FUNCTION bool AcDbSubentRef::isValid  |  ( |   | ) |   const
virtual
Returns boolean value indicating if the AcDbSubentRef is valid.
Returns
true if empty, false otherwise
Implements AcDbGeomRef.
Reimplemented in AcDbEdgeRef.
◆ operator=()
 UX_EXPORT_FUNCTION AcDbSubentRef & AcDbSubentRef::operator=  |  ( |  const AcDbSubentRef &  |  source | )
Creates AcDbSubentRef using other AcDbSubentRef.
Parameters
[in] | source | - subentity reference that will be copied.
◆ reset()
 UX_EXPORT_FUNCTION void AcDbSubentRef::reset  |  ( |   | )
virtual
Resets this subent reference.
Implements AcDbGeomRef.
Reimplemented in AcDbEdgeRef.
◆ setEntity()
 UX_EXPORT_FUNCTION void AcDbSubentRef::setEntity  |  ( |  const AcDbCompoundObjectId &  |  source | )
protected
Sets the compounded entity using an object ID.
Parameters
[in] | source | - AcDbCompoundObjectId reference that will be copied.
◆ setFromSubentPath()
 UX_EXPORT_FUNCTION void AcDbSubentRef::setFromSubentPath  |  ( |  const AcDbFullSubentPath &  |  subEntPath | )
protected
Sets the AcDbCompoundObjectId and AcDbSubentId parameters of this entity from AcDbFullSubentPath.
Parameters
[in] | subEntPath | - input subentity path for the AcDbCompoundObjectId and AcDbSubentId parameters.
◆ setSubent()
 UX_EXPORT_FUNCTION void AcDbSubentRef::setSubent  |  ( |  const AcDbSubentId &  |  source | )
protected
Sets an subent ID.
Parameters
[in] | source | - AcDbSubentId reference that will be copied.
◆ subentId()
 UX_EXPORT_FUNCTION AcDbSubentId AcDbSubentRef::subentId  |  ( |   | ) |   const
virtual
Returns an subent ID.
Returns
AcDbSubentId enitity.
Member Data Documentation
◆ AcDbSubentRef
 UX_EXPORT_FUNCTION AcDbSubentRef::AcDbSubentRef
Default constructor.
Parameter constructor.
Parameters
[in] | compound | - AcDbCompoundObjectId reference that will be copied.
[in] | subentId | - AcDbSubentId reference that will be copied.