Public Member Functions | Protected Member Functions | List of all members
AcDbGraph Class Reference
_ More...
#include <AcDbGraph.h>
 Public Member Functions
AcDbGraph (AcDbGraphNode *=NULL)
Constructor. More...
Acad::ErrorStatus  | addEdge (AcDbGraphNode *, AcDbGraphNode *)
Adds the specified edge (given by start and end nodes) to this graph. More...
Acad::ErrorStatus  | addNode (AcDbGraphNode *)
Adds the given node to this graph. More...
 Acad::ErrorStatus  | breakCycleEdge (AcDbGraphNode *, AcDbGraphNode *)
 void  | clearAll (Adesk::UInt8)
 Acad::ErrorStatus  | delNode (AcDbGraphNode *)
virtual Adesk::Boolean  | findCycles (AcDbGraphNode *=NULL)
Not implemented yet. More...
 void  | getOutgoing (AcDbVoidPtrArray &)
bool  | isEmpty () const
Checks if this graph is empty. More...
AcDbGraphNode *  | node (int) const
Gets the specified graph node of this graph. More...
int  | numNodes () const
Gets the number of nodes owned by this graph. More...
 void  | reset ()
This functions resets this graph node, deleting all sub nodes and cycles, results in an empty node.
AcDbGraphNode *  | rootNode () const
Gets the root node of this graph. More...
 void  | setNodeGrowthRate (int)
 virtual  | ~AcDbGraph ()
Destructor.
 Protected Member Functions
 Acad::ErrorStatus  | clearAllCycles ()
 Additional Inherited Members
 Static Public Member Functions inherited from AcHeapOperators
 static void  | operator delete (void *)
_
 static void  | operator delete (void *, const char *, int)
 static void  | operator delete (void *, void *)
 static void  | operator delete[] (void *)
_
 static void  | operator delete[] (void *, const char *, int)
 static void *  | operator new (size_t)
_
 static void *  | operator new (size_t, const char *, int)
 static void *  | operator new (size_t, void *p)
 static void *  | operator new[] (size_t)
_
 static void *  | operator new[] (size_t, const char *, int)
Detailed Description
_
Constructor & Destructor Documentation
◆ AcDbGraph()
 UX_EXPORT_FUNCTION AcDbGraph::AcDbGraph  |  ( |  AcDbGraphNode *  |  pRootNode = NULL | )
Constructor.
Parameters
[in] | pRootNode | root node
Remarks
The input pointer must point to dynamically allocated memory which will be freed by the owner graph. So it is not user's responsability.
Member Function Documentation
◆ addEdge()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbGraph::addEdge  |  ( |  AcDbGraphNode *  |  pFromNode,
|  AcDbGraphNode *  |  pToNode
)
Adds the specified edge (given by start and end nodes) to this graph.
Parameters
[in] | pFromNode | node from which the edge starts
[in] | pToNode | node at which the edge ends
Returns
Acad::eOk if successful
Remarks
Both input nodes must be already added to this graph.
◆ addNode()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbGraph::addNode  |  ( |  AcDbGraphNode *  |  pNode | )
Adds the given node to this graph.
Parameters
[in] | pNode | node to be added to this graph
Returns
Acad::eOk if successful
Remarks
The input pointer must point to dynamically allocated memory which will be freed by the owner graph. So it is not user's responsability.
◆ findCycles()
 Adesk::Boolean AcDbGraph::findCycles  |  ( |  AcDbGraphNode *  |   = NULL | )
virtual
Not implemented yet.
Parameters
[in]
return
Reimplemented in AcDbXrefGraph.
◆ isEmpty()
 UX_EXPORT_FUNCTION bool AcDbGraph::isEmpty  |  ( |   | ) |   const
Checks if this graph is empty.
Returns
true if the graph is empty, false otherwise
◆ node()
 UX_EXPORT_FUNCTION AcDbGraphNode * AcDbGraph::node  |  ( |  int  |  i | ) |   const
Gets the specified graph node of this graph.
Parameters
[in] | i | node index
Returns
pointer to a graph node object or NULL if the index is not valid
◆ numNodes()
 UX_EXPORT_FUNCTION int AcDbGraph::numNodes  |  ( |   | ) |   const
Gets the number of nodes owned by this graph.
Returns
number of nodes for this graph object
◆ rootNode()
 UX_EXPORT_FUNCTION AcDbGraphNode * AcDbGraph::rootNode  |  ( |   | ) |   const
Gets the root node of this graph.
Returns
pointer to a graph node object or NULL if the graph has no nodes