Public Member Functions | List of all members
AcDbPointCloudClassificationColorRamp Class Reference
 Public Member Functions
 AcCmEntityColor  | color (int) const
 const AcString  | name () const
 Adesk::Int32  | numColors () const
 void  | setColor (int, AcCmEntityColor)
 void  | setFrom (const AcDbPointCloudClassificationColorRamp *)
 Acad::ErrorStatus  | setName (const AcString &)
 void  | setVisibility (int, bool)
 bool  | visibility (int) const