Public Member Functions | List of all members
AcDbRasterImageDefFileAccessReactor Class Referenceabstract
_ More...
#include <AcDbRasterImageDefFileAccessReactor.h>
 Public Member Functions
 virtual void  | onAttach (const AcDbRasterImageDef *, const ACHAR *)=0
 virtual void  | onClose (const AcDbRasterImageDef *, const ACHAR *)=0
 virtual void  | onDetach (const AcDbRasterImageDef *, const ACHAR *)=0
 virtual void  | onDialog (AcDbRasterImageDef *, const ACHAR *, const ACHAR *)=0
 virtual Adesk::Boolean  | onOpen (const AcDbRasterImageDef *, const ACHAR *, const ACHAR *, Adesk::Boolean &, ACHAR *&)=0
 virtual Adesk::Boolean  | onPathChange (const AcDbRasterImageDef *, const ACHAR *, const ACHAR *, Adesk::Boolean &, ACHAR *&)=0
 Public Member Functions inherited from AcDbObjectReactor
 virtual void  | cancelled (const AcDbObject *)
 virtual void  | copied (const AcDbObject *, const AcDbObject *)
 virtual void  | erased (const AcDbObject *, Adesk::Boolean=Adesk::kTrue)
 virtual void  | goodbye (const AcDbObject *)
 virtual void  | modified (const AcDbObject *)
 virtual void  | modifiedXData (const AcDbObject *)
 virtual void  | modifyUndone (const AcDbObject *)
virtual void  | objectClosed (const AcDbObjectId)
Sent when an object that was open for write is closed by methods close or cancel. More...
virtual void  | openedForModify (const AcDbObject *)
Sent before an object that is open for write is changed. More...
 virtual void  | reappended (const AcDbObject *)
 virtual void  | subObjModified (const AcDbObject *, const AcDbObject *)
 virtual void  | unappended (const AcDbObject *)
 Public Member Functions inherited from AcRxObject
virtual AcRxObject *  | clone () const
Exported and implemented. More...
 virtual AcRx::Ordering  | comparedTo (const AcRxObject *) const
Exported and implemented.
virtual Acad::ErrorStatus  | copyFrom (const AcRxObject *)
Exported and implemented. More...
 virtual AcRxClass *  | isA () const
Exported and implemented.
virtual Adesk::Boolean  | isEqualTo (const AcRxObject *) const
Exported and implemented. More...
bool  | isKindOf (const AcRxClass *) const
Checks the object class. More...
AcRxObject *  | queryX (const AcRxClass *) const
returns the protocol extension object assigned to this class or a parent class. More...
AcRxObject *  | x (const AcRxClass *) const
returns the protocol extension object assigned to this class or a parent class. More...
 virtual  | ~AcRxObject ()
Destructor.
 Additional Inherited Members
 Static Public Member Functions inherited from AcRxObject
 static AcRxObject *  | cast (const AcRxObject *)
 static AcRxClass *  | desc ()
Exported and implemented.
 Public Attributes inherited from AcDbObjectReactor
AcDbObjectReactor
Default constructor.
 Protected Member Functions inherited from AcRxObject
AcRxObject ()
Exported and implemented.
Detailed Description
_