Public Member Functions | Public Attributes | List of all members
AcDbCivilVAlignmentArc Class Reference
Civil VerticalAlignment Arc class. More...
#include <AcDbCivilAlignments.h>
 Public Member Functions
AcDbCivilVAlignmentArc (AcDbCivilDbVAlignment *alignment)
AcGePoint2d  | center () const
Returns the center point of this vertical alignment arc element. More...
double  | gradeIn () const
Returns the grade at start point of this vertical alignment arc element. More...
double  | gradeOut () const
Returns the grade at end point of this vertical alignment arc element. More...
bool  | isClockwise () const
Returns whether this vertical alignment arc element is oriented clockwise or anti-clockwise. More...
double  | radius () const
Returns the radius of this vertical alignment arc element. More...
bool  | setCenter (const AcGePoint2d &center)
Assigns the center point for this vertical alignment arc element. More...
bool  | setClockwise (bool isClockwise)
Defines whether this vertical alignment arc element is oriented clockwise or anti-clockwise. More...
bool  | setRadius (double rad)
Assigns the radius for this vertical alignment arc element. More...
virtual  | ~AcDbCivilVAlignmentArc ()
Destructor. More...
 Public Member Functions inherited from AcDbCivilVAlignmentCurve
AcGePoint2d  | endPoint () const
Returns the end point of the alignment curve element. More...
double  | length () const
Returns the total length of the alignment curve element. More...
AcGePoint2d  | startPoint () const
Returns the start point of the alignment curve element. More...
virtual  | ~AcDbCivilVAlignmentCurve ()
Destructor. More...
 Public Member Functions inherited from AcDbCivilVAlignmentElement
Adesk::UInt64  | id () const
Returns the ID of this vertical alignment element. More...
Adesk::UInt64  | nextId () const
Returns the ID of vertical alignment element next to this vertical alignment element. More...
AcDbCivilVAlignmentElement::EParameterConstraint  | parameterConstraint () const
Returns the type of parameter constraint for this vertical alignment element. More...
Adesk::UInt64  | previousId () const
Returns the ID of vertical alignment element previous to this vertical alignment element. More...
bool  | setNextId (Adesk::UInt64 id)
Defines the next element ID for the specified element in this vertical alignment element. More...
bool  | setParameterConstraint (AcDbCivilVAlignmentElement::EParameterConstraint constraint)
Defines the parameter constraint type for this vertical alignment element. More...
bool  | setPreviousId (Adesk::UInt64 id)
Defines the previous element ID for the specified element in this vertical alignment element. More...
bool  | setTangencyConstraint (AcDbCivilVAlignmentElement::ETangencyConstraint constraint)
Defines the tangency constraint type for this vertical alignment element. More...
AcDbCivilVAlignmentElement::ETangencyConstraint  | tangencyConstraint () const
Returns the type of tangency constraint for this vertical alignment element. More...
AcDbCivilVAlignmentElement::EElementType  | type () const
Returns the type of this vertical alignment element. More...
virtual  | ~AcDbCivilVAlignmentElement ()
Destructor. More...
 Public Member Functions inherited from AcRxObject
virtual AcRxObject *  | clone () const
Exported and implemented. More...
 virtual AcRx::Ordering  | comparedTo (const AcRxObject *) const
Exported and implemented.
virtual Acad::ErrorStatus  | copyFrom (const AcRxObject *)
Exported and implemented. More...
 virtual AcRxClass *  | isA () const
Exported and implemented.
virtual Adesk::Boolean  | isEqualTo (const AcRxObject *) const
Exported and implemented. More...
bool  | isKindOf (const AcRxClass *) const
Checks the object class. More...
AcRxObject *  | queryX (const AcRxClass *) const
returns the protocol extension object assigned to this class or a parent class. More...
AcRxObject *  | x (const AcRxClass *) const
returns the protocol extension object assigned to this class or a parent class. More...
 virtual  | ~AcRxObject ()
Destructor.
 Public Attributes
AcDbCivilVAlignmentArc
Constructor; creates an empty vertical alignment arc element. More...
 Additional Inherited Members
 Public Types inherited from AcDbCivilVAlignmentElement
enum class  | EElementType {
 eUndefined = 0 , eTangent = 1 , eArc = 2 , eParabola = 3 ,
 ePVI = 100
 }
enum class  | EParameterConstraint {
 eUndefined = 0 , ePassThroughPoints = 1 , eRadius = 2 , eLength = 3 ,
 eAngle = 4 , eAutomatic = 5 , ePointOnTangent = 6
 }
enum class  | ETangencyConstraint {
 eUndefined = 0 , eFixed = 1 , ePrevious = 2 , eNext = 3 ,
 eBoth = 4
 }
 Static Public Member Functions inherited from AcRxObject
 static AcRxObject *  | cast (const AcRxObject *)
 static AcRxClass *  | desc ()
Exported and implemented.
 Protected Member Functions inherited from AcRxObject
AcRxObject ()
Exported and implemented.
Detailed Description
Civil VerticalAlignment Arc class.
Constructor & Destructor Documentation
◆ ~AcDbCivilVAlignmentArc()
 UX_EXPORT_FUNCTION AcDbCivilVAlignmentArc::~AcDbCivilVAlignmentArc  |  ( |   | )
virtual
Destructor.
Date
2021 torstenm implemented
Member Function Documentation
◆ center()
 UX_EXPORT_FUNCTION AcGePoint2d AcDbCivilVAlignmentArc::center  |  ( |   | ) |   const
Returns the center point of this vertical alignment arc element.
Returns
double - the grade at end point
Date
2021 torstenm implemented
◆ gradeIn()
 UX_EXPORT_FUNCTION double AcDbCivilVAlignmentArc::gradeIn  |  ( |   | ) |   const
Returns the grade at start point of this vertical alignment arc element.
Returns
double - the grade at start point
Date
2021 torstenm implemented
◆ gradeOut()
 UX_EXPORT_FUNCTION double AcDbCivilVAlignmentArc::gradeOut  |  ( |   | ) |   const
Returns the grade at end point of this vertical alignment arc element.
Returns
double - the grade at end point
Date
2021 torstenm implemented
◆ isClockwise()
 UX_EXPORT_FUNCTION bool AcDbCivilVAlignmentArc::isClockwise  |  ( |   | ) |   const
Returns whether this vertical alignment arc element is oriented clockwise or anti-clockwise.
Returns
bool - 'true' for clockwise, 'false' for anti-clockwise orientation of this arc
Date
2021 torstenm implemented
◆ radius()
 UX_EXPORT_FUNCTION double AcDbCivilVAlignmentArc::radius  |  ( |   | ) |   const
Returns the radius of this vertical alignment arc element.
Returns
double - the radius value used
Date
2021 torstenm implemented
◆ setCenter()
 UX_EXPORT_FUNCTION bool AcDbCivilVAlignmentArc::setCenter  |  ( |  const AcGePoint2d &  |  center | )
Assigns the center point for this vertical alignment arc element.
Parameters
[in] | center | - the center point to be assigned
Returns
bool - 'true' if successful, 'false' otherwise
Date
2021 torstenm implemented
◆ setClockwise()
 UX_EXPORT_FUNCTION bool AcDbCivilVAlignmentArc::setClockwise  |  ( |  bool  |  isClockwise | )
Defines whether this vertical alignment arc element is oriented clockwise or anti-clockwise.
Parameters
[in] | isClockwise | - 'true' for clockwise, 'false' for anti-clockwise orientation
Returns
bool - 'true' if successful, 'false' otherwise
Date
2021 torstenm implemented
◆ setRadius()
 UX_EXPORT_FUNCTION bool AcDbCivilVAlignmentArc::setRadius  |  ( |  double  |  rad | )
Assigns the radius for this vertical alignment arc element.
Parameters
[in] | rad | - the radius to be assigned
Returns
bool - 'true' if successful, 'false' otherwise
Date
2021 torstenm implemented
Member Data Documentation
◆ AcDbCivilVAlignmentArc
 UX_EXPORT_FUNCTION AcDbCivilVAlignmentArc::AcDbCivilVAlignmentArc
Constructor; creates an empty vertical alignment arc element.
CopyConstructor.
Date
2021 torstenm implemented
Parameters
[in] | alignment | - the source object to copy from
Date
2021 torstenm implemented