Public Member Functions | Public Attributes | List of all members
AcDbCivilHAlignmentLine Class Reference
Civil HorizontalAlignment Line class. More...
#include <AcDbCivilAlignments.h>
 Public Member Functions
AcDbCivilHAlignmentLine (AcDbCivilDbHAlignment *alignment)
double  | paramLength () const
Returns the length parameter of this line element. More...
AcGePoint2d  | passThroughPoint1 ()
Returns the first passThrough point of this line element. More...
AcGePoint2d  | passThroughPoint2 ()
Returns the second passThrough point of this line element. More...
bool  | setParamLength (double length)
Assigns the length parameter for this line element. More...
bool  | setPassThroughPoint1 (const AcGePoint2d &point)
Assigns the first passThrough point for this line element. More...
bool  | setPassThroughPoint2 (const AcGePoint2d &point)
Assigns the second passThrough point for this line element. More...
virtual  | ~AcDbCivilHAlignmentLine ()
Destructor. More...
 Public Member Functions inherited from AcDbCivilHAlignmentCurve
AcGePoint2d  | endPoint () const
Returns the end point of the alignment curve. More...
double  | endStation () const
Returns the end station parameter of the alignment curve. More...
double  | length () const
Returns the total length of the alignment curve. More...
AcGePoint2d  | startPoint () const
Returns the start point of the alignment curve. More...
double  | startStation () const
Returns the start station parameter of the alignment curve. More...
virtual  | ~AcDbCivilHAlignmentCurve ()
Destructor. More...
 Public Member Functions inherited from AcDbCivilHAlignmentElement
Adesk::UInt64  | id () const
Returns the ID of this horizontal alignment element. More...
bool  | isSubentity () const
Returns whether this horizontal alignment element is a subentity or not. More...
Adesk::UInt64  | nextId () const
Returns the ID of the next horizontal alignment element. More...
AcDbCivilHAlignmentElement::EParameterConstraint  | parameterConstraint () const
Returns the parameter constraint type for this horizontal alignment element. More...
Adesk::UInt64  | previousId () const
Returns the ID of the previous horizontal alignment element. More...
bool  | setNextId (Adesk::UInt64 id)
Assigns the specified element ID as the next element. More...
bool  | setParameterConstraint (AcDbCivilHAlignmentElement::EParameterConstraint constraint)
Assigns the type of parameter constraint for this horizontal alignment element. More...
bool  | setPreviousId (Adesk::UInt64 id)
Assigns the specified element ID as the previous element. More...
bool  | setTangencyConstraint (AcDbCivilHAlignmentElement::ETangencyConstraint constraint)
Assigns the type of tangency constraint for this horizontal alignment element. More...
AcDbCivilHAlignmentElement::ETangencyConstraint  | tangencyConstraint () const
Returns the tangency constraint type for this horizontal alignment element. More...
AcDbCivilHAlignmentElement::EElementType  | type () const
Returns the type of this horizontal alignment element. More...
virtual  | ~AcDbCivilHAlignmentElement ()
Destructor. More...
 Public Member Functions inherited from AcRxObject
virtual AcRxObject *  | clone () const
Exported and implemented. More...
 virtual AcRx::Ordering  | comparedTo (const AcRxObject *) const
Exported and implemented.
virtual Acad::ErrorStatus  | copyFrom (const AcRxObject *)
Exported and implemented. More...
 virtual AcRxClass *  | isA () const
Exported and implemented.
virtual Adesk::Boolean  | isEqualTo (const AcRxObject *) const
Exported and implemented. More...
bool  | isKindOf (const AcRxClass *) const
Checks the object class. More...
AcRxObject *  | queryX (const AcRxClass *) const
returns the protocol extension object assigned to this class or a parent class. More...
AcRxObject *  | x (const AcRxClass *) const
returns the protocol extension object assigned to this class or a parent class. More...
 virtual  | ~AcRxObject ()
Destructor.
 Public Attributes
AcDbCivilHAlignmentLine
Constructor; create an empty 'line' alignment element. More...
 Additional Inherited Members
 Public Types inherited from AcDbCivilHAlignmentElement
enum class  | EElementType {
 eUndefined = 0 , eLine = 1 , eArc = 2 , eSpiral = 3 ,
 eSpiralCurveSpiral = 4 , eSpiralLineSpiral = 5 , eSpiralLine = 6 , eLineSpiral = 7 ,
 eSpiralCurve = 8 , eCurveSpiral = 9 , eSpiralSpiralCurveSpiralSpiral = 10 , eMultipleSegments = 11 ,
 eSpiralCurveSpiralCurveSpiral = 12 , eSpiralCurveSpiralSpiralCurveSpiral = 13 , eSpiralSpiral = 14 , eSpiralSpiralCurve = 15 ,
 eCurveSpiralSpiral = 16 , eCurveLineCurve = 17 , eCurveReverseCurve = 18 , eCurveCurveReverseCurve = 19 ,
 ePI = 100
 }
enum class  | EParameterConstraint {
 eUndefined = 0 , eAutomatic = 100 , eLine_TwoPoints = 200 , eLine_ThroughPoint = 201 ,
 eLine_Length = 202 , eLine_BestFit = 203 , eArc_ThreePoints = 300 , eArc_CenterRadius = 301 ,
 eArc_CenterPassThrough = 302 , eArc_PassThroughRadius = 303 , eArc_PassThroughAttachToEnd = 304 , eArc_PassThroughDirection = 305 ,
 eArc_Radius = 306 , eArc_PassThrough = 307 , eArc_RadiusAndLength = 308 , eArc_PointOnTangent = 309 ,
 eArc_BestFit = 310 , eSCS_SpiralInRadiusSpiralOut = 400 , eSCS_SpiralLengthRadiusPassThrough = 401 , eSCS_SpiralLengthRadiusArcLength = 402 ,
 eSCS_SpiralLengthRadius = 403 , eSCS_SpiralLength = 404 , eSCS_SpiralInLengthSpiralOutLength = 405 , eSCS_SpiralInAValSpiralOutAVal = 406 ,
 eSCS_SpiralInAValRadiusSpiralOutAVal = 407 , eSCS_SpiralAValRadiusPassThrough = 408 , eSCS_SpiralAValRadiusArcLength = 409 , eSCS_SpiralAValRadius = 410 ,
 eSCS_SpiralAVal = 411 , eSCS_PointOnTangent = 412 , eSpiral_StartPointDirRadiusLength = 500 , eSpiral_StartPointDirStartAndEndRadiusLength = 501 ,
 eSTS_SpiralInLengthSpiralOutLength = 600 , eSTS_TangentLength = 601 , eSTS_SpiralInAValSpiralOutAVal = 602 , eSTS_SpiralLengthTangentPassThrough = 603 ,
 eSTS_SpiralLengthTangentLength = 604 , eSTS_SpiralAValTangentPassThrough = 605 , eSTS_SpiralAValTangentLength = 606 , eSSCSS_Sp1LenSp2LenRadiusPt = 700 ,
 eSSCSS_Sp1LenSp2LenPt1Pt2 = 701 , eSSCSS_Sp1AValSp2AValRadiusPt = 702 , eSSCSS_Sp1AValSp2AValPt1Pt2 = 703
 }
enum class  | ETangencyConstraint {
 eUndefined = 0 , eFixed = 1 , ePrevious = 2 , eNext = 3 ,
 eBoth = 4
 }
 Static Public Member Functions inherited from AcRxObject
 static AcRxObject *  | cast (const AcRxObject *)
 static AcRxClass *  | desc ()
Exported and implemented.
 Protected Member Functions inherited from AcRxObject
AcRxObject ()
Exported and implemented.
Detailed Description
Civil HorizontalAlignment Line class.
Constructor & Destructor Documentation
◆ ~AcDbCivilHAlignmentLine()
 UX_EXPORT_FUNCTION AcDbCivilHAlignmentLine::~AcDbCivilHAlignmentLine  |  ( |   | )
virtual
Destructor.
Date
2021 torstenm implemented
Member Function Documentation
◆ paramLength()
 UX_EXPORT_FUNCTION double AcDbCivilHAlignmentLine::paramLength  |  ( |   | ) |   const
Returns the length parameter of this line element.
Returns
double - the second passThrough point
Date
2021 torstenm implemented
◆ passThroughPoint1()
 UX_EXPORT_FUNCTION AcGePoint2d AcDbCivilHAlignmentLine::passThroughPoint1  |  ( |   | )
Returns the first passThrough point of this line element.
Returns
AcGePoint2d - the first passThrough point
Date
2021 torstenm implemented
◆ passThroughPoint2()
 UX_EXPORT_FUNCTION AcGePoint2d AcDbCivilHAlignmentLine::passThroughPoint2  |  ( |   | )
Returns the second passThrough point of this line element.
Returns
AcGePoint2d - the second passThrough point
Date
2021 torstenm implemented
◆ setParamLength()
 UX_EXPORT_FUNCTION bool AcDbCivilHAlignmentLine::setParamLength  |  ( |  double  |  length | )
Assigns the length parameter for this line element.
Parameters
[in] | length | - the length parameter to be assigned
Returns
bool - true if successful, false otherwise
Date
2021 torstenm implemented
◆ setPassThroughPoint1()
 UX_EXPORT_FUNCTION bool AcDbCivilHAlignmentLine::setPassThroughPoint1  |  ( |  const AcGePoint2d &  |  point | )
Assigns the first passThrough point for this line element.
Parameters
[in] | point | - the 2D passThrough point 1 to be assigned
Returns
bool - true if successful, false otherwise
Date
2021 torstenm implemented
◆ setPassThroughPoint2()
 UX_EXPORT_FUNCTION bool AcDbCivilHAlignmentLine::setPassThroughPoint2  |  ( |  const AcGePoint2d &  |  point | )
Assigns the second passThrough point for this line element.
Parameters
[in] | point | - the 2D passThrough point 2 to be assigned
Returns
bool - true if successful, false otherwise
Date
2021 torstenm implemented
Member Data Documentation
◆ AcDbCivilHAlignmentLine
 UX_EXPORT_FUNCTION AcDbCivilHAlignmentLine::AcDbCivilHAlignmentLine
Constructor; create an empty 'line' alignment element.
CopyConstructor.
Date
2021 torstenm implemented
Parameters
[in] | alignment | - the source object to copy from
Date
2021 torstenm implemented