Public Member Functions | Public Attributes | List of all members
AcDbLayout Class Reference
_ More...
#include <AcDbLayout.h>
 Public Member Functions
virtual Acad::ErrorStatus  | addToLayoutDict (AcDbDatabase *, AcDbObjectId)
Adds this AcDbLayout object to the layout dictionary, using the specified BlockTableRecord. More...
bool  | annoAllVisible () const
Returns whether all all annotative objects are visible in this layout (ANNOALLVISIBLE). More...
AcDbObjectId  | getBlockTableRecordId () const
Returns the block table record id. More...
 void  | getExtents (AcDbExtents &extent) const
 void  | getExtents (AcGePoint3d &, AcGePoint3d &) const
Acad::ErrorStatus  | getLayoutName (ACHAR *&) const
Fetches the layout name. More...
Acad::ErrorStatus  | getLayoutName (const ACHAR *&) const
Fetches the layout name. More...
void  | getLimits (AcDbExtents2d &) const
Function returns the current limits set in the layout in an AcDbExtents2d object. More...
void  | getLimits (AcGePoint2d &, AcGePoint2d &) const
Function returns the current limits set in the layout. More...
int  | getTabOrder () const
Returns the tab order for the current layout. More...
bool  | getTabSelected () const
Returns the inclusion of the layout tab in the selection set. More...
 Acad::ErrorStatus  | getThumbnail (BITMAPINFO *&) const
 AcDbObjectIdArray  | getViewportArray () const
Acad::ErrorStatus  | initialize (AcDbObjectId *=NULL)
Initializes this AcDbLayout object, preparing the overall-paperspace viewport. More...
Acad::ErrorStatus  | setAnnoAllVisible (bool)
Specifies whether all annotative objects are visible in this layout (ANNOALLVISIBLE). More...
virtual Acad::ErrorStatus  | setBlockTableRecordId (AcDbObjectId)
Sets the block table record to be used. More...
virtual Acad::ErrorStatus  | setLayoutName (const ACHAR *)
Sets the layout name. More...
virtual void  | setTabOrder (int)
Sets the tab order for the current layout. More...
virtual void  | setTabSelected (Adesk::Boolean)
Includes or not the layout tab in the selection set. More...
 Acad::ErrorStatus  | setThumbnail (const BITMAPINFO *)
 virtual  | ~AcDbLayout ()
Destructor.
 Public Member Functions inherited from AcDbPlotSettings
AcDbPlotSettings (bool)
Acad::ErrorStatus  | addToPlotSettingsDict (AcDbDatabase *)
Adds this PlotSettings object to the specified database. More...
Acad::ErrorStatus  | copyFrom (AcDbPlotSettings *)
Copies the source contents into this pointer. More...
Adesk::Boolean  | drawViewportsFirst () const
Returns whether viewports are drawn before paperspace or not. More...
Acad::ErrorStatus  | getCanonicalMediaName (const ACHAR *&) const
Returns the canonical (locale-independent) name of the currently configured paper. More...
Acad::ErrorStatus  | getCurrentStyleSheet (const ACHAR *&) const
Returns the name of the current style sheet. More...
Acad::ErrorStatus  | getCustomPrintScale (double &, double &) const
Returns the custom scale i.e. More...
Acad::ErrorStatus  | getPlotCfgName (const ACHAR *&) const
Returns the plot configuration file name. More...
Acad::ErrorStatus  | getPlotOrigin (double &, double &) const
Returns the plot origin offset. More...
Acad::ErrorStatus  | getPlotPaperMargins (double &, double &, double &, double &) const
Returns the margins of the configured paper. More...
Acad::ErrorStatus  | getPlotPaperSize (double &, double &) const
Returns the physical width and height of the entire paper area (including the non printable area). More...
Acad::ErrorStatus  | getPlotSettingsName (ACHAR *&) const
Gets the plot settings name. More...
Acad::ErrorStatus  | getPlotSettingsName (const ACHAR *&) const
Gets the plot settings name. More...
Acad::ErrorStatus  | getPlotViewName (const ACHAR *&) const
Returns the plot name of the layout portion to plot. More...
Acad::ErrorStatus  | getPlotWindowArea (double &, double &, double &, double &) const
Returns the lower-left and upper-right corners of the plot area. More...
Acad::ErrorStatus  | getStdScale (double &) const
Returns the standard scale for this PlotSettings object. More...
Adesk::Boolean  | modelType () const
Gets the plot setup type. More...
bool  | plotAsRaster () const
Returns whether the viewport is plotted as raster or not (depending on shade plot settings). More...
Adesk::Boolean  | plotCentered () const
Returns true if the plot will be centered. More...
Adesk::Boolean  | plotHidden () const
Returns true if the hidden line removal algorithm is to be applied to the objects in paperspace. More...
PlotPaperUnits  | plotPaperUnits () const
Returns the units used for plotting . More...
Adesk::Boolean  | plotPlotStyles () const
Informs whether plot styles are to be plotted, or displayed only. More...
PlotRotation  | plotRotation () const
Returns the plot rotation. More...
PlotType  | plotType () const
Returns the information about the portion of paperspace to be plotted. More...
Adesk::Boolean  | plotViewportBorders () const
Informs whether the viewport borders are to be plotted. More...
bool  | plotWireframe () const
Returns whether the viewport is plotted as vectors or not (depending on shade plot settings). More...
Adesk::Boolean  | printLineweights () const
Informs whether line weights will get printed. More...
Adesk::Boolean  | scaleLineweights () const
Informs whether line weights will get scaled along with the print scale. More...
void  | setDrawViewportsFirst (Adesk::Boolean)
Specifies whether viewports are drawn before paperspace or not. More...
void  | setPlotHidden (Adesk::Boolean)
Specifies whether or not to apply the hidden line removal algorithm to the objects in paperspace. More...
void  | setPlotPlotStyles (Adesk::Boolean)
Specifies whether plot styles are to be plotted, or displayed only. More...
Acad::ErrorStatus  | setPlotSettingsName (const ACHAR *)
Sets the plot settings name. More...
void  | setPlotViewportBorders (Adesk::Boolean)
Specifies whether the viewport borders are to be plotted. More...
void  | setPrintLineweights (Adesk::Boolean)
Defines whether or not to plot line weights. More...
void  | setScaleLineweights (Adesk::Boolean)
Specifies whether or not to scale line weights along with the print scale. More...
Acad::ErrorStatus  | setShadePlot (const ShadePlotType, const AcDbObjectId)
Configures this PlotSettings object for shaded or rendered mode. More...
Acad::ErrorStatus  | setShadePlot (ShadePlotType)
Sets the shade plot type for shaded or rendered plotting. More...
Acad::ErrorStatus  | setShadePlotCustomDPI (Adesk::Int16)
Sets the shade plot custom DPI. More...
Acad::ErrorStatus  | setShadePlotResLevel (ShadePlotResLevel)
Sets the shade plot resolution level. More...
void  | setShowPlotStyles (Adesk::Boolean)
Specifies whether the object plot style is showed during layout mode. More...
ShadePlotType  | shadePlot () const
Returns the shade plot type for shaded or rendered plotting. More...
Adesk::Int16  | shadePlotCustomDPI () const
Returns the shade plot custom DPI. More...
 AcDbObjectId  | shadePlotId () const
ShadePlotResLevel  | shadePlotResLevel () const
Returns the shade plot resolution level. More...
Adesk::Boolean  | showPlotStyles () const
Informs whether the object plot style is showed during layout mode. More...
StdScaleType  | stdScaleType () const
Returns the type of the standard scale. More...
Adesk::Boolean  | useStandardScale () const
Indicates whether the this PlotSettings object uses a standard scale to calculate the current plot scale. More...
 virtual  | ~AcDbPlotSettings ()
Destructor.
 Public Member Functions inherited from AcDbObject
virtual void  | addPersistentReactor (AcDbObjectId)
Adds a persistent reactor to this object reactor list. More...
void  | addReactor (AcDbObjectReactor *) const
Adds a transient reactor to this object. More...
virtual Acad::ErrorStatus  | applyPartialUndo (AcDbDwgFiler *, AcRxClass *)
This function is called during Undo operations on objects, that use the 'Partial Undo meachanism'; this is, this object is opened with assertWriteEnabled(Adesk::kFalse) to indicate that custom Undo filing is used rather than the default Undo filing. More...
 void  | assertNotifyEnabled () const
 void  | assertReadEnabled () const
 void  | assertWriteEnabled (Adesk::Boolean=Adesk::kTrue, Adesk::Boolean=Adesk::kTrue)
virtual Acad::ErrorStatus  | audit (AcDbAuditInfo *)
Performs the audit operation for this object. More...
Acad::ErrorStatus  | cancel ()
Reverts all changes since the object had been opened and closes the object. More...
virtual void  | cancelled (const AcDbObject *)
A handler function for persistent reactors. More...
virtual AcRxObject *  | clone () const
Creates a shallow clone of this object. More...
Acad::ErrorStatus  | close ()
Closes the object. More...
Acad::ErrorStatus  | closeAndPage (Adesk::Boolean=Adesk::kTrue)
Closes the object. More...
virtual Acad::ErrorStatus  | composeForLoad (AcDb::OdaSaveType, AcDb::AcDbDwgVersion)
This function is intended for future MT file loading support. More...
virtual void  | copied (const AcDbObject *, const AcDbObject *)
A handler function for persistent reactors. More...
virtual Acad::ErrorStatus  | copyFrom (const AcRxObject *)
Copies the pSrc object information in this object. More...
Acad::ErrorStatus  | createExtensionDictionary ()
Creates a dictionary as extension dictionary for this object. More...
AcDbDatabase *  | database () const
Returns the database that contains this object. More...
virtual Acad::ErrorStatus  | decomposeForSave (AcDb::AcDbDwgVersion, AcDbObject *&, AcDbObjectId &, Adesk::Boolean &)
This function is called during dwg and dxf output, to allow a custom object to decompose itself, due to provided dwg/dxf target file version. More...
virtual Acad::ErrorStatus  | deepClone (AcDbObject *, AcDbObject *&, AcDbIdMapping &, Adesk::Boolean=Adesk::kTrue) const final
Clones this object, appends it to the owner pOwner and adds an AcDbIdPair record to the idMap. More...
void  | disableUndoRecording (Adesk::Boolean)
Disables or enables the undo recording for the object. More...
Acad::ErrorStatus  | downgradeOpen ()
Sets the open mode for an object opened for write to be opened for read. More...
Acad::ErrorStatus  | downgradeToNotify (Adesk::Boolean)
Sets the open mode for an object opened for write to be opened for notify. More...
virtual AcGiDrawable *  | drawable ()
Retrieves the AcGiDrawable instance of this object. More...
Acad::ErrorStatus  | dwgIn (AcDbDwgFiler *)
Calls the object's dwgInFields function, and reads any XData if present. More...
virtual Acad::ErrorStatus  | dwgInFields (AcDbDwgFiler *)
Reads the object from the DWG filer. More...
Acad::ErrorStatus  | dwgOut (AcDbDwgFiler *) const
Calls the object's dwgOutFields function, and writes any XData if present. More...
virtual Acad::ErrorStatus  | dwgOutFields (AcDbDwgFiler *) const
Writes the object to the DWG filer. More...
Acad::ErrorStatus  | dxfIn (AcDbDxfFiler *)
Calls the object's dxfInFields function, and reads any XData if present. More...
virtual Acad::ErrorStatus  | dxfInFields (AcDbDxfFiler *)
Reads the object from the DXF filer. More...
Acad::ErrorStatus  | dxfOut (AcDbDxfFiler *, Adesk::Boolean, Adesk::uchar *) const
Calls the object's dxfOutFields function, and writes any XData if present. More...
virtual Acad::ErrorStatus  | dxfOutFields (AcDbDxfFiler *) const
Writes the object to the DXF filer. More...
Acad::ErrorStatus  | erase (Adesk::Boolean=Adesk::kTrue)
Sets the bit that indicates that the object is erased. More...
virtual void  | erased (const AcDbObject *, Adesk::Boolean=Adesk::kTrue)
A handler function for persistent reactors. More...
AcDbObjectId  | extensionDictionary () const
Returns the object id of the extension dictionary for this object. More...
void  | getAcDbHandle (AcDbHandle &) const
Returns handle of this object. More...
Acad::ErrorStatus  | getBinaryData (const ACHAR *, Adesk::Int32 &, char *&) const
Creates a copy of the binary data stored as chunks of maximum 127 bytes in the resbuf chain of this object's extension dictionary xrecord entry given by entryName. More...
int  | getBrxOpenCount () const
This function returns the number of open BRX instances for this object. More...
int  | getBrxOpenState () const
This function returns the BRX object open state flags as bitfields, for diagnostic purpose. More...
virtual Acad::ErrorStatus  | getClassID (CLSID *) const final
Gets the COM wrapper Class ID for this entity. More...
int  | getCustomObjectState () const
This function returns the custom object status : 1=isCustomObject 2=DifferentialUndoDisabled. More...
Acad::ErrorStatus  | getField (const ACHAR *, AcDbField *&, AcDb::OpenMode) const
Retrieves the specified Field from this object, and opens it in mode. More...
Acad::ErrorStatus  | getField (const ACHAR *, AcDbObjectId &) const
Gets the pszPropName field object from field dictionary of this AcDbObject object, using pszPropName as key. More...
AcDbObjectId  | getFieldDictionary () const
Returns the Field dictionary associated with this object,. More...
Acad::ErrorStatus  | getFieldDictionary (AcDbDictionary *&, AcDb::OpenMode) const
Gets and opens the field dictionary for this. More...
Acad::ErrorStatus  | getObjectBirthVersion (AcDb::AcDbDwgVersion &, AcDb::MaintenanceReleaseVersion &)
This function is currently not supported by the CAD engine, always returns Acad::eOk, and 'kDHL_CURRENT' + 'kMReleaseCurrent' results. More...
virtual Acad::ErrorStatus  | getObjectSaveVersion (const AcDbDwgFiler *, AcDb::AcDbDwgVersion &, AcDb::MaintenanceReleaseVersion &)
Returns the DWG version for saving the object. More...
virtual Acad::ErrorStatus  | getObjectSaveVersion (const AcDbDxfFiler *, AcDb::AcDbDwgVersion &, AcDb::MaintenanceReleaseVersion &)
Returns the DWG version for saving the object. More...
int  | getOdaOpenCount () const
This function returns the number of open ODA instances for this object. More...
int  | getOdaOpenState () const
This function returns the ODA object open state flags as bitfields, for diagnostic purpose. More...
virtual void  | goodbye (const AcDbObject *)
A handler function for persistent reactors. More...
virtual AcGsNode *  | gsNode () const
Gets the AcGsNode (graphics cache) for this entity. More...
Acad::ErrorStatus  | handOverTo (AcDbObject *, Adesk::Boolean=Adesk::kTrue, Adesk::Boolean=Adesk::kTrue)
Hands over objects identity to another object. More...
bool  | hasFields () const
Return true if this object has single or multiple fields associated with him. More...
bool  | hasPersistentReactor (AcDbObjectId) const
Checks the input objectId in this object reactor list. More...
bool  | hasSaveVersionOverride ()
This function indicates whether this object overrides the filer's save version. More...
virtual AcDbObjectId  | id () const
Returns the database id of this object. More...
Adesk::Boolean  | isAcDbObjectIdsInFlux () const
Checks whether a deep clone operation was completed. More...
Adesk::Boolean  | isAProxy () const
Adesk::Boolean  | isCancelling () const
Adesk::Boolean  | isErased () const
Returns whether this object is erased. More...
Adesk::Boolean  | isEraseStatusToggled () const
Checks whether the object erase status has been toggled. More...
Adesk::Boolean  | isModified () const
Returns whether this object's assertWriteEnabled() has been called since it was opened. More...
Adesk::Boolean  | isModifiedGraphics () const
Checks whether this object graphics will be updated when the object is closed. More...
Adesk::Boolean  | isModifiedXData () const
Checks whether this object's xData was modified. More...
Adesk::Boolean  | isNewObject () const
Returns true if and only if this object has not been closed since it was created. More...
Adesk::Boolean  | isNotifyEnabled () const
Returns whether this object is opened for notify. More...
Adesk::Boolean  | isNotifying () const
virtual Adesk::Boolean  | isPersistent () const
Returns the 'persistent' status of a database object. More...
Adesk::Boolean  | isReadEnabled () const
Returns whether this object is opened for read. More...
 Adesk::Boolean  | isReallyClosing () const
Checks whether the next close call will completely close this object return true if on the next call the object will be completely closed false otherwise.
Adesk::Boolean  | isTransactionResident () const
Gets the object transaction status. More...
Adesk::Boolean  | isUndoing () const
bool  | isUndoRecordingDisabled () const
Returns whether the undo recording for the object is enabled or not. More...
Adesk::Boolean  | isWriteEnabled () const
Returns whether this object is opened for write. More...
virtual AcDb::DuplicateRecordCloning  | mergeStyle () const
Returns the object's merge behavior during cloning. More...
virtual void  | modified (const AcDbObject *)
A handler function for persistent reactors. More...
virtual void  | modifiedGraphics (const AcDbEntity *)
A handler function for persistent reactors. More...
virtual void  | modifiedXData (const AcDbObject *)
A handler function for persistent reactors. More...
virtual void  | modifyUndone (const AcDbObject *)
A handler function for persistent reactors. More...
virtual void  | objectClosed (const AcDbObjectId)
A handler function for persistent reactors. More...
AcDbObjectId  | objectId () const
Returns object id. More...
virtual void  | openedForModify (const AcDbObject *)
A handler function for persistent reactors. More...
AcDbObjectId  | ownerId () const
Returns object id of the owner. More...
AcDbVoidPtrArray *  | reactors ()
Gets the object pointers to reactors. More...
const AcDbVoidPtrArray *  | reactors () const
Gets the object pointers to reactors. More...
virtual void  | reappended (const AcDbObject *)
A handler function for persistent reactors. More...
 virtual void  | recvPropagateModify (const AcDbObject *)
Not implemented yet.
Acad::ErrorStatus  | releaseExtensionDictionary ()
Removes the extension dictionary associated with this object. More...
virtual Acad::ErrorStatus  | removeField (AcDbObjectId)
Removes the Field specified by acFieldId from this object. More...
virtual Acad::ErrorStatus  | removeField (const ACHAR *)
Removes the Field specified by szKeyString from this object. More...
virtual Acad::ErrorStatus  | removeField (const ACHAR *, AcDbObjectId &)
Removes the Field specified by acPszKeyString from this object, and returns its ObjectId value. More...
virtual Acad::ErrorStatus  | removePersistentReactor (AcDbObjectId)
Removes a persistent reactor from this object reactor list. More...
void  | removeReactor (AcDbObjectReactor *) const
Removes a transient reactor to this object. More...
void  | setAcDbObjectIdsInFlux ()
Call this function to indicate that the object IDs of this object and its sub-objects (if any) are not yet valid. More...
Acad::ErrorStatus  | setBinaryData (const ACHAR *, Adesk::Int32, const char *)
Creates a copy of the binary data, divides it in up to 127 bytes binary chunks and
 sets them as resbufs in the resbuf chain of this object's extension dictionary xrecord entry given by entryName. More...
virtual Acad::ErrorStatus  | setField (const ACHAR *, AcDbField *, AcDbObjectId &)
Adds the pAcField field object to field dictionary of this AcDbObject object, using pKey as key. More...
virtual void  | setGsNode (AcGsNode *)
Gets the AcGsNode (graphics cache) for this entity. More...
void  | setHasSaveVersionOverride (bool)
This function can be called to specify that the object has a "save version override". More...
virtual Acad::ErrorStatus  | setOwnerId (AcDbObjectId)
Sets the ownerId data member of the object to be objId. More...
virtual Acad::ErrorStatus  | setXData (const resbuf *)
Sets/removes xData associated with this object. More...
virtual Acad::ErrorStatus  | subCancel ()
Possibility to veto a cancel operation from within custom entities. More...
virtual Acad::ErrorStatus  | subClose ()
virtual Acad::ErrorStatus  | subErase (Adesk::Boolean)
This hook is called during an AcDbObject::erase call, before any actual erase operation is performed. More...
 virtual Acad::ErrorStatus  | subHandOverTo (AcDbObject *)
virtual void  | subObjModified (const AcDbObject *, const AcDbObject *)
A handler function for persistent reactors. More...
 virtual Acad::ErrorStatus  | subOpen (AcDb::OpenMode)
virtual Acad::ErrorStatus  | subSwapIdWith (AcDbObjectId, Adesk::Boolean=Adesk::kFalse, Adesk::Boolean=Adesk::kFalse)
This hook is called during an AcDbObject::swapIdWith() call, before any actual swap operation is performed. More...
Acad::ErrorStatus  | swapIdWith (AcDbObjectId, Adesk::Boolean=Adesk::kFalse, Adesk::Boolean=Adesk::kFalse)
Swaps the object id's between the object identified by param swapId and this object. More...
virtual Acad::ErrorStatus  | swapReferences (const AcDbIdMapping &)
Not implemented yet. More...
virtual void  | unappended (const AcDbObject *)
A handler function for persistent reactors. More...
AcDbDwgFiler *  | undoFiler ()
Gets the undo filer for this object. More...
Acad::ErrorStatus  | upgradeFromNotify (Adesk::Boolean &)
Upgrades the open status of this object to AcDb::kForWrite, if this object is already open (either in AcDb::kForRead, AcDb::kForNotify or AcDb::kForWrite) More...
Acad::ErrorStatus  | upgradeOpen ()
Changes the objects open mode to AcDb::kForWrite and sends notifications. More...
virtual Acad::ErrorStatus  | wblockClone (AcRxObject *, AcDbObject *&, AcDbIdMapping &, Adesk::Boolean=Adesk::kTrue) const final
Clones this object, appends it to the owner pOwner and adds an AcDbIdPair record to the idMap. More...
virtual resbuf *  | xData (const ACHAR *=NULL) const
Returns the xData associated with this object. More...
Acad::ErrorStatus  | xDataTransformBy (const AcGeMatrix3d &)
Transforms the extended data according to parameter transformation matrix. More...
 virtual void  | xmitPropagateModify () const
Not implemented yet.
 virtual  | ~AcDbObject ()
Destructor.
 Public Member Functions inherited from AcGiDrawable
virtual bool  | bounds (AcDbExtents &) const
virtual DrawableType  | drawableType () const
 virtual AcGiDrawStream *  | drawStream () const
virtual AcGsNode *  | gsNode () const =0
virtual AcDbObjectId  | id () const =0
virtual Adesk::Boolean  | isPersistent () const =0
virtual Adesk::UInt32  | regenSupportFlags () const final
Returns whether and to which level this object supports MultiThreading. More...
 virtual Adesk::Boolean  | RolloverHit (Adesk::ULongPtr, Adesk::ULongPtr, Adesk::Boolean)
 virtual Adesk::UInt32  | setAttributes (AcGiDrawableTraits *) final
 virtual void  | setDrawStream (AcGiDrawStream *)
virtual void  | setGsNode (AcGsNode *)=0
 virtual void  | viewportDraw (AcGiViewportDraw *) final
 virtual Adesk::UInt32  | viewportDrawLogicalFlags (AcGiViewportDraw *) final
 virtual Adesk::Boolean  | worldDraw (AcGiWorldDraw *) final
 Public Member Functions inherited from AcRxObject
virtual AcRxObject *  | clone () const
Exported and implemented. More...
 virtual AcRx::Ordering  | comparedTo (const AcRxObject *) const
Exported and implemented.
virtual Acad::ErrorStatus  | copyFrom (const AcRxObject *)
Exported and implemented. More...
 virtual AcRxClass *  | isA () const
Exported and implemented.
virtual Adesk::Boolean  | isEqualTo (const AcRxObject *) const
Exported and implemented. More...
bool  | isKindOf (const AcRxClass *) const
Checks the object class. More...
AcRxObject *  | queryX (const AcRxClass *) const
returns the protocol extension object assigned to this class or a parent class. More...
AcRxObject *  | x (const AcRxClass *) const
returns the protocol extension object assigned to this class or a parent class. More...
 virtual  | ~AcRxObject ()
Destructor.
 Public Attributes
AcDbLayout
Default constructor.
 Public Attributes inherited from AcDbPlotSettings
AcDbPlotSettings
Constructor. More...
 Additional Inherited Members
 Public Types inherited from AcDbPlotSettings
enum  | PlotPaperUnits { kInches = 0 , kMillimeters , kPixels }
enum  | PlotRotation { k0degrees = 0 , k90degrees , k180degrees , k270degrees }
enum  | PlotType {
 kDisplay = 0 , kExtents , kLimits , kView ,
 kWindow , kLayout
 }
enum  | ShadePlotResLevel {
 kDraft = 0 , kPreview , kNormal , kPresentation ,
 kMaximum , kCustom
 }
enum  | ShadePlotType {
 kAsDisplayed = 0 , kWireframe , kHidden , kRendered ,
 kVisualStyle , kRenderPreset
 }
enum  | StdScaleType {
 kScaleToFit = 0 , k1_128in_1ft , k1_64in_1ft , k1_32in_1ft ,
 k1_16in_1ft , k3_32in_1ft , k1_8in_1ft , k3_16in_1ft ,
 k1_4in_1ft , k3_8in_1ft , k1_2in_1ft , k3_4in_1ft ,
 k1in_1ft , k3in_1ft , k6in_1ft , k1ft_1ft ,
 k1_1 , k1_2 , k1_4 , k1_5 ,
 k1_8 , k1_10 , k1_16 , k1_20 ,
 k1_30 , k1_40 , k1_50 , k1_100 ,
 k2_1 , k4_1 , k8_1 , k10_1 ,
 k100_1 , k1000_1 , k1and1_2in_1ft
 }
 Public Types inherited from AcGiDrawable
enum  | DrawableType {
 kGeometry = 0 , kDistantLight , kPointLight , kSpotLight ,
 kAmbientLight , kSolidBackground , kGradientBackground , kImageBackground ,
 kGroundPlaneBackground , kViewport
 }
enum  | SetAttributesFlags {
 kDrawableNone = 0 , kDrawableIsAnEntity = 1 , kDrawableUsesNesting = 2 , kDrawableIsCompoundObject = 4 ,
 kDrawableViewIndependentViewportDraw = 8 , kDrawableIsInvisible = 16 , kDrawableHasAttributes = 32 , kDrawableRegenTypeDependentGeometry = 64 ,
 kDrawableIsDimension = 133 , kDrawableRegenDraw = 256 , kDrawableStandardDisplaySingleLOD = 512 , kDrawableShadedDisplaySingleLOD = 1024 ,
 kDrawableViewDependentViewportDraw = 2048 , kDrawableBlockDependentViewportDraw = 4096 , kDrawableIsExternalReference = 8192 , kDrawableNotPlottable = 16384 ,
 kDrawableNotAllowLCS = 32768 , kDrawableMergeControlOff = 65536 , kThreadedWorldDrawViewportDraw = 131072
 }
 Static Public Member Functions inherited from AcRxObject
 static AcRxObject *  | cast (const AcRxObject *)
 static AcRxClass *  | desc ()
Exported and implemented.
 Static Public Member Functions inherited from AcHeapOperators
 static void  | operator delete (void *)
_
 static void  | operator delete (void *, const char *, int)
 static void  | operator delete (void *, void *)
 static void  | operator delete[] (void *)
_
 static void  | operator delete[] (void *, const char *, int)
 static void *  | operator new (size_t)
_
 static void *  | operator new (size_t, const char *, int)
 static void *  | operator new (size_t, void *p)
 static void *  | operator new[] (size_t)
_
 static void *  | operator new[] (size_t, const char *, int)
 Protected Member Functions inherited from AcDbObject
virtual Acad::ErrorStatus  | subDeepClone (AcDbObject *, AcDbObject *&, AcDbIdMapping &, Adesk::Boolean=true) const
virtual Acad::ErrorStatus  | subGetClassID (CLSID *) const
virtual Adesk::UInt32  | subSetAttributes (AcGiDrawableTraits *)
Sets the values of this object's subentity traits and returns with the calling object's subentity traits. More...
virtual void  | subViewportDraw (AcGiViewportDraw *)
virtual Adesk::UInt32  | subViewportDrawLogicalFlags (AcGiViewportDraw *)
virtual Acad::ErrorStatus  | subWblockClone (AcRxObject *, AcDbObject *&, AcDbIdMapping &, Adesk::Boolean=true) const
virtual Adesk::Boolean  | subWorldDraw (AcGiWorldDraw *)
 Protected Member Functions inherited from AcGiDrawable
virtual Adesk::UInt32  | subRegenSupportFlags () const
Returns whether and to which level this object supports MultiThreading. More...
virtual Adesk::UInt32  | subSetAttributes (AcGiDrawableTraits *)=0
virtual void  | subViewportDraw (AcGiViewportDraw *)=0
 virtual Adesk::UInt32  | subViewportDrawLogicalFlags (AcGiViewportDraw *)
virtual Adesk::Boolean  | subWorldDraw (AcGiWorldDraw *)=0
 Protected Member Functions inherited from AcRxObject
AcRxObject ()
Exported and implemented.
Detailed Description
_
Member Function Documentation
◆ addToLayoutDict()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbLayout::addToLayoutDict  |  ( |  AcDbDatabase *  |  pTargetDb,
|  AcDbObjectId  |  idBtr
)
virtual
Adds this AcDbLayout object to the layout dictionary, using the specified BlockTableRecord.
Parameters
[in] | pTargetDb | - database to add this layout to
[in] | idBtr | - BlockTableRecord to be used by this layout
Returns
Acad::eOk for success, or error status
◆ annoAllVisible()
 UX_EXPORT_FUNCTION bool AcDbLayout::annoAllVisible  |  ( |   | ) |   const
Returns whether all all annotative objects are visible in this layout (ANNOALLVISIBLE).
Returns
true if all annotative objects are visible in this layout, false otherwise
◆ getBlockTableRecordId()
 UX_EXPORT_FUNCTION AcDbObjectId AcDbLayout::getBlockTableRecordId  |  ( |   | ) |   const
Returns the block table record id.
Returns
block table record id
◆ getLayoutName() [1/2]
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbLayout::getLayoutName  |  ( |  ACHAR *&  |  name | ) |   const
Fetches the layout name.
Parameters
[out] | name | filled with layout name. Calling routine will free the memory allocated
Returns
Acad::eOk if successful
errorcode otherwise
◆ getLayoutName() [2/2]
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbLayout::getLayoutName  |  ( |  const ACHAR *&  |  name | ) |   const
Fetches the layout name.
Parameters
[out] | name | filled with layout name
Returns
Acad::eOk if successful
errorcode otherwise
◆ getLimits() [1/2]
 UX_EXPORT_FUNCTION void AcDbLayout::getLimits  |  ( |  AcDbExtents2d &  |  extent | ) |   const
Function returns the current limits set in the layout in an AcDbExtents2d object.
Parameters
[in/out] | extent - AcDbExtents2d argument to set limits in coordinates
Returns
extent coordinates for current limits in a layout
◆ getLimits() [2/2]
 UX_EXPORT_FUNCTION void AcDbLayout::getLimits  |  ( |  AcGePoint2d &  |  limMin,
|  AcGePoint2d &  |  limMax
) |   |  const
Function returns the current limits set in the layout.
Parameters
[in/out] | limMin - lower left corner point of limits
[in/out] | limMax - upper right corner point of limits
Returns
limMin & limMax AcGePoint2d limits
◆ getTabOrder()
 UX_EXPORT_FUNCTION int AcDbLayout::getTabOrder  |  ( |   | ) |   const
Returns the tab order for the current layout.
Returns
the tab order
◆ getTabSelected()
 UX_EXPORT_FUNCTION bool AcDbLayout::getTabSelected  |  ( |   | ) |   const
Returns the inclusion of the layout tab in the selection set.
Returns
true if the layout tab is set, false otherwise
◆ initialize()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbLayout::initialize  |  ( |  AcDbObjectId *  |  idOverallPSpaceVport = NULL | )
Initializes this AcDbLayout object, preparing the overall-paperspace viewport.
Parameters
[in/out] | idOverallPSpaceVport - optional pointer to AcDObjectId to receive the Overall Viewport ObjectId
Returns
Acad::eOk for success, or error status
◆ setAnnoAllVisible()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbLayout::setAnnoAllVisible  |  ( |  bool  |  visible | )
Specifies whether all annotative objects are visible in this layout (ANNOALLVISIBLE).
Parameters
[in] | true | or false to specify whether the annotative objects are visible or not
Returns
Acad::eOk for success, or error status
◆ setBlockTableRecordId()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbLayout::setBlockTableRecordId  |  ( |  AcDbObjectId  |  acObjId | )
virtual
Sets the block table record to be used.
Parameters
[in] | acObjId | block table record id
Returns
Acad::eOk if successful
errorcode otherwise
◆ setLayoutName()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbLayout::setLayoutName  |  ( |  const ACHAR *  |  name | )
virtual
Sets the layout name.
Parameters
[in] | name | filled with layout name
Returns
Acad::eOk if successful
errorcode otherwise
◆ setTabOrder()
 UX_EXPORT_FUNCTION void AcDbLayout::setTabOrder  |  ( |  int  |  order | )
virtual
Sets the tab order for the current layout.
Parameters
[in] | order | tab order
◆ setTabSelected()
 UX_EXPORT_FUNCTION void AcDbLayout::setTabSelected  |  ( |  Adesk::Boolean  |  bTabSelected | )
virtual
Includes or not the layout tab in the selection set.
Parameters
[in] | bTabSelected | boolean value taken to set the layout tab