Public Types | Public Member Functions | Public Attributes | List of all members
AcDbMLeader Class Reference
_ More...
#include <AcDbMLeader.h>
 Public Types
enum  | gsMarkType {
 kNone = 0 , kArrowMark = 1 , kLeaderLineMark = kArrowMark + MAX_LEADERLINE_NUMBER , kDoglegMark = kLeaderLineMark + MAX_LEADERLINE_NUMBER ,
 kMTextMark = kDoglegMark + MAX_LEADER_NUMBER , kMTextUnderLineMark = kMTextMark + 1 , kToleranceMark = kMTextUnderLineMark + 1 , kBlockMark = kToleranceMark + 1 ,
 kBlockAttribute = kBlockMark + 1
 }
enum  | MoveType { kMoveAllPoints = 0 , kMoveAllExceptArrowHeaderPoints , kMoveContentAndDoglegPoints }
enum  | PropertyOverrideType {
 kLeaderLineType = 0 , kLeaderLineColor , kLeaderLineTypeId , kLeaderLineWeight ,
 kEnableLanding , kLandingGap , kEnableDogleg , kDoglegLength ,
 kArrowSymbolId , kArrowSize , kContentType , kTextStyleId ,
 kTextLeftAttachmentType , kTextAngleType , kTextAlignmentType , kTextColor ,
 kTextHeight , kEnableFrameText , kDefaultMText , kBlockId ,
 kBlockColor , kBlockScale , kBlockRotation , kBlockConnectionType ,
 kScale , kTextRightAttachmentType , kTextSwitchAlignmentType , kTextAttachmentDirection ,
 kTextTopAttachmentType , kTextBottomAttachmentType , kExtendLeaderToText , kSize = kExtendLeaderToText + 1
 }
 Public Types inherited from AcDbEntity
enum  | VisualStyleType { kFullVisualStyle = 0 , kFaceVisualStyle = 1 , kEdgeVisualStyle = 2 }
 Public Types inherited from AcGiDrawable
enum  | DrawableType {
 kGeometry = 0 , kDistantLight , kPointLight , kSpotLight ,
 kAmbientLight , kSolidBackground , kGradientBackground , kImageBackground ,
 kGroundPlaneBackground , kViewport
 }
enum  | SetAttributesFlags {
 kDrawableNone = 0 , kDrawableIsAnEntity = 1 , kDrawableUsesNesting = 2 , kDrawableIsCompoundObject = 4 ,
 kDrawableViewIndependentViewportDraw = 8 , kDrawableIsInvisible = 16 , kDrawableHasAttributes = 32 , kDrawableRegenTypeDependentGeometry = 64 ,
 kDrawableIsDimension = 133 , kDrawableRegenDraw = 256 , kDrawableStandardDisplaySingleLOD = 512 , kDrawableShadedDisplaySingleLOD = 1024 ,
 kDrawableViewDependentViewportDraw = 2048 , kDrawableBlockDependentViewportDraw = 4096 , kDrawableIsExternalReference = 8192 , kDrawableNotPlottable = 16384 ,
 kDrawableNotAllowLCS = 32768 , kDrawableMergeControlOff = 65536 , kThreadedWorldDrawViewportDraw = 131072
 }
 Public Member Functions
Acad::ErrorStatus  | addFirstVertex (int, const AcGePoint3d &)
Adds a new first vertex to specified leaderline index for this AcDbMLeader object. More...
Acad::ErrorStatus  | addLastVertex (int, const AcGePoint3d &)
Adds a new last vertex to specified leaderline index for this AcDbMLeader object. More...
Acad::ErrorStatus  | addLeader (int &)
Creates a new leader cluster for this AcDbMLeader object. More...
Acad::ErrorStatus  | addLeaderLine (const AcGePoint3d &, int &)
Adds a new leaderline at specified point to specified leader cluster for this AcDbMLeader object. More...
Acad::ErrorStatus  | addLeaderLine (int, int &)
Adds a new leaderline to specified leader cluster for this AcDbMLeader object. More...
double  | arrowSize () const
Returns the default arrow size for this AcDbMLeader object. More...
AcDbObjectId  | arrowSymbolId () const
Returns the default arrow symbol id for this AcDbMLeader object. More...
AcDbObjectId  | arrowSymbolId (int) const
Returns the arrow symbol id for leaderline specified by its index. More...
AcCmColor  | blockColor () const
Returns the Block color for this AcDbMLeader object. More...
AcDbMLeaderStyle::BlockConnectionType  | blockConnectionType () const
Returns the Block connection type for this AcDbMLeader object. More...
AcDbObjectId  | blockContentId () const
Returns the Block content id for this AcDbMLeader object. More...
double  | blockRotation () const
Returns the Block content rotation angle for this AcDbMLeader object. More...
 AcGeScale3d  | blockScale () const
Acad::ErrorStatus  | connectionPoint (const AcGeVector3d &, AcGePoint3d &) const
Indicates leader connection point for the specified direction. More...
 Acad::ErrorStatus  | connectionPoint (const AcGeVector3d &, AcGePoint3d &, AcDbMLeaderStyle::TextAttachmentDirection) const
AcDbMLeaderStyle::ContentType  | contentType () const
Returns the content type actually defined for this AcDbMLeader object. More...
double  | doglegLength () const
Returns the default dog-leg length for this AcDbMLeader object. More...
Acad::ErrorStatus  | doglegLength (int, double &) const
Returns the dog-leg length for the specified leader cluster. More...
virtual Acad::ErrorStatus  | dwgInFields (AcDbDwgFiler *)
Reads the object from the DWG filer. More...
virtual Acad::ErrorStatus  | dwgOutFields (AcDbDwgFiler *) const
Writes the object to the DWG filer. More...
virtual Acad::ErrorStatus  | dxfInFields (AcDbDxfFiler *)
Reads the object from the DXF filer. More...
virtual Acad::ErrorStatus  | dxfOutFields (AcDbDxfFiler *) const
Writes the object to the DXF filer. More...
bool  | enableAnnotationScale () const
Returns whether annotation scale is enabled for the MLeader entity. More...
bool  | enableDogleg () const
Returns whether the dog-leg style for this AcDbMLeader object is enabled. More...
bool  | enableFrameText () const
Returns whether the text frame for this AcDbMLeader object is shown or not. More...
bool  | enableLanding () const
Returns whether the landing is enabled for leader lines of this AcDbMLeader object. More...
 bool  | extendLeaderToText () const
Acad::ErrorStatus  | getArrowSize (int, double &) const
Returns the arrow size for leaderline specified by its index. More...
Acad::ErrorStatus  | getArrowSymbolId (int, AcDbObjectId &) const
Returns the arrow symbol id for leaderline specified by its index. More...
 Acad::ErrorStatus  | getBlockAttributeValue (const AcDbObjectId &, AcDbAttribute *&) const
 Acad::ErrorStatus  | getBlockAttributeValue (const AcDbObjectId &, ACHAR *&) const
Acad::ErrorStatus  | getBlockPosition (AcGePoint3d &) const
Gets the current block position for this MLeader entity. More...
 Acad::ErrorStatus  | getContentGeomExtents (AcDbExtents &) const
 void *  | getContextDataManager () const
Acad::ErrorStatus  | getDoglegDirection (int, AcGeVector3d &) const
Returns the dog-leg direction for the specified leader cluster. More...
Acad::ErrorStatus  | getFirstVertex (int, AcGePoint3d &) const
Retrieves the first vertex for specified leaderline index for this AcDbMLeader object. More...
Acad::ErrorStatus  | getLastVertex (int, AcGePoint3d &) const
Retrieves the first vertex for specified leaderline index for this AcDbMLeader object. More...
Acad::ErrorStatus  | getLeaderIndex (int, int &) const
Retrieves the leader index for specified leaderline index for this AcDbMLeader object. More...
 Acad::ErrorStatus  | getLeaderIndexes (AcDbIntArray &) const
 Acad::ErrorStatus  | getLeaderLineColor (int, AcCmColor &) const
 Acad::ErrorStatus  | getLeaderLineIndexes (AcDbIntArray &) const
 Acad::ErrorStatus  | getLeaderLineIndexes (int, AcDbIntArray &) const
Acad::ErrorStatus  | getLeaderLineType (int, AcDbMLeaderStyle::LeaderType &) const
Returns the leader line type for the leader with specified index. More...
 Acad::ErrorStatus  | getLeaderLineTypeId (int, AcDbObjectId &) const
 Acad::ErrorStatus  | getLeaderLineWeight (int, AcDb::LineWeight &) const
 Acad::ErrorStatus  | getOverridedMLeaderStyle (AcDbMLeaderStyle &)
Acad::ErrorStatus  | getTextLocation (AcGePoint3d &) const
Retrieves the text location for this AcDbMLeader object. More...
 Acad::ErrorStatus  | getToleranceLocation (AcGePoint3d &) const
Acad::ErrorStatus  | getVertex (int, int, AcGePoint3d &) const
Retrieves the vertex for specified leaderline index at given point index for this AcDbMLeader object. More...
 bool  | hasContent () const
bool  | isOverride (PropertyOverrideType propertyType) const
Indicates if the property type of mleader has been overridden. More...
double  | landingGap () const
Returns the landing gap for this AcDbMLeader object. More...
AcCmColor  | leaderLineColor () const
Gets the color of the leader line. More...
AcDbMLeaderStyle::LeaderType  | leaderLineType () const
Returns the leader type of this MLeader entity. More...
 AcDbObjectId  | leaderLineTypeId () const
 AcDb::LineWeight  | leaderLineWeight () const
 AcDbObjectId  | MLeaderStyle ()
virtual void  | modified (const AcDbObject *)
Notification when the object @pObject was modified (persistent reactor notification) More...
Acad::ErrorStatus  | moveMLeader (const AcGeVector3d &, MoveType, bool=true)
Move the mleader entity in the direction and distance specified by input vector. More...
AcDbMText *  | mtext () const
Retrieves the MTEXT content for this AcDbMLeader object. More...
AcGeVector3d  | normal () const
Returns the normal vector of this MLeader entity (plane's normal). More...
int  | numLeaderLines () const
Returns the number of all leaderlines for this AcDbMLeader object. More...
int  | numLeaders () const
Returns the number of leader clusters for this AcDbMLeader object. More...
Acad::ErrorStatus  | numVertices (int, int &) const
Retrieves the number of vertices for specified leaderline index for this AcDbMLeader object. More...
virtual void  | objectClosed (const AcDbObjectId &)
Notification when the object @id was closed (persistent reactor notification) More...
AcGePlane  | plane () const
Returns the plane of this MLeader entity. More...
Acad::ErrorStatus  | postMLeaderToDb (AcDbDatabase *)
Saves this MLeader entity to the specified database. More...
 Acad::ErrorStatus  | recomputeBreakPoints ()
 Acad::ErrorStatus  | removeFirstVertex (int)
 Acad::ErrorStatus  | removeLastVertex (int)
 Acad::ErrorStatus  | removeLeader (int)
 Acad::ErrorStatus  | removeLeaderLine (int)
 Acad::ErrorStatus  | removeLeaderLineRefAssoc (int) const
 double  | scale () const
Acad::ErrorStatus  | setArrowSize (double)
Sets the default arrow size for this AcDbMLeader object. More...
Acad::ErrorStatus  | setArrowSize (int, double)
Sets the arrow size for the specified leaderline. More...
Acad::ErrorStatus  | setArrowSymbolId (const AcDbObjectId &)
Sets the default arrow symbol id for this AcDbMLeader object. More...
Acad::ErrorStatus  | setArrowSymbolId (int, const AcDbObjectId &)
Sets the arrow symbol id for leaderline specified by its index. More...
 Acad::ErrorStatus  | setBlockAttributeValue (const AcDbObjectId &, const AcDbAttribute *)
 Acad::ErrorStatus  | setBlockAttributeValue (const AcDbObjectId &, const ACHAR *)
Acad::ErrorStatus  | setBlockColor (const AcCmColor &)
Sets the block color of this AcDbMLeader object. More...
Acad::ErrorStatus  | setBlockConnectionType (AcDbMLeaderStyle::BlockConnectionType)
Sets the Block connection type for this AcDbMLeader object. More...
Acad::ErrorStatus  | setBlockContentId (const AcDbObjectId &)
Sets the Block content for this AcDbMLeader object. More...
Acad::ErrorStatus  | setBlockPosition (const AcGePoint3d &)
Sets the block position for this AcDbMLeader object to specified point. More...
Acad::ErrorStatus  | setBlockRotation (double)
Sets the Block content rotation angle for this AcDbMLeader object. More...
 Acad::ErrorStatus  | setBlockScale (const AcGeScale3d &)
Acad::ErrorStatus  | setContentType (AcDbMLeaderStyle::ContentType)
Sets the content type for this AcDbMLeader object. More...
 Acad::ErrorStatus  | setContextDataManager (void *)
Acad::ErrorStatus  | setDoglegDirection (int, const AcGeVector3d &)
Sets the dog-leg direction for the specified leader cluster. More...
Acad::ErrorStatus  | setDoglegLength (double)
Sets the dog-leg length for all clusters of this AcDbMLeader object. More...
Acad::ErrorStatus  | setDoglegLength (int, double)
Sets the dog-leg length for the specified leaderline of this AcDbMLeader object. More...
Acad::ErrorStatus  | setEnableAnnotationScale (bool)
Sets whether annotation scale is enabled for the MLeader entity or not. More...
Acad::ErrorStatus  | setEnableDogleg (bool)
Sets the dog-leg style for this AcDbMLeader object. More...
Acad::ErrorStatus  | setEnableFrameText (bool)
Enables or disables the text frame for this AcDbMLeader object. More...
Acad::ErrorStatus  | setEnableLanding (bool)
Sets whether the landing is enabled for leader lines of this AcDbMLeader object. More...
 Acad::ErrorStatus  | setExtendLeaderToText (bool)
Acad::ErrorStatus  | setFirstVertex (int, const AcGePoint3d &)
Sets the first vertex for specified leaderline index for this AcDbMLeader object. More...
Acad::ErrorStatus  | setLandingGap (double)
Sets the landing gap value for this AcDbMLeader object. More...
Acad::ErrorStatus  | setLastVertex (int, const AcGePoint3d &)
Sets the last vertex for specified leaderline index for this AcDbMLeader object. More...
Acad::ErrorStatus  | setLeaderLineColor (const AcCmColor &)
Sets the color of the leader line. More...
 Acad::ErrorStatus  | setLeaderLineColor (int, const AcCmColor &)
Acad::ErrorStatus  | setLeaderLineType (AcDbMLeaderStyle::LeaderType)
Sets the leader type for this AcDbMLeader object to specified point. More...
Acad::ErrorStatus  | setLeaderLineType (int, AcDbMLeaderStyle::LeaderType)
Sets the specific leader line type for the leader with specified index. More...
 Acad::ErrorStatus  | setLeaderLineTypeId (const AcDbObjectId &)
 Acad::ErrorStatus  | setLeaderLineTypeId (int, const AcDbObjectId &)
 Acad::ErrorStatus  | setLeaderLineWeight (AcDb::LineWeight)
 Acad::ErrorStatus  | setLeaderLineWeight (int, AcDb::LineWeight)
 Acad::ErrorStatus  | setMLeaderStyle (const AcDbObjectId &)
Acad::ErrorStatus  | setMText (const AcDbMText *)
Sets the MTEXT content for this AcDbMLeader object to specified AcDbMText. More...
Acad::ErrorStatus  | setOverride (PropertyOverrideType, bool=true)
Sets the override flag for mleader entity. More...
void  | setPlane (const AcGePlane &)
Assigns the plane for this MLeader entity. More...
 Acad::ErrorStatus  | setScale (double)
Acad::ErrorStatus  | setTextAlignmentType (AcDbMLeaderStyle::TextAlignmentType)
Sets the MText alignment type for this AcDbMLeader object. More...
Acad::ErrorStatus  | setTextAngleType (AcDbMLeaderStyle::TextAngleType)
Sets the MText content angle type. More...
Acad::ErrorStatus  | setTextAttachmentDirection (AcDbMLeaderStyle::TextAttachmentDirection)
Sets the MText attachment direction value for this AcDbMLeader object. More...
Acad::ErrorStatus  | setTextAttachmentType (AcDbMLeaderStyle::TextAttachmentType)
Sets the MText attachment type for this AcDbMLeader object. More...
Acad::ErrorStatus  | setTextAttachmentType (AcDbMLeaderStyle::TextAttachmentType, AcDbMLeaderStyle::LeaderDirectionType)
Sets the MText attachment type for the specified leader direction type. More...
Acad::ErrorStatus  | setTextColor (const AcCmColor &)
Sets the color of the text. More...
Acad::ErrorStatus  | setTextHeight (double)
Sets the height of the text. More...
Acad::ErrorStatus  | setTextLocation (const AcGePoint3d &)
Sets the text location for this AcDbMLeader object to specified point. More...
Acad::ErrorStatus  | setTextStyleId (const AcDbObjectId &textStyleId)
Sets the mtext content of mleader with the specified text style id. More...
 Acad::ErrorStatus  | setToleranceLocation (const AcGePoint3d &)
 Acad::ErrorStatus  | setVertex (int, int, const AcGePoint3d &)
virtual Acad::ErrorStatus  | subClose ()
Notification when this object is to be closed. More...
virtual Acad::ErrorStatus  | subErase (Adesk::Boolean)
Notification when this object is to be erased. More...
AcDbMLeaderStyle::TextAlignmentType  | textAlignmentType () const
Returns the MText alignment type for this AcDbMLeader object. More...
AcDbMLeaderStyle::TextAngleType  | textAngleType () const
Returns the MText content angle type. More...
AcDbMLeaderStyle::TextAttachmentDirection  | textAttachmentDirection () const
Returns the MText attachment direction value for this AcDbMLeader object. More...
AcDbMLeaderStyle::TextAttachmentType  | textAttachmentType () const
Returns the MText attachment type for this AcDbMLeader object. More...
AcDbMLeaderStyle::TextAttachmentType  | textAttachmentType (AcDbMLeaderStyle::LeaderDirectionType) const
Returns the MText attachment type for the specified leader direction type. More...
AcCmColor  | textColor () const
Gets the color of the text. More...
double  | textHeight () const
Gets the text height. More...
AcDbObjectId  | textStyleId () const
Returns the text style id used by mtext content of mleader. More...
 Acad::ErrorStatus  | updateContentScale (AcDbMLeaderObjectContextData *)
 Acad::ErrorStatus  | updateLeaderLinePosition ()
~AcDbMLeader ()
Default destructor.
 Public Member Functions inherited from AcDbEntity
 virtual Acad::ErrorStatus  | addSubentPaths (const AcDbFullSubentPathArray &) final
virtual Acad::ErrorStatus  | applyPartialUndo (AcDbDwgFiler *, AcRxClass *)
virtual Acad::ErrorStatus  | audit (AcDbAuditInfo *)
AcDbObjectId  | blockId () const
Returns the Object ID of the BlockTableRecord that owns this entity. More...
Acad::ErrorStatus  | boundingBoxIntersectWith (const AcDbEntity *, AcDb::Intersect, AcGePoint3dArray &, Adesk::GsMarker, Adesk::GsMarker) const
Finds the intersection between the edges of the bounding box for this entity and the pOhter entity. More...
Acad::ErrorStatus  | boundingBoxIntersectWith (const AcDbEntity *, AcDb::Intersect, const AcGePlane &, AcGePoint3dArray &, Adesk::GsMarker, Adesk::GsMarker) const
First, the function projects the other entity and the bounding box of this entity on plane specified by plane. More...
virtual bool  | bounds (AcDbExtents &) const
Returns the extents of this entity as AcDbExtents. More...
virtual bool  | castShadows () const
Checks if this entity is able to cast shadows. More...
virtual Adesk::Boolean  | cloneMeForDragging () final
Checks if a clone will be created for this entity in case of a drag operation. More...
 virtual AcDb::CollisionType  | collisionType () const
AcCmColor  | color () const
Returns the true color information of the entity. More...
Adesk::UInt16  | colorIndex () const
Returns the color number in a range from 0 to 256. More...
 virtual Acad::ErrorStatus  | deleteSubentPaths (const AcDbFullSubentPathArray &) final
virtual void  | dragStatus (const AcDb::DragStat)
Acad::ErrorStatus  | draw ()
Draws or redraws the entity on screen. More...
virtual AcGiDrawable *  | drawable ()
virtual Acad::ErrorStatus  | dwgInFields (AcDbDwgFiler *)
virtual Acad::ErrorStatus  | dwgOutFields (AcDbDwgFiler *) const
virtual Acad::ErrorStatus  | dxfInFields (AcDbDxfFiler *)
virtual Acad::ErrorStatus  | dxfOutFields (AcDbDxfFiler *) const
AcCmEntityColor  | entityColor () const
Returns the lightweight color information of the entity. More...
virtual Acad::ErrorStatus  | explode (AcDbVoidPtrArray &) const final
virtual Acad::ErrorStatus  | getCompoundObjectTransform (AcGeMatrix3d &) const final
It is used for object without geometry like AcDbMleader. More...
virtual void  | getEcs (AcGeMatrix3d &) const
Returns the transformation matrix from OCS (Object Coordinate System) to WCS (World Coordinate System). More...
virtual Acad::ErrorStatus  | getGeomExtents (AcDbExtents &) const final
Returns extents of this entity. More...
 virtual Acad::ErrorStatus  | getGripEntityUCS (const void *, AcGeVector3d &, AcGePoint3d &, AcGeVector3d &) const final
 virtual Acad::ErrorStatus  | getGripPoints (AcDbGripDataPtrArray &, const double, const int, const AcGeVector3d &, const int) const final
virtual Acad::ErrorStatus  | getGripPoints (AcGePoint3dArray &, AcDbIntArray &, AcDbIntArray &) const final
Append grip points to the specified array. More...
 virtual Acad::ErrorStatus  | getGripPointsAtSubentPath (const AcDbFullSubentPath &, AcDbGripDataPtrArray &, const double, const int, const AcGeVector3d &, const int) const final
virtual Acad::ErrorStatus  | getGsMarkersAtSubentPath (const AcDbFullSubentPath &, AcArray< Adesk::GsMarker > &) const final
virtual Acad::ErrorStatus  | getMaterialMapper (AcGiMapper &) const
virtual Acad::ErrorStatus  | getOsnapPoints (AcDb::OsnapMode, Adesk::GsMarker, const AcGePoint3d &, const AcGePoint3d &, const AcGeMatrix3d &, AcGePoint3dArray &, AcDbIntArray &) const final
Gets the entity osnap points. More...
virtual Acad::ErrorStatus  | getOsnapPoints (AcDb::OsnapMode, Adesk::GsMarker, const AcGePoint3d &, const AcGePoint3d &, const AcGeMatrix3d &, AcGePoint3dArray &, AcDbIntArray &, const AcGeMatrix3d &) const final
Gets the entity osnap points. More...
virtual Acad::ErrorStatus  | getPlane (AcGePlane &, AcDb::Planarity &) const
Returns the plane that contains this entity. More...
AcDb::PlotStyleNameType  | getPlotStyleNameId (AcDbObjectId &) const
Returns the plot style name type and its associated id. More...
virtual Acad::ErrorStatus  | getStretchPoints (AcGePoint3dArray &) const final
Append stretch points to the specified array. More...
 virtual Acad::ErrorStatus  | getSubentClassId (const AcDbFullSubentPath &, CLSID *) const final
 virtual Acad::ErrorStatus  | getSubentPathGeomExtents (const AcDbFullSubentPath &, AcDbExtents &) const final
virtual Acad::ErrorStatus  | getSubentPathsAtGsMarker (AcDb::SubentType, Adesk::GsMarker, const AcGePoint3d &, const AcGeMatrix3d &, int &, AcDbFullSubentPath *&, int=0, AcDbObjectId *=NULL) const final
Gets the subentity paths appropriate for the passed in gs marker. More...
virtual Acad::ErrorStatus  | getTransformedCopy (const AcGeMatrix3d &, AcDbEntity *&) const final
Creates a copy of the current entity applying the transformation matrix. More...
 virtual void  | gripStatus (const AcDb::GripStat) final
virtual AcGsNode *  | gsNode () const
 virtual bool  | hideMeForDragging () const final
virtual Acad::ErrorStatus  | highlight (const AcDbFullSubentPath &=kNullSubent, const Adesk::Boolean=Adesk::kFalse) const final
Highlights part of, or entire entity. More...
virtual Acad::ErrorStatus  | intersectWith (const AcDbEntity *, AcDb::Intersect, AcGePoint3dArray &, Adesk::GsMarker=0, Adesk::GsMarker=0) const final
Finds the intersection between this entity and the pOhter entity. More...
virtual Acad::ErrorStatus  | intersectWith (const AcDbEntity *, AcDb::Intersect, const AcGePlane &, AcGePoint3dArray &, Adesk::GsMarker=0, Adesk::GsMarker=0) const final
Projects this entity and the pOhter entity on plane, finds the intersection points between these projections and then projects back the points onto the caller entity. More...
 virtual bool  | isContentSnappable () const final
virtual Adesk::Boolean  | isPlanar () const
ACHAR *  | layer () const
Returns the layername. More...
AcDbObjectId  | layerId () const
Returns the Object ID of the LayerTableRecord referenced by this entity. More...
ACHAR *  | linetype () const
Gets the linetype value. More...
AcDbObjectId  | linetypeId () const
Gets the linetypeId value. More...
 double  | linetypeScale () const
returns the linetype scale factor for the entity
AcDb::LineWeight  | lineWeight () const
Gets the entity line weight. More...
virtual void  | list () const final
Prints the properties in drawing window. More...
ACHAR *  | material () const
Gets the material assigned to this entity. More...
AcDbObjectId  | materialId () const
Gets the AcDbObjectId of the material assigned to this entity. More...
virtual Acad::ErrorStatus  | moveGripPointsAt (const AcDbIntArray &, const AcGeVector3d &) final
Move the grip points pointed by the indexes specified in indexArray using the translationVector param direction and length Override this method in custom entities to define your own behaviour. More...
 virtual Acad::ErrorStatus  | moveGripPointsAt (const AcDbVoidPtrArray &, const AcGeVector3d &, const int) final
 virtual Acad::ErrorStatus  | moveGripPointsAtSubentPaths (const AcDbFullSubentPathArray &, const AcDbVoidPtrArray &, const AcGeVector3d &, const int) final
virtual Acad::ErrorStatus  | moveStretchPointsAt (const AcDbIntArray &, const AcGeVector3d &) final
Move the stretch points pointed by the indexes specified in indexArray with the offest specified by translationVector Override this method in custom entities to define your own behaviour. More...
ACHAR *  | plotStyleName () const
Returns the name of the plotStyleName string associated with this entity (DXF 390). More...
virtual bool  | receiveShadows () const
Checks if this entity is able to receive shadows. More...
void  | recordGraphicsModified (Adesk::Boolean=Adesk::kTrue)
Controls the entity display update when closing it Entities not updated when closed are updated at the first regen. More...
virtual void  | saveAs (AcGiWorldDraw *, AcDb::SaveType)
Generates the graphics primitives when a DWG save requiring proxy graphics to be saved is made. More...
virtual void  | setCastShadows (bool)
Sets this entity's flag regarding casting shadows. More...
virtual Acad::ErrorStatus  | setColor (const AcCmColor &, Adesk::Boolean=Adesk::kTrue)
Sets the color information of this entity from an AcCmColor instance. More...
virtual Acad::ErrorStatus  | setColor (const AcCmColor &, bool, AcDbDatabase *)
Sets the color property of this entity from an AcCmColor instance. More...
virtual Acad::ErrorStatus  | setColorIndex (Adesk::UInt16, Adesk::Boolean=Adesk::kTrue)
Sets the color index of this entity (DXF 62). More...
void  | setDatabaseDefaults ()
Applies the default properties of the entities database to this entity. More...
void  | setDatabaseDefaults (AcDbDatabase *)
Applies the default properties of the specified database to this entity. More...
virtual void  | setGsNode (AcGsNode *)
virtual Acad::ErrorStatus  | setLayer (AcDbObjectId, Adesk::Boolean=Adesk::kTrue, bool=false)
Sets the layer to be referenced by this entity (DXF 8). More...
virtual Acad::ErrorStatus  | setLayer (const ACHAR *, Adesk::Boolean=Adesk::kTrue, bool=false)
Sets the layer to be referenced by this entity (DXF 8). More...
virtual Acad::ErrorStatus  | setLinetype (AcDbObjectId, Adesk::Boolean=Adesk::kTrue)
Sets the entities linetype to ltypeObjectId. More...
virtual Acad::ErrorStatus  | setLinetype (const ACHAR *, Adesk::Boolean=Adesk::kTrue)
Sets the entities linetype to the linetpye referenced by layerName. More...
virtual Acad::ErrorStatus  | setLinetypeScale (double, Adesk::Boolean=Adesk::kTrue)
sets value as entity linetype scale factor More...
virtual Acad::ErrorStatus  | setLineWeight (AcDb::LineWeight, Adesk::Boolean=Adesk::kTrue)
Sets the entity line weight. More...
virtual Acad::ErrorStatus  | setMaterial (AcDbObjectId, Adesk::Boolean=Adesk::kTrue)
Not implemented yet. More...
virtual Acad::ErrorStatus  | setMaterial (const ACHAR *, Adesk::Boolean=Adesk::kTrue)
Assigns the material to the entity. More...
virtual Acad::ErrorStatus  | setMaterialMapper (const AcGiMapper &, Adesk::Boolean=Adesk::kTrue)
It is used for apply material (scale, rotation, projection, mode overrides) to an identity.If it is used AcGiMapper::kIdentity it will apply for entity a default mapper. More...
virtual Acad::ErrorStatus  | setPlotStyleName (AcDb::PlotStyleNameType, AcDbObjectId=AcDbObjectId::kNull, Adesk::Boolean=Adesk::kTrue)
Sets the plot style of this entity. More...
virtual Acad::ErrorStatus  | setPlotStyleName (const ACHAR *, Adesk::Boolean=Adesk::kTrue)
Sets the plot style of this entity. More...
Acad::ErrorStatus  | setPropertiesFrom (const AcDbEntity *, Adesk::Boolean=Adesk::kTrue)
Copies the properties color, layer, linetype, linetypescale and visibility from the source entity pEntity to this entity. More...
virtual void  | setReceiveShadows (bool)
Sets this entity's flag regarding receiving shadows. More...
virtual Acad::ErrorStatus  | setTransparency (const AcCmTransparency &, Adesk::Boolean=Adesk::kTrue)
Sets the transparency setting of this entity, and returns eOk if successful. More...
virtual Acad::ErrorStatus  | setVisibility (AcDb::Visibility, Adesk::Boolean=Adesk::kTrue) final
notyetdocumented. More...
 virtual Acad::ErrorStatus  | setVisualStyle (AcDbObjectId, VisualStyleType=kFullVisualStyle, Adesk::Boolean=true)
 virtual void  | subentGripStatus (const AcDb::GripStat, const AcDbFullSubentPath &) final
virtual AcDbEntity *  | subentPtr (const AcDbFullSubentPath &) const final
Creates an entity as a copy of the subentity given by acSubentPath. More...
virtual void  | subSetDatabaseDefaults (AcDbDatabase *)
This function is called by AcDbEntity::setDatabaseDefaults(), to allow custom entities to set their related sub entities, if any; default implementation does nothing. More...
virtual Acad::ErrorStatus  | transformBy (const AcGeMatrix3d &) final
Applies given transformation (matrix) to the entity. More...
 virtual Acad::ErrorStatus  | transformSubentPathsBy (const AcDbFullSubentPathArray &, const AcGeMatrix3d &) final
 AcCmTransparency  | transparency () const
Returns the transparency setting of this entity.
virtual Acad::ErrorStatus  | unhighlight (const AcDbFullSubentPath &=kNullSubent, const Adesk::Boolean=Adesk::kFalse) const final
Unhighlights previously highlighted part of entity, or entire entity. More...
AcDb::Visibility  | visibility () const
Gets the visibility state. More...
 AcDbObjectId  | visualStyleId (VisualStyleType=kFullVisualStyle) const
 Public Member Functions inherited from AcDbObject
virtual void  | addPersistentReactor (AcDbObjectId)
Adds a persistent reactor to this object reactor list. More...
void  | addReactor (AcDbObjectReactor *) const
Adds a transient reactor to this object. More...
virtual Acad::ErrorStatus  | applyPartialUndo (AcDbDwgFiler *, AcRxClass *)
This function is called during Undo operations on objects, that use the 'Partial Undo meachanism'; this is, this object is opened with assertWriteEnabled(Adesk::kFalse) to indicate that custom Undo filing is used rather than the default Undo filing. More...
 void  | assertNotifyEnabled () const
 void  | assertReadEnabled () const
 void  | assertWriteEnabled (Adesk::Boolean=Adesk::kTrue, Adesk::Boolean=Adesk::kTrue)
virtual Acad::ErrorStatus  | audit (AcDbAuditInfo *)
Performs the audit operation for this object. More...
Acad::ErrorStatus  | cancel ()
Reverts all changes since the object had been opened and closes the object. More...
virtual void  | cancelled (const AcDbObject *)
A handler function for persistent reactors. More...
virtual AcRxObject *  | clone () const
Creates a shallow clone of this object. More...
Acad::ErrorStatus  | close ()
Closes the object. More...
Acad::ErrorStatus  | closeAndPage (Adesk::Boolean=Adesk::kTrue)
Closes the object. More...
virtual Acad::ErrorStatus  | composeForLoad (AcDb::OdaSaveType, AcDb::AcDbDwgVersion)
This function is intended for future MT file loading support. More...
virtual void  | copied (const AcDbObject *, const AcDbObject *)
A handler function for persistent reactors. More...
virtual Acad::ErrorStatus  | copyFrom (const AcRxObject *)
Copies the pSrc object information in this object. More...
Acad::ErrorStatus  | createExtensionDictionary ()
Creates a dictionary as extension dictionary for this object. More...
AcDbDatabase *  | database () const
Returns the database that contains this object. More...
virtual Acad::ErrorStatus  | decomposeForSave (AcDb::AcDbDwgVersion, AcDbObject *&, AcDbObjectId &, Adesk::Boolean &)
This function is called during dwg and dxf output, to allow a custom object to decompose itself, due to provided dwg/dxf target file version. More...
virtual Acad::ErrorStatus  | deepClone (AcDbObject *, AcDbObject *&, AcDbIdMapping &, Adesk::Boolean=Adesk::kTrue) const final
Clones this object, appends it to the owner pOwner and adds an AcDbIdPair record to the idMap. More...
void  | disableUndoRecording (Adesk::Boolean)
Disables or enables the undo recording for the object. More...
Acad::ErrorStatus  | downgradeOpen ()
Sets the open mode for an object opened for write to be opened for read. More...
Acad::ErrorStatus  | downgradeToNotify (Adesk::Boolean)
Sets the open mode for an object opened for write to be opened for notify. More...
virtual AcGiDrawable *  | drawable ()
Retrieves the AcGiDrawable instance of this object. More...
Acad::ErrorStatus  | dwgIn (AcDbDwgFiler *)
Calls the object's dwgInFields function, and reads any XData if present. More...
virtual Acad::ErrorStatus  | dwgInFields (AcDbDwgFiler *)
Reads the object from the DWG filer. More...
Acad::ErrorStatus  | dwgOut (AcDbDwgFiler *) const
Calls the object's dwgOutFields function, and writes any XData if present. More...
virtual Acad::ErrorStatus  | dwgOutFields (AcDbDwgFiler *) const
Writes the object to the DWG filer. More...
Acad::ErrorStatus  | dxfIn (AcDbDxfFiler *)
Calls the object's dxfInFields function, and reads any XData if present. More...
virtual Acad::ErrorStatus  | dxfInFields (AcDbDxfFiler *)
Reads the object from the DXF filer. More...
Acad::ErrorStatus  | dxfOut (AcDbDxfFiler *, Adesk::Boolean, Adesk::uchar *) const
Calls the object's dxfOutFields function, and writes any XData if present. More...
virtual Acad::ErrorStatus  | dxfOutFields (AcDbDxfFiler *) const
Writes the object to the DXF filer. More...
Acad::ErrorStatus  | erase (Adesk::Boolean=Adesk::kTrue)
Sets the bit that indicates that the object is erased. More...
virtual void  | erased (const AcDbObject *, Adesk::Boolean=Adesk::kTrue)
A handler function for persistent reactors. More...
AcDbObjectId  | extensionDictionary () const
Returns the object id of the extension dictionary for this object. More...
void  | getAcDbHandle (AcDbHandle &) const
Returns handle of this object. More...
Acad::ErrorStatus  | getBinaryData (const ACHAR *, Adesk::Int32 &, char *&) const
Creates a copy of the binary data stored as chunks of maximum 127 bytes in the resbuf chain of this object's extension dictionary xrecord entry given by entryName. More...
int  | getBrxOpenCount () const
This function returns the number of open BRX instances for this object. More...
int  | getBrxOpenState () const
This function returns the BRX object open state flags as bitfields, for diagnostic purpose. More...
virtual Acad::ErrorStatus  | getClassID (CLSID *) const final
Gets the COM wrapper Class ID for this entity. More...
int  | getCustomObjectState () const
This function returns the custom object status : 1=isCustomObject 2=DifferentialUndoDisabled. More...
Acad::ErrorStatus  | getField (const ACHAR *, AcDbField *&, AcDb::OpenMode) const
Retrieves the specified Field from this object, and opens it in mode. More...
Acad::ErrorStatus  | getField (const ACHAR *, AcDbObjectId &) const
Gets the pszPropName field object from field dictionary of this AcDbObject object, using pszPropName as key. More...
AcDbObjectId  | getFieldDictionary () const
Returns the Field dictionary associated with this object,. More...
Acad::ErrorStatus  | getFieldDictionary (AcDbDictionary *&, AcDb::OpenMode) const
Gets and opens the field dictionary for this. More...
Acad::ErrorStatus  | getObjectBirthVersion (AcDb::AcDbDwgVersion &, AcDb::MaintenanceReleaseVersion &)
This function is currently not supported by the CAD engine, always returns Acad::eOk, and 'kDHL_CURRENT' + 'kMReleaseCurrent' results. More...
virtual Acad::ErrorStatus  | getObjectSaveVersion (const AcDbDwgFiler *, AcDb::AcDbDwgVersion &, AcDb::MaintenanceReleaseVersion &)
Returns the DWG version for saving the object. More...
virtual Acad::ErrorStatus  | getObjectSaveVersion (const AcDbDxfFiler *, AcDb::AcDbDwgVersion &, AcDb::MaintenanceReleaseVersion &)
Returns the DWG version for saving the object. More...
int  | getOdaOpenCount () const
This function returns the number of open ODA instances for this object. More...
int  | getOdaOpenState () const
This function returns the ODA object open state flags as bitfields, for diagnostic purpose. More...
virtual void  | goodbye (const AcDbObject *)
A handler function for persistent reactors. More...
virtual AcGsNode *  | gsNode () const
Gets the AcGsNode (graphics cache) for this entity. More...
Acad::ErrorStatus  | handOverTo (AcDbObject *, Adesk::Boolean=Adesk::kTrue, Adesk::Boolean=Adesk::kTrue)
Hands over objects identity to another object. More...
bool  | hasFields () const
Return true if this object has single or multiple fields associated with him. More...
bool  | hasPersistentReactor (AcDbObjectId) const
Checks the input objectId in this object reactor list. More...
bool  | hasSaveVersionOverride ()
This function indicates whether this object overrides the filer's save version. More...
virtual AcDbObjectId  | id () const
Returns the database id of this object. More...
Adesk::Boolean  | isAcDbObjectIdsInFlux () const
Checks whether a deep clone operation was completed. More...
Adesk::Boolean  | isAProxy () const
Adesk::Boolean  | isCancelling () const
Adesk::Boolean  | isErased () const
Returns whether this object is erased. More...
Adesk::Boolean  | isEraseStatusToggled () const
Checks whether the object erase status has been toggled. More...
Adesk::Boolean  | isModified () const
Returns whether this object's assertWriteEnabled() has been called since it was opened. More...
Adesk::Boolean  | isModifiedGraphics () const
Checks whether this object graphics will be updated when the object is closed. More...
Adesk::Boolean  | isModifiedXData () const
Checks whether this object's xData was modified. More...
Adesk::Boolean  | isNewObject () const
Returns true if and only if this object has not been closed since it was created. More...
Adesk::Boolean  | isNotifyEnabled () const
Returns whether this object is opened for notify. More...
Adesk::Boolean  | isNotifying () const
virtual Adesk::Boolean  | isPersistent () const
Returns the 'persistent' status of a database object. More...
Adesk::Boolean  | isReadEnabled () const
Returns whether this object is opened for read. More...
 Adesk::Boolean  | isReallyClosing () const
Checks whether the next close call will completely close this object return true if on the next call the object will be completely closed false otherwise.
Adesk::Boolean  | isTransactionResident () const
Gets the object transaction status. More...
Adesk::Boolean  | isUndoing () const
bool  | isUndoRecordingDisabled () const
Returns whether the undo recording for the object is enabled or not. More...
Adesk::Boolean  | isWriteEnabled () const
Returns whether this object is opened for write. More...
virtual AcDb::DuplicateRecordCloning  | mergeStyle () const
Returns the object's merge behavior during cloning. More...
virtual void  | modified (const AcDbObject *)
A handler function for persistent reactors. More...
virtual void  | modifiedGraphics (const AcDbEntity *)
A handler function for persistent reactors. More...
virtual void  | modifiedXData (const AcDbObject *)
A handler function for persistent reactors. More...
virtual void  | modifyUndone (const AcDbObject *)
A handler function for persistent reactors. More...
virtual void  | objectClosed (const AcDbObjectId)
A handler function for persistent reactors. More...
AcDbObjectId  | objectId () const
Returns object id. More...
virtual void  | openedForModify (const AcDbObject *)
A handler function for persistent reactors. More...
AcDbObjectId  | ownerId () const
Returns object id of the owner. More...
AcDbVoidPtrArray *  | reactors ()
Gets the object pointers to reactors. More...
const AcDbVoidPtrArray *  | reactors () const
Gets the object pointers to reactors. More...
virtual void  | reappended (const AcDbObject *)
A handler function for persistent reactors. More...
 virtual void  | recvPropagateModify (const AcDbObject *)
Not implemented yet.
Acad::ErrorStatus  | releaseExtensionDictionary ()
Removes the extension dictionary associated with this object. More...
virtual Acad::ErrorStatus  | removeField (AcDbObjectId)
Removes the Field specified by acFieldId from this object. More...
virtual Acad::ErrorStatus  | removeField (const ACHAR *)
Removes the Field specified by szKeyString from this object. More...
virtual Acad::ErrorStatus  | removeField (const ACHAR *, AcDbObjectId &)
Removes the Field specified by acPszKeyString from this object, and returns its ObjectId value. More...
virtual Acad::ErrorStatus  | removePersistentReactor (AcDbObjectId)
Removes a persistent reactor from this object reactor list. More...
void  | removeReactor (AcDbObjectReactor *) const
Removes a transient reactor to this object. More...
void  | setAcDbObjectIdsInFlux ()
Call this function to indicate that the object IDs of this object and its sub-objects (if any) are not yet valid. More...
Acad::ErrorStatus  | setBinaryData (const ACHAR *, Adesk::Int32, const char *)
Creates a copy of the binary data, divides it in up to 127 bytes binary chunks and
 sets them as resbufs in the resbuf chain of this object's extension dictionary xrecord entry given by entryName. More...
virtual Acad::ErrorStatus  | setField (const ACHAR *, AcDbField *, AcDbObjectId &)
Adds the pAcField field object to field dictionary of this AcDbObject object, using pKey as key. More...
virtual void  | setGsNode (AcGsNode *)
Gets the AcGsNode (graphics cache) for this entity. More...
void  | setHasSaveVersionOverride (bool)
This function can be called to specify that the object has a "save version override". More...
virtual Acad::ErrorStatus  | setOwnerId (AcDbObjectId)
Sets the ownerId data member of the object to be objId. More...
virtual Acad::ErrorStatus  | setXData (const resbuf *)
Sets/removes xData associated with this object. More...
virtual Acad::ErrorStatus  | subCancel ()
Possibility to veto a cancel operation from within custom entities. More...
virtual Acad::ErrorStatus  | subClose ()
virtual Acad::ErrorStatus  | subErase (Adesk::Boolean)
This hook is called during an AcDbObject::erase call, before any actual erase operation is performed. More...
 virtual Acad::ErrorStatus  | subHandOverTo (AcDbObject *)
virtual void  | subObjModified (const AcDbObject *, const AcDbObject *)
A handler function for persistent reactors. More...
 virtual Acad::ErrorStatus  | subOpen (AcDb::OpenMode)
virtual Acad::ErrorStatus  | subSwapIdWith (AcDbObjectId, Adesk::Boolean=Adesk::kFalse, Adesk::Boolean=Adesk::kFalse)
This hook is called during an AcDbObject::swapIdWith() call, before any actual swap operation is performed. More...
Acad::ErrorStatus  | swapIdWith (AcDbObjectId, Adesk::Boolean=Adesk::kFalse, Adesk::Boolean=Adesk::kFalse)
Swaps the object id's between the object identified by param swapId and this object. More...
virtual Acad::ErrorStatus  | swapReferences (const AcDbIdMapping &)
Not implemented yet. More...
virtual void  | unappended (const AcDbObject *)
A handler function for persistent reactors. More...
AcDbDwgFiler *  | undoFiler ()
Gets the undo filer for this object. More...
Acad::ErrorStatus  | upgradeFromNotify (Adesk::Boolean &)
Upgrades the open status of this object to AcDb::kForWrite, if this object is already open (either in AcDb::kForRead, AcDb::kForNotify or AcDb::kForWrite) More...
Acad::ErrorStatus  | upgradeOpen ()
Changes the objects open mode to AcDb::kForWrite and sends notifications. More...
virtual Acad::ErrorStatus  | wblockClone (AcRxObject *, AcDbObject *&, AcDbIdMapping &, Adesk::Boolean=Adesk::kTrue) const final
Clones this object, appends it to the owner pOwner and adds an AcDbIdPair record to the idMap. More...
virtual resbuf *  | xData (const ACHAR *=NULL) const
Returns the xData associated with this object. More...
Acad::ErrorStatus  | xDataTransformBy (const AcGeMatrix3d &)
Transforms the extended data according to parameter transformation matrix. More...
 virtual void  | xmitPropagateModify () const
Not implemented yet.
 virtual  | ~AcDbObject ()
Destructor.
 Public Member Functions inherited from AcGiDrawable
virtual bool  | bounds (AcDbExtents &) const
virtual DrawableType  | drawableType () const
 virtual AcGiDrawStream *  | drawStream () const
virtual AcGsNode *  | gsNode () const =0
virtual AcDbObjectId  | id () const =0
virtual Adesk::Boolean  | isPersistent () const =0
virtual Adesk::UInt32  | regenSupportFlags () const final
Returns whether and to which level this object supports MultiThreading. More...
 virtual Adesk::Boolean  | RolloverHit (Adesk::ULongPtr, Adesk::ULongPtr, Adesk::Boolean)
 virtual Adesk::UInt32  | setAttributes (AcGiDrawableTraits *) final
 virtual void  | setDrawStream (AcGiDrawStream *)
virtual void  | setGsNode (AcGsNode *)=0
 virtual void  | viewportDraw (AcGiViewportDraw *) final
 virtual Adesk::UInt32  | viewportDrawLogicalFlags (AcGiViewportDraw *) final
 virtual Adesk::Boolean  | worldDraw (AcGiWorldDraw *) final
 Public Member Functions inherited from AcRxObject
virtual AcRxObject *  | clone () const
Exported and implemented. More...
 virtual AcRx::Ordering  | comparedTo (const AcRxObject *) const
Exported and implemented.
virtual Acad::ErrorStatus  | copyFrom (const AcRxObject *)
Exported and implemented. More...
 virtual AcRxClass *  | isA () const
Exported and implemented.
virtual Adesk::Boolean  | isEqualTo (const AcRxObject *) const
Exported and implemented. More...
bool  | isKindOf (const AcRxClass *) const
Checks the object class. More...
AcRxObject *  | queryX (const AcRxClass *) const
returns the protocol extension object assigned to this class or a parent class. More...
AcRxObject *  | x (const AcRxClass *) const
returns the protocol extension object assigned to this class or a parent class. More...
 virtual  | ~AcRxObject ()
Destructor.
 Public Attributes
AcDbMLeader
Default constructor.
 Public Attributes inherited from AcDbEntity
AcDbEntity
This protected constructor sets the initial value for color to 257, and for the objectids for layer and linetype to AcDbObjectId::kNull. More...
 Additional Inherited Members
 Static Public Member Functions inherited from AcRxObject
 static AcRxObject *  | cast (const AcRxObject *)
 static AcRxClass *  | desc ()
Exported and implemented.
 Static Public Member Functions inherited from AcHeapOperators
 static void  | operator delete (void *)
_
 static void  | operator delete (void *, const char *, int)
 static void  | operator delete (void *, void *)
 static void  | operator delete[] (void *)
_
 static void  | operator delete[] (void *, const char *, int)
 static void *  | operator new (size_t)
_
 static void *  | operator new (size_t, const char *, int)
 static void *  | operator new (size_t, void *p)
 static void *  | operator new[] (size_t)
_
 static void *  | operator new[] (size_t, const char *, int)
 Protected Member Functions inherited from AcDbEntity
 virtual Acad::ErrorStatus  | subAddSubentPaths (const AcDbFullSubentPathArray &)
 virtual Adesk::Boolean  | subCloneMeForDragging ()
 virtual Acad::ErrorStatus  | subDeleteSubentPaths (const AcDbFullSubentPathArray &)
virtual Acad::ErrorStatus  | subExplode (AcDbVoidPtrArray &) const
 virtual Acad::ErrorStatus  | subGetCompoundObjectTransform (AcGeMatrix3d &) const
virtual Acad::ErrorStatus  | subGetGeomExtents (AcDbExtents &) const
virtual Acad::ErrorStatus  | subGetGripEntityUCS (const void *, AcGeVector3d &, AcGePoint3d &, AcGeVector3d &) const
virtual Acad::ErrorStatus  | subGetGripPoints (AcDbGripDataPtrArray &, const double, const int, const AcGeVector3d &, const int) const
virtual Acad::ErrorStatus  | subGetGripPoints (AcGePoint3dArray &, AcDbIntArray &, AcDbIntArray &) const
 virtual Acad::ErrorStatus  | subGetGripPointsAtSubentPath (const AcDbFullSubentPath &, AcDbGripDataPtrArray &, const double, const int, const AcGeVector3d &, const int) const
virtual Acad::ErrorStatus  | subGetGsMarkersAtSubentPath (const AcDbFullSubentPath &, AcArray< Adesk::GsMarker > &) const
virtual Acad::ErrorStatus  | subGetOsnapPoints (AcDb::OsnapMode, Adesk::GsMarker, const AcGePoint3d &, const AcGePoint3d &, const AcGeMatrix3d &, AcGePoint3dArray &, AcDbIntArray &) const
 virtual Acad::ErrorStatus  | subGetOsnapPoints (AcDb::OsnapMode, Adesk::GsMarker, const AcGePoint3d &, const AcGePoint3d &, const AcGeMatrix3d &, AcGePoint3dArray &, AcDbIntArray &, const AcGeMatrix3d &) const
virtual Acad::ErrorStatus  | subGetStretchPoints (AcGePoint3dArray &) const
 virtual Acad::ErrorStatus  | subGetSubentClassId (const AcDbFullSubentPath &, CLSID *) const
 virtual Acad::ErrorStatus  | subGetSubentPathGeomExtents (const AcDbFullSubentPath &, AcDbExtents &) const
virtual Acad::ErrorStatus  | subGetSubentPathsAtGsMarker (AcDb::SubentType, Adesk::GsMarker, const AcGePoint3d &, const AcGeMatrix3d &, int &, AcDbFullSubentPath *&, int=0, AcDbObjectId *=nullptr) const
virtual Acad::ErrorStatus  | subGetTransformedCopy (const AcGeMatrix3d &, AcDbEntity *&) const
virtual void  | subGripStatus (const AcDb::GripStat)
 virtual bool  | subHideMeForDragging () const
virtual Acad::ErrorStatus  | subHighlight (const AcDbFullSubentPath &=kNullSubent, const Adesk::Boolean=false) const
virtual Acad::ErrorStatus  | subIntersectWith (const AcDbEntity *, AcDb::Intersect, AcGePoint3dArray &, Adesk::GsMarker=0, Adesk::GsMarker=0) const
virtual Acad::ErrorStatus  | subIntersectWith (const AcDbEntity *, AcDb::Intersect, const AcGePlane &, AcGePoint3dArray &, Adesk::GsMarker=0, Adesk::GsMarker=0) const
virtual bool  | subIsContentSnappable () const
virtual void  | subList () const
virtual Acad::ErrorStatus  | subMoveGripPointsAt (const AcDbIntArray &, const AcGeVector3d &)
virtual Acad::ErrorStatus  | subMoveGripPointsAt (const AcDbVoidPtrArray &, const AcGeVector3d &, const int)
 virtual Acad::ErrorStatus  | subMoveGripPointsAtSubentPaths (const AcDbFullSubentPathArray &, const AcDbVoidPtrArray &, const AcGeVector3d &, const int)
virtual Acad::ErrorStatus  | subMoveStretchPointsAt (const AcDbIntArray &, const AcGeVector3d &)
virtual Adesk::UInt32  | subSetAttributes (AcGiDrawableTraits *)
Sets the values of this object's subentity traits and returns with the calling object's subentity traits. More...
virtual Acad::ErrorStatus  | subSetVisibility (AcDb::Visibility, Adesk::Boolean=true)
 virtual void  | subSubentGripStatus (const AcDb::GripStat, const AcDbFullSubentPath &)
virtual AcDbEntity *  | subSubentPtr (const AcDbFullSubentPath &) const
virtual Acad::ErrorStatus  | subTransformBy (const AcGeMatrix3d &)
 virtual Acad::ErrorStatus  | subTransformSubentPathsBy (const AcDbFullSubentPathArray &, const AcGeMatrix3d &)
virtual Acad::ErrorStatus  | subUnhighlight (const AcDbFullSubentPath &=kNullSubent, const Adesk::Boolean=false) const
virtual void  | subViewportDraw (AcGiViewportDraw *)
 virtual AcDb::Visibility  | subVisibility () const
virtual Adesk::Boolean  | subWorldDraw (AcGiWorldDraw *)
 Protected Member Functions inherited from AcDbObject
virtual Acad::ErrorStatus  | subDeepClone (AcDbObject *, AcDbObject *&, AcDbIdMapping &, Adesk::Boolean=true) const
virtual Acad::ErrorStatus  | subGetClassID (CLSID *) const
virtual Adesk::UInt32  | subSetAttributes (AcGiDrawableTraits *)
Sets the values of this object's subentity traits and returns with the calling object's subentity traits. More...
virtual void  | subViewportDraw (AcGiViewportDraw *)
virtual Adesk::UInt32  | subViewportDrawLogicalFlags (AcGiViewportDraw *)
virtual Acad::ErrorStatus  | subWblockClone (AcRxObject *, AcDbObject *&, AcDbIdMapping &, Adesk::Boolean=true) const
virtual Adesk::Boolean  | subWorldDraw (AcGiWorldDraw *)
 Protected Member Functions inherited from AcGiDrawable
virtual Adesk::UInt32  | subRegenSupportFlags () const
Returns whether and to which level this object supports MultiThreading. More...
virtual Adesk::UInt32  | subSetAttributes (AcGiDrawableTraits *)=0
virtual void  | subViewportDraw (AcGiViewportDraw *)=0
 virtual Adesk::UInt32  | subViewportDrawLogicalFlags (AcGiViewportDraw *)
virtual Adesk::Boolean  | subWorldDraw (AcGiWorldDraw *)=0
 Protected Member Functions inherited from AcRxObject
AcRxObject ()
Exported and implemented.
Detailed Description
_
Member Function Documentation
◆ addFirstVertex()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbMLeader::addFirstVertex  |  ( |  int  |  leaderLineIdx,
|  const AcGePoint3d &  |  pt
)
Adds a new first vertex to specified leaderline index for this AcDbMLeader object.
Parameters
[in] | leaderLineIdx | index of leaderline
[in] | pt | point to attach the leaderline to
Returns
Acad::eOk for success, error code otherwise
◆ addLastVertex()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbMLeader::addLastVertex  |  ( |  int  |  leaderLineIdx,
|  const AcGePoint3d &  |  pt
)
Adds a new last vertex to specified leaderline index for this AcDbMLeader object.
Parameters
[in] | leaderLineIdx | index of leaderline
[in] | pt | point to attach the leaderline to
Returns
Acad::eOk for success, error code otherwise
◆ addLeader()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbMLeader::addLeader  |  ( |  int &  |  index | )
Creates a new leader cluster for this AcDbMLeader object.
Parameters
[out] | index | the index of created cluster
Returns
Acad::eOk for success, error code otherwise
◆ addLeaderLine() [1/2]
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbMLeader::addLeaderLine  |  ( |  const AcGePoint3d &  |  pt,
|  int &  |  leaderLineIdx
)
Adds a new leaderline at specified point to specified leader cluster for this AcDbMLeader object.
Parameters
[in] | pt | point to attach the leaderline to
[out] | leaderLineIdx | the index of created leaderline
Returns
Acad::eOk for success, error code otherwise
◆ addLeaderLine() [2/2]
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbMLeader::addLeaderLine  |  ( |  int  |  leaderIdx,
|  int &  |  leaderLineIdx
)
Adds a new leaderline to specified leader cluster for this AcDbMLeader object.
Parameters
[in] | leaderIdx | index of leader cluster
[out] | leaderLineIdx | the index of created leaderline
Returns
Acad::eOk for success, error code otherwise
◆ arrowSize()
 UX_EXPORT_FUNCTION double AcDbMLeader::arrowSize  |  ( |   | ) |   const
Returns the default arrow size for this AcDbMLeader object.
Returns
double default arrow size
◆ arrowSymbolId() [1/2]
 UX_EXPORT_FUNCTION AcDbObjectId AcDbMLeader::arrowSymbolId  |  ( |   | ) |   const
Returns the default arrow symbol id for this AcDbMLeader object.
Returns
AcDbObjectId default arrow symbol id
◆ arrowSymbolId() [2/2]
 UX_EXPORT_FUNCTION AcDbObjectId AcDbMLeader::arrowSymbolId  |  ( |  int  |  leaderLineIdx | ) |   const
Returns the arrow symbol id for leaderline specified by its index.
Parameters
[in] | leaderLineIdx | the index of the leaderline
Returns
AcDbObjectId default arrow symbol id
◆ blockColor()
 UX_EXPORT_FUNCTION AcCmColor AcDbMLeader::blockColor  |  ( |   | ) |   const
Returns the Block color for this AcDbMLeader object.
Returns
the color used by the Block content
◆ blockConnectionType()
 UX_EXPORT_FUNCTION AcDbMLeaderStyle::BlockConnectionType AcDbMLeader::blockConnectionType  |  ( |   | ) |   const
Returns the Block connection type for this AcDbMLeader object.
Returns
the AcDbMLeaderStyle::BlockConnectionType used as Block connetion type
◆ blockContentId()
 UX_EXPORT_FUNCTION AcDbObjectId AcDbMLeader::blockContentId  |  ( |   | ) |   const
Returns the Block content id for this AcDbMLeader object.
Returns
the AcDbObjectId used as Block content
◆ blockRotation()
 UX_EXPORT_FUNCTION double AcDbMLeader::blockRotation  |  ( |   | ) |   const
Returns the Block content rotation angle for this AcDbMLeader object.
Returns
the angle used as rotation angle
◆ connectionPoint()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbMLeader::connectionPoint  |  ( |  const AcGeVector3d &  |  vec,
|  AcGePoint3d &  |  pt
) |   |  const
Indicates leader connection point for the specified direction.
Parameters
[in] | vec | input vector
[out] | pt | connection point
Returns
Acad::eOk for success, error code otherwise
◆ contentType()
 UX_EXPORT_FUNCTION AcDbMLeaderStyle::ContentType AcDbMLeader::contentType  |  ( |   | ) |   const
Returns the content type actually defined for this AcDbMLeader object.
Returns
AcDbMLeaderStyle::ContentType type of content as actually used
◆ doglegLength() [1/2]
 UX_EXPORT_FUNCTION double AcDbMLeader::doglegLength  |  ( |   | ) |   const
Returns the default dog-leg length for this AcDbMLeader object.
Returns
dog-leg length
◆ doglegLength() [2/2]
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbMLeader::doglegLength  |  ( |  int  |  leaderIdx,
|  double &  |  dLegLength
) |   |  const
Returns the dog-leg length for the specified leader cluster.
Parameters
[in] | leaderLineIdx | the index of the leaderline
[out] | dLegLength | the dogleg length
Returns
Acad::eOk for success, error status otherwise
◆ dwgInFields()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbMLeader::dwgInFields  |  ( |  AcDbDwgFiler *  |  dwgFiler | )
virtual
Reads the object from the DWG filer.
Parameters
[in] | dwgFiler | the filer instance which is used for filing
Returns
Acad::eOk for success, error code otherwise
Reimplemented from AcDbEntity.
◆ dwgOutFields()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbMLeader::dwgOutFields  |  ( |  AcDbDwgFiler *  |  dwgFiler | ) |   const
virtual
Writes the object to the DWG filer.
Parameters
[in] | dwgFiler | the filer instance which is used for filing
Returns
Acad::eOk for success, error code otherwise
Reimplemented from AcDbEntity.
◆ dxfInFields()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbMLeader::dxfInFields  |  ( |  AcDbDxfFiler *  |  dxfFiler | )
virtual
Reads the object from the DXF filer.
Parameters
[in] | dxfFiler | the filer instance which is used for filing
Returns
Acad::eOk for success, error code otherwise
Reimplemented from AcDbEntity.
◆ dxfOutFields()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbMLeader::dxfOutFields  |  ( |  AcDbDxfFiler *  |  dxfFiler | ) |   const
virtual
Writes the object to the DXF filer.
Parameters
[in] | dxfFiler | the filer instance which is used for filing
Returns
Acad::eOk for success, error code otherwise
Reimplemented from AcDbEntity.
◆ enableAnnotationScale()
 UX_EXPORT_FUNCTION bool AcDbMLeader::enableAnnotationScale  |  ( |   | ) |   const
Returns whether annotation scale is enabled for the MLeader entity.
Returns
true/false indication whether annotation scale is enabled
◆ enableDogleg()
 UX_EXPORT_FUNCTION bool AcDbMLeader::enableDogleg  |  ( |   | ) |   const
Returns whether the dog-leg style for this AcDbMLeader object is enabled.
Returns
true or false for enabled resp. disabled dogleg
◆ enableFrameText()
 UX_EXPORT_FUNCTION bool AcDbMLeader::enableFrameText  |  ( |   | ) |   const
Returns whether the text frame for this AcDbMLeader object is shown or not.
Returns
true or false, indicating whether the text frame is shown
◆ enableLanding()
 UX_EXPORT_FUNCTION bool AcDbMLeader::enableLanding  |  ( |   | ) |   const
Returns whether the landing is enabled for leader lines of this AcDbMLeader object.
Returns
true/false indicating whether landing gap
◆ getArrowSize()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbMLeader::getArrowSize  |  ( |  int  |  leaderLineIdx,
|  double &  |  arrowSize
) |   |  const
Returns the arrow size for leaderline specified by its index.
Parameters
[in] | leaderLineIdx | the index of the leaderline
[out] | arrowSize | the arrow size for the leaderline
Returns
Acad::eOk for success, error status otherwise
◆ getArrowSymbolId()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbMLeader::getArrowSymbolId  |  ( |  int  |  leaderLineIdx,
|  AcDbObjectId &  |  arrowId
) |   |  const
Returns the arrow symbol id for leaderline specified by its index.
Parameters
[in] | leaderLineIdx | the index of the leaderline
[out] | arrowId | AcDbObjectId default arrow symbol id
Returns
Acad::eOk for success, error status otherwise
◆ getBlockPosition()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbMLeader::getBlockPosition  |  ( |  AcGePoint3d &  |  blockPos | ) |   const
Gets the current block position for this MLeader entity.
Parameters
[out] | blockPos | block position
Returns
Acad::eOk for success, error codes otherwise
◆ getDoglegDirection()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbMLeader::getDoglegDirection  |  ( |  int  |  leaderIdx,
|  AcGeVector3d &  |  dirVec
) |   |  const
Returns the dog-leg direction for the specified leader cluster.
Parameters
[in] | leaderLineIdx | the index of the leaderline
[out] | dirVec | the dogleg direction vector
Returns
Acad::eOk for success, error status otherwise
◆ getFirstVertex()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbMLeader::getFirstVertex  |  ( |  int  |  leaderLineIdx,
|  AcGePoint3d &  |  pt
) |   |  const
Retrieves the first vertex for specified leaderline index for this AcDbMLeader object.
Parameters
[in] | leaderLineIdx | index of leaderline
[out] | pt | the first vertex
Returns
Acad::eOk for success, error code otherwise
◆ getLastVertex()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbMLeader::getLastVertex  |  ( |  int  |  leaderLineIdx,
|  AcGePoint3d &  |  pt
) |   |  const
Retrieves the first vertex for specified leaderline index for this AcDbMLeader object.
Parameters
[in] | leaderLineIdx | index of leaderline
[out] | pt | the first vertex
Returns
Acad::eOk for success, error code otherwise
◆ getLeaderIndex()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbMLeader::getLeaderIndex  |  ( |  int  |  leaderLineIdx,
|  int &  |  leaderIdx
) |   |  const
Retrieves the leader index for specified leaderline index for this AcDbMLeader object.
Parameters
[in] | leaderLineIdx | index of leaderline
[out] | leaderIdx | the leader index for the leaderline specified by leaderIdx
Returns
Acad::eOk for success, error code otherwise
◆ getLeaderLineType()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbMLeader::getLeaderLineType  |  ( |  int  |  leaderIndex,
|  AcDbMLeaderStyle::LeaderType &  |  leaderType
) |   |  const
Returns the leader line type for the leader with specified index.
Parameters
[in] | leaderIndex | - the leader index to set the specific leader line type
[out] | leaderType | - the leader type to assign
Returns
Acad::eOk if successful, error code otherwise
◆ getTextLocation()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbMLeader::getTextLocation  |  ( |  AcGePoint3d &  |  pt | ) |   const
Retrieves the text location for this AcDbMLeader object.
Parameters
[out] | pt | the text location point
Returns
Acad::eOk for success, error code otherwise
◆ getVertex()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbMLeader::getVertex  |  ( |  int  |  leaderLineIdx,
|  int  |  pointIndex,
|  AcGePoint3d &  |  pt
) |   |  const
Retrieves the vertex for specified leaderline index at given point index for this AcDbMLeader object.
Parameters
[in] | leaderLineIdx | index of leaderline
[in] | pointIndex | index of point to retrieve
[out] | pt | the first vertex
Returns
Acad::eOk for success, error code otherwise
◆ isOverride()
 UX_EXPORT_FUNCTION bool AcDbMLeader::isOverride  |  ( |  PropertyOverrideType  |  propertyType | ) |   const
Indicates if the property type of mleader has been overridden.
Parameters
[in] | propertyType | input property type
Returns
true if property has been overridden, false otherwise
◆ landingGap()
 UX_EXPORT_FUNCTION double AcDbMLeader::landingGap  |  ( |   | ) |   const
Returns the landing gap for this AcDbMLeader object.
Returns
double the landing gap value
◆ leaderLineColor()
 UX_EXPORT_FUNCTION AcCmColor AcDbMLeader::leaderLineColor  |  ( |   | ) |   const
Gets the color of the leader line.
Returns
leader line color
◆ leaderLineType()
 UX_EXPORT_FUNCTION AcDbMLeaderStyle::LeaderType AcDbMLeader::leaderLineType  |  ( |   | ) |   const
Returns the leader type of this MLeader entity.
Returns
LeaderType leader type
◆ modified()
 UX_EXPORT_FUNCTION void AcDbMLeader::modified  |  ( |  const AcDbObject *  |  pObject | )
virtual
Notification when the object @pObject was modified (persistent reactor notification)
Parameters
[in] | pObject | the object which was closed
Reimplemented from AcDbObject.
◆ moveMLeader()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbMLeader::moveMLeader  |  ( |  const AcGeVector3d &  |  vec,
|  AcDbMLeader::MoveType  |  moveType,
|  bool  |  bAutoSwitchDogleg = true
)
Move the mleader entity in the direction and distance specified by input vector.
Parameters
[in] | input | vector used for moving mleader
[in] | moveType | shows which parts of mleader will be moved
[in] | bAutoSwitchDogleg | enable auto switch of leader lines
Returns
Acad::eOk for success, error code otherwise
◆ mtext()
 UX_EXPORT_FUNCTION AcDbMText * AcDbMLeader::mtext  |  ( |   | ) |   const
Retrieves the MTEXT content for this AcDbMLeader object.
Returns
AcDbMText* object clone, or NULL if no MText content is assigned
◆ normal()
 UX_EXPORT_FUNCTION AcGeVector3d AcDbMLeader::normal  |  ( |   | ) |   const
Returns the normal vector of this MLeader entity (plane's normal).
Returns
AcGeVector3d normal vector of this MLeader
◆ numLeaderLines()
 UX_EXPORT_FUNCTION int AcDbMLeader::numLeaderLines  |  ( |   | ) |   const
Returns the number of all leaderlines for this AcDbMLeader object.
Returns
int total number of leaderlines
◆ numLeaders()
 UX_EXPORT_FUNCTION int AcDbMLeader::numLeaders  |  ( |   | ) |   const
Returns the number of leader clusters for this AcDbMLeader object.
Returns
int number of leader clusters
◆ numVertices()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbMLeader::numVertices  |  ( |  int  |  leaderLineIdx,
|  int &  |  numVertices
) |   |  const
Retrieves the number of vertices for specified leaderline index for this AcDbMLeader object.
Parameters
[in] | leaderLineIdx | index of leaderline
[out] | numVertices | number of vertices of specified leaderline
Returns
Acad::eOk for success, error code otherwise
◆ objectClosed()
 UX_EXPORT_FUNCTION void AcDbMLeader::objectClosed  |  ( |  const AcDbObjectId &  |  id | )
virtual
Notification when the object @id was closed (persistent reactor notification)
Parameters
[in] | id | the object which was closed
◆ plane()
 UX_EXPORT_FUNCTION AcGePlane AcDbMLeader::plane  |  ( |   | ) |   const
Returns the plane of this MLeader entity.
Returns
AcGePlane plane of this MLeader
◆ postMLeaderToDb()
 Acad::ErrorStatus AcDbMLeader::postMLeaderToDb  |  ( |  AcDbDatabase *  |  pTargetDbb | )
Saves this MLeader entity to the specified database.
Parameters
[in] | pTargetDbb | database to store this style
Returns
Acad::eOk for success, error codes otherwise
◆ setArrowSize() [1/2]
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbMLeader::setArrowSize  |  ( |  double  |  arrowSize | )
Sets the default arrow size for this AcDbMLeader object.
Parameters
[in] | arrowSize | the default arrow size
Returns
Acad::eOk for success, error status otherwise
◆ setArrowSize() [2/2]
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbMLeader::setArrowSize  |  ( |  int  |  leaderLineIdx,
|  double  |  arrowSize
)
Sets the arrow size for the specified leaderline.
Parameters
[in] | leaderLineIdx | the leaderline to set the arrow size for
[in] | arrowSize | the arrow size for specified leaderline
Returns
Acad::eOk for success, error status otherwise
◆ setArrowSymbolId() [1/2]
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbMLeader::setArrowSymbolId  |  ( |  const AcDbObjectId &  |  arrowId | )
Sets the default arrow symbol id for this AcDbMLeader object.
Parameters
[in] | arrowId | id of the arrow symbol
Returns
Acad::eOk for success, error status otherwise
◆ setArrowSymbolId() [2/2]
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbMLeader::setArrowSymbolId  |  ( |  int  |  leaderLineIdx,
|  const AcDbObjectId &  |  arrowId
)
Sets the arrow symbol id for leaderline specified by its index.
Parameters
[in] | leaderLineIdx | the index of the leaderline
[in] | arrowId | id of the arrow symbol
Returns
Acad::eOk for success, error status otherwise
◆ setBlockColor()
 Acad::ErrorStatus AcDbMLeader::setBlockColor  |  ( |  const AcCmColor &  |  color | )
Sets the block color of this AcDbMLeader object.
Parameters
[in] | color | of block content
Returns
Acad::eOk for success, or error status otherwise
◆ setBlockConnectionType()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbMLeader::setBlockConnectionType  |  ( |  AcDbMLeaderStyle::BlockConnectionType  |  connectType | )
Sets the Block connection type for this AcDbMLeader object.
Parameters
[in] | connectType | the AcDbMLeaderStyle::BlockConnectionType to be used for Block content
Returns
Acad::eOk for success, or error status otherwise
◆ setBlockContentId()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbMLeader::setBlockContentId  |  ( |  const AcDbObjectId &  |  idContent | )
Sets the Block content for this AcDbMLeader object.
Parameters
[in] | idContent | the AcDbObjectId to be used as Block content
Returns
Acad::eOk for success, or error status otherwise
◆ setBlockPosition()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbMLeader::setBlockPosition  |  ( |  const AcGePoint3d &  |  blockPos | )
Sets the block position for this AcDbMLeader object to specified point.
Parameters
[in] | blockPos | block position
Returns
Acad::eOk for success, error code otherwise
◆ setBlockRotation()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbMLeader::setBlockRotation  |  ( |  double  |  ang | )
Sets the Block content rotation angle for this AcDbMLeader object.
Parameters
[in] | ang | is the angle to use as rotation angle
Returns
Acad::eOk for success, or error status otherwise
◆ setContentType()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbMLeader::setContentType  |  ( |  AcDbMLeaderStyle::ContentType  |  type | )
Sets the content type for this AcDbMLeader object.
Parameters
[in] | type | AcDbMLeaderStyle::ContentType content type
Returns
Acad::eOk for success, or error status otherwise
Note
Tolerance content type is not yet supported
◆ setDoglegDirection()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbMLeader::setDoglegDirection  |  ( |  int  |  leaderIdx,
|  const AcGeVector3d &  |  dirVec
)
Sets the dog-leg direction for the specified leader cluster.
Parameters
[in] | leaderLineIdx | the index of the leaderline
[in] | dirVec | the dogleg direction vector
Returns
Acad::eOk for success, error status otherwise
◆ setDoglegLength() [1/2]
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbMLeader::setDoglegLength  |  ( |  double  |  dLegLength | )
Sets the dog-leg length for all clusters of this AcDbMLeader object.
Parameters
[in] | dLegLength | the dogleg length
Returns
Acad::eOk for success, error status otherwise
◆ setDoglegLength() [2/2]
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbMLeader::setDoglegLength  |  ( |  int  |  leaderIdx,
|  double  |  dLegLength
)
Sets the dog-leg length for the specified leaderline of this AcDbMLeader object.
Parameters
[in] | leaderLineIdx | the index of the leaderline
[in] | dLegLength | the dogleg length
Returns
Acad::eOk for success, error status otherwise
◆ setEnableAnnotationScale()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbMLeader::setEnableAnnotationScale  |  ( |  bool  |  enable | )
Sets whether annotation scale is enabled for the MLeader entity or not.
Parameters
[in] | angleType | - the mtext content angle type
Returns
Acad::eOk if successfully assigned, error code otherwise
◆ setEnableDogleg()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbMLeader::setEnableDogleg  |  ( |  bool  |  doglegEnabled | )
Sets the dog-leg style for this AcDbMLeader object.
Parameters
[in] | doglegEnabled | true or false to enable resp. disable the dogleg
Returns
Acad::eOk for success, error status otherwise
◆ setEnableFrameText()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbMLeader::setEnableFrameText  |  ( |  bool  |  showFrame | )
Enables or disables the text frame for this AcDbMLeader object.
Parameters
[in] | showFrame | show or hide the text frame
Returns
Acad::eOk for success, or error status otherwise
◆ setEnableLanding()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbMLeader::setEnableLanding  |  ( |  bool  |  useLandingGap | )
Sets whether the landing is enabled for leader lines of this AcDbMLeader object.
Parameters
[in] | useLandingGap | true/false to indicate whether landing is used
Returns
Acad::eOk for success, or error status otherwise
◆ setFirstVertex()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbMLeader::setFirstVertex  |  ( |  int  |  leaderLineIdx,
|  const AcGePoint3d &  |  pnt
)
Sets the first vertex for specified leaderline index for this AcDbMLeader object.
Parameters
[in] | leaderLineIdx | index of leaderline
[in] | pnt | the first vertex
Returns
Acad::eOk for success, error code otherwise
◆ setLandingGap()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbMLeader::setLandingGap  |  ( |  double  |  gapValue | )
Sets the landing gap value for this AcDbMLeader object.
Parameters
[in] | gapValue | specifies the landing gap
Returns
Acad::eOk for success, or error status otherwise
◆ setLastVertex()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbMLeader::setLastVertex  |  ( |  int  |  leaderLineIdx,
|  const AcGePoint3d &  |  pnt
)
Sets the last vertex for specified leaderline index for this AcDbMLeader object.
Parameters
[in] | leaderLineIdx | index of leaderline
[in] | pnt | the last vertex
Returns
Acad::eOk for success, error code otherwise
◆ setLeaderLineColor()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbMLeader::setLeaderLineColor  |  ( |  const AcCmColor &  |  color | )
Sets the color of the leader line.
Parameters
[in] | color | leader line color
Returns
Acad::eOk for success, or error status otherwise
◆ setLeaderLineType() [1/2]
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbMLeader::setLeaderLineType  |  ( |  AcDbMLeaderStyle::LeaderType  |  type | )
Sets the leader type for this AcDbMLeader object to specified point.
Parameters
[in] | type | leader type
Returns
Acad::eOk for success, error code otherwise
◆ setLeaderLineType() [2/2]
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbMLeader::setLeaderLineType  |  ( |  int  |  leaderIndex,
|  AcDbMLeaderStyle::LeaderType  |  leaderType
)
Sets the specific leader line type for the leader with specified index.
Parameters
[in] | leaderIndex | - the leader index to set the specific leader line type
[in] | leaderType | - the leader type to assign
Returns
Acad::eOk if successful, error code otherwise
◆ setMText()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbMLeader::setMText  |  ( |  const AcDbMText *  |  mtext | )
Sets the MTEXT content for this AcDbMLeader object to specified AcDbMText.
Parameters
[in] | mtext | the AcDbMText object (can be NDBRO), properties are copied to internal AcDbMText object
Returns
Acad::eOk for success, error code otherwise
◆ setOverride()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbMLeader::setOverride  |  ( |  PropertyOverrideType  |  propertyType,
|  bool  |  enable = true
)
Sets the override flag for mleader entity.
Parameters
[in] | propertyType | - property type
Returns
Acad::eOk if successfully, error code otherwise
◆ setPlane()
 UX_EXPORT_FUNCTION void AcDbMLeader::setPlane  |  ( |  const AcGePlane &  |  plane | )
Assigns the plane for this MLeader entity.
Parameters
[in] | plane | - the new plane to be assigned to this MLeader
Returns
void
◆ setTextAlignmentType()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbMLeader::setTextAlignmentType  |  ( |  AcDbMLeaderStyle::TextAlignmentType  |  alignment | )
Sets the MText alignment type for this AcDbMLeader object.
Parameters
[in] | alignment | the AcDbMLeaderStyle::TextAlignmentType to be used for MText
Returns
Acad::eOk for success, or error status otherwise
◆ setTextAngleType()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbMLeader::setTextAngleType  |  ( |  AcDbMLeaderStyle::TextAngleType  |  angleType | )
Sets the MText content angle type.
Parameters
[in] | angleType | - the mtext content angle type
Returns
Acad::eOk if successful, error code otherwise
◆ setTextAttachmentDirection()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbMLeader::setTextAttachmentDirection  |  ( |  AcDbMLeaderStyle::TextAttachmentDirection  |  textAttachDir | )
Sets the MText attachment direction value for this AcDbMLeader object.
Parameters
[in] | textAttachDir | the AcDbMLeaderStyle::TextAttachmentDirection to be used for MText
Returns
Acad::eOk for success, or error status otherwise
◆ setTextAttachmentType() [1/2]
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbMLeader::setTextAttachmentType  |  ( |  AcDbMLeaderStyle::TextAttachmentType  |  attachmentType | )
Sets the MText attachment type for this AcDbMLeader object.
Parameters
[in] | attachmentType | specifies the attachment type
Returns
Acad::eOk for success, error status otherwise
◆ setTextAttachmentType() [2/2]
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbMLeader::setTextAttachmentType  |  ( |  AcDbMLeaderStyle::TextAttachmentType  |  attachmentType,
|  AcDbMLeaderStyle::LeaderDirectionType  |  directionType
)
Sets the MText attachment type for the specified leader direction type.
Parameters
[in] | attachmentType | specifies the attachment type
[in] | directionType | specifies the leader direction type
Returns
Acad::eOk for success, error status otherwise
◆ setTextColor()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbMLeader::setTextColor  |  ( |  const AcCmColor &  |  color | )
Sets the color of the text.
Parameters
[in] | color | text color
Returns
Acad::eOk for success, or error status otherwise
◆ setTextHeight()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbMLeader::setTextHeight  |  ( |  double  |  height | )
Sets the height of the text.
Parameters
[in] | height | text height
Returns
Acad::eOk for success, or error status otherwise
◆ setTextLocation()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbMLeader::setTextLocation  |  ( |  const AcGePoint3d &  |  pt | )
Sets the text location for this AcDbMLeader object to specified point.
Parameters
[in] | pt | the text location point
Returns
Acad::eOk for success, error code otherwise
◆ setTextStyleId()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbMLeader::setTextStyleId  |  ( |  const AcDbObjectId &  |  textStyleId | )
Sets the mtext content of mleader with the specified text style id.
Parameters
[in] | textStyleId | the AcDbObjectId to be used by mtext content
Returns
Acad::eOk for success, or error status otherwise
◆ subClose()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbMLeader::subClose  |  ( |   | )
virtual
Notification when this object is to be closed.
Returns
overriding client code can return Acad::eOk to continue close() operation, any error code will cancel the actual close() operation
Reimplemented from AcDbObject.
◆ subErase()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbMLeader::subErase  |  ( |  Adesk::Boolean  |  bErase | )
virtual
Notification when this object is to be erased.
Parameters
[in] | bErase | signals wheter an *erase' or 'unerase' operation is performed
Returns
overriding client code can return Acad::eOk to continue erase() operation, any error code will cancel the actual erase() operation
Reimplemented from AcDbObject.
◆ textAlignmentType()
 UX_EXPORT_FUNCTION AcDbMLeaderStyle::TextAlignmentType AcDbMLeader::textAlignmentType  |  ( |   | ) |   const
Returns the MText alignment type for this AcDbMLeader object.
Returns
the AcDbMLeaderStyle::TextAlignmentType used
◆ textAngleType()
 UX_EXPORT_FUNCTION AcDbMLeaderStyle::TextAngleType AcDbMLeader::textAngleType  |  ( |   | ) |   const
Returns the MText content angle type.
Returns
mtext content text angle type
◆ textAttachmentDirection()
 UX_EXPORT_FUNCTION AcDbMLeaderStyle::TextAttachmentDirection AcDbMLeader::textAttachmentDirection  |  ( |   | ) |   const
Returns the MText attachment direction value for this AcDbMLeader object.
Returns
the AcDbMLeaderStyle::TextAttachmentDirection to be used for MText
◆ textAttachmentType() [1/2]
 UX_EXPORT_FUNCTION AcDbMLeaderStyle::TextAttachmentType AcDbMLeader::textAttachmentType  |  ( |   | ) |   const
Returns the MText attachment type for this AcDbMLeader object.
Returns
AcDbMLeaderStyle::TextAttachmentType
◆ textAttachmentType() [2/2]
 UX_EXPORT_FUNCTION AcDbMLeaderStyle::TextAttachmentType AcDbMLeader::textAttachmentType  |  ( |  AcDbMLeaderStyle::LeaderDirectionType  |  directionType | ) |   const
Returns the MText attachment type for the specified leader direction type.
Parameters
[in] | directionType | specifies the leader direction type
Returns
AcDbMLeaderStyle::TextAttachmentType
◆ textColor()
 UX_EXPORT_FUNCTION AcCmColor AcDbMLeader::textColor  |  ( |   | ) |   const
Gets the color of the text.
Returns
text color
◆ textHeight()
 UX_EXPORT_FUNCTION double AcDbMLeader::textHeight  |  ( |   | ) |   const
Gets the text height.
Returns
text height
◆ textStyleId()
 UX_EXPORT_FUNCTION AcDbObjectId AcDbMLeader::textStyleId  |  ( |   | ) |   const
Returns the text style id used by mtext content of mleader.
Returns
text style id of mtext content