Public Member Functions | List of all members
AcDbAnnotativeObjectPE Class Referenceabstract
_ More...
#include <AcDbAnnotativeObjectPE.h>
 Public Member Functions
virtual bool  | annotative (AcDbObject *) const =0
This function determines, whether the object is an annotative object. More...
virtual bool  | forceAnnoAllVisible (AcDbObject *) const
Returns true if the object shall be visible regardless of annotation scales (see ANNOALLVISIBLE). More...
virtual Acad::ErrorStatus  | resetScaleDependentProperties (AcDbObject *)
This function is called by the CAD system to notify the object to reset all annotation scale dependent properties to default value. More...
virtual Acad::ErrorStatus  | setAnnotative (AcDbObject *, const bool)=0
This function sets the object to be an annotative object. More...
virtual Acad::ErrorStatus  | setForceAnnoAllVisible (AcDbObject *, bool) const
Returns true if the object shall be visible regardless of annotation scales (see ANNOALLVISIBLE). More...
virtual Acad::ErrorStatus  | setFromStyle (AcDbObject *, bool &)=0
This function notifies the object to update its own annotative properties from an associated style. More...
 Public Member Functions inherited from AcRxObject
virtual AcRxObject *  | clone () const
Exported and implemented. More...
 virtual AcRx::Ordering  | comparedTo (const AcRxObject *) const
Exported and implemented.
virtual Acad::ErrorStatus  | copyFrom (const AcRxObject *)
Exported and implemented. More...
 virtual AcRxClass *  | isA () const
Exported and implemented.
virtual Adesk::Boolean  | isEqualTo (const AcRxObject *) const
Exported and implemented. More...
bool  | isKindOf (const AcRxClass *) const
Checks the object class. More...
AcRxObject *  | queryX (const AcRxClass *) const
returns the protocol extension object assigned to this class or a parent class. More...
AcRxObject *  | x (const AcRxClass *) const
returns the protocol extension object assigned to this class or a parent class. More...
 virtual  | ~AcRxObject ()
Destructor.
 Additional Inherited Members
 Static Public Member Functions inherited from AcRxObject
 static AcRxObject *  | cast (const AcRxObject *)
 static AcRxClass *  | desc ()
Exported and implemented.
 Protected Member Functions inherited from AcRxObject
AcRxObject ()
Exported and implemented.
Detailed Description
_
Member Function Documentation
◆ annotative()
 UX_EXPORT_FUNCTION bool AcDbAnnotativeObjectPE::annotative  |  ( |  AcDbObject *  |  pObject | ) |   const
pure virtual
This function determines, whether the object is an annotative object.
Parameters
[in] | pObject | the object to be queried
Returns
true, if the object is annotative
◆ forceAnnoAllVisible()
 UX_EXPORT_FUNCTION bool AcDbAnnotativeObjectPE::forceAnnoAllVisible  |  ( |  AcDbObject *  |  pObject | ) |   const
virtual
Returns true if the object shall be visible regardless of annotation scales (see ANNOALLVISIBLE).
Parameters
[in] | pObject | the object to be queried
Returns
true, if the object overrides ANNOALLVISIBLE setting
◆ resetScaleDependentProperties()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbAnnotativeObjectPE::resetScaleDependentProperties  |  ( |  AcDbObject *  |  pObject | )
virtual
This function is called by the CAD system to notify the object to reset all annotation scale dependent properties to default value.
Parameters
[in] | pObject | the object to set the visibility override to
Returns
Acad::eOk if successfull, error status otherwise
◆ setAnnotative()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbAnnotativeObjectPE::setAnnotative  |  ( |  AcDbObject *  |  pObject,
|  const bool  |  annotative
)
pure virtual
This function sets the object to be an annotative object.
Parameters
[in] | pObject | the object to be queried
[in] | annotative | true to set the object as annotative objects, false otherwise
Returns
Acad::eOk, if successful, error status otherwise
◆ setForceAnnoAllVisible()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbAnnotativeObjectPE::setForceAnnoAllVisible  |  ( |  AcDbObject *  |  pObject,
|  bool  |  force
) |   |  const
virtual
Returns true if the object shall be visible regardless of annotation scales (see ANNOALLVISIBLE).
Parameters
[in] | pObject | the object to set the visibility override to
[in] | force | - true, if the object shall be visible regardless of annotation scales (ignoring ANNOALLVISIBLE)
Returns
Acad::eOk if successfull, error status otherwise
◆ setFromStyle()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbAnnotativeObjectPE::setFromStyle  |  ( |  AcDbObject *  |  pObject,
|  bool &  |  isUpdated
)
pure virtual
This function notifies the object to update its own annotative properties from an associated style.
Parameters
[in] | pObject | the object to be updated from a style
[out] | isUpdated | set as true, if the object was properly updated (or not style depending)
Returns
Acad::eOk, if successful, error status otherwise