Public Member Functions | Static Public Member Functions | List of all members
AcDbAssocVariable Class Reference
 Public Member Functions
 AcDbAssocVariable  | AcDbAssocVariable ()
Default constructor.
const AcString &  | description () const
Returns the variable description as an arbitrary string. More...
Acad::ErrorStatus  | evaluateExpression (AcDbEvalVariant &, AcString &=dummyString()) const
Evaluates the expression. More...
Acad::ErrorStatus  | evaluateExpression (AcDbObjectIdArray &, AcArray< AcDbEvalVariant > &, AcDbEvalVariant &, AcString &=dummyString()) const
Evaluates the expression. More...
const AcString &  | expression () const
Returns the expression as an arbitrary string or an empty string if the variable is a constant. More...
 const AcString &  | expression (bool) const
AcDbObjectId  | findObjectByName (const AcString &, const AcRxClass *) const
Searches the object using its name and returns an object ID if the object is found or kNull if the object is not found. More...
bool  | isAnonymous () const
Returns true if the variable name is empty or starts from *. More...
bool  | isMergeable () const
For internal use. More...
 AcString  | mergeableVariableName () const
For internal use.
bool  | mustMerge () const
For internal use. More...
const AcString &  | name () const
Returns the name of the variable an arbitrary string. More...
Acad::ErrorStatus  | setDescription (const AcString &)
Sets the description for this variable as a string value. More...
Acad::ErrorStatus  | setEvaluatorId (const AcString &)
Sets the given ID of the expression evaluator to be used for parsing the expression. More...
Acad::ErrorStatus  | setExpression (const AcString &, const AcString &, bool, bool, AcString &=dummyString(), bool=false)
Sets the expression as a string and syntactically checks it. More...
void  | setIsMergeable (bool, bool=false, const AcString &=AcString())
For internal use. More...
Acad::ErrorStatus  | setName (const AcString &, bool)
Sets the name for this variable using a given string. More...
Acad::ErrorStatus  | setValue (const AcDbEvalVariant &)
Sets the evaluated value. More...
Acad::ErrorStatus  | validateNameAndExpression (const AcString &, const AcString &, AcString &) const
Validates the given name, expression or both, to check whether they can be used for this variable. More...
const AcDbEvalVariant &  | value () const
Returns the evaluated value of the variable. More...
 Public Member Functions inherited from AcDbAssocAction
 AcDbAssocAction  | AcDbAssocAction ()
Default constructor.
AcDbObjectId  | actionBody () const
Returns an object ID of the owned action instance. More...
 Acad::ErrorStatus  | addDependency (AcRxClass *, AcRxClass *, bool, bool, int, AcDbObjectId &)
Acad::ErrorStatus  | addDependency (const AcDbObjectId &, bool=true)
Adds a dependency for this action. More...
Acad::ErrorStatus  | addMoreObjectsToDeepClone (AcDbIdMapping &, AcDbObjectIdArray &) const
Tells to action being cloned to specify related objects that should be cloned because this action is cloned. More...
Acad::ErrorStatus  | addParam (const AcDbObjectId &, int &)
Adds a new action parameter. More...
Acad::ErrorStatus  | addParam (const AcString &, AcRxClass *, AcDbObjectId &, int &)
Creates and adds a new action parameter. More...
 bool  | areDependenciesEqual (const AcDbAssocDependency *, const AcDbAssocDependency *) const
 bool  | areDependenciesOnTheSameThing (const AcDbAssocDependency *, const AcDbAssocDependency *) const
AcDbAssocEvaluationCallback *  | currentEvaluationCallback () const
Returns the current association evaluation callback set instance, or NULL if no action evaluation is in progress. More...
void  | dependentObjectCloned (const AcDbAssocDependency *, const AcDbObject *, const AcDbObject *)
Dependency notifies the owning action when dependent-on object has been cloned. More...
 void  | dragStatus (const AcDb::DragStat)
void  | evaluate (AcDbAssocEvaluationCallback *)
Evaluates this action. More...
Acad::ErrorStatus  | evaluateDependencies ()
This should be called from the client code evaluateOverride() method, after the dependecies were inspected from the client code. More...
void  | evaluateDependency (AcDbAssocDependency *)
Allows the owning action, instead of the dependency itself, to be performed. More...
AcDbAssocEvaluationPriority  | evaluationPriority () const
Returns the evaluation priority of this action. More...
Acad::ErrorStatus  | getDependencies (bool, bool, AcDbObjectIdArray &) const
Gets the dependencies of this action. More...
void  | getDependentActionsToEvaluate (AcDbActionsToEvaluateCallback *) const
Allows the action report on all other actions that need to be evaluated. More...
Acad::ErrorStatus  | getDependentObjects (bool, bool, AcDbObjectIdArray &) const
Gets an array of objects which this action depends on or modifies. More...
Acad::ErrorStatus  | getValueParam (const AcString &, AcDbEvalVariant &, AcString &, AcString &, int=0) const
Gets a value, expression and evaluatorIds of a given value action parameter. More...
 Acad::ErrorStatus  | getValueParamArray (const AcString &, AcArray< AcDbEvalVariant > &, AcArray< AcString > &, AcArray< AcString > &) const
 bool  | hasDependencyCachedValue (const AcDbAssocDependency *) const
bool  | isActionBodyAProxy () const
Returns true if action body is loaded as a proxy object. More...
bool  | isActionEvaluationInProgress () const
Checks whether the system is evaluating an action or a network of actions. More...
bool  | isEqualTo (const AcDbAssocAction *) const
Compares this action with the given action. More...
 bool  | isExternalDependency (const AcDbAssocDependency *) const
 bool  | isOwnedDependency (const AcDbAssocDependency *) const
 bool  | isRelevantDependencyChange (const AcDbAssocDependency *) const
 Acad::ErrorStatus  | notification (AcDbAssocNotificationData *)
AcDbObjectId  | objectThatOwnsNetworkInstance () const
Returns an ID of the object that owns the network that owns this action. More...
 Acad::ErrorStatus  | ownedDependencyStatusChanged (AcDbAssocDependency *, AcDbAssocStatus)
const AcDbObjectIdArray &  | ownedParams () const
Returns an array of the owned action parameters. More...
void  | ownedValueParamNames (AcArray< AcString > &) const
Returns all the names of all value action parameters. More...
AcDbObjectId  | owningNetwork () const
Returns the logically owning association network, or kNull if it is the topmost. More...
AcDbObjectId  | paramAtIndex (int) const
Returns an owned action parameter specified by its index. More...
AcDbObjectId  | paramAtName (const AcString &, int=0) const
Returns an owned action parameter specified by its name and optional index for parameters with the same name. More...
const AcDbObjectIdArray &  | paramsAtName (const AcString &) const
Returns an array of object IDs of the owned action parameters with specified name. More...
Acad::ErrorStatus  | postProcessAfterDeepClone (AcDbIdMapping &)
Informs the source actions of the cloning object so that they can update the clones or do other action if it is necessary. More...
Acad::ErrorStatus  | postProcessAfterDeepCloneCancel (AcDbIdMapping &)
Informs the source actions so that it can obtain its clone. More...
Acad::ErrorStatus  | removeAllDependencies (bool)
Clears all dependencies from this action. More...
Acad::ErrorStatus  | removeAllParams (bool)
Removes all owned action parameters and optionally erases them. More...
Acad::ErrorStatus  | removeDependency (const AcDbObjectId &, bool)
Removes a dependency from this action. More...
Acad::ErrorStatus  | removeParam (const AcDbObjectId &, bool)
Removes an existing action parameter and optionally erases it. More...
Acad::ErrorStatus  | removeValueParam (const AcString &)
Removes the value action parameter using its name. More...
Acad::ErrorStatus  | scaleAllDistanceValueParams (double)
Scales the values of all value action parameters whose units indicate represent distances. More...
Acad::ErrorStatus  | setActionBody (const AcDbObjectId &)
Sets the owned action instance using an object ID. More...
Acad::ErrorStatus  | setOwningNetwork (const AcDbObjectId &, bool)
Sets the logically owning association network. More...
Acad::ErrorStatus  | setStatus (AcDbAssocStatus, bool=true, bool=false)
Sets the status for this action. More...
Acad::ErrorStatus  | setValueParam (const AcString &, const AcDbEvalVariant &, const AcString &, const AcString &, AcString &, bool, int=0)
Sets a value, expression and evaluatorIds for a given value action parameter. More...
 Acad::ErrorStatus  | setValueParamArray (const AcString &, const AcArray< AcDbEvalVariant > &, const AcArray< AcString > &, const AcArray< AcString > &, AcArray< AcString > &, bool)
Acad::ErrorStatus  | setValueParamControlledObjectDep (const AcString &, const AcDbObjectId &)
The value action parameter can store an object ID of an "output" dependency on an associated object. More...
Acad::ErrorStatus  | setValueParamUnitType (const AcString &, AcValue::UnitType)
Sets the unit type for a given value action parameter. More...
AcDbAssocStatus  | status () const
Returns the current status of this action. More...
Acad::ErrorStatus  | transformActionBy (const AcGeMatrix3d &)
Notifies the action that its owner is transformed. More...
Acad::ErrorStatus  | transformAllConstantGeometryParams (const AcGeMatrix3d &)
Applies the transformation matrix to all constant geometries in all owned associated parameters. More...
Acad::ErrorStatus  | updateAllObjectsControlledByValueParams () const
Updates the named properties of all objects linked with this value action parameters. More...
Acad::ErrorStatus  | updateValueParamControlledObject (const AcString &) const
Updates the "property" of the associated object from the current value of a value action parameter. More...
Acad::ErrorStatus  | updateValueParamFromControlledObject (const AcString &)
Updates the value action parameter from the current value of a named "property" of the associated object. More...
Acad::ErrorStatus  | valueParamInputVariables (const AcString &, AcDbObjectIdArray &) const
Each value action parameter may either be defined by a constant, or an expression. More...
AcValue::UnitType  | valueParamUnitType (const AcString &) const
Returns the unit type of a given value action parameter. More...
 Public Member Functions inherited from AcDbObject
virtual void  | addPersistentReactor (AcDbObjectId)
Adds a persistent reactor to this object reactor list. More...
void  | addReactor (AcDbObjectReactor *) const
Adds a transient reactor to this object. More...
virtual Acad::ErrorStatus  | applyPartialUndo (AcDbDwgFiler *, AcRxClass *)
This function is called during Undo operations on objects, that use the 'Partial Undo meachanism'; this is, this object is opened with assertWriteEnabled(Adesk::kFalse) to indicate that custom Undo filing is used rather than the default Undo filing. More...
 void  | assertNotifyEnabled () const
 void  | assertReadEnabled () const
 void  | assertWriteEnabled (Adesk::Boolean=Adesk::kTrue, Adesk::Boolean=Adesk::kTrue)
virtual Acad::ErrorStatus  | audit (AcDbAuditInfo *)
Performs the audit operation for this object. More...
Acad::ErrorStatus  | cancel ()
Reverts all changes since the object had been opened and closes the object. More...
virtual void  | cancelled (const AcDbObject *)
A handler function for persistent reactors. More...
virtual AcRxObject *  | clone () const
Creates a shallow clone of this object. More...
Acad::ErrorStatus  | close ()
Closes the object. More...
Acad::ErrorStatus  | closeAndPage (Adesk::Boolean=Adesk::kTrue)
Closes the object. More...
virtual Acad::ErrorStatus  | composeForLoad (AcDb::OdaSaveType, AcDb::AcDbDwgVersion)
This function is intended for future MT file loading support. More...
virtual void  | copied (const AcDbObject *, const AcDbObject *)
A handler function for persistent reactors. More...
virtual Acad::ErrorStatus  | copyFrom (const AcRxObject *)
Copies the pSrc object information in this object. More...
Acad::ErrorStatus  | createExtensionDictionary ()
Creates a dictionary as extension dictionary for this object. More...
AcDbDatabase *  | database () const
Returns the database that contains this object. More...
virtual Acad::ErrorStatus  | decomposeForSave (AcDb::AcDbDwgVersion, AcDbObject *&, AcDbObjectId &, Adesk::Boolean &)
This function is called during dwg and dxf output, to allow a custom object to decompose itself, due to provided dwg/dxf target file version. More...
virtual Acad::ErrorStatus  | deepClone (AcDbObject *, AcDbObject *&, AcDbIdMapping &, Adesk::Boolean=Adesk::kTrue) const final
Clones this object, appends it to the owner pOwner and adds an AcDbIdPair record to the idMap. More...
void  | disableUndoRecording (Adesk::Boolean)
Disables or enables the undo recording for the object. More...
Acad::ErrorStatus  | downgradeOpen ()
Sets the open mode for an object opened for write to be opened for read. More...
Acad::ErrorStatus  | downgradeToNotify (Adesk::Boolean)
Sets the open mode for an object opened for write to be opened for notify. More...
virtual AcGiDrawable *  | drawable ()
Retrieves the AcGiDrawable instance of this object. More...
Acad::ErrorStatus  | dwgIn (AcDbDwgFiler *)
Calls the object's dwgInFields function, and reads any XData if present. More...
virtual Acad::ErrorStatus  | dwgInFields (AcDbDwgFiler *)
Reads the object from the DWG filer. More...
Acad::ErrorStatus  | dwgOut (AcDbDwgFiler *) const
Calls the object's dwgOutFields function, and writes any XData if present. More...
virtual Acad::ErrorStatus  | dwgOutFields (AcDbDwgFiler *) const
Writes the object to the DWG filer. More...
Acad::ErrorStatus  | dxfIn (AcDbDxfFiler *)
Calls the object's dxfInFields function, and reads any XData if present. More...
virtual Acad::ErrorStatus  | dxfInFields (AcDbDxfFiler *)
Reads the object from the DXF filer. More...
Acad::ErrorStatus  | dxfOut (AcDbDxfFiler *, Adesk::Boolean, Adesk::uchar *) const
Calls the object's dxfOutFields function, and writes any XData if present. More...
virtual Acad::ErrorStatus  | dxfOutFields (AcDbDxfFiler *) const
Writes the object to the DXF filer. More...
Acad::ErrorStatus  | erase (Adesk::Boolean=Adesk::kTrue)
Sets the bit that indicates that the object is erased. More...
virtual void  | erased (const AcDbObject *, Adesk::Boolean=Adesk::kTrue)
A handler function for persistent reactors. More...
AcDbObjectId  | extensionDictionary () const
Returns the object id of the extension dictionary for this object. More...
void  | getAcDbHandle (AcDbHandle &) const
Returns handle of this object. More...
Acad::ErrorStatus  | getBinaryData (const ACHAR *, Adesk::Int32 &, char *&) const
Creates a copy of the binary data stored as chunks of maximum 127 bytes in the resbuf chain of this object's extension dictionary xrecord entry given by entryName. More...
int  | getBrxOpenCount () const
This function returns the number of open BRX instances for this object. More...
int  | getBrxOpenState () const
This function returns the BRX object open state flags as bitfields, for diagnostic purpose. More...
virtual Acad::ErrorStatus  | getClassID (CLSID *) const final
Gets the COM wrapper Class ID for this entity. More...
int  | getCustomObjectState () const
This function returns the custom object status : 1=isCustomObject 2=DifferentialUndoDisabled. More...
Acad::ErrorStatus  | getField (const ACHAR *, AcDbField *&, AcDb::OpenMode) const
Retrieves the specified Field from this object, and opens it in mode. More...
Acad::ErrorStatus  | getField (const ACHAR *, AcDbObjectId &) const
Gets the pszPropName field object from field dictionary of this AcDbObject object, using pszPropName as key. More...
AcDbObjectId  | getFieldDictionary () const
Returns the Field dictionary associated with this object,. More...
Acad::ErrorStatus  | getFieldDictionary (AcDbDictionary *&, AcDb::OpenMode) const
Gets and opens the field dictionary for this. More...
Acad::ErrorStatus  | getObjectBirthVersion (AcDb::AcDbDwgVersion &, AcDb::MaintenanceReleaseVersion &)
This function is currently not supported by the CAD engine, always returns Acad::eOk, and 'kDHL_CURRENT' + 'kMReleaseCurrent' results. More...
virtual Acad::ErrorStatus  | getObjectSaveVersion (const AcDbDwgFiler *, AcDb::AcDbDwgVersion &, AcDb::MaintenanceReleaseVersion &)
Returns the DWG version for saving the object. More...
virtual Acad::ErrorStatus  | getObjectSaveVersion (const AcDbDxfFiler *, AcDb::AcDbDwgVersion &, AcDb::MaintenanceReleaseVersion &)
Returns the DWG version for saving the object. More...
int  | getOdaOpenCount () const
This function returns the number of open ODA instances for this object. More...
int  | getOdaOpenState () const
This function returns the ODA object open state flags as bitfields, for diagnostic purpose. More...
virtual void  | goodbye (const AcDbObject *)
A handler function for persistent reactors. More...
virtual AcGsNode *  | gsNode () const
Gets the AcGsNode (graphics cache) for this entity. More...
Acad::ErrorStatus  | handOverTo (AcDbObject *, Adesk::Boolean=Adesk::kTrue, Adesk::Boolean=Adesk::kTrue)
Hands over objects identity to another object. More...
bool  | hasFields () const
Return true if this object has single or multiple fields associated with him. More...
bool  | hasPersistentReactor (AcDbObjectId) const
Checks the input objectId in this object reactor list. More...
bool  | hasSaveVersionOverride ()
This function indicates whether this object overrides the filer's save version. More...
virtual AcDbObjectId  | id () const
Returns the database id of this object. More...
Adesk::Boolean  | isAcDbObjectIdsInFlux () const
Checks whether a deep clone operation was completed. More...
Adesk::Boolean  | isAProxy () const
Adesk::Boolean  | isCancelling () const
Adesk::Boolean  | isErased () const
Returns whether this object is erased. More...
Adesk::Boolean  | isEraseStatusToggled () const
Checks whether the object erase status has been toggled. More...
Adesk::Boolean  | isModified () const
Returns whether this object's assertWriteEnabled() has been called since it was opened. More...
Adesk::Boolean  | isModifiedGraphics () const
Checks whether this object graphics will be updated when the object is closed. More...
Adesk::Boolean  | isModifiedXData () const
Checks whether this object's xData was modified. More...
Adesk::Boolean  | isNewObject () const
Returns true if and only if this object has not been closed since it was created. More...
Adesk::Boolean  | isNotifyEnabled () const
Returns whether this object is opened for notify. More...
Adesk::Boolean  | isNotifying () const
virtual Adesk::Boolean  | isPersistent () const
Returns the 'persistent' status of a database object. More...
Adesk::Boolean  | isReadEnabled () const
Returns whether this object is opened for read. More...
 Adesk::Boolean  | isReallyClosing () const
Checks whether the next close call will completely close this object return true if on the next call the object will be completely closed false otherwise.
Adesk::Boolean  | isTransactionResident () const
Gets the object transaction status. More...
Adesk::Boolean  | isUndoing () const
bool  | isUndoRecordingDisabled () const
Returns whether the undo recording for the object is enabled or not. More...
Adesk::Boolean  | isWriteEnabled () const
Returns whether this object is opened for write. More...
virtual AcDb::DuplicateRecordCloning  | mergeStyle () const
Returns the object's merge behavior during cloning. More...
virtual void  | modified (const AcDbObject *)
A handler function for persistent reactors. More...
virtual void  | modifiedGraphics (const AcDbEntity *)
A handler function for persistent reactors. More...
virtual void  | modifiedXData (const AcDbObject *)
A handler function for persistent reactors. More...
virtual void  | modifyUndone (const AcDbObject *)
A handler function for persistent reactors. More...
virtual void  | objectClosed (const AcDbObjectId)
A handler function for persistent reactors. More...
AcDbObjectId  | objectId () const
Returns object id. More...
virtual void  | openedForModify (const AcDbObject *)
A handler function for persistent reactors. More...
AcDbObjectId  | ownerId () const
Returns object id of the owner. More...
AcDbVoidPtrArray *  | reactors ()
Gets the object pointers to reactors. More...
const AcDbVoidPtrArray *  | reactors () const
Gets the object pointers to reactors. More...
virtual void  | reappended (const AcDbObject *)
A handler function for persistent reactors. More...
 virtual void  | recvPropagateModify (const AcDbObject *)
Not implemented yet.
Acad::ErrorStatus  | releaseExtensionDictionary ()
Removes the extension dictionary associated with this object. More...
virtual Acad::ErrorStatus  | removeField (AcDbObjectId)
Removes the Field specified by acFieldId from this object. More...
virtual Acad::ErrorStatus  | removeField (const ACHAR *)
Removes the Field specified by szKeyString from this object. More...
virtual Acad::ErrorStatus  | removeField (const ACHAR *, AcDbObjectId &)
Removes the Field specified by acPszKeyString from this object, and returns its ObjectId value. More...
virtual Acad::ErrorStatus  | removePersistentReactor (AcDbObjectId)
Removes a persistent reactor from this object reactor list. More...
void  | removeReactor (AcDbObjectReactor *) const
Removes a transient reactor to this object. More...
void  | setAcDbObjectIdsInFlux ()
Call this function to indicate that the object IDs of this object and its sub-objects (if any) are not yet valid. More...
Acad::ErrorStatus  | setBinaryData (const ACHAR *, Adesk::Int32, const char *)
Creates a copy of the binary data, divides it in up to 127 bytes binary chunks and
 sets them as resbufs in the resbuf chain of this object's extension dictionary xrecord entry given by entryName. More...
virtual Acad::ErrorStatus  | setField (const ACHAR *, AcDbField *, AcDbObjectId &)
Adds the pAcField field object to field dictionary of this AcDbObject object, using pKey as key. More...
virtual void  | setGsNode (AcGsNode *)
Gets the AcGsNode (graphics cache) for this entity. More...
void  | setHasSaveVersionOverride (bool)
This function can be called to specify that the object has a "save version override". More...
virtual Acad::ErrorStatus  | setOwnerId (AcDbObjectId)
Sets the ownerId data member of the object to be objId. More...
virtual Acad::ErrorStatus  | setXData (const resbuf *)
Sets/removes xData associated with this object. More...
virtual Acad::ErrorStatus  | subCancel ()
Possibility to veto a cancel operation from within custom entities. More...
virtual Acad::ErrorStatus  | subClose ()
virtual Acad::ErrorStatus  | subErase (Adesk::Boolean)
This hook is called during an AcDbObject::erase call, before any actual erase operation is performed. More...
 virtual Acad::ErrorStatus  | subHandOverTo (AcDbObject *)
virtual void  | subObjModified (const AcDbObject *, const AcDbObject *)
A handler function for persistent reactors. More...
 virtual Acad::ErrorStatus  | subOpen (AcDb::OpenMode)
virtual Acad::ErrorStatus  | subSwapIdWith (AcDbObjectId, Adesk::Boolean=Adesk::kFalse, Adesk::Boolean=Adesk::kFalse)
This hook is called during an AcDbObject::swapIdWith() call, before any actual swap operation is performed. More...
Acad::ErrorStatus  | swapIdWith (AcDbObjectId, Adesk::Boolean=Adesk::kFalse, Adesk::Boolean=Adesk::kFalse)
Swaps the object id's between the object identified by param swapId and this object. More...
virtual Acad::ErrorStatus  | swapReferences (const AcDbIdMapping &)
Not implemented yet. More...
virtual void  | unappended (const AcDbObject *)
A handler function for persistent reactors. More...
AcDbDwgFiler *  | undoFiler ()
Gets the undo filer for this object. More...
Acad::ErrorStatus  | upgradeFromNotify (Adesk::Boolean &)
Upgrades the open status of this object to AcDb::kForWrite, if this object is already open (either in AcDb::kForRead, AcDb::kForNotify or AcDb::kForWrite) More...
Acad::ErrorStatus  | upgradeOpen ()
Changes the objects open mode to AcDb::kForWrite and sends notifications. More...
virtual Acad::ErrorStatus  | wblockClone (AcRxObject *, AcDbObject *&, AcDbIdMapping &, Adesk::Boolean=Adesk::kTrue) const final
Clones this object, appends it to the owner pOwner and adds an AcDbIdPair record to the idMap. More...
virtual resbuf *  | xData (const ACHAR *=NULL) const
Returns the xData associated with this object. More...
Acad::ErrorStatus  | xDataTransformBy (const AcGeMatrix3d &)
Transforms the extended data according to parameter transformation matrix. More...
 virtual void  | xmitPropagateModify () const
Not implemented yet.
 virtual  | ~AcDbObject ()
Destructor.
 Public Member Functions inherited from AcGiDrawable
virtual bool  | bounds (AcDbExtents &) const
virtual DrawableType  | drawableType () const
 virtual AcGiDrawStream *  | drawStream () const
virtual AcGsNode *  | gsNode () const =0
virtual AcDbObjectId  | id () const =0
virtual Adesk::Boolean  | isPersistent () const =0
virtual Adesk::UInt32  | regenSupportFlags () const final
Returns whether and to which level this object supports MultiThreading. More...
 virtual Adesk::Boolean  | RolloverHit (Adesk::ULongPtr, Adesk::ULongPtr, Adesk::Boolean)
 virtual Adesk::UInt32  | setAttributes (AcGiDrawableTraits *) final
 virtual void  | setDrawStream (AcGiDrawStream *)
virtual void  | setGsNode (AcGsNode *)=0
 virtual void  | viewportDraw (AcGiViewportDraw *) final
 virtual Adesk::UInt32  | viewportDrawLogicalFlags (AcGiViewportDraw *) final
 virtual Adesk::Boolean  | worldDraw (AcGiWorldDraw *) final
 Public Member Functions inherited from AcRxObject
virtual AcRxObject *  | clone () const
Exported and implemented. More...
 virtual AcRx::Ordering  | comparedTo (const AcRxObject *) const
Exported and implemented.
virtual Acad::ErrorStatus  | copyFrom (const AcRxObject *)
Exported and implemented. More...
 virtual AcRxClass *  | isA () const
Exported and implemented.
virtual Adesk::Boolean  | isEqualTo (const AcRxObject *) const
Exported and implemented. More...
bool  | isKindOf (const AcRxClass *) const
Checks the object class. More...
AcRxObject *  | queryX (const AcRxClass *) const
returns the protocol extension object assigned to this class or a parent class. More...
AcRxObject *  | x (const AcRxClass *) const
returns the protocol extension object assigned to this class or a parent class. More...
 virtual  | ~AcRxObject ()
Destructor.
 Static Public Member Functions
static void  | addGlobalCallback (class AcDbAssocVariableCallback *)
Adds the callback to this variable. More...
 static Acad::ErrorStatus  | evaluateExpression (const AcString &, const AcString &, const AcDbObjectId &, AcDbEvalVariant &, AcString &, AcString &=dummyString())
static class AcDbAssocVariableCallback *  | globalCallback ()
Returns the callback that is the collection of all associated callbacks registered by client code. More...
static void  | removeGlobalCallback (class AcDbAssocVariableCallback *)
Removes the callback from this variable. More...
 Static Public Member Functions inherited from AcDbAssocAction
static AcDbObjectId  | actionBody (const AcDbObjectId &)
Returns an object ID of a given object id owned action instance. More...
 static bool  | doesObjectHaveActiveActions (const AcDbObject *)
static Acad::ErrorStatus  | getActionsDependentOnObject (const AcDbObject *, bool, bool, AcDbObjectIdArray &)
Gets all actions depending on the given object. More...
 static Acad::ErrorStatus  | markDependentActionsToEvaluate (const AcDbObjectId &)
 static Acad::ErrorStatus  | removeActionsControllingObject (const AcDbObjectId &, int=0, const AcDbObjectId &=AcDbObjectId::kNull)
 Static Public Member Functions inherited from AcRxObject
 static AcRxObject *  | cast (const AcRxObject *)
 static AcRxClass *  | desc ()
Exported and implemented.
 Static Public Member Functions inherited from AcHeapOperators
 static void  | operator delete (void *)
_
 static void  | operator delete (void *, const char *, int)
 static void  | operator delete (void *, void *)
 static void  | operator delete[] (void *)
_
 static void  | operator delete[] (void *, const char *, int)
 static void *  | operator new (size_t)
_
 static void *  | operator new (size_t, const char *, int)
 static void *  | operator new (size_t, void *p)
 static void *  | operator new[] (size_t)
_
 static void *  | operator new[] (size_t, const char *, int)
 Additional Inherited Members
 Public Types inherited from AcGiDrawable
enum  | DrawableType {
 kGeometry = 0 , kDistantLight , kPointLight , kSpotLight ,
 kAmbientLight , kSolidBackground , kGradientBackground , kImageBackground ,
 kGroundPlaneBackground , kViewport
 }
enum  | SetAttributesFlags {
 kDrawableNone = 0 , kDrawableIsAnEntity = 1 , kDrawableUsesNesting = 2 , kDrawableIsCompoundObject = 4 ,
 kDrawableViewIndependentViewportDraw = 8 , kDrawableIsInvisible = 16 , kDrawableHasAttributes = 32 , kDrawableRegenTypeDependentGeometry = 64 ,
 kDrawableIsDimension = 133 , kDrawableRegenDraw = 256 , kDrawableStandardDisplaySingleLOD = 512 , kDrawableShadedDisplaySingleLOD = 1024 ,
 kDrawableViewDependentViewportDraw = 2048 , kDrawableBlockDependentViewportDraw = 4096 , kDrawableIsExternalReference = 8192 , kDrawableNotPlottable = 16384 ,
 kDrawableNotAllowLCS = 32768 , kDrawableMergeControlOff = 65536 , kThreadedWorldDrawViewportDraw = 131072
 }
 Protected Member Functions inherited from AcDbObject
virtual Acad::ErrorStatus  | subDeepClone (AcDbObject *, AcDbObject *&, AcDbIdMapping &, Adesk::Boolean=true) const
virtual Acad::ErrorStatus  | subGetClassID (CLSID *) const
virtual Adesk::UInt32  | subSetAttributes (AcGiDrawableTraits *)
Sets the values of this object's subentity traits and returns with the calling object's subentity traits. More...
virtual void  | subViewportDraw (AcGiViewportDraw *)
virtual Adesk::UInt32  | subViewportDrawLogicalFlags (AcGiViewportDraw *)
virtual Acad::ErrorStatus  | subWblockClone (AcRxObject *, AcDbObject *&, AcDbIdMapping &, Adesk::Boolean=true) const
virtual Adesk::Boolean  | subWorldDraw (AcGiWorldDraw *)
 Protected Member Functions inherited from AcGiDrawable
virtual Adesk::UInt32  | subRegenSupportFlags () const
Returns whether and to which level this object supports MultiThreading. More...
virtual Adesk::UInt32  | subSetAttributes (AcGiDrawableTraits *)=0
virtual void  | subViewportDraw (AcGiViewportDraw *)=0
 virtual Adesk::UInt32  | subViewportDrawLogicalFlags (AcGiViewportDraw *)
virtual Adesk::Boolean  | subWorldDraw (AcGiWorldDraw *)=0
 Protected Member Functions inherited from AcRxObject
AcRxObject ()
Exported and implemented.
Member Function Documentation
◆ addGlobalCallback()
 UX_EXPORT_FUNCTION void AcDbAssocVariable::addGlobalCallback  |  ( |  class AcDbAssocVariableCallback *  |  pAssocCallback | )
static
Adds the callback to this variable.
Parameters
[in] | pAssocCallBack | - the registered callback.
Returns
◆ description()
 UX_EXPORT_FUNCTION const AcString & AcDbAssocVariable::description  |  ( |   | ) |   const
Returns the variable description as an arbitrary string.
Returns
Description or empty string
◆ evaluateExpression() [1/2]
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbAssocVariable::evaluateExpression  |  ( |  AcDbEvalVariant &  |  expressionEval,
|  AcString &  |  error = dummyString()
) |   |  const
Evaluates the expression.
Parameters
[in] | expressionEval | - expression evaluator on the current referenced values.
[out] | error | - string error if the name or expression are not valid
Returns
Acad::eOk for success, error status otherwise
◆ evaluateExpression() [2/2]
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbAssocVariable::evaluateExpression  |  ( |  AcDbObjectIdArray &  |  idsObject,
|  AcArray< AcDbEvalVariant > &  |  evalValues,
|  AcDbEvalVariant &  |  expressionEval,
|  AcString &  |  error = dummyString()
) |   |  const
Evaluates the expression.
Parameters
[in/out] | idsObject - array of expression evaluator ids.
[in/out] | evalValues - array expression evaluator on the current referenced values.
[out] | expressionEval | - returned expression evaluator value.
[out] | error | - string error if the name or expression are not valid
Returns
Acad::eOk for success, error status otherwise
◆ expression()
 UX_EXPORT_FUNCTION const AcString & AcDbAssocVariable::expression  |  ( |   | ) |   const
Returns the expression as an arbitrary string or an empty string if the variable is a constant.
Returns
Expresion or empty string
◆ findObjectByName()
 UX_EXPORT_FUNCTION AcDbObjectId AcDbAssocVariable::findObjectByName  |  ( |  const AcString &  |  name,
|  const AcRxClass *  |  pClass
) |   |  const
Searches the object using its name and returns an object ID if the object is found or kNull if the object is not found.
Parameters
[in] | name | - name of parameter object to return.
[in] | pClass | - name of parameter object to return.
Returns
parameters object Id, NULL otherwise
◆ globalCallback()
 UX_EXPORT_FUNCTION AcDbAssocVariableCallback * AcDbAssocVariable::globalCallback  |  ( |   | )
static
Returns the callback that is the collection of all associated callbacks registered by client code.
Returns
◆ isAnonymous()
 UX_EXPORT_FUNCTION bool AcDbAssocVariable::isAnonymous  |  ( |   | ) |   const
Returns true if the variable name is empty or starts from *.
Returns
true if the variable name is empty or starts from *, false otherwise
◆ isMergeable()
 UX_EXPORT_FUNCTION bool AcDbAssocVariable::isMergeable  |  ( |   | ) |   const
For internal use.
Returns
true if succeded, false otherwise
◆ mustMerge()
 UX_EXPORT_FUNCTION bool AcDbAssocVariable::mustMerge  |  ( |   | ) |   const
For internal use.
Returns
true if succeded, false otherwise
◆ name()
 UX_EXPORT_FUNCTION const AcString & AcDbAssocVariable::name  |  ( |   | ) |   const
Returns the name of the variable an arbitrary string.
Returns
AcString
◆ removeGlobalCallback()
 UX_EXPORT_FUNCTION void AcDbAssocVariable::removeGlobalCallback  |  ( |  class AcDbAssocVariableCallback *  |  pAssocCallback | )
static
Removes the callback from this variable.
Parameters
[in] | pAssocCallBack | - the registered callback.
Returns
◆ setDescription()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbAssocVariable::setDescription  |  ( |  const AcString &  |  description | )
Sets the description for this variable as a string value.
Parameters
[in] | description | - set the new value for description.
Returns
Acad::eOk for success, error status otherwise
◆ setEvaluatorId()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbAssocVariable::setEvaluatorId  |  ( |  const AcString &  |  idEvaluator | )
Sets the given ID of the expression evaluator to be used for parsing the expression.
An empty string sets the default evaluator.
Parameters
[in] | idEvaluator | - expression evaluator id.
Returns
Acad::eOk for success, error status otherwise
◆ setExpression()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbAssocVariable::setExpression  |  ( |  const AcString &  |  expression,
|  const AcString &  |  idEvaluator,
|  bool  |  checkForDependencies,
|  bool  |  updateDependencies,
|  AcString &  |  error = dummyString(),
|  bool  |  silent = false
)
Sets the expression as a string and syntactically checks it.
Parameters
[in] | expression | - empty string or the new expression.
[in] | idEvaluator | - expression evaluator string.
[in] | checkForDependencies | - check if this variable is not referenced.
[in] | updateDependencies | - true/ it erases all existing value dependencies.
[out] | error | - string error if the name or expression are not valid
[in] | silent | - true/ it will not print the a message when the expression is not valid.
Returns
Acad::eOk for success, error status otherwise
◆ setIsMergeable()
 UX_EXPORT_FUNCTION void AcDbAssocVariable::setIsMergeable  |  ( |  bool  |  isMergeable,
|  bool  |  mustMerge = false,
|  const AcString &  |  mergeNames = AcString()
)
For internal use.
Returns
◆ setName()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbAssocVariable::setName  |  ( |  const AcString &  |  name,
|  bool  |  referenceUpdate
)
Sets the name for this variable using a given string.
Parameters
[in] | name | - new variable name
[in] | referenceUpdate | - if true, finds all expressions referencing for this variable and changes their strings
Returns
Acad::eOk for success, error status otherwise
◆ setValue()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbAssocVariable::setValue  |  ( |  const AcDbEvalVariant &  |  evalValue | )
Sets the evaluated value.
If the expression is not empty, this value will be overwritten and the expression will be evaluated.
Parameters
[in] | evalValue | - evaluator new value.
Returns
Acad::eOk for success, error status otherwise
◆ validateNameAndExpression()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbAssocVariable::validateNameAndExpression  |  ( |  const AcString &  |  validateName,
|  const AcString &  |  validateExpression,
|  AcString &  |  error
) |   |  const
Validates the given name, expression or both, to check whether they can be used for this variable.
Parameters
[in] | validateName | - variable name to validate. It can be null.
[in] | validateExpression | - variable expression to validate. It can be null.
[out] | error | - string error if the name or expression are not valid
Returns
Acad::eOk for success, error status otherwise
◆ value()
 UX_EXPORT_FUNCTION const AcDbEvalVariant & AcDbAssocVariable::value  |  ( |   | ) |   const
Returns the evaluated value of the variable.
Returns
AcDbEvalVariant