Public Member Functions | List of all members
AcDbLayerStateManagerReactor Class Reference
_ More...
#include <AcDbLayerStateManagerReactor.h>
 Public Member Functions
 virtual void  | abortLayerStateDelete (const ACHAR *, const AcDbObjectId &)
 virtual void  | abortLayerStateRename (const ACHAR *, const ACHAR *)
 virtual void  | abortLayerStateRestore (const ACHAR *, const AcDbObjectId &)
 virtual void  | layerStateCompareFailed (const ACHAR *, const AcDbObjectId &)
 virtual void  | layerStateCreated (const ACHAR *, const AcDbObjectId &)
 virtual void  | layerStateDeleted (const ACHAR *)
 virtual void  | layerStateRenamed (const ACHAR *, const ACHAR *)
 virtual void  | layerStateRestored (const ACHAR *, const AcDbObjectId &)
 virtual void  | layerStateToBeDeleted (const ACHAR *, const AcDbObjectId &)
 virtual void  | layerStateToBeRenamed (const ACHAR *, const ACHAR *)
 virtual void  | layerStateToBeRestored (const ACHAR *, const AcDbObjectId &)
 Public Member Functions inherited from AcRxObject
virtual AcRxObject *  | clone () const
Exported and implemented. More...
 virtual AcRx::Ordering  | comparedTo (const AcRxObject *) const
Exported and implemented.
virtual Acad::ErrorStatus  | copyFrom (const AcRxObject *)
Exported and implemented. More...
 virtual AcRxClass *  | isA () const
Exported and implemented.
virtual Adesk::Boolean  | isEqualTo (const AcRxObject *) const
Exported and implemented. More...
bool  | isKindOf (const AcRxClass *) const
Checks the object class. More...
AcRxObject *  | queryX (const AcRxClass *) const
returns the protocol extension object assigned to this class or a parent class. More...
AcRxObject *  | x (const AcRxClass *) const
returns the protocol extension object assigned to this class or a parent class. More...
 virtual  | ~AcRxObject ()
Destructor.
 Additional Inherited Members
 Static Public Member Functions inherited from AcRxObject
 static AcRxObject *  | cast (const AcRxObject *)
 static AcRxClass *  | desc ()
Exported and implemented.
 Protected Member Functions inherited from AcRxObject
AcRxObject ()
Exported and implemented.
Detailed Description
_