Public Member Functions | List of all members
AcDbAssocSimplePersSubentId Class Reference
_ More...
#include <AcDbAssocSimplePersSubentId.h>
 Public Member Functions
AcDbAssocSimplePersSubentId (AcDbSubentId=kNullSubentId)
virtual Acad::ErrorStatus  | audit (AcDbAuditInfo *) override
virtual Acad::ErrorStatus  | copyFrom (const AcRxObject *) override
virtual Acad::ErrorStatus  | dwgInFields (AcDbDwgFiler *) override
virtual Acad::ErrorStatus  | dwgOutFields (AcDbDwgFiler *) const override
virtual Acad::ErrorStatus  | dxfInFields (AcDbDxfFiler *) override
virtual Acad::ErrorStatus  | dxfOutFields (AcDbDxfFiler *) const override
virtual Acad::ErrorStatus  | getTransientSubentIds (const AcDbEntity *, AcDbDatabase *, AcDbSubentIdArray &) const override
virtual bool  | isEqualTo (const AcDbEntity *, AcDbDatabase *, const AcDbAssocPersSubentId *) const override
virtual bool  | isNull () const override
virtual Acad::ErrorStatus  | release (AcDbEntity *, AcDbDatabase *) const override
 void  | setSubentId (const AcDbSubentId &)
virtual AcDb::SubentType  | subentType (const AcDbEntity *, AcDbDatabase *) const override
virtual int  | transientSubentCount (const AcDbEntity *, AcDbDatabase *) const override
 Public Member Functions inherited from AcDbAssocPersSubentId
 virtual Acad::ErrorStatus  | audit (AcDbAuditInfo *)
virtual Acad::ErrorStatus  | copyFrom (const AcRxObject *)
 virtual Acad::ErrorStatus  | dwgInFields (AcDbDwgFiler *)
 virtual Acad::ErrorStatus  | dwgOutFields (AcDbDwgFiler *) const
 virtual Acad::ErrorStatus  | dxfInFields (AcDbDxfFiler *)
 virtual Acad::ErrorStatus  | dxfOutFields (AcDbDxfFiler *) const
 virtual Acad::ErrorStatus  | getTransientSubentIds (const AcDbEntity *, AcDbDatabase *, AcDbSubentIdArray &) const
 virtual bool  | isEqualTo (const AcDbEntity *, AcDbDatabase *, const AcDbAssocPersSubentId *) const
 virtual bool  | isNull () const =0
 virtual Acad::ErrorStatus  | mirror (const AcDbEntity *, AcDbDatabase *)
 virtual Acad::ErrorStatus  | release (AcDbEntity *, AcDbDatabase *) const
 virtual AcDb::SubentType  | subentType (const AcDbEntity *, AcDbDatabase *) const =0
 virtual int  | transientSubentCount (const AcDbEntity *, AcDbDatabase *) const
 Public Member Functions inherited from AcRxObject
virtual AcRxObject *  | clone () const
Exported and implemented. More...
 virtual AcRx::Ordering  | comparedTo (const AcRxObject *) const
Exported and implemented.
virtual Acad::ErrorStatus  | copyFrom (const AcRxObject *)
Exported and implemented. More...
 virtual AcRxClass *  | isA () const
Exported and implemented.
virtual Adesk::Boolean  | isEqualTo (const AcRxObject *) const
Exported and implemented. More...
bool  | isKindOf (const AcRxClass *) const
Checks the object class. More...
AcRxObject *  | queryX (const AcRxClass *) const
returns the protocol extension object assigned to this class or a parent class. More...
AcRxObject *  | x (const AcRxClass *) const
returns the protocol extension object assigned to this class or a parent class. More...
 virtual  | ~AcRxObject ()
Destructor.
 Additional Inherited Members
 Static Public Member Functions inherited from AcDbAssocPersSubentId
 static Acad::ErrorStatus  | createObjectAndDwgInFields (AcDbDatabase *, AcDbDwgFiler *, AcDbAssocPersSubentId *&)
 static Acad::ErrorStatus  | createObjectAndDxfInFields (AcDbDxfFiler *, AcDbAssocPersSubentId *&)
 Static Public Member Functions inherited from AcRxObject
 static AcRxObject *  | cast (const AcRxObject *)
 static AcRxClass *  | desc ()
Exported and implemented.
 Protected Member Functions inherited from AcRxObject
AcRxObject ()
Exported and implemented.
Detailed Description
_
Member Function Documentation
◆ audit()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbAssocSimplePersSubentId::audit  |  ( |  AcDbAuditInfo *  |  audit | )
overridevirtual
Reimplemented from AcDbAssocPersSubentId.
◆ copyFrom()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbAssocSimplePersSubentId::copyFrom  |  ( |  const AcRxObject *  |  pSrc | )
overridevirtual
Reimplemented from AcDbAssocPersSubentId.
◆ dwgInFields()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbAssocSimplePersSubentId::dwgInFields  |  ( |  AcDbDwgFiler *  |  pFiler | )
overridevirtual
Reimplemented from AcDbAssocPersSubentId.
◆ dwgOutFields()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbAssocSimplePersSubentId::dwgOutFields  |  ( |  AcDbDwgFiler *  |  pFiler | ) |   const
overridevirtual
Reimplemented from AcDbAssocPersSubentId.
◆ dxfInFields()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbAssocSimplePersSubentId::dxfInFields  |  ( |  AcDbDxfFiler *  |  pFiler | )
overridevirtual
Reimplemented from AcDbAssocPersSubentId.
◆ dxfOutFields()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbAssocSimplePersSubentId::dxfOutFields  |  ( |  AcDbDxfFiler *  |  pFiler | ) |   const
overridevirtual
Reimplemented from AcDbAssocPersSubentId.
◆ getTransientSubentIds()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbAssocSimplePersSubentId::getTransientSubentIds  |  ( |  const AcDbEntity *  |  pEnt,
|  AcDbDatabase *  |  ,
|  AcDbSubentIdArray &  |  ids
) |   |  const
overridevirtual
Reimplemented from AcDbAssocPersSubentId.
◆ isEqualTo()
 UX_EXPORT_FUNCTION bool AcDbAssocSimplePersSubentId::isEqualTo  |  ( |  const AcDbEntity *  |  pEnt,
|  AcDbDatabase *  |  ,
|  const AcDbAssocPersSubentId *  |  rhs
) |   |  const
overridevirtual
Reimplemented from AcDbAssocPersSubentId.
◆ isNull()
 UX_EXPORT_FUNCTION bool AcDbAssocSimplePersSubentId::isNull  |  ( |   | ) |   const
overridevirtual
Implements AcDbAssocPersSubentId.
◆ release()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbAssocSimplePersSubentId::release  |  ( |  AcDbEntity *  |  pEnt,
|  AcDbDatabase *  |  pDb
) |   |  const
overridevirtual
Reimplemented from AcDbAssocPersSubentId.
◆ subentType()
 UX_EXPORT_FUNCTION AcDb::SubentType AcDbAssocSimplePersSubentId::subentType  |  ( |  const AcDbEntity *  |  pEnt,
|  AcDbDatabase *
) |   |  const
overridevirtual
Implements AcDbAssocPersSubentId.
◆ transientSubentCount()
 UX_EXPORT_FUNCTION int AcDbAssocSimplePersSubentId::transientSubentCount  |  ( |  const AcDbEntity *  |  pEnt,
|  AcDbDatabase *
) |   |  const
overridevirtual
Reimplemented from AcDbAssocPersSubentId.