Public Types | Public Member Functions | List of all members
AcDbAuditInfo Class Reference
_ More...
#include <AcDbAuditInfo.h>
 Public Types
enum  | AuditPass { PASS1 = 1 , PASS2 }
 Public Member Functions
AcDbAuditInfo ()
Constructor.
AuditPass  | auditPass () const
Checks if the object is audited during PASS1 or PASS2 stage. More...
void  | errorsFixed (int)
Increments the number of fixed errors for this object. More...
void  | errorsFound (int)
Increments the number of found errors for this object. More...
 Acad::ErrorStatus  | fetchObject (AcDbObjectId, AcDbObjectId &, AcRxClass *, bool=false, bool=true, bool=false)
bool  | fixErrors () const
Checks if errors need to be fixed. More...
 void  | incNumEntities ()
 int  | numEntities ()
int  | numErrors () const
Checks the number of errors detected by this AcDbAuditInfo object. More...
 int  | numFixes () const
Checks the number of errors fixed by this AcDbAuditInfo object.
void  | printError (const AcDbObject *, const ACHAR *, const ACHAR *, const ACHAR *)
Sends a notification so that error information is printed. More...
void  | printError (const ACHAR *, const ACHAR *, const ACHAR *, const ACHAR *)
Sends a notification so that error information is printed. More...
 void  | printNumEntities (const ACHAR *)
 Acad::ErrorStatus  | registerObject (AcDbHandle, bool, AcRxClass *)
 void  | requestRegen ()
 void  | resetNumEntities ()
 Acad::ErrorStatus  | updateObject (AcDbHandle, bool, bool, bool, bool, bool, bool, bool, AcRxClass *, AcRxClass *, AcDbObjectId)
~AcDbAuditInfo ()
Destructor.
Detailed Description
_
Member Function Documentation
◆ auditPass()
 UX_EXPORT_FUNCTION AcDbAuditInfo::AuditPass AcDbAuditInfo::auditPass  |  ( |   | ) |   const
Checks if the object is audited during PASS1 or PASS2 stage.
Returns
stage of audit operation; can be PASS1 or PASS2
◆ errorsFixed()
 UX_EXPORT_FUNCTION void AcDbAuditInfo::errorsFixed  |  ( |  int  |  numErrorsFixed | )
Increments the number of fixed errors for this object.
Parameters
[in] | numErrorsFixed | number of fixed errors
◆ errorsFound()
 UX_EXPORT_FUNCTION void AcDbAuditInfo::errorsFound  |  ( |  int  |  numErrorsFound | )
Increments the number of found errors for this object.
Parameters
[in] | numErrorsFound | number of found errors
◆ fixErrors()
 UX_EXPORT_FUNCTION bool AcDbAuditInfo::fixErrors  |  ( |   | ) |   const
Checks if errors need to be fixed.
Returns
true if errors need to be fixed, false otherwise
◆ numErrors()
 UX_EXPORT_FUNCTION int AcDbAuditInfo::numErrors  |  ( |   | ) |   const
Checks the number of errors detected by this AcDbAuditInfo object.
Returns
number of detected errors
◆ printError() [1/2]
 UX_EXPORT_FUNCTION void AcDbAuditInfo::printError  |  ( |  const AcDbObject *  |  pObject,
|  const ACHAR *  |  badData,
|  const ACHAR *  |  reason,
|  const ACHAR *  |  defValue
)
Sends a notification so that error information is printed.
Parameters
[in] | pObject | pointer to the object which generated the error
[in] | badData | describes the data which is bad
[in] | reason | describes the reason the data is bad
[in] | defValue | replaced or default value
Remarks
If AUDITCTL system variable is set the information is also logged in the created .adt file.
◆ printError() [2/2]
 UX_EXPORT_FUNCTION void AcDbAuditInfo::printError  |  ( |  const ACHAR *  |  objectType,
|  const ACHAR *  |  badData,
|  const ACHAR *  |  reason,
|  const ACHAR *  |  defValue
)
Sends a notification so that error information is printed.
Parameters
[in] | objectType | type of the object for which the error is detected
[in] | badData | describes the data which is bad
[in] | reason | describes the reason the data is bad
[in] | defValue | replaced or default value
Remarks
If AUDITCTL system variable is set the information is also logged in the created .adt file.