Public Member Functions | Public Attributes | List of all members
AcDbObjectReactor Class Reference
_ More...
#include <AcDbObjectReactor.h>
 Public Member Functions
 virtual void  | cancelled (const AcDbObject *)
 virtual void  | copied (const AcDbObject *, const AcDbObject *)
 virtual void  | erased (const AcDbObject *, Adesk::Boolean=Adesk::kTrue)
 virtual void  | goodbye (const AcDbObject *)
 virtual void  | modified (const AcDbObject *)
 virtual void  | modifiedXData (const AcDbObject *)
 virtual void  | modifyUndone (const AcDbObject *)
virtual void  | objectClosed (const AcDbObjectId)
Sent when an object that was open for write is closed by methods close or cancel. More...
virtual void  | openedForModify (const AcDbObject *)
Sent before an object that is open for write is changed. More...
 virtual void  | reappended (const AcDbObject *)
 virtual void  | subObjModified (const AcDbObject *, const AcDbObject *)
 virtual void  | unappended (const AcDbObject *)
 Public Member Functions inherited from AcRxObject
virtual AcRxObject *  | clone () const
Exported and implemented. More...
 virtual AcRx::Ordering  | comparedTo (const AcRxObject *) const
Exported and implemented.
virtual Acad::ErrorStatus  | copyFrom (const AcRxObject *)
Exported and implemented. More...
 virtual AcRxClass *  | isA () const
Exported and implemented.
virtual Adesk::Boolean  | isEqualTo (const AcRxObject *) const
Exported and implemented. More...
bool  | isKindOf (const AcRxClass *) const
Checks the object class. More...
AcRxObject *  | queryX (const AcRxClass *) const
returns the protocol extension object assigned to this class or a parent class. More...
AcRxObject *  | x (const AcRxClass *) const
returns the protocol extension object assigned to this class or a parent class. More...
 virtual  | ~AcRxObject ()
Destructor.
 Public Attributes
AcDbObjectReactor
Default constructor.
 Additional Inherited Members
 Static Public Member Functions inherited from AcRxObject
 static AcRxObject *  | cast (const AcRxObject *)
 static AcRxClass *  | desc ()
Exported and implemented.
 Protected Member Functions inherited from AcRxObject
AcRxObject ()
Exported and implemented.
Detailed Description
_
Member Function Documentation
◆ objectClosed()
 UX_EXPORT_FUNCTION void AcDbObjectReactor::objectClosed  |  ( |  const AcDbObjectId  |  objId | )
virtual
Sent when an object that was open for write is closed by methods close or cancel.
Parameters
[in] | objId | Id of the object what is closing
Remarks
In other CAD libraries this notification may always be sent, when an database resident object is closing. In DwgDirect it is only sent, when the object had be modified. So it is in BRX
◆ openedForModify()
 UX_EXPORT_FUNCTION void AcDbObjectReactor::openedForModify  |  ( |  const AcDbObject *  |  dbObj | )
virtual
Sent before an object that is open for write is changed.
Parameters
[in] | dbObj | object what will be changed