Public Types | Public Member Functions | Static Public Member Functions | Protected Member Functions | List of all members
AcDbTextEditorSelectionBase Class Reference
_ More...
#include <AcDbTextEditorSelectionBase.h>
 Public Types
enum  | FlowAlign { kFlowBase = 0 , kFlowCenter = 1 , kFlowTop = 2 }
enum  | InsertTextType {
 kUnicodeMTextFormat = 0 , kMTextFormat = 1 , kRichTextFormat = 2 , kUnicodeDTextFormat = 3 ,
 kDTextFormat = 4 , kUnicodeTextFormat = 5 , kMultibyteTextFormat = 6
 }
 Public Member Functions
 bool  | bold () const
 AcCmColor  | color () const
 FlowAlign  | flowAlign () const
 AcString  | font () const
 double  | height () const
 Acad::ErrorStatus  | inputSpecialChar (Adesk::UInt32)
 Acad::ErrorStatus  | insertColumnBreak ()
 Acad::ErrorStatus  | insertImportedText (InsertTextType, void *)
 Acad::ErrorStatus  | insertString (const AcString &)
 Acad::ErrorStatus  | insertSymbol (ACHAR, Charset)
 bool  | isTrueType () const
 bool  | italic () const
 Charset  | language () const
 double  | obliqueAngle () const
 bool  | overline () const
 Acad::ErrorStatus  | setColor (const AcCmColor &)
 Acad::ErrorStatus  | setFlowAlign (FlowAlign)
 Acad::ErrorStatus  | setFont (const AcString &, bool)
 Acad::ErrorStatus  | setHeight (double)
 Acad::ErrorStatus  | setLanguage (Charset)
 Acad::ErrorStatus  | setObliqueAngle (double)
 Acad::ErrorStatus  | setTrackingFactor (double)
 Acad::ErrorStatus  | setWidthScale (double)
 bool  | strikethrough () const
 Acad::ErrorStatus  | toggleBold ()
 Acad::ErrorStatus  | toggleItalic ()
 Acad::ErrorStatus  | toggleOverline ()
 Acad::ErrorStatus  | toggleStrikethrough ()
 Acad::ErrorStatus  | toggleUnderline ()
 double  | trackingFactor () const
 bool  | underline () const
 double  | widthScale () const
 Static Public Member Functions
 static double  | maxObliqueAngle ()
 static double  | maxTrackingFactor ()
 static double  | maxWidthScale ()
 static double  | minObliqueAngle ()
 static double  | minTrackingFactor ()
 static double  | minWidthScale ()
 Protected Member Functions
AcDbTextEditorSelectionBase (const AcDbTextEditorSelectionBase &)
 AcDbTextEditorSelectionBase &  | operator= (const AcDbTextEditorSelectionBase &)
Detailed Description
_