Public Member Functions | Public Attributes | List of all members
AcDbDataColumn Class Reference
_ More...
#include <AcDbDataColumn.h>
 Public Member Functions
AcDbDataColumn (const AcDbDataCell::CellType, const ACHAR *=NULL)
AcDbDataColumn (const AcDbDataColumn &)
virtual Acad::ErrorStatus  | appendCell (const AcDbDataCell &)
Append a data cell to the column. More...
virtual const ACHAR *  | columnName () const
Get the column name of this data column. More...
virtual AcDbDataCell::CellType  | columnType () const
Get the cell type of this data column. More...
virtual Acad::ErrorStatus  | getCellAt (Adesk::UInt32, AcDbDataCell &) const
Gets the specified data cell. More...
virtual Acad::ErrorStatus  | getIndexAtCell (const AcDbDataCell &, Adesk::UInt32 &) const
Finds the index of the specified data cell. More...
virtual Adesk::UInt32  | growLength () const
Get the grow size of this data column. More...
virtual Acad::ErrorStatus  | insertCellAt (Adesk::UInt32, const AcDbDataCell &)
Inserts the specified data cell. More...
virtual Adesk::UInt32  | numCells () const
Get the number of cells in this data column. More...
virtual AcDbDataColumn &  | operator= (const AcDbDataColumn &)
Assign cells from another data column. More...
virtual Adesk::UInt32  | physicalLength () const
Get the physical size of this data column. More...
virtual Acad::ErrorStatus  | removeCellAt (Adesk::UInt32)
Removes the specified data cell. More...
virtual Acad::ErrorStatus  | setCellAt (Adesk::UInt32, const AcDbDataCell &)
Sets the specified data cell contents. More...
virtual Acad::ErrorStatus  | setColumnName (const ACHAR *)
Sets the data column name. More...
virtual Acad::ErrorStatus  | setColumnType (AcDbDataCell::CellType)
Sets the data column type. More...
virtual Acad::ErrorStatus  | setGrowLength (Adesk::UInt32)
Sets the data column grow size. More...
virtual Acad::ErrorStatus  | setPhysicalLength (Adesk::UInt32)
Sets the data column physical size. More...
 virtual  | ~AcDbDataColumn ()
Destructor.
 Public Member Functions inherited from AcRxObject
virtual AcRxObject *  | clone () const
Exported and implemented. More...
 virtual AcRx::Ordering  | comparedTo (const AcRxObject *) const
Exported and implemented.
virtual Acad::ErrorStatus  | copyFrom (const AcRxObject *)
Exported and implemented. More...
 virtual AcRxClass *  | isA () const
Exported and implemented.
virtual Adesk::Boolean  | isEqualTo (const AcRxObject *) const
Exported and implemented. More...
bool  | isKindOf (const AcRxClass *) const
Checks the object class. More...
AcRxObject *  | queryX (const AcRxClass *) const
returns the protocol extension object assigned to this class or a parent class. More...
AcRxObject *  | x (const AcRxClass *) const
returns the protocol extension object assigned to this class or a parent class. More...
 virtual  | ~AcRxObject ()
Destructor.
 Public Attributes
AcDbDataColumn
Default constructor. More...
 Additional Inherited Members
 Static Public Member Functions inherited from AcRxObject
 static AcRxObject *  | cast (const AcRxObject *)
 static AcRxClass *  | desc ()
Exported and implemented.
 Protected Member Functions inherited from AcRxObject
AcRxObject ()
Exported and implemented.
Detailed Description
_
Member Function Documentation
◆ appendCell()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbDataColumn::appendCell  |  ( |  const AcDbDataCell &  |  cell | )
virtual
Append a data cell to the column.
Parameters
[in] | cell | cell to add.
Returns
Acad::eOk if successful, error status otherwise.
◆ columnName()
 UX_EXPORT_FUNCTION const ACHAR * AcDbDataColumn::columnName  |  ( |   | ) |   const
virtual
Get the column name of this data column.
Returns
name
◆ columnType()
 UX_EXPORT_FUNCTION AcDbDataCell::CellType AcDbDataColumn::columnType  |  ( |   | ) |   const
virtual
Get the cell type of this data column.
Returns
cell type
◆ getCellAt()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbDataColumn::getCellAt  |  ( |  Adesk::UInt32  |  index,
|  AcDbDataCell &  |  cell
) |   |  const
virtual
Gets the specified data cell.
Parameters
[in] | index | cell index.
[out] | cell | cell content.
Returns
Acad::eOk if successful, error status otherwise.
◆ getIndexAtCell()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbDataColumn::getIndexAtCell  |  ( |  const AcDbDataCell &  |  cell,
|  Adesk::UInt32 &  |  index
) |   |  const
virtual
Finds the index of the specified data cell.
Parameters
[in] | cell | cell to find.
[out] | index | cell index.
Returns
Acad::eOk if successful, error status otherwise.
◆ growLength()
 UX_EXPORT_FUNCTION Adesk::UInt32 AcDbDataColumn::growLength  |  ( |   | ) |   const
virtual
Get the grow size of this data column.
Returns
grow size
◆ insertCellAt()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbDataColumn::insertCellAt  |  ( |  Adesk::UInt32  |  index,
|  const AcDbDataCell &  |  cell
)
virtual
Inserts the specified data cell.
Parameters
[in] | index | inserted cell index.
[in] | cell | cell to add.
Returns
Acad::eOk if successful, error status otherwise.
◆ numCells()
 UX_EXPORT_FUNCTION Adesk::UInt32 AcDbDataColumn::numCells  |  ( |   | ) |   const
virtual
Get the number of cells in this data column.
Returns
size
◆ operator=()
 UX_EXPORT_FUNCTION AcDbDataColumn & AcDbDataColumn::operator=  |  ( |  const AcDbDataColumn &  |  source | )
virtual
Assign cells from another data column.
Parameters
[in] | source | source column.
Returns
reference to this data column.
◆ physicalLength()
 UX_EXPORT_FUNCTION Adesk::UInt32 AcDbDataColumn::physicalLength  |  ( |   | ) |   const
virtual
Get the physical size of this data column.
Returns
physical size
◆ removeCellAt()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbDataColumn::removeCellAt  |  ( |  Adesk::UInt32  |  index | )
virtual
Removes the specified data cell.
Parameters
[in] | index | cell index.
Returns
Acad::eOk if successful, error status otherwise.
◆ setCellAt()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbDataColumn::setCellAt  |  ( |  Adesk::UInt32  |  index,
|  const AcDbDataCell &  |  cell
)
virtual
Sets the specified data cell contents.
Parameters
[in] | index | cell index.
[in] | cell | new cell content.
Returns
Acad::eOk if successful, error status otherwise.
◆ setColumnName()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbDataColumn::setColumnName  |  ( |  const ACHAR *  |  name | )
virtual
Sets the data column name.
Parameters
[in] | name | column name.
Returns
Acad::eOk if successful, error status otherwise.
◆ setColumnType()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbDataColumn::setColumnType  |  ( |  AcDbDataCell::CellType  |  type | )
virtual
Sets the data column type.
Parameters
[in] | type | column type.
Returns
Acad::eOk if successful, error status otherwise.
◆ setGrowLength()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbDataColumn::setGrowLength  |  ( |  Adesk::UInt32  |  n | )
virtual
Sets the data column grow size.
Parameters
[in] | n | grow size.
Returns
Acad::eOk if successful, error status otherwise.
◆ setPhysicalLength()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbDataColumn::setPhysicalLength  |  ( |  Adesk::UInt32  |  n | )
virtual
Sets the data column physical size.
Parameters
[in] | n | physical size.
Returns
Acad::eOk if successful, error status otherwise.
Member Data Documentation
◆ AcDbDataColumn
 UX_EXPORT_FUNCTION AcDbDataColumn::AcDbDataColumn
Default constructor.
Construct a data column.
Copy constructor.
Parameters
[in] | source | data column to copy.
[in] | type | cell type.
[in] | colName | column name (may be NULL).