Public Types | Public Member Functions | List of all members
AcDbGraphNode Class Reference
_ More...
#include <AcDbGraphNode.h>
 Public Types
enum  | Flags {
 kNone = 0 , kVisited = 1 , kOutsideRefed = 2 , kSelected = 4 ,
 kInList = 8 , kListAll = 14 , kFirstLevel = 16 , kUnresTree = 32 ,
 kAll = 47
 }
 Public Member Functions
AcDbGraphNode (void *=NULL)
Constructor. More...
 Acad::ErrorStatus  | addRefTo (AcDbGraphNode *)
 Acad::ErrorStatus  | clear (Adesk::UInt8)
AcDbGraphNode *  | cycleIn (int) const
Gets the specified incoming cyclical reference of this graph node object. More...
AcDbGraphNode *  | cycleOut (int) const
Gets the specified incoming cyclical reference of this graph node object. More...
void *  | data () const
Gets the data associated with this graph node object. More...
 Acad::ErrorStatus  | disconnectAll ()
AcDbGraphNode *  | in (int) const
Gets the specified incoming reference of this graph node object. More...
bool  | isCycleNode () const
Checks if this graph node object is part of a cyclical reference. More...
bool  | isMarkedAs (Adesk::UInt8) const
Checks if all the specified set flag bits are set in this graph node object. More...
 Acad::ErrorStatus  | markAs (Adesk::UInt8)
 Acad::ErrorStatus  | markTree (Adesk::UInt8, AcDbVoidPtrArray *=NULL)
AcDbGraphNode *  | nextCycleNode () const
Gets the next outgoing cyclical reference of this graph node object. More...
int  | numCycleIn () const
Gets the number of incoming cyclical references associated with this graph node. More...
int  | numCycleOut () const
Gets the number of outgoing cyclical references associated with this graph node. More...
int  | numIn () const
Gets the number of incoming references associated with this graph node object. More...
int  | numOut () const
Gets the number of outgoing references associated with this graph node object. More...
AcDbGraphNode *  | out (int) const
Gets the specified outgoing reference of this graph node object. More...
AcDbGraph *  | owner () const
Gets the graph which is the owner of this graph node. More...
 Acad::ErrorStatus  | removeRefTo (AcDbGraphNode *)
void  | setData (void *)
Sets the data associated with this graph node object using the passed in pointer. More...
 void  | setEdgeGrowthRate (int, int)
 virtual  | ~AcDbGraphNode ()
Destructor.
 Additional Inherited Members
 Static Public Member Functions inherited from AcHeapOperators
 static void  | operator delete (void *)
_
 static void  | operator delete (void *, const char *, int)
 static void  | operator delete (void *, void *)
 static void  | operator delete[] (void *)
_
 static void  | operator delete[] (void *, const char *, int)
 static void *  | operator new (size_t)
_
 static void *  | operator new (size_t, const char *, int)
 static void *  | operator new (size_t, void *p)
 static void *  | operator new[] (size_t)
_
 static void *  | operator new[] (size_t, const char *, int)
Detailed Description
_
Constructor & Destructor Documentation
◆ AcDbGraphNode()
 UX_EXPORT_FUNCTION AcDbGraphNode::AcDbGraphNode  |  ( |  void *  |  pNodeData = NULL | )
Constructor.
Sets this graph node's data to point to pNodeData.
Parameters
[in] | pNodeData | pointer to data to be set
Member Function Documentation
◆ cycleIn()
 UX_EXPORT_FUNCTION AcDbGraphNode * AcDbGraphNode::cycleIn  |  ( |  int  |  i | ) |   const
Gets the specified incoming cyclical reference of this graph node object.
Parameters
[in] | i | reference index
Returns
pointer to a graph node object or NULL if the index is not valid
Remarks
Call this function after AcDbGraph::findCycles() for the owner of this node.
◆ cycleOut()
 UX_EXPORT_FUNCTION AcDbGraphNode * AcDbGraphNode::cycleOut  |  ( |  int  |  i | ) |   const
Gets the specified incoming cyclical reference of this graph node object.
Parameters
[in] | i | reference index
Returns
pointer to a graph node object or NULL if the index is not valid
Remarks
Call this function after AcDbGraph::findCycles() for the owner of this node.
◆ data()
 UX_EXPORT_FUNCTION void * AcDbGraphNode::data  |  ( |   | ) |   const
Gets the data associated with this graph node object.
Returns
void pointer to data associated with this graph node
◆ in()
 UX_EXPORT_FUNCTION AcDbGraphNode * AcDbGraphNode::in  |  ( |  int  |  i | ) |   const
Gets the specified incoming reference of this graph node object.
Parameters
[in] | i | reference index
Returns
pointer to a graph node object or NULL if the index is not valid
◆ isCycleNode()
 UX_EXPORT_FUNCTION bool AcDbGraphNode::isCycleNode  |  ( |   | ) |   const
Checks if this graph node object is part of a cyclical reference.
Returns
true if this node is part of a cyclical reference, false otherwise
Remarks
Call this function after AcDbGraph::findCycles() for the owner of this node.
◆ isMarkedAs()
 UX_EXPORT_FUNCTION bool AcDbGraphNode::isMarkedAs  |  ( |  Adesk::UInt8  |  f | ) |   const
Checks if all the specified set flag bits are set in this graph node object.
Parameters
[in] | f | flag bits to check
Returns
true if all the flag bits are set, false otherwise
◆ nextCycleNode()
 UX_EXPORT_FUNCTION AcDbGraphNode * AcDbGraphNode::nextCycleNode  |  ( |   | ) |   const
Gets the next outgoing cyclical reference of this graph node object.
Returns
pointer to a graph node object or NULL if cycleOut(0) returns NULL for the graph
Remarks
Call this function after AcDbGraph::findCycles() for the owner of this node.
◆ numCycleIn()
 UX_EXPORT_FUNCTION int AcDbGraphNode::numCycleIn  |  ( |   | ) |   const
Gets the number of incoming cyclical references associated with this graph node.
Returns
number of incoming cyclical references
Remarks
Call this function after AcDbGraph::findCycles() for the owner of this node.
◆ numCycleOut()
 UX_EXPORT_FUNCTION int AcDbGraphNode::numCycleOut  |  ( |   | ) |   const
Gets the number of outgoing cyclical references associated with this graph node.
Returns
number of outgoing cyclical references
Remarks
Call this function after AcDbGraph::findCycles() for the owner of this node.
◆ numIn()
 UX_EXPORT_FUNCTION int AcDbGraphNode::numIn  |  ( |   | ) |   const
Gets the number of incoming references associated with this graph node object.
Returns
number of incoming references
◆ numOut()
 UX_EXPORT_FUNCTION int AcDbGraphNode::numOut  |  ( |   | ) |   const
Gets the number of outgoing references associated with this graph node object.
Returns
number of outgoing references
◆ out()
 UX_EXPORT_FUNCTION AcDbGraphNode * AcDbGraphNode::out  |  ( |  int  |  i | ) |   const
Gets the specified outgoing reference of this graph node object.
Parameters
[in] | i | reference index
Returns
pointer to a graph node object or NULL if the index is not valid
◆ owner()
 UX_EXPORT_FUNCTION AcDbGraph * AcDbGraphNode::owner  |  ( |   | ) |   const
Gets the graph which is the owner of this graph node.
Returns
pointer to a graph object or NULL if this node hasn't been attached to a graph
◆ setData()
 UX_EXPORT_FUNCTION void AcDbGraphNode::setData  |  ( |  void *  |  pNodeData | )
Sets the data associated with this graph node object using the passed in pointer.
Parameters
[in] | pNodeData | pointer to data to be set for this graoh node