Public Types | Public Member Functions | List of all members
AcDbCivilVAlignmentElement Class Reference
Civil VerticalAlignment base class. More...
#include <AcDbCivilAlignments.h>
 Public Types
enum class  | EElementType {
 eUndefined = 0 , eTangent = 1 , eArc = 2 , eParabola = 3 ,
 ePVI = 100
 }
enum class  | EParameterConstraint {
 eUndefined = 0 , ePassThroughPoints = 1 , eRadius = 2 , eLength = 3 ,
 eAngle = 4 , eAutomatic = 5 , ePointOnTangent = 6
 }
enum class  | ETangencyConstraint {
 eUndefined = 0 , eFixed = 1 , ePrevious = 2 , eNext = 3 ,
 eBoth = 4
 }
 Public Member Functions
Adesk::UInt64  | id () const
Returns the ID of this vertical alignment element. More...
Adesk::UInt64  | nextId () const
Returns the ID of vertical alignment element next to this vertical alignment element. More...
AcDbCivilVAlignmentElement::EParameterConstraint  | parameterConstraint () const
Returns the type of parameter constraint for this vertical alignment element. More...
Adesk::UInt64  | previousId () const
Returns the ID of vertical alignment element previous to this vertical alignment element. More...
bool  | setNextId (Adesk::UInt64 id)
Defines the next element ID for the specified element in this vertical alignment element. More...
bool  | setParameterConstraint (AcDbCivilVAlignmentElement::EParameterConstraint constraint)
Defines the parameter constraint type for this vertical alignment element. More...
bool  | setPreviousId (Adesk::UInt64 id)
Defines the previous element ID for the specified element in this vertical alignment element. More...
bool  | setTangencyConstraint (AcDbCivilVAlignmentElement::ETangencyConstraint constraint)
Defines the tangency constraint type for this vertical alignment element. More...
AcDbCivilVAlignmentElement::ETangencyConstraint  | tangencyConstraint () const
Returns the type of tangency constraint for this vertical alignment element. More...
AcDbCivilVAlignmentElement::EElementType  | type () const
Returns the type of this vertical alignment element. More...
virtual  | ~AcDbCivilVAlignmentElement ()
Destructor. More...
 Public Member Functions inherited from AcRxObject
virtual AcRxObject *  | clone () const
Exported and implemented. More...
 virtual AcRx::Ordering  | comparedTo (const AcRxObject *) const
Exported and implemented.
virtual Acad::ErrorStatus  | copyFrom (const AcRxObject *)
Exported and implemented. More...
 virtual AcRxClass *  | isA () const
Exported and implemented.
virtual Adesk::Boolean  | isEqualTo (const AcRxObject *) const
Exported and implemented. More...
bool  | isKindOf (const AcRxClass *) const
Checks the object class. More...
AcRxObject *  | queryX (const AcRxClass *) const
returns the protocol extension object assigned to this class or a parent class. More...
AcRxObject *  | x (const AcRxClass *) const
returns the protocol extension object assigned to this class or a parent class. More...
 virtual  | ~AcRxObject ()
Destructor.
 Additional Inherited Members
 Static Public Member Functions inherited from AcRxObject
 static AcRxObject *  | cast (const AcRxObject *)
 static AcRxClass *  | desc ()
Exported and implemented.
 Protected Member Functions inherited from AcRxObject
AcRxObject ()
Exported and implemented.
Detailed Description
Civil VerticalAlignment base class.
Constructor & Destructor Documentation
◆ ~AcDbCivilVAlignmentElement()
 UX_EXPORT_FUNCTION AcDbCivilVAlignmentElement::~AcDbCivilVAlignmentElement  |  ( |   | )
virtual
Destructor.
Date
2021 torstenm implemented
Member Function Documentation
◆ id()
 UX_EXPORT_FUNCTION Adesk::UInt64 AcDbCivilVAlignmentElement::id  |  ( |   | ) |   const
Returns the ID of this vertical alignment element.
Returns
Adesk::UInt64 - the element ID of this
Date
2021 torstenm implemented
◆ nextId()
 UX_EXPORT_FUNCTION Adesk::UInt64 AcDbCivilVAlignmentElement::nextId  |  ( |   | ) |   const
Returns the ID of vertical alignment element next to this vertical alignment element.
Returns
Adesk::UInt64 - the next element ID of this
Date
2021 torstenm implemented
◆ parameterConstraint()
 UX_EXPORT_FUNCTION AcDbCivilVAlignmentElement::EParameterConstraint AcDbCivilVAlignmentElement::parameterConstraint  |  ( |   | ) |   const
Returns the type of parameter constraint for this vertical alignment element.
Returns
AcDbCivilVAlignmentElement::ETangencyConstraint - the parameter constraint type
Date
2021 torstenm implemented
◆ previousId()
 UX_EXPORT_FUNCTION Adesk::UInt64 AcDbCivilVAlignmentElement::previousId  |  ( |   | ) |   const
Returns the ID of vertical alignment element previous to this vertical alignment element.
Returns
Adesk::UInt64 - the previous element ID of this
Date
2021 torstenm implemented
◆ setNextId()
 UX_EXPORT_FUNCTION bool AcDbCivilVAlignmentElement::setNextId  |  ( |  Adesk::UInt64  |  id | )
Defines the next element ID for the specified element in this vertical alignment element.
Parameters
[in] | id | - the element ID to set as next element
Returns
bool - 'true' if successful, 'false' otherwise
Date
2021 torstenm implemented
◆ setParameterConstraint()
 UX_EXPORT_FUNCTION bool AcDbCivilVAlignmentElement::setParameterConstraint  |  ( |  AcDbCivilVAlignmentElement::EParameterConstraint  |  constraint | )
Defines the parameter constraint type for this vertical alignment element.
Parameters
[in] | constraint | - the parameter constraint type to be set for this element
Returns
bool - 'true' if successful, 'false' otherwise
Date
2021 torstenm implemented
◆ setPreviousId()
 UX_EXPORT_FUNCTION bool AcDbCivilVAlignmentElement::setPreviousId  |  ( |  Adesk::UInt64  |  id | )
Defines the previous element ID for the specified element in this vertical alignment element.
Parameters
[in] | id | - the element ID to set as previous element
Returns
bool - 'true' if successful, 'false' otherwise
Date
2021 torstenm implemented
◆ setTangencyConstraint()
 UX_EXPORT_FUNCTION bool AcDbCivilVAlignmentElement::setTangencyConstraint  |  ( |  AcDbCivilVAlignmentElement::ETangencyConstraint  |  constraint | )
Defines the tangency constraint type for this vertical alignment element.
Parameters
[in] | constraint | - the tangency constraint type to be set for this element
Returns
bool - 'true' if successful, 'false' otherwise
Date
2021 torstenm implemented
◆ tangencyConstraint()
 UX_EXPORT_FUNCTION AcDbCivilVAlignmentElement::ETangencyConstraint AcDbCivilVAlignmentElement::tangencyConstraint  |  ( |   | ) |   const
Returns the type of tangency constraint for this vertical alignment element.
Returns
AcDbCivilVAlignmentElement::ETangencyConstraint - the tangency constraint type
Date
2021 torstenm implemented
◆ type()
 UX_EXPORT_FUNCTION AcDbCivilVAlignmentElement::EElementType AcDbCivilVAlignmentElement::type  |  ( |   | ) |   const
Returns the type of this vertical alignment element.
Returns
AcDbCivilVAlignmentElement::EElementType - the element type
Date
2021 torstenm implemented