Public Types | Public Member Functions | List of all members
AcDbHyperlink Class Referenceabstract
_ More...
#include <AcDbHyperlink.h>
 Public Types
enum  | HLinkFlags { kUndefined = 0 , kConvertDwgToDwf }
 Public Member Functions
AcDbHyperlink ()
Default constructor.
 virtual const ACHAR *  | description () const =0
Returns the description of this hyperlink.
 virtual const long  | flags () const
Returns the numbers of flags of this hyperlink.
 virtual const ACHAR *  | getDisplayString () const =0
Returns the display string of this hyperlink.
 virtual const int  | getNestedLevel () const =0
!!! NOT IMPLEMENTED YET.
 virtual bool  | isOutermostContainer () const =0
!!! NOT IMPLEMENTED YET.
 virtual const ACHAR *  | name () const =0
Returns the name of this hyperlink.
virtual void  | setDescription (const ACHAR *)=0
Sets the description of this hyperlink. More...
 virtual void  | setFlags (const long)
virtual void  | setName (const ACHAR *)=0
Sets the name of this hyperlink. More...
 virtual void  | setSubLocation (const ACHAR *)=0
 virtual const ACHAR *  | subLocation () const =0
Returns the subLocation string of this hyperlink.
 virtual  | ~AcDbHyperlink ()
Default destructor.
Detailed Description
_
Member Function Documentation
◆ setDescription()
 void AcDbHyperlink::setDescription  |  ( |  const ACHAR *  |  pDescription | )
pure virtual
Sets the description of this hyperlink.
Parameters
[in] | pDescrip | wanted description
◆ setName()
 void AcDbHyperlink::setName  |  ( |  const ACHAR *  |  pName | )
pure virtual
Sets the name of this hyperlink.
Sets the subLocation string of this hyperlink.
Parameters
[in] | pName | wanted name
[in] | pSubLoc | subLocation string