Public Types | Public Member Functions | List of all members
AcDbMatchProperties Class Referenceabstract
_ More...
#include <AcDbMatchProperties.h>
 Public Types
enum  | Flags {
 kColorFlag = 1 , kLayerFlag = 2 , kLtypeFlag = 4 , kThicknessFlag = 8 ,
 kLtscaleFlag = 16 , kTextFlag = 32 , kDimensionFlag = 64 , kHatchFlag = 128 ,
 kLweightFlag = 256 , kPlotstylenameFlag = 512 , kPolylineFlag = 1024 , kViewportFlag = 2048 ,
 kTableFlag = 4096 , kMaterialFlag = 8192 , kShadowDisplayFlag = 16384 , kMultileaderFlag = 32768 ,
 kTransparencyFlag = 65536 , kSetAllFlagsOn
 }
 Public Member Functions
 virtual void  | copyProperties (AcDbEntity *, AcDbEntity *, unsigned int) const =0
 Public Member Functions inherited from AcRxObject
virtual AcRxObject *  | clone () const
Exported and implemented. More...
 virtual AcRx::Ordering  | comparedTo (const AcRxObject *) const
Exported and implemented.
virtual Acad::ErrorStatus  | copyFrom (const AcRxObject *)
Exported and implemented. More...
 virtual AcRxClass *  | isA () const
Exported and implemented.
virtual Adesk::Boolean  | isEqualTo (const AcRxObject *) const
Exported and implemented. More...
bool  | isKindOf (const AcRxClass *) const
Checks the object class. More...
AcRxObject *  | queryX (const AcRxClass *) const
returns the protocol extension object assigned to this class or a parent class. More...
AcRxObject *  | x (const AcRxClass *) const
returns the protocol extension object assigned to this class or a parent class. More...
 virtual  | ~AcRxObject ()
Destructor.
 Additional Inherited Members
 Static Public Member Functions inherited from AcRxObject
 static AcRxObject *  | cast (const AcRxObject *)
 static AcRxClass *  | desc ()
Exported and implemented.
 Protected Member Functions inherited from AcRxObject
AcRxObject ()
Exported and implemented.
Detailed Description
_