Public Member Functions | Public Attributes | List of all members
AcDbSpline Class Reference
 Public Member Functions
AcDbSpline (const AcGePoint3d &, const AcGeVector3d &, const AcGeVector3d &, double, double=0.0, double=(BRX_PI *2.0))
AcDbSpline (const AcGePoint3dArray &, AcGe::KnotParameterization, int=3, double=0.0)
AcDbSpline (const AcGePoint3dArray &, const AcGeVector3d &, const AcGeVector3d &, AcGe::KnotParameterization, int=3, double=0.0)
AcDbSpline (const AcGePoint3dArray &, const AcGeVector3d &, const AcGeVector3d &, int=4, double=0.0)
AcDbSpline (const AcGePoint3dArray &, int=4, double=0.0)
AcDbSpline (int, Adesk::Boolean, Adesk::Boolean, Adesk::Boolean, const AcGePoint3dArray &, const AcGeDoubleArray &, const AcGeDoubleArray &, double=0.0, double=0.0)
virtual DBCURVE_METHODS bool  | castShadows () const
See AcDbCurve::castShadows() . More...
int  | degree () const
Returns the spline degree. More...
Acad::ErrorStatus  | dwgInFields (AcDbDwgFiler *)
Acad::ErrorStatus  | elevateDegree (int)
Increase degree of spline with values starting from current degree value and finishing with values less or equal than 25. More...
double  | fitTolerance () const
Returns the tolerance value used for curve fitting. More...
Acad::ErrorStatus  | getControlPointAt (int, AcGePoint3d &) const
Returns, via pnt (in WCS coordinates), the value of the control point at position cardinal in the list of control points. More...
Acad::ErrorStatus  | getFitData (AcGePoint3dArray &, Adesk::Boolean &, AcGeVector3d &, AcGeVector3d &, AcGe::KnotParameterization &, int &, double &) const
Gets the spline fit points, tangents and tolerance. More...
Acad::ErrorStatus  | getFitData (AcGePoint3dArray &, int &, double &, Adesk::Boolean &, AcGeVector3d &, AcGeVector3d &) const
Gets the spline fit points, tangents and tolerance. More...
Acad::ErrorStatus  | getFitPointAt (int, AcGePoint3d &) const
Returns with pnt set to the value of the fit point at position cardinal. More...
Acad::ErrorStatus  | getFitTangents (AcGeVector3d &, AcGeVector3d &) const
Returns with startPointTangent and endPointTangent set to the start point and end point tangent vectors in WCS coordinates. More...
Acad::ErrorStatus  | getNurbsData (int &, Adesk::Boolean &, Adesk::Boolean &, Adesk::Boolean &, AcGePoint3dArray &, AcGeDoubleArray &, AcGeDoubleArray &, double &, double &) const
Gets the spline NURBS data. More...
Acad::ErrorStatus  | getOffsetCurvesGivenPlaneNormal (const AcGeVector3d &, double, AcDbVoidPtrArray &) const
Adesk::Boolean  | hasFitData () const
Returns Adesk::kTrue if and only if the spline has fit data associated with it. More...
Acad::ErrorStatus  | insertFitPointAt (int, const AcGePoint3d &)
Adds pnt to the list of fit points and refits the spline. More...
Acad::ErrorStatus  | insertKnot (double)
Inserts a new knot on the current spline at the location given by the input spline parameter parameter. More...
Adesk::Boolean  | isNull () const
If this spline attached object is not present returns true. More...
Adesk::Boolean  | isRational () const
If this spline is rational returns true. More...
Acad::ErrorStatus  | modifyPositionAndTangent (double, const AcGePoint3d &, const AcGeVector3d *)
Adjusts the location and tangent of a point on the spline curve with the given parameter. More...
int  | numControlPoints () const
Returns the number of control points in the spline. More...
int  | numFitPoints () const
Returns the number of fit points in the spline. More...
Acad::ErrorStatus  | purgeFitData ()
If the spline is a fitted spline the function purge the fit data.The spline uses NURBS data or control points. More...
virtual bool  | receiveShadows () const
See AcDbCurve::receiveShadows() . More...
Acad::ErrorStatus  | removeFitPointAt (int)
Removes the fit point with the index specified by position. More...
virtual void  | setCastShadows (bool)
See AcDbCurve::setCastShadows(bool) . More...
Acad::ErrorStatus  | setControlPointAt (int, const AcGePoint3d &)
Sets pnt (in WCS coordinates) to be the control point at the cardinal position in the control points list replacing the point value that was previously at cardinal position. More...
Acad::ErrorStatus  | setFitData (const AcGePoint3dArray &, bool, AcGe::KnotParameterization, int=3, double=0.0)
Assigns the fit data for this spline entity. More...
Acad::ErrorStatus  | setFitData (const AcGePoint3dArray &, const AcGeVector3d &, const AcGeVector3d &, AcGe::KnotParameterization, int=3, double=0.0)
Assigns the fit data for this spline entity. More...
Acad::ErrorStatus  | setFitData (const AcGePoint3dArray &, int, double, const AcGeVector3d &, const AcGeVector3d &)
Sets the spline's data using the given params. More...
Acad::ErrorStatus  | setFitPointAt (int, const AcGePoint3d &)
Sets pnt (in WCS coordinates) to be the fit point at the cardinal position in the fit points list (replacing the point value previously at cardinal) More...
Acad::ErrorStatus  | setFitTangents (const AcGeVector3d &, const AcGeVector3d &)
Sets the start end tangents of spline to be startTangent and endTangent respectively and refits the spline. More...
Acad::ErrorStatus  | setFitTol (double)
Sets value to be the new fit point tolerance for the spline and then refits the spline curve. More...
Acad::ErrorStatus  | setNurbsData (int, Adesk::Boolean, Adesk::Boolean, Adesk::Boolean, const AcGePoint3dArray &, const AcGeDoubleArray &, const AcGeDoubleArray &, double=0., double=0.)
Sets the spline's nurbs data with the given params. More...
virtual void  | setReceiveShadows (bool)
See AcDbCurve::setReceiveShadows(bool) . More...
Acad::ErrorStatus  | setType (SplineType)
Sets the spline type: kFitPoints or kControlPoints. More...
 Acad::ErrorStatus  | setWeightAt (int, double)
Acad::ErrorStatus  | toPolyline (AcDbCurve *&, bool, bool, int=10, int *=NULL, unsigned int=kPlineVerticesThrehold) const
Converts this spline entity into a polyline, based on requested parameters. More...
Acad::ErrorStatus  | toPolyline (AcDbCurve *&, int=10, int *=NULL, unsigned int=kPlineVerticesThrehold) const
Converts this spline entity into a polyline, based on PLINETYPE and PLINECONVERTMODE settings. More...
SplineType  | type () const
Gets the spline type: kFitPoints or kControlPoints. More...
Acad::ErrorStatus  | updateFitData ()
Purges the spline fit data. More...
double  | weightAt (int) const
Returns the spline control point weight at a given parameter. More...
 Public Member Functions inherited from AcDbCurve
virtual Acad::ErrorStatus  | extend (Adesk::Boolean, const AcGePoint3d &)
virtual Acad::ErrorStatus  | extend (double)
 virtual Acad::ErrorStatus  | getAcGeCurve (AcGeCurve3d *&, const AcGeTol &=AcGeContext::gTol) const
virtual Acad::ErrorStatus  | getArea (double &) const
virtual Acad::ErrorStatus  | getClosestPointTo (const AcGePoint3d &, AcGePoint3d &, Adesk::Boolean=Adesk::kFalse) const
virtual Acad::ErrorStatus  | getClosestPointTo (const AcGePoint3d &, const AcGeVector3d &, AcGePoint3d &, Adesk::Boolean=Adesk::kFalse) const
virtual Acad::ErrorStatus  | getDistAtParam (double, double &) const
Gets the length of the curve from its start point to the one given by value. More...
virtual Acad::ErrorStatus  | getDistAtPoint (const AcGePoint3d &, double &) const
Gets the lenght of the curve measured from the start point of the curve to the param ptOnCurve. More...
virtual Acad::ErrorStatus  | getEndParam (double &) const
Gets this curve end parameter. More...
virtual Acad::ErrorStatus  | getEndPoint (AcGePoint3d &) const
Set the passed point to end point of the curve, if successful. More...
virtual Acad::ErrorStatus  | getFirstDeriv (const AcGePoint3d &, AcGeVector3d &) const
Gets the first derivative of the curve at the specified point. More...
virtual Acad::ErrorStatus  | getFirstDeriv (double, AcGeVector3d &) const
Gets the first derivative of the curve at the point with curve parameter of value. More...
virtual Acad::ErrorStatus  | getOffsetCurves (double, AcDbVoidPtrArray &) const
virtual Acad::ErrorStatus  | getOffsetCurvesGivenPlaneNormal (const AcGeVector3d &, double, AcDbVoidPtrArray &) const
virtual Acad::ErrorStatus  | getOrthoProjectedCurve (const AcGePlane &, AcDbCurve *&) const
virtual Acad::ErrorStatus  | getParamAtDist (double, double &) const
Gets the parameter of the curve at a point located along the curve at a distance of length from its start point. More...
virtual Acad::ErrorStatus  | getParamAtPoint (const AcGePoint3d &, double &) const
Gets the parameter of the specified point. More...
virtual Acad::ErrorStatus  | getPointAtDist (double, AcGePoint3d &) const
Gets the point on this curve at the distance lenght measured from the start point. More...
virtual Acad::ErrorStatus  | getPointAtParam (double, AcGePoint3d &) const
Gets the point on the curve specified by the passed in param. More...
virtual Acad::ErrorStatus  | getProjectedCurve (const AcGePlane &, const AcGeVector3d &, AcDbCurve *&) const
virtual Acad::ErrorStatus  | getSecondDeriv (const AcGePoint3d &, AcGeVector3d &) const
virtual Acad::ErrorStatus  | getSecondDeriv (double, AcGeVector3d &) const
 virtual Acad::ErrorStatus  | getSpline (AcDbSpline *&) const
virtual Acad::ErrorStatus  | getSplitCurves (const AcGeDoubleArray &, AcDbVoidPtrArray &) const
virtual Acad::ErrorStatus  | getSplitCurves (const AcGePoint3dArray &, AcDbVoidPtrArray &) const
virtual Acad::ErrorStatus  | getStartParam (double &) const
Gets this curve start parameter. More...
virtual Acad::ErrorStatus  | getStartPoint (AcGePoint3d &) const
Set the passed point to start point of the curve, if successful. More...
virtual Adesk::Boolean  | isClosed () const
Returns whether this curve entity is closed. More...
virtual Adesk::Boolean  | isPeriodic () const
Returns whether this curve entity is periodic. More...
virtual Acad::ErrorStatus  | reverseCurve ()
 virtual Acad::ErrorStatus  | setFromAcGeCurve (const AcGeCurve3d &, AcGeVector3d *=NULL, const AcGeTol &=AcGeContext::gTol)
 virtual  | ~AcDbCurve ()
Destructor.
 Public Member Functions inherited from AcDbEntity
 virtual Acad::ErrorStatus  | addSubentPaths (const AcDbFullSubentPathArray &) final
virtual Acad::ErrorStatus  | applyPartialUndo (AcDbDwgFiler *, AcRxClass *)
virtual Acad::ErrorStatus  | audit (AcDbAuditInfo *)
AcDbObjectId  | blockId () const
Returns the Object ID of the BlockTableRecord that owns this entity. More...
Acad::ErrorStatus  | boundingBoxIntersectWith (const AcDbEntity *, AcDb::Intersect, AcGePoint3dArray &, Adesk::GsMarker, Adesk::GsMarker) const
Finds the intersection between the edges of the bounding box for this entity and the pOhter entity. More...
Acad::ErrorStatus  | boundingBoxIntersectWith (const AcDbEntity *, AcDb::Intersect, const AcGePlane &, AcGePoint3dArray &, Adesk::GsMarker, Adesk::GsMarker) const
First, the function projects the other entity and the bounding box of this entity on plane specified by plane. More...
virtual bool  | bounds (AcDbExtents &) const
Returns the extents of this entity as AcDbExtents. More...
virtual bool  | castShadows () const
Checks if this entity is able to cast shadows. More...
virtual Adesk::Boolean  | cloneMeForDragging () final
Checks if a clone will be created for this entity in case of a drag operation. More...
 virtual AcDb::CollisionType  | collisionType () const
AcCmColor  | color () const
Returns the true color information of the entity. More...
Adesk::UInt16  | colorIndex () const
Returns the color number in a range from 0 to 256. More...
 virtual Acad::ErrorStatus  | deleteSubentPaths (const AcDbFullSubentPathArray &) final
virtual void  | dragStatus (const AcDb::DragStat)
Acad::ErrorStatus  | draw ()
Draws or redraws the entity on screen. More...
virtual AcGiDrawable *  | drawable ()
virtual Acad::ErrorStatus  | dwgInFields (AcDbDwgFiler *)
virtual Acad::ErrorStatus  | dwgOutFields (AcDbDwgFiler *) const
virtual Acad::ErrorStatus  | dxfInFields (AcDbDxfFiler *)
virtual Acad::ErrorStatus  | dxfOutFields (AcDbDxfFiler *) const
AcCmEntityColor  | entityColor () const
Returns the lightweight color information of the entity. More...
virtual Acad::ErrorStatus  | explode (AcDbVoidPtrArray &) const final
virtual Acad::ErrorStatus  | getCompoundObjectTransform (AcGeMatrix3d &) const final
It is used for object without geometry like AcDbMleader. More...
virtual void  | getEcs (AcGeMatrix3d &) const
Returns the transformation matrix from OCS (Object Coordinate System) to WCS (World Coordinate System). More...
virtual Acad::ErrorStatus  | getGeomExtents (AcDbExtents &) const final
Returns extents of this entity. More...
 virtual Acad::ErrorStatus  | getGripEntityUCS (const void *, AcGeVector3d &, AcGePoint3d &, AcGeVector3d &) const final
 virtual Acad::ErrorStatus  | getGripPoints (AcDbGripDataPtrArray &, const double, const int, const AcGeVector3d &, const int) const final
virtual Acad::ErrorStatus  | getGripPoints (AcGePoint3dArray &, AcDbIntArray &, AcDbIntArray &) const final
Append grip points to the specified array. More...
 virtual Acad::ErrorStatus  | getGripPointsAtSubentPath (const AcDbFullSubentPath &, AcDbGripDataPtrArray &, const double, const int, const AcGeVector3d &, const int) const final
virtual Acad::ErrorStatus  | getGsMarkersAtSubentPath (const AcDbFullSubentPath &, AcArray< Adesk::GsMarker > &) const final
virtual Acad::ErrorStatus  | getMaterialMapper (AcGiMapper &) const
virtual Acad::ErrorStatus  | getOsnapPoints (AcDb::OsnapMode, Adesk::GsMarker, const AcGePoint3d &, const AcGePoint3d &, const AcGeMatrix3d &, AcGePoint3dArray &, AcDbIntArray &) const final
Gets the entity osnap points. More...
virtual Acad::ErrorStatus  | getOsnapPoints (AcDb::OsnapMode, Adesk::GsMarker, const AcGePoint3d &, const AcGePoint3d &, const AcGeMatrix3d &, AcGePoint3dArray &, AcDbIntArray &, const AcGeMatrix3d &) const final
Gets the entity osnap points. More...
virtual Acad::ErrorStatus  | getPlane (AcGePlane &, AcDb::Planarity &) const
Returns the plane that contains this entity. More...
AcDb::PlotStyleNameType  | getPlotStyleNameId (AcDbObjectId &) const
Returns the plot style name type and its associated id. More...
virtual Acad::ErrorStatus  | getStretchPoints (AcGePoint3dArray &) const final
Append stretch points to the specified array. More...
 virtual Acad::ErrorStatus  | getSubentClassId (const AcDbFullSubentPath &, CLSID *) const final
 virtual Acad::ErrorStatus  | getSubentPathGeomExtents (const AcDbFullSubentPath &, AcDbExtents &) const final
virtual Acad::ErrorStatus  | getSubentPathsAtGsMarker (AcDb::SubentType, Adesk::GsMarker, const AcGePoint3d &, const AcGeMatrix3d &, int &, AcDbFullSubentPath *&, int=0, AcDbObjectId *=NULL) const final
Gets the subentity paths appropriate for the passed in gs marker. More...
virtual Acad::ErrorStatus  | getTransformedCopy (const AcGeMatrix3d &, AcDbEntity *&) const final
Creates a copy of the current entity applying the transformation matrix. More...
 virtual void  | gripStatus (const AcDb::GripStat) final
virtual AcGsNode *  | gsNode () const
 virtual bool  | hideMeForDragging () const final
virtual Acad::ErrorStatus  | highlight (const AcDbFullSubentPath &=kNullSubent, const Adesk::Boolean=Adesk::kFalse) const final
Highlights part of, or entire entity. More...
virtual Acad::ErrorStatus  | intersectWith (const AcDbEntity *, AcDb::Intersect, AcGePoint3dArray &, Adesk::GsMarker=0, Adesk::GsMarker=0) const final
Finds the intersection between this entity and the pOhter entity. More...
virtual Acad::ErrorStatus  | intersectWith (const AcDbEntity *, AcDb::Intersect, const AcGePlane &, AcGePoint3dArray &, Adesk::GsMarker=0, Adesk::GsMarker=0) const final
Projects this entity and the pOhter entity on plane, finds the intersection points between these projections and then projects back the points onto the caller entity. More...
 virtual bool  | isContentSnappable () const final
virtual Adesk::Boolean  | isPlanar () const
ACHAR *  | layer () const
Returns the layername. More...
AcDbObjectId  | layerId () const
Returns the Object ID of the LayerTableRecord referenced by this entity. More...
ACHAR *  | linetype () const
Gets the linetype value. More...
AcDbObjectId  | linetypeId () const
Gets the linetypeId value. More...
 double  | linetypeScale () const
returns the linetype scale factor for the entity
AcDb::LineWeight  | lineWeight () const
Gets the entity line weight. More...
virtual void  | list () const final
Prints the properties in drawing window. More...
ACHAR *  | material () const
Gets the material assigned to this entity. More...
AcDbObjectId  | materialId () const
Gets the AcDbObjectId of the material assigned to this entity. More...
virtual Acad::ErrorStatus  | moveGripPointsAt (const AcDbIntArray &, const AcGeVector3d &) final
Move the grip points pointed by the indexes specified in indexArray using the translationVector param direction and length Override this method in custom entities to define your own behaviour. More...
 virtual Acad::ErrorStatus  | moveGripPointsAt (const AcDbVoidPtrArray &, const AcGeVector3d &, const int) final
 virtual Acad::ErrorStatus  | moveGripPointsAtSubentPaths (const AcDbFullSubentPathArray &, const AcDbVoidPtrArray &, const AcGeVector3d &, const int) final
virtual Acad::ErrorStatus  | moveStretchPointsAt (const AcDbIntArray &, const AcGeVector3d &) final
Move the stretch points pointed by the indexes specified in indexArray with the offest specified by translationVector Override this method in custom entities to define your own behaviour. More...
ACHAR *  | plotStyleName () const
Returns the name of the plotStyleName string associated with this entity (DXF 390). More...
virtual bool  | receiveShadows () const
Checks if this entity is able to receive shadows. More...
void  | recordGraphicsModified (Adesk::Boolean=Adesk::kTrue)
Controls the entity display update when closing it Entities not updated when closed are updated at the first regen. More...
virtual void  | saveAs (AcGiWorldDraw *, AcDb::SaveType)
Generates the graphics primitives when a DWG save requiring proxy graphics to be saved is made. More...
virtual void  | setCastShadows (bool)
Sets this entity's flag regarding casting shadows. More...
virtual Acad::ErrorStatus  | setColor (const AcCmColor &, Adesk::Boolean=Adesk::kTrue)
Sets the color information of this entity from an AcCmColor instance. More...
virtual Acad::ErrorStatus  | setColor (const AcCmColor &, bool, AcDbDatabase *)
Sets the color property of this entity from an AcCmColor instance. More...
virtual Acad::ErrorStatus  | setColorIndex (Adesk::UInt16, Adesk::Boolean=Adesk::kTrue)
Sets the color index of this entity (DXF 62). More...
void  | setDatabaseDefaults ()
Applies the default properties of the entities database to this entity. More...
void  | setDatabaseDefaults (AcDbDatabase *)
Applies the default properties of the specified database to this entity. More...
virtual void  | setGsNode (AcGsNode *)
virtual Acad::ErrorStatus  | setLayer (AcDbObjectId, Adesk::Boolean=Adesk::kTrue, bool=false)
Sets the layer to be referenced by this entity (DXF 8). More...
virtual Acad::ErrorStatus  | setLayer (const ACHAR *, Adesk::Boolean=Adesk::kTrue, bool=false)
Sets the layer to be referenced by this entity (DXF 8). More...
virtual Acad::ErrorStatus  | setLinetype (AcDbObjectId, Adesk::Boolean=Adesk::kTrue)
Sets the entities linetype to ltypeObjectId. More...
virtual Acad::ErrorStatus  | setLinetype (const ACHAR *, Adesk::Boolean=Adesk::kTrue)
Sets the entities linetype to the linetpye referenced by layerName. More...
virtual Acad::ErrorStatus  | setLinetypeScale (double, Adesk::Boolean=Adesk::kTrue)
sets value as entity linetype scale factor More...
virtual Acad::ErrorStatus  | setLineWeight (AcDb::LineWeight, Adesk::Boolean=Adesk::kTrue)
Sets the entity line weight. More...
virtual Acad::ErrorStatus  | setMaterial (AcDbObjectId, Adesk::Boolean=Adesk::kTrue)
Not implemented yet. More...
virtual Acad::ErrorStatus  | setMaterial (const ACHAR *, Adesk::Boolean=Adesk::kTrue)
Assigns the material to the entity. More...
virtual Acad::ErrorStatus  | setMaterialMapper (const AcGiMapper &, Adesk::Boolean=Adesk::kTrue)
It is used for apply material (scale, rotation, projection, mode overrides) to an identity.If it is used AcGiMapper::kIdentity it will apply for entity a default mapper. More...
virtual Acad::ErrorStatus  | setPlotStyleName (AcDb::PlotStyleNameType, AcDbObjectId=AcDbObjectId::kNull, Adesk::Boolean=Adesk::kTrue)
Sets the plot style of this entity. More...
virtual Acad::ErrorStatus  | setPlotStyleName (const ACHAR *, Adesk::Boolean=Adesk::kTrue)
Sets the plot style of this entity. More...
Acad::ErrorStatus  | setPropertiesFrom (const AcDbEntity *, Adesk::Boolean=Adesk::kTrue)
Copies the properties color, layer, linetype, linetypescale and visibility from the source entity pEntity to this entity. More...
virtual void  | setReceiveShadows (bool)
Sets this entity's flag regarding receiving shadows. More...
virtual Acad::ErrorStatus  | setTransparency (const AcCmTransparency &, Adesk::Boolean=Adesk::kTrue)
Sets the transparency setting of this entity, and returns eOk if successful. More...
virtual Acad::ErrorStatus  | setVisibility (AcDb::Visibility, Adesk::Boolean=Adesk::kTrue) final
notyetdocumented. More...
 virtual Acad::ErrorStatus  | setVisualStyle (AcDbObjectId, VisualStyleType=kFullVisualStyle, Adesk::Boolean=true)
 virtual void  | subentGripStatus (const AcDb::GripStat, const AcDbFullSubentPath &) final
virtual AcDbEntity *  | subentPtr (const AcDbFullSubentPath &) const final
Creates an entity as a copy of the subentity given by acSubentPath. More...
virtual void  | subSetDatabaseDefaults (AcDbDatabase *)
This function is called by AcDbEntity::setDatabaseDefaults(), to allow custom entities to set their related sub entities, if any; default implementation does nothing. More...
virtual Acad::ErrorStatus  | transformBy (const AcGeMatrix3d &) final
Applies given transformation (matrix) to the entity. More...
 virtual Acad::ErrorStatus  | transformSubentPathsBy (const AcDbFullSubentPathArray &, const AcGeMatrix3d &) final
 AcCmTransparency  | transparency () const
Returns the transparency setting of this entity.
virtual Acad::ErrorStatus  | unhighlight (const AcDbFullSubentPath &=kNullSubent, const Adesk::Boolean=Adesk::kFalse) const final
Unhighlights previously highlighted part of entity, or entire entity. More...
AcDb::Visibility  | visibility () const
Gets the visibility state. More...
 AcDbObjectId  | visualStyleId (VisualStyleType=kFullVisualStyle) const
 Public Member Functions inherited from AcDbObject
virtual void  | addPersistentReactor (AcDbObjectId)
Adds a persistent reactor to this object reactor list. More...
void  | addReactor (AcDbObjectReactor *) const
Adds a transient reactor to this object. More...
virtual Acad::ErrorStatus  | applyPartialUndo (AcDbDwgFiler *, AcRxClass *)
This function is called during Undo operations on objects, that use the 'Partial Undo meachanism'; this is, this object is opened with assertWriteEnabled(Adesk::kFalse) to indicate that custom Undo filing is used rather than the default Undo filing. More...
 void  | assertNotifyEnabled () const
 void  | assertReadEnabled () const
 void  | assertWriteEnabled (Adesk::Boolean=Adesk::kTrue, Adesk::Boolean=Adesk::kTrue)
virtual Acad::ErrorStatus  | audit (AcDbAuditInfo *)
Performs the audit operation for this object. More...
Acad::ErrorStatus  | cancel ()
Reverts all changes since the object had been opened and closes the object. More...
virtual void  | cancelled (const AcDbObject *)
A handler function for persistent reactors. More...
virtual AcRxObject *  | clone () const
Creates a shallow clone of this object. More...
Acad::ErrorStatus  | close ()
Closes the object. More...
Acad::ErrorStatus  | closeAndPage (Adesk::Boolean=Adesk::kTrue)
Closes the object. More...
virtual Acad::ErrorStatus  | composeForLoad (AcDb::OdaSaveType, AcDb::AcDbDwgVersion)
This function is intended for future MT file loading support. More...
virtual void  | copied (const AcDbObject *, const AcDbObject *)
A handler function for persistent reactors. More...
virtual Acad::ErrorStatus  | copyFrom (const AcRxObject *)
Copies the pSrc object information in this object. More...
Acad::ErrorStatus  | createExtensionDictionary ()
Creates a dictionary as extension dictionary for this object. More...
AcDbDatabase *  | database () const
Returns the database that contains this object. More...
virtual Acad::ErrorStatus  | decomposeForSave (AcDb::AcDbDwgVersion, AcDbObject *&, AcDbObjectId &, Adesk::Boolean &)
This function is called during dwg and dxf output, to allow a custom object to decompose itself, due to provided dwg/dxf target file version. More...
virtual Acad::ErrorStatus  | deepClone (AcDbObject *, AcDbObject *&, AcDbIdMapping &, Adesk::Boolean=Adesk::kTrue) const final
Clones this object, appends it to the owner pOwner and adds an AcDbIdPair record to the idMap. More...
void  | disableUndoRecording (Adesk::Boolean)
Disables or enables the undo recording for the object. More...
Acad::ErrorStatus  | downgradeOpen ()
Sets the open mode for an object opened for write to be opened for read. More...
Acad::ErrorStatus  | downgradeToNotify (Adesk::Boolean)
Sets the open mode for an object opened for write to be opened for notify. More...
virtual AcGiDrawable *  | drawable ()
Retrieves the AcGiDrawable instance of this object. More...
Acad::ErrorStatus  | dwgIn (AcDbDwgFiler *)
Calls the object's dwgInFields function, and reads any XData if present. More...
virtual Acad::ErrorStatus  | dwgInFields (AcDbDwgFiler *)
Reads the object from the DWG filer. More...
Acad::ErrorStatus  | dwgOut (AcDbDwgFiler *) const
Calls the object's dwgOutFields function, and writes any XData if present. More...
virtual Acad::ErrorStatus  | dwgOutFields (AcDbDwgFiler *) const
Writes the object to the DWG filer. More...
Acad::ErrorStatus  | dxfIn (AcDbDxfFiler *)
Calls the object's dxfInFields function, and reads any XData if present. More...
virtual Acad::ErrorStatus  | dxfInFields (AcDbDxfFiler *)
Reads the object from the DXF filer. More...
Acad::ErrorStatus  | dxfOut (AcDbDxfFiler *, Adesk::Boolean, Adesk::uchar *) const
Calls the object's dxfOutFields function, and writes any XData if present. More...
virtual Acad::ErrorStatus  | dxfOutFields (AcDbDxfFiler *) const
Writes the object to the DXF filer. More...
Acad::ErrorStatus  | erase (Adesk::Boolean=Adesk::kTrue)
Sets the bit that indicates that the object is erased. More...
virtual void  | erased (const AcDbObject *, Adesk::Boolean=Adesk::kTrue)
A handler function for persistent reactors. More...
AcDbObjectId  | extensionDictionary () const
Returns the object id of the extension dictionary for this object. More...
void  | getAcDbHandle (AcDbHandle &) const
Returns handle of this object. More...
Acad::ErrorStatus  | getBinaryData (const ACHAR *, Adesk::Int32 &, char *&) const
Creates a copy of the binary data stored as chunks of maximum 127 bytes in the resbuf chain of this object's extension dictionary xrecord entry given by entryName. More...
int  | getBrxOpenCount () const
This function returns the number of open BRX instances for this object. More...
int  | getBrxOpenState () const
This function returns the BRX object open state flags as bitfields, for diagnostic purpose. More...
virtual Acad::ErrorStatus  | getClassID (CLSID *) const final
Gets the COM wrapper Class ID for this entity. More...
int  | getCustomObjectState () const
This function returns the custom object status : 1=isCustomObject 2=DifferentialUndoDisabled. More...
Acad::ErrorStatus  | getField (const ACHAR *, AcDbField *&, AcDb::OpenMode) const
Retrieves the specified Field from this object, and opens it in mode. More...
Acad::ErrorStatus  | getField (const ACHAR *, AcDbObjectId &) const
Gets the pszPropName field object from field dictionary of this AcDbObject object, using pszPropName as key. More...
AcDbObjectId  | getFieldDictionary () const
Returns the Field dictionary associated with this object,. More...
Acad::ErrorStatus  | getFieldDictionary (AcDbDictionary *&, AcDb::OpenMode) const
Gets and opens the field dictionary for this. More...
Acad::ErrorStatus  | getObjectBirthVersion (AcDb::AcDbDwgVersion &, AcDb::MaintenanceReleaseVersion &)
This function is currently not supported by the CAD engine, always returns Acad::eOk, and 'kDHL_CURRENT' + 'kMReleaseCurrent' results. More...
virtual Acad::ErrorStatus  | getObjectSaveVersion (const AcDbDwgFiler *, AcDb::AcDbDwgVersion &, AcDb::MaintenanceReleaseVersion &)
Returns the DWG version for saving the object. More...
virtual Acad::ErrorStatus  | getObjectSaveVersion (const AcDbDxfFiler *, AcDb::AcDbDwgVersion &, AcDb::MaintenanceReleaseVersion &)
Returns the DWG version for saving the object. More...
int  | getOdaOpenCount () const
This function returns the number of open ODA instances for this object. More...
int  | getOdaOpenState () const
This function returns the ODA object open state flags as bitfields, for diagnostic purpose. More...
virtual void  | goodbye (const AcDbObject *)
A handler function for persistent reactors. More...
virtual AcGsNode *  | gsNode () const
Gets the AcGsNode (graphics cache) for this entity. More...
Acad::ErrorStatus  | handOverTo (AcDbObject *, Adesk::Boolean=Adesk::kTrue, Adesk::Boolean=Adesk::kTrue)
Hands over objects identity to another object. More...
bool  | hasFields () const
Return true if this object has single or multiple fields associated with him. More...
bool  | hasPersistentReactor (AcDbObjectId) const
Checks the input objectId in this object reactor list. More...
bool  | hasSaveVersionOverride ()
This function indicates whether this object overrides the filer's save version. More...
virtual AcDbObjectId  | id () const
Returns the database id of this object. More...
Adesk::Boolean  | isAcDbObjectIdsInFlux () const
Checks whether a deep clone operation was completed. More...
Adesk::Boolean  | isAProxy () const
Adesk::Boolean  | isCancelling () const
Adesk::Boolean  | isErased () const
Returns whether this object is erased. More...
Adesk::Boolean  | isEraseStatusToggled () const
Checks whether the object erase status has been toggled. More...
Adesk::Boolean  | isModified () const
Returns whether this object's assertWriteEnabled() has been called since it was opened. More...
Adesk::Boolean  | isModifiedGraphics () const
Checks whether this object graphics will be updated when the object is closed. More...
Adesk::Boolean  | isModifiedXData () const
Checks whether this object's xData was modified. More...
Adesk::Boolean  | isNewObject () const
Returns true if and only if this object has not been closed since it was created. More...
Adesk::Boolean  | isNotifyEnabled () const
Returns whether this object is opened for notify. More...
Adesk::Boolean  | isNotifying () const
virtual Adesk::Boolean  | isPersistent () const
Returns the 'persistent' status of a database object. More...
Adesk::Boolean  | isReadEnabled () const
Returns whether this object is opened for read. More...
 Adesk::Boolean  | isReallyClosing () const
Checks whether the next close call will completely close this object return true if on the next call the object will be completely closed false otherwise.
Adesk::Boolean  | isTransactionResident () const
Gets the object transaction status. More...
Adesk::Boolean  | isUndoing () const
bool  | isUndoRecordingDisabled () const
Returns whether the undo recording for the object is enabled or not. More...
Adesk::Boolean  | isWriteEnabled () const
Returns whether this object is opened for write. More...
virtual AcDb::DuplicateRecordCloning  | mergeStyle () const
Returns the object's merge behavior during cloning. More...
virtual void  | modified (const AcDbObject *)
A handler function for persistent reactors. More...
virtual void  | modifiedGraphics (const AcDbEntity *)
A handler function for persistent reactors. More...
virtual void  | modifiedXData (const AcDbObject *)
A handler function for persistent reactors. More...
virtual void  | modifyUndone (const AcDbObject *)
A handler function for persistent reactors. More...
virtual void  | objectClosed (const AcDbObjectId)
A handler function for persistent reactors. More...
AcDbObjectId  | objectId () const
Returns object id. More...
virtual void  | openedForModify (const AcDbObject *)
A handler function for persistent reactors. More...
AcDbObjectId  | ownerId () const
Returns object id of the owner. More...
AcDbVoidPtrArray *  | reactors ()
Gets the object pointers to reactors. More...
const AcDbVoidPtrArray *  | reactors () const
Gets the object pointers to reactors. More...
virtual void  | reappended (const AcDbObject *)
A handler function for persistent reactors. More...
 virtual void  | recvPropagateModify (const AcDbObject *)
Not implemented yet.
Acad::ErrorStatus  | releaseExtensionDictionary ()
Removes the extension dictionary associated with this object. More...
virtual Acad::ErrorStatus  | removeField (AcDbObjectId)
Removes the Field specified by acFieldId from this object. More...
virtual Acad::ErrorStatus  | removeField (const ACHAR *)
Removes the Field specified by szKeyString from this object. More...
virtual Acad::ErrorStatus  | removeField (const ACHAR *, AcDbObjectId &)
Removes the Field specified by acPszKeyString from this object, and returns its ObjectId value. More...
virtual Acad::ErrorStatus  | removePersistentReactor (AcDbObjectId)
Removes a persistent reactor from this object reactor list. More...
void  | removeReactor (AcDbObjectReactor *) const
Removes a transient reactor to this object. More...
void  | setAcDbObjectIdsInFlux ()
Call this function to indicate that the object IDs of this object and its sub-objects (if any) are not yet valid. More...
Acad::ErrorStatus  | setBinaryData (const ACHAR *, Adesk::Int32, const char *)
Creates a copy of the binary data, divides it in up to 127 bytes binary chunks and
 sets them as resbufs in the resbuf chain of this object's extension dictionary xrecord entry given by entryName. More...
virtual Acad::ErrorStatus  | setField (const ACHAR *, AcDbField *, AcDbObjectId &)
Adds the pAcField field object to field dictionary of this AcDbObject object, using pKey as key. More...
virtual void  | setGsNode (AcGsNode *)
Gets the AcGsNode (graphics cache) for this entity. More...
void  | setHasSaveVersionOverride (bool)
This function can be called to specify that the object has a "save version override". More...
virtual Acad::ErrorStatus  | setOwnerId (AcDbObjectId)
Sets the ownerId data member of the object to be objId. More...
virtual Acad::ErrorStatus  | setXData (const resbuf *)
Sets/removes xData associated with this object. More...
virtual Acad::ErrorStatus  | subCancel ()
Possibility to veto a cancel operation from within custom entities. More...
virtual Acad::ErrorStatus  | subClose ()
virtual Acad::ErrorStatus  | subErase (Adesk::Boolean)
This hook is called during an AcDbObject::erase call, before any actual erase operation is performed. More...
 virtual Acad::ErrorStatus  | subHandOverTo (AcDbObject *)
virtual void  | subObjModified (const AcDbObject *, const AcDbObject *)
A handler function for persistent reactors. More...
 virtual Acad::ErrorStatus  | subOpen (AcDb::OpenMode)
virtual Acad::ErrorStatus  | subSwapIdWith (AcDbObjectId, Adesk::Boolean=Adesk::kFalse, Adesk::Boolean=Adesk::kFalse)
This hook is called during an AcDbObject::swapIdWith() call, before any actual swap operation is performed. More...
Acad::ErrorStatus  | swapIdWith (AcDbObjectId, Adesk::Boolean=Adesk::kFalse, Adesk::Boolean=Adesk::kFalse)
Swaps the object id's between the object identified by param swapId and this object. More...
virtual Acad::ErrorStatus  | swapReferences (const AcDbIdMapping &)
Not implemented yet. More...
virtual void  | unappended (const AcDbObject *)
A handler function for persistent reactors. More...
AcDbDwgFiler *  | undoFiler ()
Gets the undo filer for this object. More...
Acad::ErrorStatus  | upgradeFromNotify (Adesk::Boolean &)
Upgrades the open status of this object to AcDb::kForWrite, if this object is already open (either in AcDb::kForRead, AcDb::kForNotify or AcDb::kForWrite) More...
Acad::ErrorStatus  | upgradeOpen ()
Changes the objects open mode to AcDb::kForWrite and sends notifications. More...
virtual Acad::ErrorStatus  | wblockClone (AcRxObject *, AcDbObject *&, AcDbIdMapping &, Adesk::Boolean=Adesk::kTrue) const final
Clones this object, appends it to the owner pOwner and adds an AcDbIdPair record to the idMap. More...
virtual resbuf *  | xData (const ACHAR *=NULL) const
Returns the xData associated with this object. More...
Acad::ErrorStatus  | xDataTransformBy (const AcGeMatrix3d &)
Transforms the extended data according to parameter transformation matrix. More...
 virtual void  | xmitPropagateModify () const
Not implemented yet.
 virtual  | ~AcDbObject ()
Destructor.
 Public Member Functions inherited from AcGiDrawable
virtual bool  | bounds (AcDbExtents &) const
virtual DrawableType  | drawableType () const
 virtual AcGiDrawStream *  | drawStream () const
virtual AcGsNode *  | gsNode () const =0
virtual AcDbObjectId  | id () const =0
virtual Adesk::Boolean  | isPersistent () const =0
virtual Adesk::UInt32  | regenSupportFlags () const final
Returns whether and to which level this object supports MultiThreading. More...
 virtual Adesk::Boolean  | RolloverHit (Adesk::ULongPtr, Adesk::ULongPtr, Adesk::Boolean)
 virtual Adesk::UInt32  | setAttributes (AcGiDrawableTraits *) final
 virtual void  | setDrawStream (AcGiDrawStream *)
virtual void  | setGsNode (AcGsNode *)=0
 virtual void  | viewportDraw (AcGiViewportDraw *) final
 virtual Adesk::UInt32  | viewportDrawLogicalFlags (AcGiViewportDraw *) final
 virtual Adesk::Boolean  | worldDraw (AcGiWorldDraw *) final
 Public Member Functions inherited from AcRxObject
virtual AcRxObject *  | clone () const
Exported and implemented. More...
 virtual AcRx::Ordering  | comparedTo (const AcRxObject *) const
Exported and implemented.
virtual Acad::ErrorStatus  | copyFrom (const AcRxObject *)
Exported and implemented. More...
 virtual AcRxClass *  | isA () const
Exported and implemented.
virtual Adesk::Boolean  | isEqualTo (const AcRxObject *) const
Exported and implemented. More...
bool  | isKindOf (const AcRxClass *) const
Checks the object class. More...
AcRxObject *  | queryX (const AcRxClass *) const
returns the protocol extension object assigned to this class or a parent class. More...
AcRxObject *  | x (const AcRxClass *) const
returns the protocol extension object assigned to this class or a parent class. More...
 virtual  | ~AcRxObject ()
Destructor.
 Public Attributes
AcDbSpline
Default constructor. More...
 Public Attributes inherited from AcDbCurve
AcDbCurve
Default constructor.
 Public Attributes inherited from AcDbEntity
AcDbEntity
This protected constructor sets the initial value for color to 257, and for the objectids for layer and linetype to AcDbObjectId::kNull. More...
 Additional Inherited Members
 Public Types inherited from AcDbEntity
enum  | VisualStyleType { kFullVisualStyle = 0 , kFaceVisualStyle = 1 , kEdgeVisualStyle = 2 }
 Public Types inherited from AcGiDrawable
enum  | DrawableType {
 kGeometry = 0 , kDistantLight , kPointLight , kSpotLight ,
 kAmbientLight , kSolidBackground , kGradientBackground , kImageBackground ,
 kGroundPlaneBackground , kViewport
 }
enum  | SetAttributesFlags {
 kDrawableNone = 0 , kDrawableIsAnEntity = 1 , kDrawableUsesNesting = 2 , kDrawableIsCompoundObject = 4 ,
 kDrawableViewIndependentViewportDraw = 8 , kDrawableIsInvisible = 16 , kDrawableHasAttributes = 32 , kDrawableRegenTypeDependentGeometry = 64 ,
 kDrawableIsDimension = 133 , kDrawableRegenDraw = 256 , kDrawableStandardDisplaySingleLOD = 512 , kDrawableShadedDisplaySingleLOD = 1024 ,
 kDrawableViewDependentViewportDraw = 2048 , kDrawableBlockDependentViewportDraw = 4096 , kDrawableIsExternalReference = 8192 , kDrawableNotPlottable = 16384 ,
 kDrawableNotAllowLCS = 32768 , kDrawableMergeControlOff = 65536 , kThreadedWorldDrawViewportDraw = 131072
 }
 Static Public Member Functions inherited from AcDbCurve
 static Acad::ErrorStatus  | createFromAcGeCurve (const AcGeCurve3d &, AcDbCurve *&, AcGeVector3d *=NULL, const AcGeTol &=AcGeContext::gTol)
 Static Public Member Functions inherited from AcRxObject
 static AcRxObject *  | cast (const AcRxObject *)
 static AcRxClass *  | desc ()
Exported and implemented.
 Static Public Member Functions inherited from AcHeapOperators
 static void  | operator delete (void *)
_
 static void  | operator delete (void *, const char *, int)
 static void  | operator delete (void *, void *)
 static void  | operator delete[] (void *)
_
 static void  | operator delete[] (void *, const char *, int)
 static void *  | operator new (size_t)
_
 static void *  | operator new (size_t, const char *, int)
 static void *  | operator new (size_t, void *p)
 static void *  | operator new[] (size_t)
_
 static void *  | operator new[] (size_t, const char *, int)
 Protected Member Functions inherited from AcDbEntity
 virtual Acad::ErrorStatus  | subAddSubentPaths (const AcDbFullSubentPathArray &)
 virtual Adesk::Boolean  | subCloneMeForDragging ()
 virtual Acad::ErrorStatus  | subDeleteSubentPaths (const AcDbFullSubentPathArray &)
virtual Acad::ErrorStatus  | subExplode (AcDbVoidPtrArray &) const
 virtual Acad::ErrorStatus  | subGetCompoundObjectTransform (AcGeMatrix3d &) const
virtual Acad::ErrorStatus  | subGetGeomExtents (AcDbExtents &) const
virtual Acad::ErrorStatus  | subGetGripEntityUCS (const void *, AcGeVector3d &, AcGePoint3d &, AcGeVector3d &) const
virtual Acad::ErrorStatus  | subGetGripPoints (AcDbGripDataPtrArray &, const double, const int, const AcGeVector3d &, const int) const
virtual Acad::ErrorStatus  | subGetGripPoints (AcGePoint3dArray &, AcDbIntArray &, AcDbIntArray &) const
 virtual Acad::ErrorStatus  | subGetGripPointsAtSubentPath (const AcDbFullSubentPath &, AcDbGripDataPtrArray &, const double, const int, const AcGeVector3d &, const int) const
virtual Acad::ErrorStatus  | subGetGsMarkersAtSubentPath (const AcDbFullSubentPath &, AcArray< Adesk::GsMarker > &) const
virtual Acad::ErrorStatus  | subGetOsnapPoints (AcDb::OsnapMode, Adesk::GsMarker, const AcGePoint3d &, const AcGePoint3d &, const AcGeMatrix3d &, AcGePoint3dArray &, AcDbIntArray &) const
 virtual Acad::ErrorStatus  | subGetOsnapPoints (AcDb::OsnapMode, Adesk::GsMarker, const AcGePoint3d &, const AcGePoint3d &, const AcGeMatrix3d &, AcGePoint3dArray &, AcDbIntArray &, const AcGeMatrix3d &) const
virtual Acad::ErrorStatus  | subGetStretchPoints (AcGePoint3dArray &) const
 virtual Acad::ErrorStatus  | subGetSubentClassId (const AcDbFullSubentPath &, CLSID *) const
 virtual Acad::ErrorStatus  | subGetSubentPathGeomExtents (const AcDbFullSubentPath &, AcDbExtents &) const
virtual Acad::ErrorStatus  | subGetSubentPathsAtGsMarker (AcDb::SubentType, Adesk::GsMarker, const AcGePoint3d &, const AcGeMatrix3d &, int &, AcDbFullSubentPath *&, int=0, AcDbObjectId *=nullptr) const
virtual Acad::ErrorStatus  | subGetTransformedCopy (const AcGeMatrix3d &, AcDbEntity *&) const
virtual void  | subGripStatus (const AcDb::GripStat)
 virtual bool  | subHideMeForDragging () const
virtual Acad::ErrorStatus  | subHighlight (const AcDbFullSubentPath &=kNullSubent, const Adesk::Boolean=false) const
virtual Acad::ErrorStatus  | subIntersectWith (const AcDbEntity *, AcDb::Intersect, AcGePoint3dArray &, Adesk::GsMarker=0, Adesk::GsMarker=0) const
virtual Acad::ErrorStatus  | subIntersectWith (const AcDbEntity *, AcDb::Intersect, const AcGePlane &, AcGePoint3dArray &, Adesk::GsMarker=0, Adesk::GsMarker=0) const
virtual bool  | subIsContentSnappable () const
virtual void  | subList () const
virtual Acad::ErrorStatus  | subMoveGripPointsAt (const AcDbIntArray &, const AcGeVector3d &)
virtual Acad::ErrorStatus  | subMoveGripPointsAt (const AcDbVoidPtrArray &, const AcGeVector3d &, const int)
 virtual Acad::ErrorStatus  | subMoveGripPointsAtSubentPaths (const AcDbFullSubentPathArray &, const AcDbVoidPtrArray &, const AcGeVector3d &, const int)
virtual Acad::ErrorStatus  | subMoveStretchPointsAt (const AcDbIntArray &, const AcGeVector3d &)
virtual Adesk::UInt32  | subSetAttributes (AcGiDrawableTraits *)
Sets the values of this object's subentity traits and returns with the calling object's subentity traits. More...
virtual Acad::ErrorStatus  | subSetVisibility (AcDb::Visibility, Adesk::Boolean=true)
 virtual void  | subSubentGripStatus (const AcDb::GripStat, const AcDbFullSubentPath &)
virtual AcDbEntity *  | subSubentPtr (const AcDbFullSubentPath &) const
virtual Acad::ErrorStatus  | subTransformBy (const AcGeMatrix3d &)
 virtual Acad::ErrorStatus  | subTransformSubentPathsBy (const AcDbFullSubentPathArray &, const AcGeMatrix3d &)
virtual Acad::ErrorStatus  | subUnhighlight (const AcDbFullSubentPath &=kNullSubent, const Adesk::Boolean=false) const
virtual void  | subViewportDraw (AcGiViewportDraw *)
 virtual AcDb::Visibility  | subVisibility () const
virtual Adesk::Boolean  | subWorldDraw (AcGiWorldDraw *)
 Protected Member Functions inherited from AcDbObject
virtual Acad::ErrorStatus  | subDeepClone (AcDbObject *, AcDbObject *&, AcDbIdMapping &, Adesk::Boolean=true) const
virtual Acad::ErrorStatus  | subGetClassID (CLSID *) const
virtual Adesk::UInt32  | subSetAttributes (AcGiDrawableTraits *)
Sets the values of this object's subentity traits and returns with the calling object's subentity traits. More...
virtual void  | subViewportDraw (AcGiViewportDraw *)
virtual Adesk::UInt32  | subViewportDrawLogicalFlags (AcGiViewportDraw *)
virtual Acad::ErrorStatus  | subWblockClone (AcRxObject *, AcDbObject *&, AcDbIdMapping &, Adesk::Boolean=true) const
virtual Adesk::Boolean  | subWorldDraw (AcGiWorldDraw *)
 Protected Member Functions inherited from AcGiDrawable
virtual Adesk::UInt32  | subRegenSupportFlags () const
Returns whether and to which level this object supports MultiThreading. More...
virtual Adesk::UInt32  | subSetAttributes (AcGiDrawableTraits *)=0
virtual void  | subViewportDraw (AcGiViewportDraw *)=0
 virtual Adesk::UInt32  | subViewportDrawLogicalFlags (AcGiViewportDraw *)
virtual Adesk::Boolean  | subWorldDraw (AcGiWorldDraw *)=0
 Protected Member Functions inherited from AcRxObject
AcRxObject ()
Exported and implemented.
Member Function Documentation
◆ castShadows()
 UX_EXPORT_FUNCTION bool AcDbSpline::castShadows  |  ( |   | ) |   const
virtual
See AcDbCurve::castShadows() .
Returns
always false for this type
Reimplemented from AcDbEntity.
◆ degree()
 UX_EXPORT_FUNCTION int AcDbSpline::degree  |  ( |   | ) |   const
Returns the spline degree.
Returns
spline degree
◆ dwgInFields()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbSpline::dwgInFields  |  ( |  AcDbDwgFiler *  |  dwgFiler | )
virtual
Reimplemented from AcDbEntity.
◆ elevateDegree()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbSpline::elevateDegree  |  ( |  int  |  degree | )
Increase degree of spline with values starting from current degree value and finishing with values less or equal than 25.
Degree of spline cannot be less then current degree.
Parameters
[in] | degree | new degree of spline
Returns
Acad::eOk if successful Acad::eGeneralModelingFailure otherwise
◆ fitTolerance()
 UX_EXPORT_FUNCTION double AcDbSpline::fitTolerance  |  ( |  void  |   | ) |   const
Returns the tolerance value used for curve fitting.
This is the maximum distance (in drawing units) that the spline curve is allowed to deviate from the fit points
Date
2009-04-28 arturs added support for closed objects
 2007-08-03 laurentiuv created
◆ getControlPointAt()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbSpline::getControlPointAt  |  ( |  int  |  cardinal,
|  AcGePoint3d &  |  pnt
) |   |  const
Returns, via pnt (in WCS coordinates), the value of the control point at position cardinal in the list of control points.
If cardinal is negative or more than the number of control points in the spline, then point is set to the last control point.
Date
2009-04-28 arturs added support for closed objects
 2007-08-06 laurentiuv created
◆ getFitData() [1/2]
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbSpline::getFitData  |  ( |  AcGePoint3dArray &  |  pointsArray,
|  Adesk::Boolean &  |  tangentsUsed,
|  AcGeVector3d &  |  sTangent,
|  AcGeVector3d &  |  eTangent,
|  AcGe::KnotParameterization &  |  parameter,
|  int &  |  splineOrder,
|  double &  |  tolerance
) |   |  const
Gets the spline fit points, tangents and tolerance.
Parameters
[out] | pointsArray | - array of fit points
[out] | tangentsUsed | - specifies whether any tanget is used
[out] | sTangent | - tangent at start point
[out] | eTangent | - tangent at end point
[out] | parameter | - the knot parameterization
[out] | splineOrder | - the spline degree
[out] | tolerance | - used tolerance
Returns
Acad::eOk if successful, errorcode otherwise
Date
2021-12-21 torstenm implemented
◆ getFitData() [2/2]
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbSpline::getFitData  |  ( |  AcGePoint3dArray &  |  pointsArray,
|  int &  |  splineDegree,
|  double &  |  tolerance,
|  Adesk::Boolean &  |  isTangent,
|  AcGeVector3d &  |  startTan,
|  AcGeVector3d &  |  endTan
) |   |  const
Gets the spline fit points, tangents and tolerance.
Parameters
[out] | pointsArray | array of fit points
[out] | splineDegree
[out] | tolerance | spline fit tolerance
[out] | isTangent | true if there are endpoint tangents, false otherwise
[out] | startTan | start tangent
[out] | endTan | end tangent
Returns
Acad::eOk if successful, errorcode otherwise
Date
2009-04-28 arturs added support for closed objects
 2009-03-26 arturs adjusted return error code
 2007-09-29 laurentiuv created
◆ getFitPointAt()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbSpline::getFitPointAt  |  ( |  int  |  cardinal,
|  AcGePoint3d &  |  pnt
) |   |  const
Returns with pnt set to the value of the fit point at position cardinal.
Date
2007-08-06 laurentiuv created
◆ getFitTangents()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbSpline::getFitTangents  |  ( |  AcGeVector3d &  |  startPointTangent,
|  AcGeVector3d &  |  endPointTangent
) |   |  const
Returns with startPointTangent and endPointTangent set to the start point and end point tangent vectors in WCS coordinates.
Date
2009-04-28 arturs added support for closed objects
 2007-08-06 laurentiuv created
◆ getNurbsData()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbSpline::getNurbsData  |  ( |  int &  |  splineDegree,
|  Adesk::Boolean &  |  isRational,
|  Adesk::Boolean &  |  isClosed,
|  Adesk::Boolean &  |  isPeriodic,
|  AcGePoint3dArray &  |  ctrlPntArray,
|  AcGeDoubleArray &  |  knotArray,
|  AcGeDoubleArray &  |  weightArray,
|  double &  |  ctrlPntTol,
|  double &  |  knotTolValue
) |   |  const
Gets the spline NURBS data.
Parameters
[out] | splineDegree | spline degree
[out] | isRational | kTrue for rational spline
[out] | isClosed | kTrue for closed spline
[out] | isPeriodic | kTrue for periodic spline
[out] | ctrlPntArray | control point array
[out] | knotArray | knot array
[out] | weightArray | weight array
[out] | pointTolerance | tolerance used for the control points
[out] | knotTolerance | tolerance used for the knot values
Returns
Acad::eOk
◆ getOffsetCurvesGivenPlaneNormal()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbSpline::getOffsetCurvesGivenPlaneNormal  |  ( |  const AcGeVector3d &  |  normVector,
|  double  |  distance,
|  AcDbVoidPtrArray &  |  curveArray
) |   |  const
virtual
See also
AcDbCurve::getOffsetCurvesGivenPlaneNormal(const AcGeVector3d&, double, AcDbVoidPtrArray&)
Reimplemented from AcDbCurve.
◆ hasFitData()
 UX_EXPORT_FUNCTION Adesk::Boolean AcDbSpline::hasFitData  |  ( |   | ) |   const
Returns Adesk::kTrue if and only if the spline has fit data associated with it.
Date
2009-04-28 arturs added support for closed objects
 2007-08-07 laurentiuv created
◆ insertFitPointAt()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbSpline::insertFitPointAt  |  ( |  int  |  cardinal,
|  const AcGePoint3d &  |  pnt
)
Adds pnt to the list of fit points and refits the spline.
pnt is added at the cardinal position in the fit points list. If cardinal is negative, then pnt is added at the beginning of the spline. If cardinal is greater than the number of fit points in the spline, then pnt is added at the end of the spline.
Date
2010-01-28 danielm corrected returned error status and added support for negative or bigger than numFitPoints cardinal value, as specified in ObjectArx documentation
 2007-08-06 laurentiuv created
◆ insertKnot()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbSpline::insertKnot  |  ( |  double  |  parameter | )
Inserts a new knot on the current spline at the location given by the input spline parameter parameter.
Parameters
[in] | parameter | parameter on the spline where the new knot will be inserted. Must be within the spline's parameter range.
Returns
Acad::eOk if successful Acad::eGeneralModelingFailure otherwise
◆ isNull()
 UX_EXPORT_FUNCTION Adesk::Boolean AcDbSpline::isNull  |  ( |   | ) |   const
If this spline attached object is not present returns true.
Returns
true if the spline attached object is not present
false otherwise
◆ isRational()
 UX_EXPORT_FUNCTION Adesk::Boolean AcDbSpline::isRational  |  ( |   | ) |   const
If this spline is rational returns true.
Returns
true if the spline is rational
false otherwise
◆ modifyPositionAndTangent()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbSpline::modifyPositionAndTangent  |  ( |  double  |  param,
|  const AcGePoint3d &  |  point,
|  const AcGeVector3d *  |  deriv
)
Adjusts the location and tangent of a point on the spline curve with the given parameter.
The local control points are adjusted accordingly. If deriv is null, only the location of the point is adjusted.
Parameters
[in] | param | - parameter
[out] | point | - specify the new location of the point on the spline curve
[in] | deriv | - Specify the tangent vector
Returns
Acad::eOk if successfull, error code otherwise
◆ numControlPoints()
 UX_EXPORT_FUNCTION int AcDbSpline::numControlPoints  |  ( |   | ) |   const
Returns the number of control points in the spline.
Date
2009-04-28 arturs added support for closed objects
 2007-08-03 laurentiuv created
◆ numFitPoints()
 UX_EXPORT_FUNCTION int AcDbSpline::numFitPoints  |  ( |   | ) |   const
Returns the number of fit points in the spline.
Date
2009-04-28 arturs added support for closed objects
 2007-08-03 laurentiuv created
◆ purgeFitData()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbSpline::purgeFitData  |  ( |   | )
If the spline is a fitted spline the function purge the fit data.The spline uses NURBS data or control points.
Returns
Acad::eOk if successful, Acad::eGeneralModelingFailure code otherwise
◆ receiveShadows()
 UX_EXPORT_FUNCTION bool AcDbSpline::receiveShadows  |  ( |   | ) |   const
virtual
See AcDbCurve::receiveShadows() .
Returns
always false for this type
Reimplemented from AcDbEntity.
◆ removeFitPointAt()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbSpline::removeFitPointAt  |  ( |  int  |  position | )
Removes the fit point with the index specified by position.
The spline is then refitted. The spline must have three or more fit points for this function to succeed.
Parameters
[in] | position | index of the fit point that will be removed
Returns
Acad::eOk if successful Acad::eInvalidInput if position is not a valid index Acad::eGeneralModelingFailure if the spline has 2 or less fit points or can't be refitted
◆ setCastShadows()
 UX_EXPORT_FUNCTION void AcDbSpline::setCastShadows  |  ( |  bool  |  value | )
virtual
See AcDbCurve::setCastShadows(bool) .
Parameters
[in] | value | ignored
Reimplemented from AcDbEntity.
◆ setControlPointAt()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbSpline::setControlPointAt  |  ( |  int  |  cardinal,
|  const AcGePoint3d &  |  pnt
)
Sets pnt (in WCS coordinates) to be the control point at the cardinal position in the control points list replacing the point value that was previously at cardinal position.
Date
2007-08-06 laurentiuv created
◆ setFitData() [1/3]
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbSpline::setFitData  |  ( |  const AcGePoint3dArray &  |  pointsArray,
|  bool  |  isPeriodic,
|  AcGe::KnotParameterization  |  parameter,
|  int  |  splineOrder = 3,
|  double  |  tolerance = 0.0
)
Assigns the fit data for this spline entity.
Parameters
[out] | pointsArray | - array of fit points
[out] | isPeriodic | - ignored
[out] | parameter | - the knot parameterization
[out] | splineOrder | - the spline degree
[out] | tolerance | - used tolerance
Returns
Acad::eOk if successful, errorcode otherwise
Date
2021-12-21 torstenm implemented
◆ setFitData() [2/3]
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbSpline::setFitData  |  ( |  const AcGePoint3dArray &  |  pointsArray,
|  const AcGeVector3d &  |  sTangent,
|  const AcGeVector3d &  |  eTangent,
|  AcGe::KnotParameterization  |  parameter,
|  int  |  splineOrder = 3,
|  double  |  tolerance = 0.0
)
Assigns the fit data for this spline entity.
Parameters
[out] | pointsArray | - array of fit points
[out] | sTangent | - tangent at start point
[out] | eTangent | - tangent at end point
[out] | parameter | - the knot parameterization
[out] | splineOrder | - the spline degree
[out] | tolerance | - used tolerance
Returns
Acad::eOk if successful, errorcode otherwise
Date
2021-12-21 torstenm implemented
◆ setFitData() [3/3]
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbSpline::setFitData  |  ( |  const AcGePoint3dArray &  |  pointsArray,
|  int  |  splineDegree,
|  double  |  tolerance,
|  const AcGeVector3d &  |  startTan,
|  const AcGeVector3d &  |  endTan
)
Sets the spline's data using the given params.
Returns
Acad::eOk, if successful
Acad::eGeneralModelingFailure otherwise
◆ setFitPointAt()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbSpline::setFitPointAt  |  ( |  int  |  cardinal,
|  const AcGePoint3d &  |  pnt
)
Sets pnt (in WCS coordinates) to be the fit point at the cardinal position in the fit points list (replacing the point value previously at cardinal)
Date
2010-08-06 danielm corrected call to corresponding DD function setFitPointAt() and not insertFitPointAt(), corrected case when changing first or last fit point of a closed spline, added code to return error status when an invalid index is inputted, added test
 2007-08-06 laurentiuv created
◆ setFitTangents()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbSpline::setFitTangents  |  ( |  const AcGeVector3d &  |  startTangent,
|  const AcGeVector3d &  |  endTangent
)
Sets the start end tangents of spline to be startTangent and endTangent respectively and refits the spline.
Date
2007-08-06 laurentiuv created
◆ setFitTol()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbSpline::setFitTol  |  ( |  double  |  value | )
Sets value to be the new fit point tolerance for the spline and then refits the spline curve.
If value is 0, then the spline passes through all the fit points
Date
2007-08-03 laurentiuv created
◆ setNurbsData()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbSpline::setNurbsData  |  ( |  int  |  splineDegree,
|  Adesk::Boolean  |  isRational,
|  Adesk::Boolean  |  isClosed,
|  Adesk::Boolean  |  isPeriodic,
|  const AcGePoint3dArray &  |  ctrlPntArray,
|  const AcGeDoubleArray &  |  knotArray,
|  const AcGeDoubleArray &  |  weightArray,
|  double  |  ctrlPntTol = 0.,
|  double  |  knotTolValue = 0.
)
Sets the spline's nurbs data with the given params.
Parameters
[in] | splineDegree | spline degree
[in] | isRational | kTrue for rational spline
[in] | isClosed | kTrue for closed spline
[in] | isPeriodic | kTrue for periodic spline
[in] | ctrlPntArray | control point array
[in] | knotArray | knot array
[in] | weightArray | weight array. Values to be > 0
[in] | ctrlPntTol | controls the unicity of the control points
[in] | knotTolValue | controls the unicity of the knot values
◆ setReceiveShadows()
 UX_EXPORT_FUNCTION void AcDbSpline::setReceiveShadows  |  ( |  bool  |  value | )
virtual
See AcDbCurve::setReceiveShadows(bool) .
Parameters
[in] | value | ignored
Reimplemented from AcDbEntity.
◆ setType()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbSpline::setType  |  ( |  SplineType  |  newType | )
Sets the spline type: kFitPoints or kControlPoints.
Parameters
[in] | newType | new value of the SplineType to set
Returns
Acad::eOk, or error code
◆ toPolyline() [1/2]
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbSpline::toPolyline  |  ( |  AcDbCurve *&  |  curve,
|  bool  |  convertAsArcs,
|  bool  |  convertAsLWPolyline,
|  int  |  precision = 10,
|  int *  |  bestPrecision = NULL,
|  unsigned int  |  maxVertices = kPlineVerticesThrehold
) |   |  const
Converts this spline entity into a polyline, based on requested parameters.
Parameters
[out] | curve | - result entity (any 2d/3d polyline entity)
[in] | convertAsArcs | - if spline is planar, the created polyline will use arc segments (otheriwse only linear segments)
[in] | convertAsLWPolyline | - if spline is planar, an AcDbPolyline is created, otherwise AcDb2dPolyline
[in] | precision | - requested precision
[out] | bestPrecision | - maximum result precision possible
[in] | maxVertices | - threshold number of vertices for the spline
Returns
Acad::eOk if successfull, error code otherwise
◆ toPolyline() [2/2]
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbSpline::toPolyline  |  ( |  AcDbCurve *&  |  curve,
|  int  |  precision = 10,
|  int *  |  bestPrecision = NULL,
|  unsigned int  |  maxVertices = kPlineVerticesThrehold
) |   |  const
Converts this spline entity into a polyline, based on PLINETYPE and PLINECONVERTMODE settings.
Parameters
[out] | curve | - result entity (any 2d/3d polyline entity)
[in] | precision | - requested precision
[out] | bestPrecision | - maximum result precision possible
[in] | maxVertices | - threshold number of vertices for the spline
Returns
Acad::eOk if successfull, error code otherwise
◆ type()
 UX_EXPORT_FUNCTION SplineType AcDbSpline::type  |  ( |   | ) |   const
Gets the spline type: kFitPoints or kControlPoints.
Returns
type of SplineType
◆ updateFitData()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbSpline::updateFitData  |  ( |  void  |   | )
Purges the spline fit data.
Returns
Acad::eOk if the operation is successful, otherwise Acad::eGeneralModelingFailure
Date
2010-09-22 marianc created
◆ weightAt()
 double AcDbSpline::weightAt  |  ( |  int  |  param | ) |   const
Returns the spline control point weight at a given parameter.
Parameters
[in] | param | - parameter
Returns
spline control point weight @retrun -1 if invalid index, spline is irrational or does not have control points
Member Data Documentation
◆ AcDbSpline
 UX_EXPORT_FUNCTION AcDbSpline::AcDbSpline
Default constructor.
Constructs a spline entity by fit points, start and end tangents, knot parameter, and spline order.
Constructs a spline entity by fit points, knot parameter, and spline order.
Constructs a spline and set it to an elliptic arc.
Constructor 3.
Constructor 2.
Constructor 1.
Initializes to line segment between (0,0,0) and (1,0,0).
Parameters
[in] | pointArray | input point array
[in] | degree | spline degree [2,26]
[in] | tolerance | interpolation precision. 0 is the greatest precision
[in] | splineDegree | spline degree
[in] | isRational | kTrue for rational spline
[in] | isClosed | kTrue for closed spline
[in] | isPeriodic | kTrue for periodic spline
[in] | ctrlPntArray | control point array
[in] | knotArray | knot array
[in] | weightArray | weight array. Values to be > 0
[in] | pointTolerance | controls the unicity of the control points
[in] | knotTolerance | controls the unicity of the knot values
[in] | pointArray | points array used to fit the curve
[in] | startTang | tangent vector for the first point
[in] | endTang | tangent vector for the last point
[in] | degree | spline degree [2,26]
[in] | tolerance | interpolation precision (0 is maximum precision)
[in] | center | center point of elliptic arc
[in] | normal | normal vector of elliptic arc
[in] | majAxis | major axis of elliptic arc
[in] | radRatio | (minAxis/majAxis) ratio needed for elliptic arc
[in] | startAng | start angle of elliptic arc
[in] | endAng | end angle of elliptic arc
[in] | pointArray | - fit points array
[in] | parameter | - knot parameterization
[in] | degree | - order of the spline
[in] | tolerance | - tolerance to be used
[in] | pointArray | - fit points array
[in] | sTangent | - start point tangent
[in] | eTangent | - end point tangent
[in] | parameter | - knot parameterization
[in] | degree | - order of the spline
[in] | tolerance | - tolerance to be used