Public Types | Public Member Functions | Public Attributes | List of all members
AcDbCivilDbHAlignment Class Reference
Civil Db Horizontal Alignment base class. More...
#include <AcDbCivilAlignments.h>
 Public Types
enum class  | EArcParameterType {
 eRadius = 0 , eDegreeOfCurve = 1 , eTangentLength = 2 , eChordLength = 3 ,
 eCurveLength = 4 , eExternalDist = 5 , eMiddleOrdinate = 6 , eCurveAngle = 7 ,
 eCurveThroughPoint = 8
 }
enum class  | EArcType { eCompound = 0 , eReverse = 1 }
enum class  | EHAlignmentVisualStyle { eUndefined = 0x0 , eElements = 0x1 , eTangentExtensions = 0x2 , eElementExtensions = 0x4 }
enum class  | ESpiralDefinitionType { eClothoid = 0 , eCubicParabola = 1 }
enum class  | ESpiralParameterType { eParamA = 0 , eParamLength = 1 }
 Public Types inherited from AcDbEntity
enum  | VisualStyleType { kFullVisualStyle = 0 , kFaceVisualStyle = 1 , kEdgeVisualStyle = 2 }
 Public Types inherited from AcGiDrawable
enum  | DrawableType {
 kGeometry = 0 , kDistantLight , kPointLight , kSpotLight ,
 kAmbientLight , kSolidBackground , kGradientBackground , kImageBackground ,
 kGroundPlaneBackground , kViewport
 }
enum  | SetAttributesFlags {
 kDrawableNone = 0 , kDrawableIsAnEntity = 1 , kDrawableUsesNesting = 2 , kDrawableIsCompoundObject = 4 ,
 kDrawableViewIndependentViewportDraw = 8 , kDrawableIsInvisible = 16 , kDrawableHasAttributes = 32 , kDrawableRegenTypeDependentGeometry = 64 ,
 kDrawableIsDimension = 133 , kDrawableRegenDraw = 256 , kDrawableStandardDisplaySingleLOD = 512 , kDrawableShadedDisplaySingleLOD = 1024 ,
 kDrawableViewDependentViewportDraw = 2048 , kDrawableBlockDependentViewportDraw = 4096 , kDrawableIsExternalReference = 8192 , kDrawableNotPlottable = 16384 ,
 kDrawableNotAllowLCS = 32768 , kDrawableMergeControlOff = 65536 , kThreadedWorldDrawViewportDraw = 131072
 }
 Public Member Functions
Adesk::UInt64  | addArcAuto (Adesk::UInt64 prevId, Adesk::UInt64 nextId)
Adds an automatic arc element between the previous and next position index to this horizontal alignment. More...
Adesk::UInt64  | addArcBetween (Adesk::UInt64 prevId, Adesk::UInt64 nextId, const AcGePoint2d &passThrough)
Adds an arc element defined between previous and next position index, using a passthrough point. More...
Adesk::UInt64  | addArcBetween (Adesk::UInt64 prevId, Adesk::UInt64 nextId, double parameter, AcDbCivilDbHAlignment::EArcParameterType paramType=AcDbCivilDbHAlignment::EArcParameterType::eRadius, bool isGreaterThan180=false, AcDbCivilDbHAlignment::EArcType arcType=EArcType::eCompound)
Adds an arc element defined between previous and next position index, using parameter of given type, and arc size and arc type. More...
Adesk::UInt64  | addArcFixed (const AcGePoint2d &center, double radius, bool isClockwise)
Adds a fixed arc element defined by center point, radius and direction to this horizontal alignment. More...
Adesk::UInt64  | addArcFixed (const AcGePoint2d &startPoint, const AcGePoint2d &midPoint, const AcGePoint2d &endPoint)
Adds an arc element defined by start point, middle point and end point to this horizontal alignment. More...
Adesk::UInt64  | addArcFrom (Adesk::UInt64 prevId, const AcGePoint2d &passThroughPoint)
Adds an arc element defined by previous position index and a passthrough point to this horizontal alignment. More...
Adesk::UInt64  | addArcFrom (Adesk::UInt64 prevId, const AcGePoint2d &passThroughPoint, const AcGeVector2d &direction)
Adds an arc element defined by next position index, a passthrough point and the direction at the passthrough point to this horizontal alignment. More...
Adesk::UInt64  | addArcFrom (Adesk::UInt64 prevId, double radius, double paramValue, AcDbCivilDbHAlignment::EArcParameterType paramType, bool isClockwise)
Adds an arc element defined by previous position index, radius, constraint parameter value and type. More...
Adesk::UInt64  | addArcFrom (Adesk::UInt64 previous, const AcGePoint2d &passThroughPoint, double radius, bool isGreaterThan180, AcDbCivilDbHAlignment::EArcType arcType)
Adds an arc element defined by previous position index, a passthrough point, the radius, a flag that determines whether the arc is greater than PI, and the curve type. More...
Adesk::UInt64  | addArcTo (Adesk::UInt64 nextId, const AcGePoint2d &passThroughPoint)
Adds an arc element defined by next position index and a passthrough point to this horizontal alignment. More...
Adesk::UInt64  | addArcTo (Adesk::UInt64 nextId, const AcGePoint2d &passThroughPoint, const AcGeVector2d &direction)
Adds an arc element defined by next position index, a passthrough point and the direction at the passthrough point to this horizontal alignment. More...
Adesk::UInt64  | addArcTo (Adesk::UInt64 nextId, const AcGePoint2d &passThroughPoint, double radius, bool isGreaterThan180, AcDbCivilDbHAlignment::EArcType arcType)
Adds an arc element defined by next position index, a passthrough point, the radius, a flag that determines whether the arc is greater than PI, and the curve type. More...
Adesk::UInt64  | addArcTo (Adesk::UInt64 nextId, double radius, double paramValue, AcDbCivilDbHAlignment::EArcParameterType paramType, bool isClockwise)
Adds an arc element defined by next position index, radius, constraint parameter value and type. More...
Adesk::UInt64  | addCSSTo (Adesk::UInt64 nextId, double spiral1Param, double spiral2Param, AcDbCivilDbHAlignment::ESpiralParameterType spiralParamType, double radius, const AcGePoint2d &passThroughPoint, AcDbCivilDbHAlignment::ESpiralDefinitionType spiralDefinition)
Adds a 'curve-spiral-spiral' alignment element before next position index, constrained by parameters for the first and second spiral elements, radius of the curve/arc, the arc length and orientation, and the spiral definition type. More...
Adesk::UInt64  | addCSTo (Adesk::UInt64 nextId, double spiralParam, AcDbCivilDbHAlignment::ESpiralParameterType spiralParamType, double radius, const AcGePoint2d &passThroughPoint, bool isGreaterThan180, AcDbCivilDbHAlignment::ESpiralDefinitionType spiralDefinition)
Adds a 'curve-spiral' alignment element before next position index, constrained by a spiral parameter and radius of the curve/arc, the pass-through point, an arc size flag, and the spiral definition type. More...
Adesk::UInt64  | addCSTo (Adesk::UInt64 nextId, double spiralParam, AcDbCivilDbHAlignment::ESpiralParameterType spiralParamType, double radius, double arcLength, bool isClockwise, AcDbCivilDbHAlignment::ESpiralDefinitionType spiralDefinition)
Adds a 'curve-spiral' alignment element before next position index, constrained by a spiral parameter and radius of the curve/arc, the arc length and orientation, and the spiral definition type. More...
Adesk::UInt64  | addLineBetween (Adesk::UInt64 prevId, Adesk::UInt64 nextId)
Adds a line element defined by previous and next element to this horizontal alignment. More...
Adesk::UInt64  | addLineFixed (Adesk::UInt64 prevId, double length)
Adds a fixed line element after specified element ID, with given length, to this horizontal alignment. More...
Adesk::UInt64  | addLineFixed (const AcGePoint2d &startPoint, const AcGePoint2d &endPoint)
Adds a fixed line element defined with startPoint + endPoint, to this horizontal alignment. More...
Adesk::UInt64  | addLineFrom (Adesk::UInt64 prevId, const AcGePoint2d &point)
Adds a line element towards the specified previous element ID using given the specified pass-through point, to this horizontal alignment. More...
Adesk::UInt64  | addLineFrom (Adesk::UInt64 prevId, double length)
Adds a line element towards the specified previous element ID using given line length, to this horizontal alignment. More...
Adesk::UInt64  | addLineTo (Adesk::UInt64 nextId, const AcGePoint2d &point)
Adds a line element towards the specified next element ID using given the specified pass-through point, to this horizontal alignment. More...
Adesk::UInt64  | addLineTo (Adesk::UInt64 nextId, double length)
Adds a line element towards the specified next element ID using given line length, to this horizontal alignment. More...
Adesk::UInt64  | addSCFrom (Adesk::UInt64 prevId, double spiralParam, AcDbCivilDbHAlignment::ESpiralParameterType spiralParamType, double radius, const AcGePoint2d &passThroughPoint, bool isGreaterThan180, AcDbCivilDbHAlignment::ESpiralDefinitionType spiralDefinition)
Adds a 'spiral-curve' alignment element after previous position index, constrained by a spiral parameter and radius of the curve/arc, the pass-through point, an arc size flag, and the spiral definition type. More...
Adesk::UInt64  | addSCFrom (Adesk::UInt64 prevId, double spiralParam, AcDbCivilDbHAlignment::ESpiralParameterType spiralParamType, double radius, double arcLength, bool isClockwise, AcDbCivilDbHAlignment::ESpiralDefinitionType spiralDefinition)
Adds a 'spiral-curve' alignment element after previous position index, constrained by a spiral parameter and radius of the curve/arc, the arc length and orientation, and the spiral definition type. More...
Adesk::UInt64  | addSCSAuto (Adesk::UInt64 prevId, Adesk::UInt64 nextId)
Adds a 'spiral-curve-spiral' automatic alignment element between the previous and next position index. More...
Adesk::UInt64  | addSCSBetween (Adesk::UInt64 prevId, Adesk::UInt64 nextId, double spiral1Param, double spiral2Param, AcDbCivilDbHAlignment::ESpiralParameterType spiralParamType, double radius, AcDbCivilDbHAlignment::ESpiralDefinitionType spiralDefinition)
Adds a spiral-curve-spiral' alignment element between previous and next position index, using 2 parameters of given type, radius, and spiral type. More...
Adesk::UInt64  | addSpiralBetween (Adesk::UInt64 prevId, Adesk::UInt64 nextId, AcDbCivilDbHAlignment::ESpiralDefinitionType spiralDefinition)
Adds a spiral alignment element between previous and next position index, using the spiral definition type. More...
Adesk::UInt64  | addSpiralFrom (Adesk::UInt64 prevId, double radius, double length, bool isClockwise, AcDbCivilDbHAlignment::ESpiralDefinitionType spiralDefinition)
Adds a spiral alignment element after previous index, using radius, length and arc orientation flag, based on the spiral definition type. More...
Adesk::UInt64  | addSpiralTo (Adesk::UInt64 nextId, double radius, double length, bool isClockwise, AcDbCivilDbHAlignment::ESpiralDefinitionType spiralDefinition)
Adds a spiral alignment element before next index, using radius, length and arc orientation flag, based on the spiral definition type. More...
Adesk::UInt64  | addSSBetween (Adesk::UInt64 prevId, Adesk::UInt64 nextId, double spiralRatio, AcDbCivilDbHAlignment::ESpiralParameterType spiralParamType, AcDbCivilDbHAlignment::ESpiralDefinitionType spiralDefinition)
Adds a 'spiral-spiral' alignment element between previous and next position index, using ratio and spiral parameter and definition type. More...
Adesk::UInt64  | addSSCFrom (Adesk::UInt64 prevId, double spiral1Param, double spiral2Param, AcDbCivilDbHAlignment::ESpiralParameterType spiralParamType, double radius, const AcGePoint2d &passThroughPoint, AcDbCivilDbHAlignment::ESpiralDefinitionType spiralDefinition)
Adds a 'spiral-spiral-curve' alignment element after previous position index, constrained by parameters for the first and second spiral elements, radius of the curve/arc, the arc length and orientation, and the spiral definition type. More...
Adesk::UInt64  | addSTFrom (Adesk::UInt64 prevId, double spiralParam, AcDbCivilDbHAlignment::ESpiralParameterType spiralParamType, const AcGePoint2d &passThroughPoint, AcDbCivilDbHAlignment::ESpiralDefinitionType spiralDefinition)
Adds a 'spiral-line' alignment element between previous and next position index, using the spiral definition type. More...
Adesk::UInt64  | addSTFrom (Adesk::UInt64 prevId, double spiralParam, AcDbCivilDbHAlignment::ESpiralParameterType spiralParamType, double tangentLength, AcDbCivilDbHAlignment::ESpiralDefinitionType spiralDefinition)
Adds a 'spiral-line' alignment element after previous position index, constrained by a spiral parameter and length of the line, and the spiral definition type. More...
Adesk::UInt64  | addSTSBetween (Adesk::UInt64 prevId, Adesk::UInt64 nextId, double spiral1Param, double spiral2Param, AcDbCivilDbHAlignment::ESpiralParameterType spiralParamType, AcDbCivilDbHAlignment::ESpiralDefinitionType spiralDefinition)
Adds a spiral-curve-spiral' alignment element between previous and next position index, using 2 parameters of given type, and the spiral type. More...
Adesk::UInt64  | addTSTo (Adesk::UInt64 nextId, double spiralParam, AcDbCivilDbHAlignment::ESpiralParameterType spiralParamType, const AcGePoint2d &passThroughPoint, AcDbCivilDbHAlignment::ESpiralDefinitionType spiralDefinition)
Adds a 'line-spiral' alignment element before next position index, constrained by a spiral parameter and pass-through point for the line, and the spiral definition type. More...
Adesk::UInt64  | addTSTo (Adesk::UInt64 nextId, double spiralParam, AcDbCivilDbHAlignment::ESpiralParameterType spiralParamType, double tangentLength, AcDbCivilDbHAlignment::ESpiralDefinitionType spiralDefinition)
Adds a 'line-spiral' alignment element before next position index, constrained by a spiral parameter and length of the line, and the spiral definition type. More...
AcDbObjectId  | alignment3dAt (Adesk::UInt32 index) const
Returns the AcDbObjectId of the 3D alignment at specified index. More...
Adesk::UInt32  | alignment3dCount () const
Returns the number of all 3D alignments belonging to this horizontal alignment entity. More...
Adesk::UInt64  | curveAtPI (const AcDbCivilHAlignmentPI *pi) const
Returns the element ID of the curve at specified 'Point Of Intersection' [PI] in this horizontal alignment. More...
Adesk::UInt32  | curveElementColor () const
Returns the color of curve/arc element. More...
bool  | deleteElement (Adesk::UInt64 id)
Deletes the element at specified position index. More...
AcDbCivilHAlignmentElementPtr  | elementAtId (Adesk::UInt64 id) const
Returns the element with specified id in this horizontal alignment. More...
AcDbCivilHAlignmentElementPtr  | elementAtStation (double station) const
Returns the element at specified station parameter in this horizontal alignment. More...
size_t  | elementCount () const
Returns the number of all elements belonging to this horizontal alignment. More...
Adesk::UInt32  | elementExtensionColor () const
Returns the color of alignment element extension. More...
Adesk::UInt64  | firstElementId () const
Returns the ID of the first element in this horizontal alignment. More...
Adesk::UInt64  | firstLineElementId () const
Returns the ID of the first line element in this horizontal alignment. More...
Adesk::UInt64  | getElementId (Adesk::GsMarker gsMarker) const
Returns the element ID at specified GsMarker for this horizontal alignment. More...
AcDbCivilHAlignmentPIPtrArray  | getPIsArray () const
Returns the array of PIs (points of intersection) in this horizontal alignment. More...
bool  | getPointAtStation (const double station, AcGePoint2d &pt) const
Returns the station point at the specified station. More...
Acad::ErrorStatus  | getRadius (double param, double &radius) const
Returns the curve radius at specified position parameter for this horizontal alignment. More...
bool  | getStationAtPoint (const AcGePoint2d &point, double &station, double &offset, double *fromStation=nullptr, double *toStation=nullptr) const
Returns the 'station' and 'offset' at given point; range can be specified with 'fromStation' and 'toStation' parameters. More...
Acad::ErrorStatus  | getUnorderedElementIds (AcArray< Adesk::UInt64 > &elementIds) const
Returns an unordered array of all element IDs used by this horizontal alignment. More...
Adesk::UInt64  | insertLineFixed (const AcGePoint2d &startPoint, const AcGePoint2d &endPoint, Adesk::UInt64 prevId)
Adds a fixed line element defined by startPoint + endPoint, after the element with prevId, to this horizontal alignment. More...
Adesk::UInt64  | lastElementId () const
Returns the ID of the last element in this horizontal alignment. More...
double  | length () const
Returns the total length of the horizontal alignment. More...
Adesk::UInt32  | lineElementColor () const
Returns the color of linear element. More...
Adesk::UInt64  | nextLineElementId (Adesk::UInt64 id) const
Returns the ID of the next line element for specified element ID in this horizontal alignment. More...
Adesk::UInt64  | previousLineElementId (Adesk::UInt64 id) const
Returns the ID of the preceding line element for specified element ID in this horizontal alignment. More...
bool  | setCurveElementColor (const Adesk::UInt32 color)
Assigns the color for the curve/arc extension element. More...
bool  | setElementExtensionColor (const Adesk::UInt32 color)
Assigns the color for the extension element. More...
bool  | setLineElementColor (const Adesk::UInt32 color)
Assigns the color for the linear extension element. More...
bool  | setSpiralElementColor (const Adesk::UInt32 color)
Assigns the color for the spiral extension element. More...
bool  | setStationEquations (const AcCivilStationEquations &stationEquations)
Assigns the collection of station equations to this horizontal alignment entity. More...
bool  | setStyle (const Adesk::UInt32 style)
Assigns the alignment style, combined bit flags of EHAlignmentVisualStyle. More...
bool  | setTangentExtensionColor (const Adesk::UInt32 color)
Assigns the color for the tangent extension element. More...
Adesk::UInt32  | spiralElementColor () const
Returns the color of spiral element. More...
AcCivilStationEquations  | stationEquations () const
Returns the collection of all station equations. More...
Adesk::UInt32  | style () const
Returns the alignment style, combined bit flags of EHAlignmentVisualStyle. More...
Adesk::UInt32  | tangentExtensionColor () const
Returns the color of tangent extension. More...
bool  | update (bool updateDependencies=true)
Updates this AcDbCivilDbHAlignment object, optionally including dependencies (default). More...
AcDbObjectId  | verticalAlignmentAt (Adesk::UInt32 index) const
Returns the AcDbObjectId of the vertical alignment element at specified index. More...
Adesk::UInt32  | verticalAlignmentCount () const
Returns the number of all vertical alignments belonging to this horizontal alignment entity. More...
AcDbObjectId  | verticalAlignmentViewAt (Adesk::UInt32 index) const
Returns the AcDbObjectId of the vertical alignment view at specified index. More...
Adesk::UInt32  | verticalAlignmentViewCount () const
Returns the number of all vertical alignment views belonging to this horizontal alignment entity. More...
virtual  | ~AcDbCivilDbHAlignment ()
Destructor. More...
 Public Member Functions inherited from AcDbCivilDbCurve
const ACHAR *  | description () const
Returns the description of this AcDbCivilDbCurve derived entity. More...
const ACHAR *  | name () const
Returns the name of this AcDbCivilDbCurve derived entity. More...
void  | setDescription (const ACHAR *szDescription)
Assigns the specified description to this AcDbCivilDbCurve derived entity. More...
void  | setName (const ACHAR *szName)
Assigns the specified name to this AcDbCivilDbCurve derived entity. More...
virtual  | ~AcDbCivilDbCurve ()
Destructor. More...
 Public Member Functions inherited from AcDbCurve
virtual Acad::ErrorStatus  | extend (Adesk::Boolean, const AcGePoint3d &)
virtual Acad::ErrorStatus  | extend (double)
 virtual Acad::ErrorStatus  | getAcGeCurve (AcGeCurve3d *&, const AcGeTol &=AcGeContext::gTol) const
virtual Acad::ErrorStatus  | getArea (double &) const
virtual Acad::ErrorStatus  | getClosestPointTo (const AcGePoint3d &, AcGePoint3d &, Adesk::Boolean=Adesk::kFalse) const
virtual Acad::ErrorStatus  | getClosestPointTo (const AcGePoint3d &, const AcGeVector3d &, AcGePoint3d &, Adesk::Boolean=Adesk::kFalse) const
virtual Acad::ErrorStatus  | getDistAtParam (double, double &) const
Gets the length of the curve from its start point to the one given by value. More...
virtual Acad::ErrorStatus  | getDistAtPoint (const AcGePoint3d &, double &) const
Gets the lenght of the curve measured from the start point of the curve to the param ptOnCurve. More...
virtual Acad::ErrorStatus  | getEndParam (double &) const
Gets this curve end parameter. More...
virtual Acad::ErrorStatus  | getEndPoint (AcGePoint3d &) const
Set the passed point to end point of the curve, if successful. More...
virtual Acad::ErrorStatus  | getFirstDeriv (const AcGePoint3d &, AcGeVector3d &) const
Gets the first derivative of the curve at the specified point. More...
virtual Acad::ErrorStatus  | getFirstDeriv (double, AcGeVector3d &) const
Gets the first derivative of the curve at the point with curve parameter of value. More...
virtual Acad::ErrorStatus  | getOffsetCurves (double, AcDbVoidPtrArray &) const
virtual Acad::ErrorStatus  | getOffsetCurvesGivenPlaneNormal (const AcGeVector3d &, double, AcDbVoidPtrArray &) const
virtual Acad::ErrorStatus  | getOrthoProjectedCurve (const AcGePlane &, AcDbCurve *&) const
virtual Acad::ErrorStatus  | getParamAtDist (double, double &) const
Gets the parameter of the curve at a point located along the curve at a distance of length from its start point. More...
virtual Acad::ErrorStatus  | getParamAtPoint (const AcGePoint3d &, double &) const
Gets the parameter of the specified point. More...
virtual Acad::ErrorStatus  | getPointAtDist (double, AcGePoint3d &) const
Gets the point on this curve at the distance lenght measured from the start point. More...
virtual Acad::ErrorStatus  | getPointAtParam (double, AcGePoint3d &) const
Gets the point on the curve specified by the passed in param. More...
virtual Acad::ErrorStatus  | getProjectedCurve (const AcGePlane &, const AcGeVector3d &, AcDbCurve *&) const
virtual Acad::ErrorStatus  | getSecondDeriv (const AcGePoint3d &, AcGeVector3d &) const
virtual Acad::ErrorStatus  | getSecondDeriv (double, AcGeVector3d &) const
 virtual Acad::ErrorStatus  | getSpline (AcDbSpline *&) const
virtual Acad::ErrorStatus  | getSplitCurves (const AcGeDoubleArray &, AcDbVoidPtrArray &) const
virtual Acad::ErrorStatus  | getSplitCurves (const AcGePoint3dArray &, AcDbVoidPtrArray &) const
virtual Acad::ErrorStatus  | getStartParam (double &) const
Gets this curve start parameter. More...
virtual Acad::ErrorStatus  | getStartPoint (AcGePoint3d &) const
Set the passed point to start point of the curve, if successful. More...
virtual Adesk::Boolean  | isClosed () const
Returns whether this curve entity is closed. More...
virtual Adesk::Boolean  | isPeriodic () const
Returns whether this curve entity is periodic. More...
virtual Acad::ErrorStatus  | reverseCurve ()
 virtual Acad::ErrorStatus  | setFromAcGeCurve (const AcGeCurve3d &, AcGeVector3d *=NULL, const AcGeTol &=AcGeContext::gTol)
 virtual  | ~AcDbCurve ()
Destructor.
 Public Member Functions inherited from AcDbEntity
 virtual Acad::ErrorStatus  | addSubentPaths (const AcDbFullSubentPathArray &) final
virtual Acad::ErrorStatus  | applyPartialUndo (AcDbDwgFiler *, AcRxClass *)
virtual Acad::ErrorStatus  | audit (AcDbAuditInfo *)
AcDbObjectId  | blockId () const
Returns the Object ID of the BlockTableRecord that owns this entity. More...
Acad::ErrorStatus  | boundingBoxIntersectWith (const AcDbEntity *, AcDb::Intersect, AcGePoint3dArray &, Adesk::GsMarker, Adesk::GsMarker) const
Finds the intersection between the edges of the bounding box for this entity and the pOhter entity. More...
Acad::ErrorStatus  | boundingBoxIntersectWith (const AcDbEntity *, AcDb::Intersect, const AcGePlane &, AcGePoint3dArray &, Adesk::GsMarker, Adesk::GsMarker) const
First, the function projects the other entity and the bounding box of this entity on plane specified by plane. More...
virtual bool  | bounds (AcDbExtents &) const
Returns the extents of this entity as AcDbExtents. More...
virtual bool  | castShadows () const
Checks if this entity is able to cast shadows. More...
virtual Adesk::Boolean  | cloneMeForDragging () final
Checks if a clone will be created for this entity in case of a drag operation. More...
 virtual AcDb::CollisionType  | collisionType () const
AcCmColor  | color () const
Returns the true color information of the entity. More...
Adesk::UInt16  | colorIndex () const
Returns the color number in a range from 0 to 256. More...
 virtual Acad::ErrorStatus  | deleteSubentPaths (const AcDbFullSubentPathArray &) final
virtual void  | dragStatus (const AcDb::DragStat)
Acad::ErrorStatus  | draw ()
Draws or redraws the entity on screen. More...
virtual AcGiDrawable *  | drawable ()
virtual Acad::ErrorStatus  | dwgInFields (AcDbDwgFiler *)
virtual Acad::ErrorStatus  | dwgOutFields (AcDbDwgFiler *) const
virtual Acad::ErrorStatus  | dxfInFields (AcDbDxfFiler *)
virtual Acad::ErrorStatus  | dxfOutFields (AcDbDxfFiler *) const
AcCmEntityColor  | entityColor () const
Returns the lightweight color information of the entity. More...
virtual Acad::ErrorStatus  | explode (AcDbVoidPtrArray &) const final
virtual Acad::ErrorStatus  | getCompoundObjectTransform (AcGeMatrix3d &) const final
It is used for object without geometry like AcDbMleader. More...
virtual void  | getEcs (AcGeMatrix3d &) const
Returns the transformation matrix from OCS (Object Coordinate System) to WCS (World Coordinate System). More...
virtual Acad::ErrorStatus  | getGeomExtents (AcDbExtents &) const final
Returns extents of this entity. More...
 virtual Acad::ErrorStatus  | getGripEntityUCS (const void *, AcGeVector3d &, AcGePoint3d &, AcGeVector3d &) const final
 virtual Acad::ErrorStatus  | getGripPoints (AcDbGripDataPtrArray &, const double, const int, const AcGeVector3d &, const int) const final
virtual Acad::ErrorStatus  | getGripPoints (AcGePoint3dArray &, AcDbIntArray &, AcDbIntArray &) const final
Append grip points to the specified array. More...
 virtual Acad::ErrorStatus  | getGripPointsAtSubentPath (const AcDbFullSubentPath &, AcDbGripDataPtrArray &, const double, const int, const AcGeVector3d &, const int) const final
virtual Acad::ErrorStatus  | getGsMarkersAtSubentPath (const AcDbFullSubentPath &, AcArray< Adesk::GsMarker > &) const final
virtual Acad::ErrorStatus  | getMaterialMapper (AcGiMapper &) const
virtual Acad::ErrorStatus  | getOsnapPoints (AcDb::OsnapMode, Adesk::GsMarker, const AcGePoint3d &, const AcGePoint3d &, const AcGeMatrix3d &, AcGePoint3dArray &, AcDbIntArray &) const final
Gets the entity osnap points. More...
virtual Acad::ErrorStatus  | getOsnapPoints (AcDb::OsnapMode, Adesk::GsMarker, const AcGePoint3d &, const AcGePoint3d &, const AcGeMatrix3d &, AcGePoint3dArray &, AcDbIntArray &, const AcGeMatrix3d &) const final
Gets the entity osnap points. More...
virtual Acad::ErrorStatus  | getPlane (AcGePlane &, AcDb::Planarity &) const
Returns the plane that contains this entity. More...
AcDb::PlotStyleNameType  | getPlotStyleNameId (AcDbObjectId &) const
Returns the plot style name type and its associated id. More...
virtual Acad::ErrorStatus  | getStretchPoints (AcGePoint3dArray &) const final
Append stretch points to the specified array. More...
 virtual Acad::ErrorStatus  | getSubentClassId (const AcDbFullSubentPath &, CLSID *) const final
 virtual Acad::ErrorStatus  | getSubentPathGeomExtents (const AcDbFullSubentPath &, AcDbExtents &) const final
virtual Acad::ErrorStatus  | getSubentPathsAtGsMarker (AcDb::SubentType, Adesk::GsMarker, const AcGePoint3d &, const AcGeMatrix3d &, int &, AcDbFullSubentPath *&, int=0, AcDbObjectId *=NULL) const final
Gets the subentity paths appropriate for the passed in gs marker. More...
virtual Acad::ErrorStatus  | getTransformedCopy (const AcGeMatrix3d &, AcDbEntity *&) const final
Creates a copy of the current entity applying the transformation matrix. More...
 virtual void  | gripStatus (const AcDb::GripStat) final
virtual AcGsNode *  | gsNode () const
 virtual bool  | hideMeForDragging () const final
virtual Acad::ErrorStatus  | highlight (const AcDbFullSubentPath &=kNullSubent, const Adesk::Boolean=Adesk::kFalse) const final
Highlights part of, or entire entity. More...
virtual Acad::ErrorStatus  | intersectWith (const AcDbEntity *, AcDb::Intersect, AcGePoint3dArray &, Adesk::GsMarker=0, Adesk::GsMarker=0) const final
Finds the intersection between this entity and the pOhter entity. More...
virtual Acad::ErrorStatus  | intersectWith (const AcDbEntity *, AcDb::Intersect, const AcGePlane &, AcGePoint3dArray &, Adesk::GsMarker=0, Adesk::GsMarker=0) const final
Projects this entity and the pOhter entity on plane, finds the intersection points between these projections and then projects back the points onto the caller entity. More...
 virtual bool  | isContentSnappable () const final
virtual Adesk::Boolean  | isPlanar () const
ACHAR *  | layer () const
Returns the layername. More...
AcDbObjectId  | layerId () const
Returns the Object ID of the LayerTableRecord referenced by this entity. More...
ACHAR *  | linetype () const
Gets the linetype value. More...
AcDbObjectId  | linetypeId () const
Gets the linetypeId value. More...
 double  | linetypeScale () const
returns the linetype scale factor for the entity
AcDb::LineWeight  | lineWeight () const
Gets the entity line weight. More...
virtual void  | list () const final
Prints the properties in drawing window. More...
ACHAR *  | material () const
Gets the material assigned to this entity. More...
AcDbObjectId  | materialId () const
Gets the AcDbObjectId of the material assigned to this entity. More...
virtual Acad::ErrorStatus  | moveGripPointsAt (const AcDbIntArray &, const AcGeVector3d &) final
Move the grip points pointed by the indexes specified in indexArray using the translationVector param direction and length Override this method in custom entities to define your own behaviour. More...
 virtual Acad::ErrorStatus  | moveGripPointsAt (const AcDbVoidPtrArray &, const AcGeVector3d &, const int) final
 virtual Acad::ErrorStatus  | moveGripPointsAtSubentPaths (const AcDbFullSubentPathArray &, const AcDbVoidPtrArray &, const AcGeVector3d &, const int) final
virtual Acad::ErrorStatus  | moveStretchPointsAt (const AcDbIntArray &, const AcGeVector3d &) final
Move the stretch points pointed by the indexes specified in indexArray with the offest specified by translationVector Override this method in custom entities to define your own behaviour. More...
ACHAR *  | plotStyleName () const
Returns the name of the plotStyleName string associated with this entity (DXF 390). More...
virtual bool  | receiveShadows () const
Checks if this entity is able to receive shadows. More...
void  | recordGraphicsModified (Adesk::Boolean=Adesk::kTrue)
Controls the entity display update when closing it Entities not updated when closed are updated at the first regen. More...
virtual void  | saveAs (AcGiWorldDraw *, AcDb::SaveType)
Generates the graphics primitives when a DWG save requiring proxy graphics to be saved is made. More...
virtual void  | setCastShadows (bool)
Sets this entity's flag regarding casting shadows. More...
virtual Acad::ErrorStatus  | setColor (const AcCmColor &, Adesk::Boolean=Adesk::kTrue)
Sets the color information of this entity from an AcCmColor instance. More...
virtual Acad::ErrorStatus  | setColor (const AcCmColor &, bool, AcDbDatabase *)
Sets the color property of this entity from an AcCmColor instance. More...
virtual Acad::ErrorStatus  | setColorIndex (Adesk::UInt16, Adesk::Boolean=Adesk::kTrue)
Sets the color index of this entity (DXF 62). More...
void  | setDatabaseDefaults ()
Applies the default properties of the entities database to this entity. More...
void  | setDatabaseDefaults (AcDbDatabase *)
Applies the default properties of the specified database to this entity. More...
virtual void  | setGsNode (AcGsNode *)
virtual Acad::ErrorStatus  | setLayer (AcDbObjectId, Adesk::Boolean=Adesk::kTrue, bool=false)
Sets the layer to be referenced by this entity (DXF 8). More...
virtual Acad::ErrorStatus  | setLayer (const ACHAR *, Adesk::Boolean=Adesk::kTrue, bool=false)
Sets the layer to be referenced by this entity (DXF 8). More...
virtual Acad::ErrorStatus  | setLinetype (AcDbObjectId, Adesk::Boolean=Adesk::kTrue)
Sets the entities linetype to ltypeObjectId. More...
virtual Acad::ErrorStatus  | setLinetype (const ACHAR *, Adesk::Boolean=Adesk::kTrue)
Sets the entities linetype to the linetpye referenced by layerName. More...
virtual Acad::ErrorStatus  | setLinetypeScale (double, Adesk::Boolean=Adesk::kTrue)
sets value as entity linetype scale factor More...
virtual Acad::ErrorStatus  | setLineWeight (AcDb::LineWeight, Adesk::Boolean=Adesk::kTrue)
Sets the entity line weight. More...
virtual Acad::ErrorStatus  | setMaterial (AcDbObjectId, Adesk::Boolean=Adesk::kTrue)
Not implemented yet. More...
virtual Acad::ErrorStatus  | setMaterial (const ACHAR *, Adesk::Boolean=Adesk::kTrue)
Assigns the material to the entity. More...
virtual Acad::ErrorStatus  | setMaterialMapper (const AcGiMapper &, Adesk::Boolean=Adesk::kTrue)
It is used for apply material (scale, rotation, projection, mode overrides) to an identity.If it is used AcGiMapper::kIdentity it will apply for entity a default mapper. More...
virtual Acad::ErrorStatus  | setPlotStyleName (AcDb::PlotStyleNameType, AcDbObjectId=AcDbObjectId::kNull, Adesk::Boolean=Adesk::kTrue)
Sets the plot style of this entity. More...
virtual Acad::ErrorStatus  | setPlotStyleName (const ACHAR *, Adesk::Boolean=Adesk::kTrue)
Sets the plot style of this entity. More...
Acad::ErrorStatus  | setPropertiesFrom (const AcDbEntity *, Adesk::Boolean=Adesk::kTrue)
Copies the properties color, layer, linetype, linetypescale and visibility from the source entity pEntity to this entity. More...
virtual void  | setReceiveShadows (bool)
Sets this entity's flag regarding receiving shadows. More...
virtual Acad::ErrorStatus  | setTransparency (const AcCmTransparency &, Adesk::Boolean=Adesk::kTrue)
Sets the transparency setting of this entity, and returns eOk if successful. More...
virtual Acad::ErrorStatus  | setVisibility (AcDb::Visibility, Adesk::Boolean=Adesk::kTrue) final
notyetdocumented. More...
 virtual Acad::ErrorStatus  | setVisualStyle (AcDbObjectId, VisualStyleType=kFullVisualStyle, Adesk::Boolean=true)
 virtual void  | subentGripStatus (const AcDb::GripStat, const AcDbFullSubentPath &) final
virtual AcDbEntity *  | subentPtr (const AcDbFullSubentPath &) const final
Creates an entity as a copy of the subentity given by acSubentPath. More...
virtual void  | subSetDatabaseDefaults (AcDbDatabase *)
This function is called by AcDbEntity::setDatabaseDefaults(), to allow custom entities to set their related sub entities, if any; default implementation does nothing. More...
virtual Acad::ErrorStatus  | transformBy (const AcGeMatrix3d &) final
Applies given transformation (matrix) to the entity. More...
 virtual Acad::ErrorStatus  | transformSubentPathsBy (const AcDbFullSubentPathArray &, const AcGeMatrix3d &) final
 AcCmTransparency  | transparency () const
Returns the transparency setting of this entity.
virtual Acad::ErrorStatus  | unhighlight (const AcDbFullSubentPath &=kNullSubent, const Adesk::Boolean=Adesk::kFalse) const final
Unhighlights previously highlighted part of entity, or entire entity. More...
AcDb::Visibility  | visibility () const
Gets the visibility state. More...
 AcDbObjectId  | visualStyleId (VisualStyleType=kFullVisualStyle) const
 Public Member Functions inherited from AcDbObject
virtual void  | addPersistentReactor (AcDbObjectId)
Adds a persistent reactor to this object reactor list. More...
void  | addReactor (AcDbObjectReactor *) const
Adds a transient reactor to this object. More...
virtual Acad::ErrorStatus  | applyPartialUndo (AcDbDwgFiler *, AcRxClass *)
This function is called during Undo operations on objects, that use the 'Partial Undo meachanism'; this is, this object is opened with assertWriteEnabled(Adesk::kFalse) to indicate that custom Undo filing is used rather than the default Undo filing. More...
 void  | assertNotifyEnabled () const
 void  | assertReadEnabled () const
 void  | assertWriteEnabled (Adesk::Boolean=Adesk::kTrue, Adesk::Boolean=Adesk::kTrue)
virtual Acad::ErrorStatus  | audit (AcDbAuditInfo *)
Performs the audit operation for this object. More...
Acad::ErrorStatus  | cancel ()
Reverts all changes since the object had been opened and closes the object. More...
virtual void  | cancelled (const AcDbObject *)
A handler function for persistent reactors. More...
virtual AcRxObject *  | clone () const
Creates a shallow clone of this object. More...
Acad::ErrorStatus  | close ()
Closes the object. More...
Acad::ErrorStatus  | closeAndPage (Adesk::Boolean=Adesk::kTrue)
Closes the object. More...
virtual Acad::ErrorStatus  | composeForLoad (AcDb::OdaSaveType, AcDb::AcDbDwgVersion)
This function is intended for future MT file loading support. More...
virtual void  | copied (const AcDbObject *, const AcDbObject *)
A handler function for persistent reactors. More...
virtual Acad::ErrorStatus  | copyFrom (const AcRxObject *)
Copies the pSrc object information in this object. More...
Acad::ErrorStatus  | createExtensionDictionary ()
Creates a dictionary as extension dictionary for this object. More...
AcDbDatabase *  | database () const
Returns the database that contains this object. More...
virtual Acad::ErrorStatus  | decomposeForSave (AcDb::AcDbDwgVersion, AcDbObject *&, AcDbObjectId &, Adesk::Boolean &)
This function is called during dwg and dxf output, to allow a custom object to decompose itself, due to provided dwg/dxf target file version. More...
virtual Acad::ErrorStatus  | deepClone (AcDbObject *, AcDbObject *&, AcDbIdMapping &, Adesk::Boolean=Adesk::kTrue) const final
Clones this object, appends it to the owner pOwner and adds an AcDbIdPair record to the idMap. More...
void  | disableUndoRecording (Adesk::Boolean)
Disables or enables the undo recording for the object. More...
Acad::ErrorStatus  | downgradeOpen ()
Sets the open mode for an object opened for write to be opened for read. More...
Acad::ErrorStatus  | downgradeToNotify (Adesk::Boolean)
Sets the open mode for an object opened for write to be opened for notify. More...
virtual AcGiDrawable *  | drawable ()
Retrieves the AcGiDrawable instance of this object. More...
Acad::ErrorStatus  | dwgIn (AcDbDwgFiler *)
Calls the object's dwgInFields function, and reads any XData if present. More...
virtual Acad::ErrorStatus  | dwgInFields (AcDbDwgFiler *)
Reads the object from the DWG filer. More...
Acad::ErrorStatus  | dwgOut (AcDbDwgFiler *) const
Calls the object's dwgOutFields function, and writes any XData if present. More...
virtual Acad::ErrorStatus  | dwgOutFields (AcDbDwgFiler *) const
Writes the object to the DWG filer. More...
Acad::ErrorStatus  | dxfIn (AcDbDxfFiler *)
Calls the object's dxfInFields function, and reads any XData if present. More...
virtual Acad::ErrorStatus  | dxfInFields (AcDbDxfFiler *)
Reads the object from the DXF filer. More...
Acad::ErrorStatus  | dxfOut (AcDbDxfFiler *, Adesk::Boolean, Adesk::uchar *) const
Calls the object's dxfOutFields function, and writes any XData if present. More...
virtual Acad::ErrorStatus  | dxfOutFields (AcDbDxfFiler *) const
Writes the object to the DXF filer. More...
Acad::ErrorStatus  | erase (Adesk::Boolean=Adesk::kTrue)
Sets the bit that indicates that the object is erased. More...
virtual void  | erased (const AcDbObject *, Adesk::Boolean=Adesk::kTrue)
A handler function for persistent reactors. More...
AcDbObjectId  | extensionDictionary () const
Returns the object id of the extension dictionary for this object. More...
void  | getAcDbHandle (AcDbHandle &) const
Returns handle of this object. More...
Acad::ErrorStatus  | getBinaryData (const ACHAR *, Adesk::Int32 &, char *&) const
Creates a copy of the binary data stored as chunks of maximum 127 bytes in the resbuf chain of this object's extension dictionary xrecord entry given by entryName. More...
int  | getBrxOpenCount () const
This function returns the number of open BRX instances for this object. More...
int  | getBrxOpenState () const
This function returns the BRX object open state flags as bitfields, for diagnostic purpose. More...
virtual Acad::ErrorStatus  | getClassID (CLSID *) const final
Gets the COM wrapper Class ID for this entity. More...
int  | getCustomObjectState () const
This function returns the custom object status : 1=isCustomObject 2=DifferentialUndoDisabled. More...
Acad::ErrorStatus  | getField (const ACHAR *, AcDbField *&, AcDb::OpenMode) const
Retrieves the specified Field from this object, and opens it in mode. More...
Acad::ErrorStatus  | getField (const ACHAR *, AcDbObjectId &) const
Gets the pszPropName field object from field dictionary of this AcDbObject object, using pszPropName as key. More...
AcDbObjectId  | getFieldDictionary () const
Returns the Field dictionary associated with this object,. More...
Acad::ErrorStatus  | getFieldDictionary (AcDbDictionary *&, AcDb::OpenMode) const
Gets and opens the field dictionary for this. More...
Acad::ErrorStatus  | getObjectBirthVersion (AcDb::AcDbDwgVersion &, AcDb::MaintenanceReleaseVersion &)
This function is currently not supported by the CAD engine, always returns Acad::eOk, and 'kDHL_CURRENT' + 'kMReleaseCurrent' results. More...
virtual Acad::ErrorStatus  | getObjectSaveVersion (const AcDbDwgFiler *, AcDb::AcDbDwgVersion &, AcDb::MaintenanceReleaseVersion &)
Returns the DWG version for saving the object. More...
virtual Acad::ErrorStatus  | getObjectSaveVersion (const AcDbDxfFiler *, AcDb::AcDbDwgVersion &, AcDb::MaintenanceReleaseVersion &)
Returns the DWG version for saving the object. More...
int  | getOdaOpenCount () const
This function returns the number of open ODA instances for this object. More...
int  | getOdaOpenState () const
This function returns the ODA object open state flags as bitfields, for diagnostic purpose. More...
virtual void  | goodbye (const AcDbObject *)
A handler function for persistent reactors. More...
virtual AcGsNode *  | gsNode () const
Gets the AcGsNode (graphics cache) for this entity. More...
Acad::ErrorStatus  | handOverTo (AcDbObject *, Adesk::Boolean=Adesk::kTrue, Adesk::Boolean=Adesk::kTrue)
Hands over objects identity to another object. More...
bool  | hasFields () const
Return true if this object has single or multiple fields associated with him. More...
bool  | hasPersistentReactor (AcDbObjectId) const
Checks the input objectId in this object reactor list. More...
bool  | hasSaveVersionOverride ()
This function indicates whether this object overrides the filer's save version. More...
virtual AcDbObjectId  | id () const
Returns the database id of this object. More...
Adesk::Boolean  | isAcDbObjectIdsInFlux () const
Checks whether a deep clone operation was completed. More...
Adesk::Boolean  | isAProxy () const
Adesk::Boolean  | isCancelling () const
Adesk::Boolean  | isErased () const
Returns whether this object is erased. More...
Adesk::Boolean  | isEraseStatusToggled () const
Checks whether the object erase status has been toggled. More...
Adesk::Boolean  | isModified () const
Returns whether this object's assertWriteEnabled() has been called since it was opened. More...
Adesk::Boolean  | isModifiedGraphics () const
Checks whether this object graphics will be updated when the object is closed. More...
Adesk::Boolean  | isModifiedXData () const
Checks whether this object's xData was modified. More...
Adesk::Boolean  | isNewObject () const
Returns true if and only if this object has not been closed since it was created. More...
Adesk::Boolean  | isNotifyEnabled () const
Returns whether this object is opened for notify. More...
Adesk::Boolean  | isNotifying () const
virtual Adesk::Boolean  | isPersistent () const
Returns the 'persistent' status of a database object. More...
Adesk::Boolean  | isReadEnabled () const
Returns whether this object is opened for read. More...
 Adesk::Boolean  | isReallyClosing () const
Checks whether the next close call will completely close this object return true if on the next call the object will be completely closed false otherwise.
Adesk::Boolean  | isTransactionResident () const
Gets the object transaction status. More...
Adesk::Boolean  | isUndoing () const
bool  | isUndoRecordingDisabled () const
Returns whether the undo recording for the object is enabled or not. More...
Adesk::Boolean  | isWriteEnabled () const
Returns whether this object is opened for write. More...
virtual AcDb::DuplicateRecordCloning  | mergeStyle () const
Returns the object's merge behavior during cloning. More...
virtual void  | modified (const AcDbObject *)
A handler function for persistent reactors. More...
virtual void  | modifiedGraphics (const AcDbEntity *)
A handler function for persistent reactors. More...
virtual void  | modifiedXData (const AcDbObject *)
A handler function for persistent reactors. More...
virtual void  | modifyUndone (const AcDbObject *)
A handler function for persistent reactors. More...
virtual void  | objectClosed (const AcDbObjectId)
A handler function for persistent reactors. More...
AcDbObjectId  | objectId () const
Returns object id. More...
virtual void  | openedForModify (const AcDbObject *)
A handler function for persistent reactors. More...
AcDbObjectId  | ownerId () const
Returns object id of the owner. More...
AcDbVoidPtrArray *  | reactors ()
Gets the object pointers to reactors. More...
const AcDbVoidPtrArray *  | reactors () const
Gets the object pointers to reactors. More...
virtual void  | reappended (const AcDbObject *)
A handler function for persistent reactors. More...
 virtual void  | recvPropagateModify (const AcDbObject *)
Not implemented yet.
Acad::ErrorStatus  | releaseExtensionDictionary ()
Removes the extension dictionary associated with this object. More...
virtual Acad::ErrorStatus  | removeField (AcDbObjectId)
Removes the Field specified by acFieldId from this object. More...
virtual Acad::ErrorStatus  | removeField (const ACHAR *)
Removes the Field specified by szKeyString from this object. More...
virtual Acad::ErrorStatus  | removeField (const ACHAR *, AcDbObjectId &)
Removes the Field specified by acPszKeyString from this object, and returns its ObjectId value. More...
virtual Acad::ErrorStatus  | removePersistentReactor (AcDbObjectId)
Removes a persistent reactor from this object reactor list. More...
void  | removeReactor (AcDbObjectReactor *) const
Removes a transient reactor to this object. More...
void  | setAcDbObjectIdsInFlux ()
Call this function to indicate that the object IDs of this object and its sub-objects (if any) are not yet valid. More...
Acad::ErrorStatus  | setBinaryData (const ACHAR *, Adesk::Int32, const char *)
Creates a copy of the binary data, divides it in up to 127 bytes binary chunks and
 sets them as resbufs in the resbuf chain of this object's extension dictionary xrecord entry given by entryName. More...
virtual Acad::ErrorStatus  | setField (const ACHAR *, AcDbField *, AcDbObjectId &)
Adds the pAcField field object to field dictionary of this AcDbObject object, using pKey as key. More...
virtual void  | setGsNode (AcGsNode *)
Gets the AcGsNode (graphics cache) for this entity. More...
void  | setHasSaveVersionOverride (bool)
This function can be called to specify that the object has a "save version override". More...
virtual Acad::ErrorStatus  | setOwnerId (AcDbObjectId)
Sets the ownerId data member of the object to be objId. More...
virtual Acad::ErrorStatus  | setXData (const resbuf *)
Sets/removes xData associated with this object. More...
virtual Acad::ErrorStatus  | subCancel ()
Possibility to veto a cancel operation from within custom entities. More...
virtual Acad::ErrorStatus  | subClose ()
virtual Acad::ErrorStatus  | subErase (Adesk::Boolean)
This hook is called during an AcDbObject::erase call, before any actual erase operation is performed. More...
 virtual Acad::ErrorStatus  | subHandOverTo (AcDbObject *)
virtual void  | subObjModified (const AcDbObject *, const AcDbObject *)
A handler function for persistent reactors. More...
 virtual Acad::ErrorStatus  | subOpen (AcDb::OpenMode)
virtual Acad::ErrorStatus  | subSwapIdWith (AcDbObjectId, Adesk::Boolean=Adesk::kFalse, Adesk::Boolean=Adesk::kFalse)
This hook is called during an AcDbObject::swapIdWith() call, before any actual swap operation is performed. More...
Acad::ErrorStatus  | swapIdWith (AcDbObjectId, Adesk::Boolean=Adesk::kFalse, Adesk::Boolean=Adesk::kFalse)
Swaps the object id's between the object identified by param swapId and this object. More...
virtual Acad::ErrorStatus  | swapReferences (const AcDbIdMapping &)
Not implemented yet. More...
virtual void  | unappended (const AcDbObject *)
A handler function for persistent reactors. More...
AcDbDwgFiler *  | undoFiler ()
Gets the undo filer for this object. More...
Acad::ErrorStatus  | upgradeFromNotify (Adesk::Boolean &)
Upgrades the open status of this object to AcDb::kForWrite, if this object is already open (either in AcDb::kForRead, AcDb::kForNotify or AcDb::kForWrite) More...
Acad::ErrorStatus  | upgradeOpen ()
Changes the objects open mode to AcDb::kForWrite and sends notifications. More...
virtual Acad::ErrorStatus  | wblockClone (AcRxObject *, AcDbObject *&, AcDbIdMapping &, Adesk::Boolean=Adesk::kTrue) const final
Clones this object, appends it to the owner pOwner and adds an AcDbIdPair record to the idMap. More...
virtual resbuf *  | xData (const ACHAR *=NULL) const
Returns the xData associated with this object. More...
Acad::ErrorStatus  | xDataTransformBy (const AcGeMatrix3d &)
Transforms the extended data according to parameter transformation matrix. More...
 virtual void  | xmitPropagateModify () const
Not implemented yet.
 virtual  | ~AcDbObject ()
Destructor.
 Public Member Functions inherited from AcGiDrawable
virtual bool  | bounds (AcDbExtents &) const
virtual DrawableType  | drawableType () const
 virtual AcGiDrawStream *  | drawStream () const
virtual AcGsNode *  | gsNode () const =0
virtual AcDbObjectId  | id () const =0
virtual Adesk::Boolean  | isPersistent () const =0
virtual Adesk::UInt32  | regenSupportFlags () const final
Returns whether and to which level this object supports MultiThreading. More...
 virtual Adesk::Boolean  | RolloverHit (Adesk::ULongPtr, Adesk::ULongPtr, Adesk::Boolean)
 virtual Adesk::UInt32  | setAttributes (AcGiDrawableTraits *) final
 virtual void  | setDrawStream (AcGiDrawStream *)
virtual void  | setGsNode (AcGsNode *)=0
 virtual void  | viewportDraw (AcGiViewportDraw *) final
 virtual Adesk::UInt32  | viewportDrawLogicalFlags (AcGiViewportDraw *) final
 virtual Adesk::Boolean  | worldDraw (AcGiWorldDraw *) final
 Public Member Functions inherited from AcRxObject
virtual AcRxObject *  | clone () const
Exported and implemented. More...
 virtual AcRx::Ordering  | comparedTo (const AcRxObject *) const
Exported and implemented.
virtual Acad::ErrorStatus  | copyFrom (const AcRxObject *)
Exported and implemented. More...
 virtual AcRxClass *  | isA () const
Exported and implemented.
virtual Adesk::Boolean  | isEqualTo (const AcRxObject *) const
Exported and implemented. More...
bool  | isKindOf (const AcRxClass *) const
Checks the object class. More...
AcRxObject *  | queryX (const AcRxClass *) const
returns the protocol extension object assigned to this class or a parent class. More...
AcRxObject *  | x (const AcRxClass *) const
returns the protocol extension object assigned to this class or a parent class. More...
 virtual  | ~AcRxObject ()
Destructor.
 Public Attributes
AcDbCivilDbHAlignment
Default Constructor. More...
 Public Attributes inherited from AcDbCurve
AcDbCurve
Default constructor.
 Public Attributes inherited from AcDbEntity
AcDbEntity
This protected constructor sets the initial value for color to 257, and for the objectids for layer and linetype to AcDbObjectId::kNull. More...
 Additional Inherited Members
 Static Public Member Functions inherited from AcDbCurve
 static Acad::ErrorStatus  | createFromAcGeCurve (const AcGeCurve3d &, AcDbCurve *&, AcGeVector3d *=NULL, const AcGeTol &=AcGeContext::gTol)
 Static Public Member Functions inherited from AcRxObject
 static AcRxObject *  | cast (const AcRxObject *)
 static AcRxClass *  | desc ()
Exported and implemented.
 Static Public Member Functions inherited from AcHeapOperators
 static void  | operator delete (void *)
_
 static void  | operator delete (void *, const char *, int)
 static void  | operator delete (void *, void *)
 static void  | operator delete[] (void *)
_
 static void  | operator delete[] (void *, const char *, int)
 static void *  | operator new (size_t)
_
 static void *  | operator new (size_t, const char *, int)
 static void *  | operator new (size_t, void *p)
 static void *  | operator new[] (size_t)
_
 static void *  | operator new[] (size_t, const char *, int)
 Protected Member Functions inherited from AcDbEntity
 virtual Acad::ErrorStatus  | subAddSubentPaths (const AcDbFullSubentPathArray &)
 virtual Adesk::Boolean  | subCloneMeForDragging ()
 virtual Acad::ErrorStatus  | subDeleteSubentPaths (const AcDbFullSubentPathArray &)
virtual Acad::ErrorStatus  | subExplode (AcDbVoidPtrArray &) const
 virtual Acad::ErrorStatus  | subGetCompoundObjectTransform (AcGeMatrix3d &) const
virtual Acad::ErrorStatus  | subGetGeomExtents (AcDbExtents &) const
virtual Acad::ErrorStatus  | subGetGripEntityUCS (const void *, AcGeVector3d &, AcGePoint3d &, AcGeVector3d &) const
virtual Acad::ErrorStatus  | subGetGripPoints (AcDbGripDataPtrArray &, const double, const int, const AcGeVector3d &, const int) const
virtual Acad::ErrorStatus  | subGetGripPoints (AcGePoint3dArray &, AcDbIntArray &, AcDbIntArray &) const
 virtual Acad::ErrorStatus  | subGetGripPointsAtSubentPath (const AcDbFullSubentPath &, AcDbGripDataPtrArray &, const double, const int, const AcGeVector3d &, const int) const
virtual Acad::ErrorStatus  | subGetGsMarkersAtSubentPath (const AcDbFullSubentPath &, AcArray< Adesk::GsMarker > &) const
virtual Acad::ErrorStatus  | subGetOsnapPoints (AcDb::OsnapMode, Adesk::GsMarker, const AcGePoint3d &, const AcGePoint3d &, const AcGeMatrix3d &, AcGePoint3dArray &, AcDbIntArray &) const
 virtual Acad::ErrorStatus  | subGetOsnapPoints (AcDb::OsnapMode, Adesk::GsMarker, const AcGePoint3d &, const AcGePoint3d &, const AcGeMatrix3d &, AcGePoint3dArray &, AcDbIntArray &, const AcGeMatrix3d &) const
virtual Acad::ErrorStatus  | subGetStretchPoints (AcGePoint3dArray &) const
 virtual Acad::ErrorStatus  | subGetSubentClassId (const AcDbFullSubentPath &, CLSID *) const
 virtual Acad::ErrorStatus  | subGetSubentPathGeomExtents (const AcDbFullSubentPath &, AcDbExtents &) const
virtual Acad::ErrorStatus  | subGetSubentPathsAtGsMarker (AcDb::SubentType, Adesk::GsMarker, const AcGePoint3d &, const AcGeMatrix3d &, int &, AcDbFullSubentPath *&, int=0, AcDbObjectId *=nullptr) const
virtual Acad::ErrorStatus  | subGetTransformedCopy (const AcGeMatrix3d &, AcDbEntity *&) const
virtual void  | subGripStatus (const AcDb::GripStat)
 virtual bool  | subHideMeForDragging () const
virtual Acad::ErrorStatus  | subHighlight (const AcDbFullSubentPath &=kNullSubent, const Adesk::Boolean=false) const
virtual Acad::ErrorStatus  | subIntersectWith (const AcDbEntity *, AcDb::Intersect, AcGePoint3dArray &, Adesk::GsMarker=0, Adesk::GsMarker=0) const
virtual Acad::ErrorStatus  | subIntersectWith (const AcDbEntity *, AcDb::Intersect, const AcGePlane &, AcGePoint3dArray &, Adesk::GsMarker=0, Adesk::GsMarker=0) const
virtual bool  | subIsContentSnappable () const
virtual void  | subList () const
virtual Acad::ErrorStatus  | subMoveGripPointsAt (const AcDbIntArray &, const AcGeVector3d &)
virtual Acad::ErrorStatus  | subMoveGripPointsAt (const AcDbVoidPtrArray &, const AcGeVector3d &, const int)
 virtual Acad::ErrorStatus  | subMoveGripPointsAtSubentPaths (const AcDbFullSubentPathArray &, const AcDbVoidPtrArray &, const AcGeVector3d &, const int)
virtual Acad::ErrorStatus  | subMoveStretchPointsAt (const AcDbIntArray &, const AcGeVector3d &)
virtual Adesk::UInt32  | subSetAttributes (AcGiDrawableTraits *)
Sets the values of this object's subentity traits and returns with the calling object's subentity traits. More...
virtual Acad::ErrorStatus  | subSetVisibility (AcDb::Visibility, Adesk::Boolean=true)
 virtual void  | subSubentGripStatus (const AcDb::GripStat, const AcDbFullSubentPath &)
virtual AcDbEntity *  | subSubentPtr (const AcDbFullSubentPath &) const
virtual Acad::ErrorStatus  | subTransformBy (const AcGeMatrix3d &)
 virtual Acad::ErrorStatus  | subTransformSubentPathsBy (const AcDbFullSubentPathArray &, const AcGeMatrix3d &)
virtual Acad::ErrorStatus  | subUnhighlight (const AcDbFullSubentPath &=kNullSubent, const Adesk::Boolean=false) const
virtual void  | subViewportDraw (AcGiViewportDraw *)
 virtual AcDb::Visibility  | subVisibility () const
virtual Adesk::Boolean  | subWorldDraw (AcGiWorldDraw *)
 Protected Member Functions inherited from AcDbObject
virtual Acad::ErrorStatus  | subDeepClone (AcDbObject *, AcDbObject *&, AcDbIdMapping &, Adesk::Boolean=true) const
virtual Acad::ErrorStatus  | subGetClassID (CLSID *) const
virtual Adesk::UInt32  | subSetAttributes (AcGiDrawableTraits *)
Sets the values of this object's subentity traits and returns with the calling object's subentity traits. More...
virtual void  | subViewportDraw (AcGiViewportDraw *)
virtual Adesk::UInt32  | subViewportDrawLogicalFlags (AcGiViewportDraw *)
virtual Acad::ErrorStatus  | subWblockClone (AcRxObject *, AcDbObject *&, AcDbIdMapping &, Adesk::Boolean=true) const
virtual Adesk::Boolean  | subWorldDraw (AcGiWorldDraw *)
 Protected Member Functions inherited from AcGiDrawable
virtual Adesk::UInt32  | subRegenSupportFlags () const
Returns whether and to which level this object supports MultiThreading. More...
virtual Adesk::UInt32  | subSetAttributes (AcGiDrawableTraits *)=0
virtual void  | subViewportDraw (AcGiViewportDraw *)=0
 virtual Adesk::UInt32  | subViewportDrawLogicalFlags (AcGiViewportDraw *)
virtual Adesk::Boolean  | subWorldDraw (AcGiWorldDraw *)=0
 Protected Member Functions inherited from AcRxObject
AcRxObject ()
Exported and implemented.
Detailed Description
Civil Db Horizontal Alignment base class.
Constructor & Destructor Documentation
◆ ~AcDbCivilDbHAlignment()
 UX_EXPORT_FUNCTION AcDbCivilDbHAlignment::~AcDbCivilDbHAlignment  |  ( |   | )
virtual
Destructor.
Date
2021 torstenm implemented
Member Function Documentation
◆ addArcAuto()
 UX_EXPORT_FUNCTION Adesk::UInt64 AcDbCivilDbHAlignment::addArcAuto  |  ( |  Adesk::UInt64  |  prevId,
|  Adesk::UInt64  |  nextId
)
Adds an automatic arc element between the previous and next position index to this horizontal alignment.
Parameters
[in] | prevId | - the index ID of the previous element
[in] | nextId | - the index ID of the next element
Returns
Adesk::UInt64 - the element ID of the added element, or 0 in case of an error
Date
2021 torstenm implemented
◆ addArcBetween() [1/2]
 UX_EXPORT_FUNCTION Adesk::UInt64 AcDbCivilDbHAlignment::addArcBetween  |  ( |  Adesk::UInt64  |  prevId,
|  Adesk::UInt64  |  nextId,
|  const AcGePoint2d &  |  passThrough
)
Adds an arc element defined between previous and next position index, using a passthrough point.
Parameters
[in] | prevId | - the ID of the previous Id element
[in] | nextId | - the ID of the next Id element
[in] | passThroughPoint | - the pass-through point of the arc element
Returns
Adesk::UInt64 - the element ID of the added element, or 0 in case of an error
Date
2021 torstenm implemented
◆ addArcBetween() [2/2]
 UX_EXPORT_FUNCTION Adesk::UInt64 AcDbCivilDbHAlignment::addArcBetween  |  ( |  Adesk::UInt64  |  prevId,
|  Adesk::UInt64  |  nextId,
|  double  |  paramValue,
|  AcDbCivilDbHAlignment::EArcParameterType  |  paramType = AcDbCivilDbHAlignment::EArcParameterType::eRadius,
|  bool  |  isGreaterThan180 = false,
|  AcDbCivilDbHAlignment::EArcType  |  arcType = EArcType::eCompound
)
Adds an arc element defined between previous and next position index, using parameter of given type, and arc size and arc type.
Parameters
[in] | prevId | - the ID of the previous element
[in] | nextId | - the ID of the next element
[in] | paramValue | - the constraint parameter value (depends on 'paramType')
[in] | paramType | - AcDbCivilDbHAlignment::EArcParameterType : the constraint parameter type
[in] | isGreaterThan180 | - boolean flag : true if the arc is larger than PI, false if shorter
[in] | arcType | - AcDbCivilDbHAlignment::EArcType : the arc type
Returns
Adesk::UInt64 - the element ID of the added element, or 0 in case of an error
Date
2021 torstenm implemented
◆ addArcFixed() [1/2]
 UX_EXPORT_FUNCTION Adesk::UInt64 AcDbCivilDbHAlignment::addArcFixed  |  ( |  const AcGePoint2d &  |  center,
|  double  |  radius,
|  bool  |  isClockwise
)
Adds a fixed arc element defined by center point, radius and direction to this horizontal alignment.
Parameters
[in] | center | - the center point of the fixed arc element
[in] | radius | - the radius of the fixed arc element
[in] | isClockwise | - defines the orientation of the fixed arc element
Returns
Adesk::UInt64 - the element ID of the added element, or 0 in case of an error
Date
2021 torstenm implemented
◆ addArcFixed() [2/2]
 UX_EXPORT_FUNCTION Adesk::UInt64 AcDbCivilDbHAlignment::addArcFixed  |  ( |  const AcGePoint2d &  |  startPoint,
|  const AcGePoint2d &  |  midPoint,
|  const AcGePoint2d &  |  endPoint
)
Adds an arc element defined by start point, middle point and end point to this horizontal alignment.
Parameters
[in] | startPoint | - the start point of the arc element
[in] | midPoint | - the middle point of the arc element
[in] | endPoint | - the end point of the arc element
Returns
Adesk::UInt64 - the element ID of the added element, or 0 in case of an error
Date
2021 torstenm implemented
◆ addArcFrom() [1/4]
 UX_EXPORT_FUNCTION Adesk::UInt64 AcDbCivilDbHAlignment::addArcFrom  |  ( |  Adesk::UInt64  |  prevId,
|  const AcGePoint2d &  |  passThroughPoint
)
Adds an arc element defined by previous position index and a passthrough point to this horizontal alignment.
Parameters
[in] | prevId | - the ID of the previous element
[in] | passThroughPoint | - the pass-through point of the arc element
Returns
Adesk::UInt64 - the element ID of the added element, or 0 in case of an error
Date
2021 torstenm implemented
◆ addArcFrom() [2/4]
 UX_EXPORT_FUNCTION Adesk::UInt64 AcDbCivilDbHAlignment::addArcFrom  |  ( |  Adesk::UInt64  |  prevId,
|  const AcGePoint2d &  |  passThroughPoint,
|  const AcGeVector2d &  |  direction
)
Adds an arc element defined by next position index, a passthrough point and the direction at the passthrough point to this horizontal alignment.
Parameters
[in] | prevId | - the ID of the previous element
[in] | passThroughPoint | - the pass-through point of the arc element
[in] | direction | - the direction vector at the pass-through point
Returns
Adesk::UInt64 - the element ID of the added element, or 0 in case of an error
Date
2021 torstenm implemented
◆ addArcFrom() [3/4]
 UX_EXPORT_FUNCTION Adesk::UInt64 AcDbCivilDbHAlignment::addArcFrom  |  ( |  Adesk::UInt64  |  prevId,
|  double  |  radius,
|  double  |  paramValue,
|  AcDbCivilDbHAlignment::EArcParameterType  |  paramType,
|  bool  |  isClockwise
)
Adds an arc element defined by previous position index, radius, constraint parameter value and type.
Parameters
[in] | prevId | - the ID of the previous Id element
[in] | radius | - the radius of the arc element
[in] | paramValue | - the constraint parameter value (depends on 'paramType')
[in] | paramType | - AcDbCivilDbHAlignment::EArcParameterType : the constraint parameter type
[in] | isClockwise | - defines the orientation of the fixed arc element
Returns
Adesk::UInt64 - the element ID of the added element, or 0 in case of an error
Date
2021 torstenm implemented
◆ addArcFrom() [4/4]
 UX_EXPORT_FUNCTION Adesk::UInt64 AcDbCivilDbHAlignment::addArcFrom  |  ( |  Adesk::UInt64  |  prevId,
|  const AcGePoint2d &  |  passThroughPoint,
|  double  |  radius,
|  bool  |  isGreaterThan180,
|  AcDbCivilDbHAlignment::EArcType  |  arcType
)
Adds an arc element defined by previous position index, a passthrough point, the radius, a flag that determines whether the arc is greater than PI, and the curve type.
Parameters
[in] | prevId | - the ID of the previous Id element
[in] | passThroughPoint | - the pass-through point of the arc element
[in] | radius | - the radius of the arc element
[in] | isGreaterThan180 | - boolean flag : true if the arc is larger than PI, false if shorter
[in] | arcType | - AcDbCivilDbHAlignment::EArcType : the arc type
Returns
Adesk::UInt64 - the element ID of the added element, or 0 in case of an error
Date
2021 torstenm implemented
◆ addArcTo() [1/4]
 UX_EXPORT_FUNCTION Adesk::UInt64 AcDbCivilDbHAlignment::addArcTo  |  ( |  Adesk::UInt64  |  nextId,
|  const AcGePoint2d &  |  passThroughPoint
)
Adds an arc element defined by next position index and a passthrough point to this horizontal alignment.
Parameters
[in] | nextId | - the ID of the next element
[in] | passThroughPoint | - the pass-through point of the arc element
Returns
Adesk::UInt64 - the element ID of the added element, or 0 in case of an error
Date
2021 torstenm implemented
◆ addArcTo() [2/4]
 UX_EXPORT_FUNCTION Adesk::UInt64 AcDbCivilDbHAlignment::addArcTo  |  ( |  Adesk::UInt64  |  nextId,
|  const AcGePoint2d &  |  passThroughPoint,
|  const AcGeVector2d &  |  direction
)
Adds an arc element defined by next position index, a passthrough point and the direction at the passthrough point to this horizontal alignment.
Parameters
[in] | nextId | - the ID of the next element
[in] | passThroughPoint | - the pass-through point of the arc element
[in] | direction | - the direction vector at the pass-through point
Returns
Adesk::UInt64 - the element ID of the added element, or 0 in case of an error
Date
2021 torstenm implemented
◆ addArcTo() [3/4]
 UX_EXPORT_FUNCTION Adesk::UInt64 AcDbCivilDbHAlignment::addArcTo  |  ( |  Adesk::UInt64  |  nextId,
|  const AcGePoint2d &  |  passThroughPoint,
|  double  |  radius,
|  bool  |  isGreaterThan180,
|  AcDbCivilDbHAlignment::EArcType  |  arcType
)
Adds an arc element defined by next position index, a passthrough point, the radius, a flag that determines whether the arc is greater than PI, and the curve type.
Parameters
[in] | nextId | - the ID of the next Id element
[in] | passThroughPoint | - the pass-through point of the arc element
[in] | radius | - the radius of the arc element
[in] | isGreaterThan180 | - boolean flag : true if the arc is larger than PI, false if shorter
[in] | arcType | - AcDbCivilDbHAlignment::EArcType : the arc type
Returns
Adesk::UInt64 - the element ID of the added element, or 0 in case of an error
Date
2021 torstenm implemented
◆ addArcTo() [4/4]
 UX_EXPORT_FUNCTION Adesk::UInt64 AcDbCivilDbHAlignment::addArcTo  |  ( |  Adesk::UInt64  |  nextId,
|  double  |  radius,
|  double  |  paramValue,
|  AcDbCivilDbHAlignment::EArcParameterType  |  paramType,
|  bool  |  isClockwise
)
Adds an arc element defined by next position index, radius, constraint parameter value and type.
Parameters
[in] | nextId | - the ID of the next Id element
[in] | radius | - the radius of the arc element
[in] | paramValue | - the constraint parameter value (depends on 'paramType')
[in] | paramType | - AcDbCivilDbHAlignment::EArcParameterType : the constraint parameter type
[in] | isClockwise | - defines the orientation of the fixed arc element
Returns
Adesk::UInt64 - the element ID of the added element, or 0 in case of an error
Date
2021 torstenm implemented
◆ addCSSTo()
 UX_EXPORT_FUNCTION Adesk::UInt64 AcDbCivilDbHAlignment::addCSSTo  |  ( |  Adesk::UInt64  |  nextId,
|  double  |  spiral1Param,
|  double  |  spiral2Param,
|  AcDbCivilDbHAlignment::ESpiralParameterType  |  spiralParamType,
|  double  |  radius,
|  const AcGePoint2d &  |  passThroughPoint,
|  AcDbCivilDbHAlignment::ESpiralDefinitionType  |  spiralDefinitionType
)
Adds a 'curve-spiral-spiral' alignment element before next position index, constrained by parameters for the first and second spiral elements, radius of the curve/arc, the arc length and orientation, and the spiral definition type.
Parameters
[in] | nextId | - the ID of the next element
[in] | spiral1Param | - the parameter value
[in] | spiral2Param | - the parameter value
[in] | spiralParamType | - AcDbCivilDbHAlignment::ESpiralParameterType, the type of the spiral parameters
[in] | radius | - the radius for the curve/arc element
[in] | passThroughPoint | - the 2D pass-through point
[in] | spiralDefinitionType | - AcDbCivilDbHAlignment::ESpiralDefinitionType, the spiral type
Returns
Adesk::UInt64 - the element ID of the added element, or 0 in case of an error
Date
2021 torstenm implemented
◆ addCSTo() [1/2]
 UX_EXPORT_FUNCTION Adesk::UInt64 AcDbCivilDbHAlignment::addCSTo  |  ( |  Adesk::UInt64  |  nextId,
|  double  |  spiralParam,
|  AcDbCivilDbHAlignment::ESpiralParameterType  |  spiralParamType,
|  double  |  radius,
|  const AcGePoint2d &  |  passThroughPoint,
|  bool  |  isGreaterThan180,
|  AcDbCivilDbHAlignment::ESpiralDefinitionType  |  spiralDefinitionType
)
Adds a 'curve-spiral' alignment element before next position index, constrained by a spiral parameter and radius of the curve/arc, the pass-through point, an arc size flag, and the spiral definition type.
Parameters
[in] | nextId | - the ID of the next element
[in] | spiralParam | - the parameter value
[in] | spiralParamType | - AcDbCivilDbHAlignment::ESpiralParameterType, the type of the spiral parameter
[in] | radius | - the radius for the curve/arc element
[in] | passThroughPoint | - the 2D pass-through point
[in] | isGreaterThan180 | - defines whether the curve/arc is spans over more than 180 degrees
[in] | spiralDefinitionType | - AcDbCivilDbHAlignment::ESpiralDefinitionType, the spiral type
Returns
Adesk::UInt64 - the element ID of the added element, or 0 in case of an error
Date
2021 torstenm implemented
◆ addCSTo() [2/2]
 UX_EXPORT_FUNCTION Adesk::UInt64 AcDbCivilDbHAlignment::addCSTo  |  ( |  Adesk::UInt64  |  nextId,
|  double  |  spiralParam,
|  AcDbCivilDbHAlignment::ESpiralParameterType  |  spiralParamType,
|  double  |  radius,
|  double  |  arcLength,
|  bool  |  isClockwise,
|  AcDbCivilDbHAlignment::ESpiralDefinitionType  |  spiralDefinitionType
)
Adds a 'curve-spiral' alignment element before next position index, constrained by a spiral parameter and radius of the curve/arc, the arc length and orientation, and the spiral definition type.
Parameters
[in] | nextId | - the ID of the next element
[in] | spiralParam | - the parameter value
[in] | spiralParamType | - AcDbCivilDbHAlignment::ESpiralParameterType, the type of the spiral parameter
[in] | radius | - the radius for the curve/arc element
[in] | arcLength | - the length of the curve/arc element
[in] | isClockwise | - defines whether the curve/arc is clockwise (true) or anti-clockwise (false)
[in] | spiralDefinitionType | - AcDbCivilDbHAlignment::ESpiralDefinitionType, the spiral type
Returns
Adesk::UInt64 - the element ID of the added element, or 0 in case of an error
Date
2021 torstenm implemented
◆ addLineBetween()
 UX_EXPORT_FUNCTION Adesk::UInt64 AcDbCivilDbHAlignment::addLineBetween  |  ( |  Adesk::UInt64  |  prevId,
|  Adesk::UInt64  |  nextId
)
Adds a line element defined by previous and next element to this horizontal alignment.
Parameters
[in] | prevId | - the ID of the previous element
[in] | nextId | - the ID of the next element
Returns
Adesk::UInt64 - the element ID of the added element, or 0 in case of an error
Date
2021 torstenm implemented
◆ addLineFixed() [1/2]
 UX_EXPORT_FUNCTION Adesk::UInt64 AcDbCivilDbHAlignment::addLineFixed  |  ( |  Adesk::UInt64  |  prevId,
|  double  |  length
)
Adds a fixed line element after specified element ID, with given length, to this horizontal alignment.
Parameters
[in] | prevId | - the ID of the preceding element, to add the new fixed line element after
[in] | length | - the length parameter for the fixed line element being added
Returns
Adesk::UInt64 - the element ID of the added element, or 0 in case of an error
Date
2021 torstenm implemented
◆ addLineFixed() [2/2]
 UX_EXPORT_FUNCTION Adesk::UInt64 AcDbCivilDbHAlignment::addLineFixed  |  ( |  const AcGePoint2d &  |  startPoint,
|  const AcGePoint2d &  |  endPoint
)
Adds a fixed line element defined with startPoint + endPoint, to this horizontal alignment.
Parameters
[in] | startPoint | - the start point for the fixed line element
[in] | endPoint | - the end point for the fixed line element
Returns
Adesk::UInt64 - the element ID of the added element, or 0 in case of an error
Date
2021 torstenm implemented
◆ addLineFrom() [1/2]
 UX_EXPORT_FUNCTION Adesk::UInt64 AcDbCivilDbHAlignment::addLineFrom  |  ( |  Adesk::UInt64  |  prevId,
|  const AcGePoint2d &  |  point
)
Adds a line element towards the specified previous element ID using given the specified pass-through point, to this horizontal alignment.
Parameters
[in] | prevId | - the ID of the previous element
[in] | point | - the pass-through point for the line element
Returns
Adesk::UInt64 - the element ID of the added element, or 0 in case of an error
Date
2021 torstenm implemented
◆ addLineFrom() [2/2]
 UX_EXPORT_FUNCTION Adesk::UInt64 AcDbCivilDbHAlignment::addLineFrom  |  ( |  Adesk::UInt64  |  prevId,
|  double  |  length
)
Adds a line element towards the specified previous element ID using given line length, to this horizontal alignment.
Parameters
[in] | prevId | - the ID of the previous element
[in] | length | - the length for the line element to be added
Returns
Adesk::UInt64 - the element ID of the added element, or 0 in case of an error
Date
2021 torstenm implemented
◆ addLineTo() [1/2]
 UX_EXPORT_FUNCTION Adesk::UInt64 AcDbCivilDbHAlignment::addLineTo  |  ( |  Adesk::UInt64  |  nextId,
|  const AcGePoint2d &  |  point
)
Adds a line element towards the specified next element ID using given the specified pass-through point, to this horizontal alignment.
Parameters
[in] | nextId | - the ID of the next element
[in] | point | - the pass-through point for the line element
Returns
Adesk::UInt64 - the element ID of the added element, or 0 in case of an error
Date
2021 torstenm implemented
◆ addLineTo() [2/2]
 UX_EXPORT_FUNCTION Adesk::UInt64 AcDbCivilDbHAlignment::addLineTo  |  ( |  Adesk::UInt64  |  nextId,
|  double  |  length
)
Adds a line element towards the specified next element ID using given line length, to this horizontal alignment.
Parameters
[in] | nextId | - the ID of the next element
[in] | length | - the length for the line element to be added
Returns
Adesk::UInt64 - the element ID of the added element, or 0 in case of an error
Date
2021 torstenm implemented
◆ addSCFrom() [1/2]
 UX_EXPORT_FUNCTION Adesk::UInt64 AcDbCivilDbHAlignment::addSCFrom  |  ( |  Adesk::UInt64  |  prevId,
|  double  |  spiralParam,
|  AcDbCivilDbHAlignment::ESpiralParameterType  |  spiralParamType,
|  double  |  radius,
|  const AcGePoint2d &  |  passThroughPoint,
|  bool  |  isGreaterThan180,
|  AcDbCivilDbHAlignment::ESpiralDefinitionType  |  spiralDefinitionType
)
Adds a 'spiral-curve' alignment element after previous position index, constrained by a spiral parameter and radius of the curve/arc, the pass-through point, an arc size flag, and the spiral definition type.
Parameters
[in] | prevId | - the ID of the previous element
[in] | spiralParam | - the parameter value
[in] | spiralParamType | - AcDbCivilDbHAlignment::ESpiralParameterType, the type of the spiral parameter
[in] | radius | - the radius for the curve/arc element
[in] | passThroughPoint | - the 2D pass-through point
[in] | isGreaterThan180 | - defines whether the curve/arc is spans over more than 180 degrees
[in] | spiralDefinitionType | - AcDbCivilDbHAlignment::ESpiralDefinitionType, the spiral type
Returns
Adesk::UInt64 - the element ID of the added element, or 0 in case of an error
Date
2021 torstenm implemented
◆ addSCFrom() [2/2]
 UX_EXPORT_FUNCTION Adesk::UInt64 AcDbCivilDbHAlignment::addSCFrom  |  ( |  Adesk::UInt64  |  prevId,
|  double  |  spiralParam,
|  AcDbCivilDbHAlignment::ESpiralParameterType  |  spiralParamType,
|  double  |  radius,
|  double  |  arcLength,
|  bool  |  isClockwise,
|  AcDbCivilDbHAlignment::ESpiralDefinitionType  |  spiralDefinitionType
)
Adds a 'spiral-curve' alignment element after previous position index, constrained by a spiral parameter and radius of the curve/arc, the arc length and orientation, and the spiral definition type.
Parameters
[in] | prevId | - the ID of the previous element
[in] | spiralParam | - the parameter value
[in] | spiralParamType | - AcDbCivilDbHAlignment::ESpiralParameterType, the type of the spiral parameter
[in] | radius | - the radius for the curve/arc element
[in] | arcLength | - the length of the curve/arc element
[in] | isClockwise | - defines whether the curve/arc is clockwise (true) or anti-clockwise (false)
[in] | spiralDefinitionType | - AcDbCivilDbHAlignment::ESpiralDefinitionType, the spiral type
Returns
Adesk::UInt64 - the element ID of the added element, or 0 in case of an error
Date
2021 torstenm implemented
◆ addSCSAuto()
 UX_EXPORT_FUNCTION Adesk::UInt64 AcDbCivilDbHAlignment::addSCSAuto  |  ( |  Adesk::UInt64  |  prevId,
|  Adesk::UInt64  |  nextId
)
Adds a 'spiral-curve-spiral' automatic alignment element between the previous and next position index.
Parameters
[in] | prevId | - the ID of the previous element
[in] | nextId | - the ID of the next element
Returns
Adesk::UInt64 - the element ID of the added element, or 0 in case of an error
Date
2021 torstenm implemented
◆ addSCSBetween()
 UX_EXPORT_FUNCTION Adesk::UInt64 AcDbCivilDbHAlignment::addSCSBetween  |  ( |  Adesk::UInt64  |  prevId,
|  Adesk::UInt64  |  nextId,
|  double  |  spiral1Param,
|  double  |  spiral2Param,
|  AcDbCivilDbHAlignment::ESpiralParameterType  |  spiralParamType,
|  double  |  radius,
|  AcDbCivilDbHAlignment::ESpiralDefinitionType  |  spiralDefinitionType
)
Adds a spiral-curve-spiral' alignment element between previous and next position index, using 2 parameters of given type, radius, and spiral type.
Parameters
[in] | prevId | - the ID of the previous element
[in] | nextId | - the ID of the next element
[in] | spiral1Param | - parameter value for spiral 1
[in] | spiral2Param | - parameter value for spiral 2
[in] | spiralParamType | - AcDbCivilDbHAlignment::ESpiralParameterType, type of spiral parameters
[in] | radius | - the element radius
[in] | spiralDefinitionType | - AcDbCivilDbHAlignment::ESpiralDefinitionType, the spiral type
Returns
Adesk::UInt64 - the element ID of the added element, or 0 in case of an error
Date
2021 torstenm implemented
◆ addSpiralBetween()
 UX_EXPORT_FUNCTION Adesk::UInt64 AcDbCivilDbHAlignment::addSpiralBetween  |  ( |  Adesk::UInt64  |  prevId,
|  Adesk::UInt64  |  nextId,
|  AcDbCivilDbHAlignment::ESpiralDefinitionType  |  spiralDefinitionType
)
Adds a spiral alignment element between previous and next position index, using the spiral definition type.
Parameters
[in] | prevId | - the ID of the previous element
[in] | nextId | - the ID of the next element
[in] | spiralDefinitionType | - AcDbCivilDbHAlignment::ESpiralDefinitionType, the spiral type
Returns
Adesk::UInt64 - the element ID of the added element, or 0 in case of an error
Date
2021 torstenm implemented
◆ addSpiralFrom()
 UX_EXPORT_FUNCTION Adesk::UInt64 AcDbCivilDbHAlignment::addSpiralFrom  |  ( |  Adesk::UInt64  |  prevId,
|  double  |  radius,
|  double  |  length,
|  bool  |  isClockwise,
|  AcDbCivilDbHAlignment::ESpiralDefinitionType  |  spiralDefinitionType
)
Adds a spiral alignment element after previous index, using radius, length and arc orientation flag, based on the spiral definition type.
Parameters
[in] | prevId | - the ID of the previous element
[in] | radius | - radius of the spiral element
[in] | length | - length of the spiral element
[in] | isClockwise | - defines whether the spiral goes clockwise (true) or anto-clockwise (false)
[in] | spiralDefinitionType | - AcDbCivilDbHAlignment::ESpiralDefinitionType, the spiral type
Returns
Adesk::UInt64 - the element ID of the added element, or 0 in case of an error
Date
2021 torstenm implemented
◆ addSpiralTo()
 UX_EXPORT_FUNCTION Adesk::UInt64 AcDbCivilDbHAlignment::addSpiralTo  |  ( |  Adesk::UInt64  |  nextId,
|  double  |  radius,
|  double  |  length,
|  bool  |  isClockwise,
|  AcDbCivilDbHAlignment::ESpiralDefinitionType  |  spiralDefinitionType
)
Adds a spiral alignment element before next index, using radius, length and arc orientation flag, based on the spiral definition type.
Parameters
[in] | nextId | - the ID of the next element
[in] | radius | - radius of the spiral element
[in] | length | - length of the spiral element
[in] | isClockwise | - defines whether the spiral goes clockwise (true) or anto-clockwise (false)
[in] | spiralDefinitionType | - AcDbCivilDbHAlignment::ESpiralDefinitionType, the spiral type
Returns
Adesk::UInt64 - the element ID of the added element, or 0 in case of an error
Date
2021 torstenm implemented
◆ addSSBetween()
 UX_EXPORT_FUNCTION Adesk::UInt64 AcDbCivilDbHAlignment::addSSBetween  |  ( |  Adesk::UInt64  |  prevId,
|  Adesk::UInt64  |  nextId,
|  double  |  spiralRatio,
|  AcDbCivilDbHAlignment::ESpiralParameterType  |  spiralParamType,
|  AcDbCivilDbHAlignment::ESpiralDefinitionType  |  spiralDefinitionType
)
Adds a 'spiral-spiral' alignment element between previous and next position index, using ratio and spiral parameter and definition type.
Parameters
[in] | prevId | - the ID of the previous element
[in] | nextId | - the ID of the next element
[in] | spiralRatio | - ratio between spirals
[in] | spiralParamType | - AcDbCivilDbHAlignment::ESpiralParameterType, type of spiral parameters
[in] | spiralDefinitionType | - AcDbCivilDbHAlignment::ESpiralDefinitionType, the spiral type
Returns
Adesk::UInt64 - the element ID of the added element, or 0 in case of an error
Date
2021 torstenm implemented
◆ addSSCFrom()
 UX_EXPORT_FUNCTION Adesk::UInt64 AcDbCivilDbHAlignment::addSSCFrom  |  ( |  Adesk::UInt64  |  prevId,
|  double  |  spiral1Param,
|  double  |  spiral2Param,
|  AcDbCivilDbHAlignment::ESpiralParameterType  |  spiralParamType,
|  double  |  radius,
|  const AcGePoint2d &  |  passThroughPoint,
|  AcDbCivilDbHAlignment::ESpiralDefinitionType  |  spiralDefinitionType
)
Adds a 'spiral-spiral-curve' alignment element after previous position index, constrained by parameters for the first and second spiral elements, radius of the curve/arc, the arc length and orientation, and the spiral definition type.
Parameters
[in] | prevId | - the ID of the previous element
[in] | spiral1Param | - the parameter value
[in] | spiral2Param | - the parameter value
[in] | spiralParamType | - AcDbCivilDbHAlignment::ESpiralParameterType, the type of the spiral parameters
[in] | radius | - the radius for the curve/arc element
[in] | passThroughPoint | - the 2D pass-through point
[in] | spiralDefinitionType | - AcDbCivilDbHAlignment::ESpiralDefinitionType, the spiral type
Returns
Adesk::UInt64 - the element ID of the added element, or 0 in case of an error
Date
2021 torstenm implemented
◆ addSTFrom() [1/2]
 UX_EXPORT_FUNCTION Adesk::UInt64 AcDbCivilDbHAlignment::addSTFrom  |  ( |  Adesk::UInt64  |  prevId,
|  double  |  spiralParam,
|  AcDbCivilDbHAlignment::ESpiralParameterType  |  spiralParamType,
|  const AcGePoint2d &  |  passThroughPoint,
|  AcDbCivilDbHAlignment::ESpiralDefinitionType  |  spiralDefinitionType
)
Adds a 'spiral-line' alignment element between previous and next position index, using the spiral definition type.
Parameters
[in] | prevId | - the ID of the previous element
[in] | spiralParam | - the parameter value
[in] | spiralParamType | - AcDbCivilDbHAlignment::ESpiralParameterType, the type of the spiral parameter
[in] | passThroughPoint | - the 2D pass-through point
[in] | spiralDefinitionType | - AcDbCivilDbHAlignment::ESpiralDefinitionType, the spiral type
Returns
Adesk::UInt64 - the element ID of the added element, or 0 in case of an error
Date
2021 torstenm implemented
◆ addSTFrom() [2/2]
 UX_EXPORT_FUNCTION Adesk::UInt64 AcDbCivilDbHAlignment::addSTFrom  |  ( |  Adesk::UInt64  |  prevId,
|  double  |  spiralParam,
|  AcDbCivilDbHAlignment::ESpiralParameterType  |  spiralParamType,
|  double  |  tangentLength,
|  AcDbCivilDbHAlignment::ESpiralDefinitionType  |  spiralDefinitionType
)
Adds a 'spiral-line' alignment element after previous position index, constrained by a spiral parameter and length of the line, and the spiral definition type.
Parameters
[in] | prevId | - the ID of the previous element
[in] | spiralParam | - the parameter value
[in] | spiralParamType | - AcDbCivilDbHAlignment::ESpiralParameterType, the type of the spiral parameter
[in] | tangentLength | - the line length parameter
[in] | spiralDefinitionType | - AcDbCivilDbHAlignment::ESpiralDefinitionType, the spiral type
Returns
Adesk::UInt64 - the element ID of the added element, or 0 in case of an error
Date
2021 torstenm implemented
◆ addSTSBetween()
 UX_EXPORT_FUNCTION Adesk::UInt64 AcDbCivilDbHAlignment::addSTSBetween  |  ( |  Adesk::UInt64  |  prevId,
|  Adesk::UInt64  |  nextId,
|  double  |  spiral1Param,
|  double  |  spiral2Param,
|  AcDbCivilDbHAlignment::ESpiralParameterType  |  spiralParamType,
|  AcDbCivilDbHAlignment::ESpiralDefinitionType  |  spiralDefinitionType
)
Adds a spiral-curve-spiral' alignment element between previous and next position index, using 2 parameters of given type, and the spiral type.
Parameters
[in] | prevId | - the ID of the previous element
[in] | nextId | - the ID of the next element
[in] | spiral1Param | - parameter value for spiral 1
[in] | spiral2Param | - parameter value for spiral 2
[in] | spiralParamType | - AcDbCivilDbHAlignment::ESpiralParameterType, type of spiral parameters
[in] | spiralDefinitionType | - AcDbCivilDbHAlignment::ESpiralDefinitionType, the spiral type
Returns
Adesk::UInt64 - the element ID of the added element, or 0 in case of an error
Date
2021 torstenm implemented
◆ addTSTo() [1/2]
 UX_EXPORT_FUNCTION Adesk::UInt64 AcDbCivilDbHAlignment::addTSTo  |  ( |  Adesk::UInt64  |  nextId,
|  double  |  spiralParam,
|  AcDbCivilDbHAlignment::ESpiralParameterType  |  spiralParamType,
|  const AcGePoint2d &  |  passThroughPoint,
|  AcDbCivilDbHAlignment::ESpiralDefinitionType  |  spiralDefinitionType
)
Adds a 'line-spiral' alignment element before next position index, constrained by a spiral parameter and pass-through point for the line, and the spiral definition type.
Parameters
[in] | nextId | - the ID of the next element
[in] | spiralParam | - the parameter value
[in] | spiralParamType | - AcDbCivilDbHAlignment::ESpiralParameterType, the type of the spiral parameter
[in] | passThroughPoint | - the 2D pass-through point
[in] | spiralDefinitionType | - AcDbCivilDbHAlignment::ESpiralDefinitionType, the spiral type
Returns
Adesk::UInt64 - the element ID of the added element, or 0 in case of an error
Date
2021 torstenm implemented
◆ addTSTo() [2/2]
 UX_EXPORT_FUNCTION Adesk::UInt64 AcDbCivilDbHAlignment::addTSTo  |  ( |  Adesk::UInt64  |  nextId,
|  double  |  spiralParam,
|  AcDbCivilDbHAlignment::ESpiralParameterType  |  spiralParamType,
|  double  |  tangentLength,
|  AcDbCivilDbHAlignment::ESpiralDefinitionType  |  spiralDefinitionType
)
Adds a 'line-spiral' alignment element before next position index, constrained by a spiral parameter and length of the line, and the spiral definition type.
Parameters
[in] | nextId | - the ID of the next element
[in] | spiralParam | - the parameter value
[in] | spiralParamType | - AcDbCivilDbHAlignment::ESpiralParameterType, the type of the spiral parameter
[in] | tangentLength | - the line length parameter
[in] | spiralDefinitionType | - AcDbCivilDbHAlignment::ESpiralDefinitionType, the spiral type
Returns
Adesk::UInt64 - the element ID of the added element, or 0 in case of an error
Date
2021 torstenm implemented
◆ alignment3dAt()
 UX_EXPORT_FUNCTION AcDbObjectId AcDbCivilDbHAlignment::alignment3dAt  |  ( |  Adesk::UInt32  |  index | ) |   const
Returns the AcDbObjectId of the 3D alignment at specified index.
Parameters
[in] | index | - Adesk::UInt32, the index to retrieve the 3d alignment entity
Returns
AcDbObjectId - the 3D alignment entity at specified index
Date
2021 torstenm implemented
◆ alignment3dCount()
 UX_EXPORT_FUNCTION Adesk::UInt32 AcDbCivilDbHAlignment::alignment3dCount  |  ( |   | ) |   const
Returns the number of all 3D alignments belonging to this horizontal alignment entity.
Returns
Adesk::UInt32 - the number of all 3D alignments
Date
2021 torstenm implemented
◆ curveAtPI()
 UX_EXPORT_FUNCTION Adesk::UInt64 AcDbCivilDbHAlignment::curveAtPI  |  ( |  const AcDbCivilHAlignmentPI *  |  pi | ) |   const
Returns the element ID of the curve at specified 'Point Of Intersection' [PI] in this horizontal alignment.
Parameters
[in] | pi | - the AcDbCivilHAlignmentPI object to retrieve the curve element for
Returns
Adesk::UInt64 - the element ID at specified 'Point of Intersection' element, or 0 if not valid
Date
2021 torstenm implemented
◆ curveElementColor()
 UX_EXPORT_FUNCTION Adesk::UInt32 AcDbCivilDbHAlignment::curveElementColor  |  ( |   | ) |   const
Returns the color of curve/arc element.
Returns
Adesk::UInt32 - 0...256, the ACI index color value
Date
2021 torstenm implemented
◆ deleteElement()
 UX_EXPORT_FUNCTION bool AcDbCivilDbHAlignment::deleteElement  |  ( |  Adesk::UInt64  |  id | )
Deletes the element at specified position index.
Parameters
[in] | id | - the ID of the element to be removed
Returns
bool - true if operation succeeded, false otherwise
Date
2021 torstenm implemented
◆ elementAtId()
 UX_EXPORT_FUNCTION AcDbCivilHAlignmentElementPtr AcDbCivilDbHAlignment::elementAtId  |  ( |  Adesk::UInt64  |  id | ) |   const
Returns the element with specified id in this horizontal alignment.
Parameters
[in] | id | - element ID to retrieve the element for
Returns
AcDbCivilHAlignmentElementPtr - the element with specified ID, or empty pointer if specified ID is not valid
Date
2021 torstenm implemented
◆ elementAtStation()
 UX_EXPORT_FUNCTION AcDbCivilHAlignmentElementPtr AcDbCivilDbHAlignment::elementAtStation  |  ( |  double  |  station | ) |   const
Returns the element at specified station parameter in this horizontal alignment.
Parameters
[in] | station | - the station parameter to retrieve the element for
Returns
AcDbCivilHAlignmentElementPtr - the element at specified station, or empty pointer if station is not valid
Date
2021 torstenm implemented
◆ elementCount()
 UX_EXPORT_FUNCTION size_t AcDbCivilDbHAlignment::elementCount  |  ( |   | ) |   const
Returns the number of all elements belonging to this horizontal alignment.
Returns
size_t - the number of all elements
Date
2021 torstenm implemented
◆ elementExtensionColor()
 UX_EXPORT_FUNCTION Adesk::UInt32 AcDbCivilDbHAlignment::elementExtensionColor  |  ( |   | ) |   const
Returns the color of alignment element extension.
Returns
Adesk::UInt32 - 0...256, the ACI index color value
Date
2021 torstenm implemented
◆ firstElementId()
 UX_EXPORT_FUNCTION Adesk::UInt64 AcDbCivilDbHAlignment::firstElementId  |  ( |   | ) |   const
Returns the ID of the first element in this horizontal alignment.
Returns
Adesk::UInt64 - the ID of the first alignment element, or 0 if it fails
Date
2021 torstenm implemented
◆ firstLineElementId()
 UX_EXPORT_FUNCTION Adesk::UInt64 AcDbCivilDbHAlignment::firstLineElementId  |  ( |   | ) |   const
Returns the ID of the first line element in this horizontal alignment.
Returns
Adesk::UInt64 - the ID of the first line alignment element, or 0 if no line element is used
Date
2021 torstenm implemented
◆ getElementId()
 UX_EXPORT_FUNCTION Adesk::UInt64 AcDbCivilDbHAlignment::getElementId  |  ( |  Adesk::GsMarker  |  gsMarker | ) |   const
Returns the element ID at specified GsMarker for this horizontal alignment.
Parameters
[in] | gsMarker | - the GsMarker to retrieve the element ID for
Returns
Adesk::UInt64 - the element ID at specified GsMarker, or 0 in case of error
Date
2021 torstenm implemented
◆ getPIsArray()
 UX_EXPORT_FUNCTION AcDbCivilHAlignmentPIPtrArray AcDbCivilDbHAlignment::getPIsArray  |  ( |   | ) |   const
Returns the array of PIs (points of intersection) in this horizontal alignment.
Returns
AcDbCivilHAlignmentPIPtrArray - array of AcDbCivilHAlignmentPIPtr objects; array can be empty
Date
2021 torstenm implemented
◆ getPointAtStation()
 UX_EXPORT_FUNCTION bool AcDbCivilDbHAlignment::getPointAtStation  |  ( |  const double  |  station,
|  AcGePoint2d &  |  point
) |   |  const
Returns the station point at the specified station.
Parameters
[in] | station | - specifies the station where to retrieve the station point for
[out] | point | - returns the station point
Returns
bool - true if the operation succeeded, false otherwise
Date
2021 torstenm implemented
◆ getRadius()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbCivilDbHAlignment::getRadius  |  ( |  double  |  param,
|  double &  |  radius
) |   |  const
Returns the curve radius at specified position parameter for this horizontal alignment.
Parameters
[in] | param | - the parameter on the horizontal alignment to retrieve the curve's radius for
[out] | radius | - the curve radius at specified parameter
Returns
Acad::ErrorStatus - Acad::eOk if function succeeded, error status otherwise
Date
2021 torstenm implemented
◆ getStationAtPoint()
 UX_EXPORT_FUNCTION bool AcDbCivilDbHAlignment::getStationAtPoint  |  ( |  const AcGePoint2d &  |  point,
|  double &  |  station,
|  double &  |  offset,
|  double *  |  fromStation = nullptr,
|  double *  |  toStation = nullptr
) |   |  const
Returns the 'station' and 'offset' at given point; range can be specified with 'fromStation' and 'toStation' parameters.
Parameters
[in] | point | - specifies the point where to retrieve 'station' and 'offset' for
[out] | station | - returns the 'station' parameter
[out] | offset | - returns the signed 'offset' parameter (negative for left side points)
[in] | fromStation | - optionally; if provided, it specifies the lower bound of the range
[in] | toStation | - optionally; if provided, it specifies the upper bound of the range
Returns
bool - true if the operation succeeded, false otherwise
Date
2021 torstenm implemented
◆ getUnorderedElementIds()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbCivilDbHAlignment::getUnorderedElementIds  |  ( |  AcArray< Adesk::UInt64 > &  |  elementIds | ) |   const
Returns an unordered array of all element IDs used by this horizontal alignment.
Returns
Acad::ErrorStatus - Acad::eOk if operation succeeded, or error status otherwise
Remarks
: the output array is not cleared on function entry
Date
2021 torstenm implemented
◆ insertLineFixed()
 UX_EXPORT_FUNCTION Adesk::UInt64 AcDbCivilDbHAlignment::insertLineFixed  |  ( |  const AcGePoint2d &  |  startPoint,
|  const AcGePoint2d &  |  endPoint,
|  Adesk::UInt64  |  prevId
)
Adds a fixed line element defined by startPoint + endPoint, after the element with prevId, to this horizontal alignment.
Parameters
[in] | startPoint | - the start point of the fixed line element
[in] | endPoint | - the end point of the fixed line element
[in] | prevId | - the index ID of the element, after which to add the new element
Returns
Adesk::UInt64 - the element ID of the added element, or 0 in case of an error
Date
2021 torstenm implemented
◆ lastElementId()
 UX_EXPORT_FUNCTION Adesk::UInt64 AcDbCivilDbHAlignment::lastElementId  |  ( |   | ) |   const
Returns the ID of the last element in this horizontal alignment.
Returns
Adesk::UInt64 - the ID of the last alignment element, or 0 if it fails
Date
2021 torstenm implemented
◆ length()
 UX_EXPORT_FUNCTION double AcDbCivilDbHAlignment::length  |  ( |   | ) |   const
Returns the total length of the horizontal alignment.
Returns
double - the total length of this horizontal alignment entity
Date
2021 torstenm implemented
◆ lineElementColor()
 UX_EXPORT_FUNCTION Adesk::UInt32 AcDbCivilDbHAlignment::lineElementColor  |  ( |   | ) |   const
Returns the color of linear element.
Returns
Adesk::UInt32 - 0...256, the ACI index color value
Date
2021 torstenm implemented
◆ nextLineElementId()
 UX_EXPORT_FUNCTION Adesk::UInt64 AcDbCivilDbHAlignment::nextLineElementId  |  ( |  Adesk::UInt64  |  id | ) |   const
Returns the ID of the next line element for specified element ID in this horizontal alignment.
Parameters
[in] | id | - line element ID to retrieve the next line element for
Returns
Adesk::UInt64 - the ID of the next line alignment element, or 0 if no next line element is used
Date
2021 torstenm implemented
◆ previousLineElementId()
 UX_EXPORT_FUNCTION Adesk::UInt64 AcDbCivilDbHAlignment::previousLineElementId  |  ( |  Adesk::UInt64  |  id | ) |   const
Returns the ID of the preceding line element for specified element ID in this horizontal alignment.
Parameters
[in] | id | - line element ID to retrieve the preceding line element for
Returns
Adesk::UInt64 - the ID of the preceding line alignment element, or 0 if no preceding line element is used
Date
2021 torstenm implemented
◆ setCurveElementColor()
 UX_EXPORT_FUNCTION bool AcDbCivilDbHAlignment::setCurveElementColor  |  ( |  const Adesk::UInt32  |  color | )
Assigns the color for the curve/arc extension element.
Parameters
[in] | color | - 0...256, th ACI color index value to be assigned
Returns
bool - true if operation succeeded, false otherwise
Date
2021 torstenm implemented
◆ setElementExtensionColor()
 UX_EXPORT_FUNCTION bool AcDbCivilDbHAlignment::setElementExtensionColor  |  ( |  const Adesk::UInt32  |  color | )
Assigns the color for the extension element.
Parameters
[in] | color | - 0...256, th ACI color index value to be assigned
Returns
bool - true if operation succeeded, false otherwise
Date
2021 torstenm implemented
◆ setLineElementColor()
 UX_EXPORT_FUNCTION bool AcDbCivilDbHAlignment::setLineElementColor  |  ( |  const Adesk::UInt32  |  color | )
Assigns the color for the linear extension element.
Parameters
[in] | color | - 0...256, th ACI color index value to be assigned
Returns
bool - true if operation succeeded, false otherwise
Date
2021 torstenm implemented
◆ setSpiralElementColor()
 UX_EXPORT_FUNCTION bool AcDbCivilDbHAlignment::setSpiralElementColor  |  ( |  const Adesk::UInt32  |  color | )
Assigns the color for the spiral extension element.
Parameters
[in] | color | - 0...256, th ACI color index value to be assigned
Returns
bool - true if operation succeeded, false otherwise
Date
2021 torstenm implemented
◆ setStationEquations()
 UX_EXPORT_FUNCTION bool AcDbCivilDbHAlignment::setStationEquations  |  ( |  const AcCivilStationEquations &  |  stationEquations | )
Assigns the collection of station equations to this horizontal alignment entity.
Parameters
[in] | stationEquations- | AcDbCivilDbHAlignment::AcCivilStationEquations, the station equations collection to be assigned
Returns
bool - true if operation succeeded, false otherwise
Date
2021 torstenm implemented
◆ setStyle()
 UX_EXPORT_FUNCTION bool AcDbCivilDbHAlignment::setStyle  |  ( |  const Adesk::UInt32  |  style | )
Assigns the alignment style, combined bit flags of EHAlignmentVisualStyle.
Parameters
[in] | style | - the style to be assigned (combination of EHAlignmentVisualStyle bit values)
Returns
bool - true if operation succeeded, false otherwise
Date
2021 torstenm implemented
◆ setTangentExtensionColor()
 UX_EXPORT_FUNCTION bool AcDbCivilDbHAlignment::setTangentExtensionColor  |  ( |  const Adesk::UInt32  |  color | )
Assigns the color for the tangent extension element.
Parameters
[in] | color | - 0...256, th ACI color index value to be assigned
Returns
bool - true if operation succeeded, false otherwise
Date
2021 torstenm implemented
◆ spiralElementColor()
 UX_EXPORT_FUNCTION Adesk::UInt32 AcDbCivilDbHAlignment::spiralElementColor  |  ( |   | ) |   const
Returns the color of spiral element.
Returns
Adesk::UInt32 - 0...256, the ACI index color value
Date
2021 torstenm implemented
◆ stationEquations()
 UX_EXPORT_FUNCTION AcCivilStationEquations AcDbCivilDbHAlignment::stationEquations  |  ( |   | ) |   const
Returns the collection of all station equations.
Returns
AcDbCivilDbHAlignment::AcCivilStationEquations - the station equations object
Date
2021 torstenm implemented
◆ style()
 UX_EXPORT_FUNCTION Adesk::UInt32 AcDbCivilDbHAlignment::style  |  ( |   | ) |   const
Returns the alignment style, combined bit flags of EHAlignmentVisualStyle.
Returns
Adesk::UInt32 - combination of EHAlignmentVisualStyle bit values
Date
2021 torstenm implemented
◆ tangentExtensionColor()
 UX_EXPORT_FUNCTION Adesk::UInt32 AcDbCivilDbHAlignment::tangentExtensionColor  |  ( |   | ) |   const
Returns the color of tangent extension.
Returns
Adesk::UInt32 - 0...256, the ACI index color value
Date
2021 torstenm implemented
◆ update()
 UX_EXPORT_FUNCTION bool AcDbCivilDbHAlignment::update  |  ( |  bool  |  updateDependencies = true | )
Updates this AcDbCivilDbHAlignment object, optionally including dependencies (default).
Parameters
[in] | updateDependencies | - enable or disable updating depending objects and elements
Returns
bool - true if the function succeeded, false otherwise
Date
2021 torstenm implemented
◆ verticalAlignmentAt()
 UX_EXPORT_FUNCTION AcDbObjectId AcDbCivilDbHAlignment::verticalAlignmentAt  |  ( |  Adesk::UInt32  |  index | ) |   const
Returns the AcDbObjectId of the vertical alignment element at specified index.
Parameters
[in] | index | - Adesk::UInt32, the index to retrieve the vertical alignment entity
Returns
Adesk::UInt32 - the number of vertical alignment elements
Date
2021 torstenm implemented
◆ verticalAlignmentCount()
 UX_EXPORT_FUNCTION Adesk::UInt32 AcDbCivilDbHAlignment::verticalAlignmentCount  |  ( |   | ) |   const
Returns the number of all vertical alignments belonging to this horizontal alignment entity.
Returns
Adesk::UInt32 - the number of vertical alignment elements
Date
2021 torstenm implemented
◆ verticalAlignmentViewAt()
 UX_EXPORT_FUNCTION AcDbObjectId AcDbCivilDbHAlignment::verticalAlignmentViewAt  |  ( |  Adesk::UInt32  |  index | ) |   const
Returns the AcDbObjectId of the vertical alignment view at specified index.
Parameters
[in] | index | - Adesk::UInt32, the index to retrieve the vertical alignment view
Returns
AcDbObjectId - the vertical alignment view entity at specified index
Date
2021 torstenm implemented
◆ verticalAlignmentViewCount()
 UX_EXPORT_FUNCTION Adesk::UInt32 AcDbCivilDbHAlignment::verticalAlignmentViewCount  |  ( |   | ) |   const
Returns the number of all vertical alignment views belonging to this horizontal alignment entity.
Returns
Adesk::UInt32 - the number of vertical alignment views
Date
2021 torstenm implemented
Member Data Documentation
◆ AcDbCivilDbHAlignment
 UX_EXPORT_FUNCTION AcDbCivilDbHAlignment::AcDbCivilDbHAlignment
Default Constructor.
Date
2021 torstenm implemented