Public Member Functions | Public Attributes | Protected Member Functions | List of all members
AcDbEvalVariant Class Reference
_ More...
#include <AcDbEvalVariant.h>
 Public Member Functions
AcDbEvalVariant (Adesk::Int32)
AcDbEvalVariant (const AcDbEvalVariant &)
AcDbEvalVariant (const AcDbEvalVariant *)
AcDbEvalVariant (const AcDbObjectId &)
AcDbEvalVariant (const AcGePoint2d &)
AcDbEvalVariant (const AcGePoint3d &)
AcDbEvalVariant (const ACHAR *)
AcDbEvalVariant (const resbuf &)
AcDbEvalVariant (double)
AcDbEvalVariant (short)
void  | clear ()
Deallocates the resbuf content of this object, and initialises to default value. More...
virtual Acad::ErrorStatus  | copyFrom (const AcRxObject *)
Copies the AcDbEvalVariant content/data into this object. More...
 Acad::ErrorStatus  | dwgInFields (AcDbDwgFiler *)
 Acad::ErrorStatus  | dwgOutFields (AcDbDwgFiler *) const
 Acad::ErrorStatus  | dxfInFields (AcDbDxfFiler *)
 Acad::ErrorStatus  | dxfOutFields (AcDbDxfFiler *) const
AcDb::DwgDataType  | getType () const
Returns the AcDb::DwgDataType data type of this object. More...
Acad::ErrorStatus  | getValue (AcDbObjectId &, AcDbDatabase *=NULL) const
Gets the AcDbObjectId value from this object. More...
Acad::ErrorStatus  | getValue (AcGePoint2d &) const
Gets the AcGePoint2d value from this object. More...
Acad::ErrorStatus  | getValue (AcGePoint3d &) const
Gets the AcGePoint3d value from this object. More...
Acad::ErrorStatus  | getValue (AcString &) const
Gets the string value from this object. More...
Acad::ErrorStatus  | getValue (Adesk::Int32 &) const
Gets the 32-bit integer value from this object. More...
Acad::ErrorStatus  | getValue (double &) const
Gets the 16-bit integer value from this object. More...
Acad::ErrorStatus  | getValue (short &) const
Gets the 16-bit integer value from this object. More...
bool  | operator!= (const AcDbEvalVariant &) const
Compares this AcDbEvalVariant with @other AcDbEvalVariant. More...
bool  | operator< (const AcDbEvalVariant &) const
Compares this AcDbEvalVariant with @other AcDbEvalVariant. More...
bool  | operator<= (const AcDbEvalVariant &) const
Compares this AcDbEvalVariant with @other AcDbEvalVariant. More...
AcDbEvalVariant &  | operator= (Adesk::Int32)
Assignment operator, sets this object to integer value. More...
AcDbEvalVariant &  | operator= (const AcDbEvalVariant &)
Assignment operator, copies the source AcDbEvalVariant into this object. More...
AcDbEvalVariant &  | operator= (const AcDbObjectId &)
Assignment operator, sets this object to ObjectId. More...
AcDbEvalVariant &  | operator= (const AcGePoint2d &)
Assignment operator, sets this object to 2d point. More...
AcDbEvalVariant &  | operator= (const AcGePoint3d &)
Assignment operator, sets this object to 3d point. More...
AcDbEvalVariant &  | operator= (const ACHAR *)
Assignment operator, sets this object to string. More...
AcDbEvalVariant &  | operator= (const resbuf &)
Assignment operator, sets this object to the resbuf value. More...
AcDbEvalVariant &  | operator= (double)
Assignment operator, sets this object to double value. More...
AcDbEvalVariant &  | operator= (short)
Assignment operator, sets this object to short integer value. More...
bool  | operator== (const AcDbEvalVariant &) const
Compares this AcDbEvalVariant with @other AcDbEvalVariant. More...
bool  | operator> (const AcDbEvalVariant &) const
Compares this AcDbEvalVariant with @other AcDbEvalVariant. More...
bool  | operator>= (const AcDbEvalVariant &) const
Compares this AcDbEvalVariant with @other AcDbEvalVariant. More...
Acad::ErrorStatus  | setValue (AcDb::DxfCode, const AcDbObjectId &)
Sets the AcGePoint2d value for this object using specified DXF code. More...
Acad::ErrorStatus  | setValue (AcDb::DxfCode, const AcGePoint2d &)
Sets the AcGePoint2d value for this object using specified DXF code. More...
Acad::ErrorStatus  | setValue (AcDb::DxfCode, const AcGePoint3d &)
Sets the AcGePoint3d value for this object using specified DXF code. More...
Acad::ErrorStatus  | setValue (AcDb::DxfCode, const AcString &)
Sets the string value for this object using specified DXF code. More...
Acad::ErrorStatus  | setValue (AcDb::DxfCode, const Adesk::Int32)
Sets the 32-bit integer value for this object using specified DXF code. More...
Acad::ErrorStatus  | setValue (AcDb::DxfCode, const double)
Sets the double value for this object using specified DXF code. More...
Acad::ErrorStatus  | setValue (AcDb::DxfCode, const short)
Sets the 16-bit integer value for this object using specified DXF code. More...
~AcDbEvalVariant ()
Destructor.
 Public Member Functions inherited from AcRxObject
virtual AcRxObject *  | clone () const
Exported and implemented. More...
 virtual AcRx::Ordering  | comparedTo (const AcRxObject *) const
Exported and implemented.
virtual Acad::ErrorStatus  | copyFrom (const AcRxObject *)
Exported and implemented. More...
 virtual AcRxClass *  | isA () const
Exported and implemented.
virtual Adesk::Boolean  | isEqualTo (const AcRxObject *) const
Exported and implemented. More...
bool  | isKindOf (const AcRxClass *) const
Checks the object class. More...
AcRxObject *  | queryX (const AcRxClass *) const
returns the protocol extension object assigned to this class or a parent class. More...
AcRxObject *  | x (const AcRxClass *) const
returns the protocol extension object assigned to this class or a parent class. More...
 virtual  | ~AcRxObject ()
Destructor.
 Public Attributes
AcDbEvalVariant
Default constructor. More...
 Public Attributes inherited from resbuf
 struct resbuf *  | rbnext
 short  | restype
 union ads_u_val  | resval
 Protected Member Functions
void  | init ()
Initialises the resbuf content of this object to default value (AcDb::kDwgNull). More...
 Protected Member Functions inherited from AcRxObject
AcRxObject ()
Exported and implemented.
 Additional Inherited Members
 Static Public Member Functions inherited from AcRxObject
 static AcRxObject *  | cast (const AcRxObject *)
 static AcRxClass *  | desc ()
Exported and implemented.
Detailed Description
_
Member Function Documentation
◆ clear()
 UX_EXPORT_FUNCTION void AcDbEvalVariant::clear  |  ( |   | )
Deallocates the resbuf content of this object, and initialises to default value.
Returns
void
◆ copyFrom()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbEvalVariant::copyFrom  |  ( |  const AcRxObject *  |  pSource | )
virtual
Copies the AcDbEvalVariant content/data into this object.
Parameters
[in] | pSource | source AcDbEvalVariant to copy from
Returns
Acad::eOk, or error status otherwise
Reimplemented from AcRxObject.
◆ getType()
 UX_EXPORT_FUNCTION AcDb::DwgDataType AcDbEvalVariant::getType  |  ( |   | ) |   const
Returns the AcDb::DwgDataType data type of this object.
Returns
DwgDataType data type
◆ getValue() [1/7]
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbEvalVariant::getValue  |  ( |  AcDbObjectId &  |  val,
|  AcDbDatabase *  |  db = NULL
) |   |  const
Gets the AcDbObjectId value from this object.
Parameters
[out] | val | AcDbObjectId retrieved
Returns
Acad::eOk for success, or error status otherwise
◆ getValue() [2/7]
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbEvalVariant::getValue  |  ( |  AcGePoint2d &  |  val | ) |   const
Gets the AcGePoint2d value from this object.
Parameters
[out] | val | AcGePoint2d retrieved
Returns
Acad::eOk for success, or error status otherwise
◆ getValue() [3/7]
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbEvalVariant::getValue  |  ( |  AcGePoint3d &  |  val | ) |   const
Gets the AcGePoint3d value from this object.
Parameters
[out] | val | AcGePoint3d retrieved
Returns
Acad::eOk for success, or error status otherwise
◆ getValue() [4/7]
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbEvalVariant::getValue  |  ( |  AcString &  |  val | ) |   const
Gets the string value from this object.
Parameters
[out] | val | AcString retrieved
Returns
Acad::eOk for success, or error status otherwise
◆ getValue() [5/7]
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbEvalVariant::getValue  |  ( |  Adesk::Int32 &  |  val | ) |   const
Gets the 32-bit integer value from this object.
Parameters
[out] | val | Adesk::Int32 retrieved
Returns
Acad::eOk for success, or error status otherwise
◆ getValue() [6/7]
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbEvalVariant::getValue  |  ( |  double &  |  val | ) |   const
Gets the 16-bit integer value from this object.
Parameters
[out] | val | double value retrieved
Returns
Acad::eOk for success, or error status otherwise
◆ getValue() [7/7]
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbEvalVariant::getValue  |  ( |  short &  |  val | ) |   const
Gets the 16-bit integer value from this object.
Parameters
[out] | val | short value retrieved
Returns
Acad::eOk for success, or error status otherwise
◆ init()
 void AcDbEvalVariant::init  |  ( |   | )
protected
Initialises the resbuf content of this object to default value (AcDb::kDwgNull).
Returns
void
◆ operator!=()
 UX_EXPORT_FUNCTION bool AcDbEvalVariant::operator!=  |  ( |  const AcDbEvalVariant &  |  other | ) |   const
Compares this AcDbEvalVariant with @other AcDbEvalVariant.
Parameters
[in] | other | AcDbEvalVariant to compare with
Returns
true/false
◆ operator<()
 UX_EXPORT_FUNCTION bool AcDbEvalVariant::operator<  |  ( |  const AcDbEvalVariant &  |  other | ) |   const
Compares this AcDbEvalVariant with @other AcDbEvalVariant.
Parameters
[in] | other | AcDbEvalVariant to compare with
Returns
true/false
◆ operator<=()
 UX_EXPORT_FUNCTION bool AcDbEvalVariant::operator<=  |  ( |  const AcDbEvalVariant &  |  other | ) |   const
Compares this AcDbEvalVariant with @other AcDbEvalVariant.
Parameters
[in] | other | AcDbEvalVariant to compare with
Returns
true/false
◆ operator=() [1/9]
 UX_EXPORT_FUNCTION AcDbEvalVariant & AcDbEvalVariant::operator=  |  ( |  Adesk::Int32  |  val | )
Assignment operator, sets this object to integer value.
Parameters
[in] | val
Returns
Acad::eOk, or error status otherwise
◆ operator=() [2/9]
 UX_EXPORT_FUNCTION AcDbEvalVariant & AcDbEvalVariant::operator=  |  ( |  const AcDbEvalVariant &  |  source | )
Assignment operator, copies the source AcDbEvalVariant into this object.
Parameters
[in] | source | AcDbEvalVariant to copy from
Returns
Acad::eOk, or error status otherwise
◆ operator=() [3/9]
 UX_EXPORT_FUNCTION AcDbEvalVariant & AcDbEvalVariant::operator=  |  ( |  const AcDbObjectId &  |  id | )
Assignment operator, sets this object to ObjectId.
Parameters
[in] | val
Returns
Acad::eOk, or error status otherwise
◆ operator=() [4/9]
 UX_EXPORT_FUNCTION AcDbEvalVariant & AcDbEvalVariant::operator=  |  ( |  const AcGePoint2d &  |  val | )
Assignment operator, sets this object to 2d point.
Parameters
[in] | val
Returns
Acad::eOk, or error status otherwise
◆ operator=() [5/9]
 UX_EXPORT_FUNCTION AcDbEvalVariant & AcDbEvalVariant::operator=  |  ( |  const AcGePoint3d &  |  val | )
Assignment operator, sets this object to 3d point.
Parameters
[in] | val
Returns
Acad::eOk, or error status otherwise
◆ operator=() [6/9]
 UX_EXPORT_FUNCTION AcDbEvalVariant & AcDbEvalVariant::operator=  |  ( |  const ACHAR *  |  val | )
Assignment operator, sets this object to string.
Parameters
[in] | val
Returns
Acad::eOk, or error status otherwise
◆ operator=() [7/9]
 UX_EXPORT_FUNCTION AcDbEvalVariant & AcDbEvalVariant::operator=  |  ( |  const resbuf &  |  source | )
Assignment operator, sets this object to the resbuf value.
Parameters
[in] | val
Returns
Acad::eOk, or error status otherwise
◆ operator=() [8/9]
 UX_EXPORT_FUNCTION AcDbEvalVariant & AcDbEvalVariant::operator=  |  ( |  double  |  val | )
Assignment operator, sets this object to double value.
Parameters
[in] | val
Returns
Acad::eOk, or error status otherwise
◆ operator=() [9/9]
 UX_EXPORT_FUNCTION AcDbEvalVariant & AcDbEvalVariant::operator=  |  ( |  short  |  val | )
Assignment operator, sets this object to short integer value.
Parameters
[in] | val
Returns
Acad::eOk, or error status otherwise
◆ operator==()
 UX_EXPORT_FUNCTION bool AcDbEvalVariant::operator==  |  ( |  const AcDbEvalVariant &  |  other | ) |   const
Compares this AcDbEvalVariant with @other AcDbEvalVariant.
Parameters
[in] | other | AcDbEvalVariant to compare with
Returns
true/false
◆ operator>()
 UX_EXPORT_FUNCTION bool AcDbEvalVariant::operator>  |  ( |  const AcDbEvalVariant &  |  other | ) |   const
Compares this AcDbEvalVariant with @other AcDbEvalVariant.
Parameters
[in] | other | AcDbEvalVariant to compare with
Returns
true/false
◆ operator>=()
 UX_EXPORT_FUNCTION bool AcDbEvalVariant::operator>=  |  ( |  const AcDbEvalVariant &  |  other | ) |   const
Compares this AcDbEvalVariant with @other AcDbEvalVariant.
Parameters
[in] | other | AcDbEvalVariant to compare with
Returns
true/false
◆ setValue() [1/7]
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbEvalVariant::setValue  |  ( |  AcDb::DxfCode  |  dxfCode,
|  const AcDbObjectId &  |  val
)
Sets the AcGePoint2d value for this object using specified DXF code.
Parameters
[in] | val | AcDbObjectId value to set
Returns
Acad::eOk for success, or error status otherwise
◆ setValue() [2/7]
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbEvalVariant::setValue  |  ( |  AcDb::DxfCode  |  dxfCode,
|  const AcGePoint2d &  |  val
)
Sets the AcGePoint2d value for this object using specified DXF code.
Parameters
[in] | val | AcGePoint2d value to set
Returns
Acad::eOk for success, or error status otherwise
◆ setValue() [3/7]
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbEvalVariant::setValue  |  ( |  AcDb::DxfCode  |  dxfCode,
|  const AcGePoint3d &  |  val
)
Sets the AcGePoint3d value for this object using specified DXF code.
Parameters
[in] | val | AcGePoint3d value to set
Returns
Acad::eOk for success, or error status otherwise
◆ setValue() [4/7]
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbEvalVariant::setValue  |  ( |  AcDb::DxfCode  |  dxfCode,
|  const AcString &  |  val
)
Sets the string value for this object using specified DXF code.
Parameters
[in] | val | AcString value to set
Returns
Acad::eOk for success, or error status otherwise
◆ setValue() [5/7]
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbEvalVariant::setValue  |  ( |  AcDb::DxfCode  |  dxfCode,
|  const Adesk::Int32  |  val
)
Sets the 32-bit integer value for this object using specified DXF code.
Parameters
[in] | val | Adesk::Int32 value to set
Returns
Acad::eOk for success, or error status otherwise
◆ setValue() [6/7]
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbEvalVariant::setValue  |  ( |  AcDb::DxfCode  |  dxfCode,
|  const double  |  val
)
Sets the double value for this object using specified DXF code.
Parameters
[in] | val | double value to set
Returns
Acad::eOk for success, or error status otherwise
◆ setValue() [7/7]
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbEvalVariant::setValue  |  ( |  AcDb::DxfCode  |  dxfCode,
|  const short  |  val
)
Sets the 16-bit integer value for this object using specified DXF code.
Parameters
[in] | val | short value to set
Returns
Acad::eOk for success, or error status otherwise
Member Data Documentation
◆ AcDbEvalVariant
 UX_EXPORT_FUNCTION AcDbEvalVariant::AcDbEvalVariant
Default constructor.
Cconstructor, initialises this object from resbuf.
Cconstructor, initialises this object from short integer.
Cconstructor, initialises this object from integer.
Cconstructor, initialises this object from double.
Cconstructor, initialises this object from string.
Cconstructor, initialises this object from 3d point.
Cconstructor, initialises this object from 2d point.
Cconstructor, initialises this object from ObjectId.
Copy constructor, initialises this object from pSource.
Copy constructor, initialises this object from source.
Parameters
[in] | source | AcDbEvalVariant to initialise from
Returns
Acad::eOk, or error status otherwise
Parameters
[in] | val
Returns
Acad::eOk, or error status otherwise
Parameters
[in] | source | resbuf to initialise from
Returns
Acad::eOk, or error status otherwise