Public Member Functions | List of all members
AcDbLayoutManager Class Referenceabstract
_ More...
#include <AcDbLayoutManager.h>
 Public Member Functions
 virtual void  | addReactor (AcDbLayoutManagerReactor *)=0
 virtual Acad::ErrorStatus  | cloneLayout (AcDbLayout *, const ACHAR *, int=0, const AcDbDatabase *=NULL)=0
Not implemented yet.
virtual Acad::ErrorStatus  | copyLayout (const ACHAR *, const ACHAR *, const AcDbDatabase *=NULL)=0
Creates a copy of an existing AcDbLayout object and names it sDest. More...
 virtual int  | countLayouts (AcDbDatabase *=NULL)=0
 virtual Acad::ErrorStatus  | createLayout (const ACHAR *, AcDbObjectId &, AcDbObjectId &, AcDbDatabase *=NULL)=0
 virtual Acad::ErrorStatus  | deleteLayout (const ACHAR *, const AcDbDatabase *=NULL)=0
 virtual const ACHAR *  | findActiveLayout (bool, const AcDbDatabase *=NULL)=0
virtual AcDbObjectId  | findLayoutNamed (const ACHAR *, const AcDbDatabase *=NULL)=0
Returns a pointer to the layout with name sName. More...
virtual AcDbObjectId  | getActiveLayoutBTRId (const AcDbDatabase *=NULL)=0
Retrieves the BlockTableRecord of current Layout. More...
 virtual Acad::ErrorStatus  | getActiveLayoutName (AcString &, bool allowModel, const AcDbDatabase *=NULL)=0
Acad::ErrorStatus  | getLayoutNamed (const ACHAR *name, AcDbLayout *&pLayout, AcDb::OpenMode mode=AcDb::kForRead, const AcDbDatabase *pDb=NULL)
Returns the AcDbLayout, if it exists in specified database, opened in specified mode. More...
 virtual AcDbObjectId  | getNonRectVPIdFromClipId (AcDbObjectId)=0
Not implemented yet.
 virtual bool  | isVpnumClipped (int, const AcDbDatabase *=NULL)=0
Not implemented yet.
bool  | layoutExists (const ACHAR *name, const AcDbDatabase *pDb=NULL)
Verifies whether the specified layout exists in given database. More...
 virtual void  | removeReactor (AcDbLayoutManagerReactor *)=0
virtual Acad::ErrorStatus  | renameLayout (const ACHAR *, const ACHAR *, const AcDbDatabase *=NULL)=0
Renames the layout named sSource to the newly given name sDest. More...
 virtual Acad::ErrorStatus  | setCurrentLayout (const ACHAR *, const AcDbDatabase *=NULL)=0
virtual Acad::ErrorStatus  | setCurrentLayoutId (AcDbObjectId)=0
Activates the layout specified by layoutId. More...
 Public Member Functions inherited from AcRxObject
virtual AcRxObject *  | clone () const
Exported and implemented. More...
 virtual AcRx::Ordering  | comparedTo (const AcRxObject *) const
Exported and implemented.
virtual Acad::ErrorStatus  | copyFrom (const AcRxObject *)
Exported and implemented. More...
 virtual AcRxClass *  | isA () const
Exported and implemented.
virtual Adesk::Boolean  | isEqualTo (const AcRxObject *) const
Exported and implemented. More...
bool  | isKindOf (const AcRxClass *) const
Checks the object class. More...
AcRxObject *  | queryX (const AcRxClass *) const
returns the protocol extension object assigned to this class or a parent class. More...
AcRxObject *  | x (const AcRxClass *) const
returns the protocol extension object assigned to this class or a parent class. More...
 virtual  | ~AcRxObject ()
Destructor.
 Additional Inherited Members
 Static Public Member Functions inherited from AcRxObject
 static AcRxObject *  | cast (const AcRxObject *)
 static AcRxClass *  | desc ()
Exported and implemented.
 Protected Member Functions inherited from AcRxObject
AcRxObject ()
Exported and implemented.
Detailed Description
_
Member Function Documentation
◆ copyLayout()
 Acad::ErrorStatus AcDbLayoutManager::copyLayout  |  ( |  const ACHAR *  |  ,
|  const ACHAR *  |  ,
|  const AcDbDatabase *  |   = NULL
)
pure virtual
Creates a copy of an existing AcDbLayout object and names it sDest.
Parameters
[in] | sSource | - name of the layout to be copied
[in] | sDest | - name of the layout to be created
Returns
- Acad::eOk if successful
Acad::eCopyDoesNotExist if sSource does not exist or empty
Acad::eCopyIsModelSpace if sSource is the model space
Acad::eInvalidInput if sDest is NULL
◆ findLayoutNamed()
 AcDbObjectId AcDbLayoutManager::findLayoutNamed  |  ( |  const ACHAR *  |  sName,
|  const AcDbDatabase *  |  pDb = NULL
)
pure virtual
Returns a pointer to the layout with name sName.
Parameters
[in] | name | - name of the searched layout
[in] | pDb | - database to be used; if omitted or NULL, the current database is used
Returns
AcDbObjectId - ObjectId of the layout, or AcDbObjectId::kNull
◆ getActiveLayoutBTRId()
 AcDbObjectId AcDbLayoutManager::getActiveLayoutBTRId  |  ( |  const AcDbDatabase *  |   = NULL | )
pure virtual
Retrieves the BlockTableRecord of current Layout.
Returns
AcDbObjectId of current layout's BlockTableRecord
◆ getLayoutNamed()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbLayoutManager::getLayoutNamed  |  ( |  const ACHAR *  |  name,
|  AcDbLayout *&  |  pLayout,
|  AcDb::OpenMode  |  mode = AcDb::kForRead,
|  const AcDbDatabase *  |  pDb = NULL
)
Returns the AcDbLayout, if it exists in specified database, opened in specified mode.
Parameters
[in] | name | - the layout name
[out] | pLayout | - the opened AcDbLayout object, or NULL
[in] | mode | - open mode for the AcDbLayout object
[in] | pDb | - database to be used for the layout retrieval
Returns
Acad::eOk, if the layout exists and is opened in requested mode, error code otherwise
◆ layoutExists()
 UX_EXPORT_FUNCTION bool AcDbLayoutManager::layoutExists  |  ( |  const ACHAR *  |  name,
|  const AcDbDatabase *  |  pDb = NULL
)
Verifies whether the specified layout exists in given database.
Parameters
[in] | name | - the layout name
[in] | pDb | - database to be used for the layout retrieval
Returns
true if the layout exists, false otherwise
◆ renameLayout()
 Acad::ErrorStatus AcDbLayoutManager::renameLayout  |  ( |  const ACHAR *  |  ,
|  const ACHAR *  |  ,
|  const AcDbDatabase *  |   = NULL
)
pure virtual
Renames the layout named sSource to the newly given name sDest.
Parameters
[in] | sSource | old name of the layout
[in] | sDest | new name of the layout
Returns
◆ setCurrentLayoutId()
 Acad::ErrorStatus AcDbLayoutManager::setCurrentLayoutId  |  ( |  AcDbObjectId  |  id | )
pure virtual
Activates the layout specified by layoutId.
Parameters
[in] | layoutId | of the Layout to be activated
Returns
Acad::eOk, or error code otherwise