Public Member Functions | Public Attributes | List of all members
AcDbObjectContextCollection Class Referenceabstract
_ More...
#include <AcDbObjectContextCollection.h>
 Public Member Functions
 virtual Acad::ErrorStatus  | addContext (const AcDbObjectContext *)=0
 virtual AcDbObjectContext *  | currentContext (const AcDbObject *) const =0
 virtual AcDbObjectContext *  | getContext (const AcString &) const =0
 virtual bool  | hasContext (const AcString &) const =0
 virtual Acad::ErrorStatus  | lockContext (const AcDbObjectContext *)=0
 virtual bool  | locked () const =0
 virtual AcString  | name () const =0
 virtual AcDbObjectContextCollectionIterator *  | newIterator () const =0
 virtual Acad::ErrorStatus  | removeContext (const AcString &)=0
 virtual Acad::ErrorStatus  | setCurrentContext (const AcDbObjectContext *)=0
 virtual Acad::ErrorStatus  | unlockContext ()=0
 Public Member Functions inherited from AcRxObject
virtual AcRxObject *  | clone () const
Exported and implemented. More...
 virtual AcRx::Ordering  | comparedTo (const AcRxObject *) const
Exported and implemented.
virtual Acad::ErrorStatus  | copyFrom (const AcRxObject *)
Exported and implemented. More...
 virtual AcRxClass *  | isA () const
Exported and implemented.
virtual Adesk::Boolean  | isEqualTo (const AcRxObject *) const
Exported and implemented. More...
bool  | isKindOf (const AcRxClass *) const
Checks the object class. More...
AcRxObject *  | queryX (const AcRxClass *) const
returns the protocol extension object assigned to this class or a parent class. More...
AcRxObject *  | x (const AcRxClass *) const
returns the protocol extension object assigned to this class or a parent class. More...
 virtual  | ~AcRxObject ()
Destructor.
 Public Attributes
AcDbObjectContextCollection
Standard Contructor.
 Additional Inherited Members
 Static Public Member Functions inherited from AcRxObject
 static AcRxObject *  | cast (const AcRxObject *)
 static AcRxClass *  | desc ()
Exported and implemented.
 Protected Member Functions inherited from AcRxObject
AcRxObject ()
Exported and implemented.
Detailed Description
_