Public Member Functions | List of all members
AcDbSubentId Class Reference
_ More...
#include <AcDbSubentId.h>
 Public Member Functions
AcDbSubentId (AcDb::SubentType, INT_PTR)
AcDbSubentId (AcRxClass *, INT_PTR)
 INT_PTR  | index () const
 bool  | operator!= (const AcDbSubentId &) const
 bool  | operator== (const AcDbSubentId &) const
 void  | setIndex (INT_PTR)
 void  | setType (AcDb::SubentType)
 void  | setTypeClass (AcRxClass *)
 AcDb::SubentType  | type () const
 AcRxClass *  | typeClass () const
 Additional Inherited Members
 Static Public Member Functions inherited from AcHeapOperators
 static void  | operator delete (void *)
_
 static void  | operator delete (void *, const char *, int)
 static void  | operator delete (void *, void *)
 static void  | operator delete[] (void *)
_
 static void  | operator delete[] (void *, const char *, int)
 static void *  | operator new (size_t)
_
 static void *  | operator new (size_t, const char *, int)
 static void *  | operator new (size_t, void *p)
 static void *  | operator new[] (size_t)
_
 static void *  | operator new[] (size_t, const char *, int)
Detailed Description
_