Public Member Functions | Public Attributes | List of all members
AcDbTableStyle Class Reference
_ More...
#include <AcDbTableStyle.h>
 Public Member Functions
virtual AcDb::CellAlignment  | alignment (AcDb::RowType=AcDb::kDataRow) const
Returns the alignment for a given row type of the table style. More...
 AcDb::CellAlignment  | alignment (const ACHAR *) const
virtual Acad::ErrorStatus  | audit (AcDbAuditInfo *)
virtual AcCmColor  | backgroundColor (AcDb::RowType=AcDb::kDataRow) const
Returns the background color for the specified row type. More...
 AcCmColor  | backgroundColor (const ACHAR *) const
 virtual Adesk::UInt32  | bitFlags () const
Not implemented yet.
 int  | cellClass (const ACHAR *) const
virtual AcCmColor  | color (AcDb::RowType=AcDb::kDataRow) const
Returns the AcCmColor object for the specified row type. More...
 AcCmColor  | color (const ACHAR *) const
 Acad::ErrorStatus  | copyCellStyle (const AcDbTableStyle *, const ACHAR *, const ACHAR *)
 Acad::ErrorStatus  | copyCellStyle (const ACHAR *, const ACHAR *)
Acad::ErrorStatus  | createCellStyle (const ACHAR *)
Creates a cell style with the given name. More...
 Acad::ErrorStatus  | createCellStyle (const ACHAR *, const ACHAR *)
 const ACHAR *  | createCellStyle (void)
 Acad::ErrorStatus  | deleteCellStyle (const ACHAR *)
 virtual const ACHAR *  | description () const
Not implemented yet.
virtual Acad::ErrorStatus  | dwgInFields (AcDbDwgFiler *)
virtual Acad::ErrorStatus  | dwgOutFields (AcDbDwgFiler *) const
virtual Acad::ErrorStatus  | dxfInFields (AcDbDxfFiler *)
virtual Acad::ErrorStatus  | dxfOutFields (AcDbDxfFiler *) const
 Acad::ErrorStatus  | enableMergeAll (bool, const ACHAR *)
virtual AcDb::FlowDirection  | flowDirection () const
Returns the order in which the table will be drawn. More...
 virtual const ACHAR *  | format () const
Not implemented yet.
 virtual const ACHAR *  | format (AcDb::RowType) const
Not implemented yet.
 const ACHAR *  | format (const ACHAR *) const
 int  | getCellStyles (AcStringArray &) const
 virtual Acad::ErrorStatus  | getDataType (AcValue::DataType &, AcValue::UnitType &) const
Not implemented yet.
 virtual Acad::ErrorStatus  | getDataType (AcValue::DataType &, AcValue::UnitType &, AcDb::RowType) const
Not implemented yet.
 Acad::ErrorStatus  | getDataType (AcValue::DataType &, AcValue::UnitType &, const ACHAR *) const
 Acad::ErrorStatus  | getGridProperty (AcGridProperty &, AcDb::GridLineType, const ACHAR *) const
virtual Acad::ErrorStatus  | getName (ACHAR *&) const
Gets the name of the table style. More...
 Acad::ErrorStatus  | getTemplate (AcDbTableTemplate *&, AcDb::OpenMode)
 AcDbObjectId  | getTemplate (void) const
 Acad::ErrorStatus  | getUniqueCellStyleName (const ACHAR *, AcString &) const
 virtual AcCmColor  | gridColor (AcDb::GridLineType, AcDb::RowType=AcDb::kDataRow) const
Not implemented yet.
 AcCmColor  | gridColor (AcDb::GridLineType, const ACHAR *) const
 double  | gridDoubleLineSpacing (AcDb::GridLineType, const ACHAR *) const
 AcDb::GridLineStyle  | gridLineStyle (AcDb::GridLineType, const ACHAR *) const
 AcDbObjectId  | gridLinetype (AcDb::GridLineType, const ACHAR *) const
 virtual AcDb::LineWeight  | gridLineWeight (AcDb::GridLineType, AcDb::RowType=AcDb::kDataRow) const
Not implemented yet.
 AcDb::LineWeight  | gridLineWeight (AcDb::GridLineType, const ACHAR *) const
 virtual AcDb::Visibility  | gridVisibility (AcDb::GridLineType, AcDb::RowType=AcDb::kDataRow) const
Not implemented yet.
 AcDb::Visibility  | gridVisibility (AcDb::GridLineType, const ACHAR *) const
virtual double  | horzCellMargin () const
The function returns the horizontal value for the cell margin of the table style. More...
virtual bool  | isBackgroundColorNone (AcDb::RowType=AcDb::kDataRow) const
Returns whether background color is set for the row type @ rowType. More...
 bool  | isCellStyleInUse (const ACHAR *) const
virtual bool  | isHeaderSuppressed () const
Returns whether header row is shown by this style or not. More...
 bool  | isMergeAllEnabled (const ACHAR *) const
 bool  | isRenamable () const
virtual bool  | isTitleSuppressed () const
Returns whether title row is shown by this style or not. More...
 double  | margin (AcDb::CellMargin, const ACHAR *) const
 int  | numCellStyles (void) const
virtual Acad::ErrorStatus  | postTableStyleToDb (AcDbDatabase *, const ACHAR *, AcDbObjectId &)
Adds this table style to pDb, giving it the name pName. More...
 AcDbObjectId  | removeTemplate (void)
 Acad::ErrorStatus  | renameCellStyle (const ACHAR *, const ACHAR *)
 double  | rotation (const ACHAR *) const
 Acad::ErrorStatus  | setAlignment (AcDb::CellAlignment, const ACHAR *)
virtual Acad::ErrorStatus  | setAlignment (AcDb::CellAlignment, int=AcDb::kAllRows)
Sets the text alignment in the specified table cell. More...
 Acad::ErrorStatus  | setBackgroundColor (const AcCmColor &, const ACHAR *)
virtual Acad::ErrorStatus  | setBackgroundColor (const AcCmColor &, int=AcDb::kAllRows)
Sets the background color for the specified row type. More...
virtual Acad::ErrorStatus  | setBackgroundColorNone (bool, int=AcDb::kAllRows)
Enables/Disables the background color for the specified row type. More...
 virtual Acad::ErrorStatus  | setBitFlags (Adesk::UInt32)
Not implemented yet.
 Acad::ErrorStatus  | setCellClass (int, const ACHAR *)
 Acad::ErrorStatus  | setColor (const AcCmColor &, const ACHAR *)
virtual Acad::ErrorStatus  | setColor (const AcCmColor &, int=AcDb::kAllRows)
Sets the text color for the specified row type. More...
 virtual Acad::ErrorStatus  | setDataType (AcValue::DataType, AcValue::UnitType)
Not implemented yet.
 Acad::ErrorStatus  | setDataType (AcValue::DataType, AcValue::UnitType, const ACHAR *)
 virtual Acad::ErrorStatus  | setDataType (AcValue::DataType, AcValue::UnitType, int)
Not implemented yet.
 virtual Acad::ErrorStatus  | setDescription (const ACHAR *)
Not implemented yet.
virtual Acad::ErrorStatus  | setFlowDirection (AcDb::FlowDirection)
Sets the order in which the table will be drawn. More...
 virtual Acad::ErrorStatus  | setFormat (const ACHAR *)
Not implemented yet.
 Acad::ErrorStatus  | setFormat (const ACHAR *, const ACHAR *)
 virtual Acad::ErrorStatus  | setFormat (const ACHAR *, int)
Not implemented yet.
 Acad::ErrorStatus  | setGridColor (const AcCmColor, AcDb::GridLineType, const ACHAR *)
 virtual Acad::ErrorStatus  | setGridColor (const AcCmColor, int=AcDb::kAllGridLines, int=AcDb::kAllRows)
Not implemented yet.
 Acad::ErrorStatus  | setGridDoubleLineSpacing (double, AcDb::GridLineType, const ACHAR *)
 Acad::ErrorStatus  | setGridLineStyle (AcDb::GridLineStyle, AcDb::GridLineType, const ACHAR *)
 Acad::ErrorStatus  | setGridLinetype (const AcDbObjectId &, AcDb::GridLineType, const ACHAR *)
 Acad::ErrorStatus  | setGridLineWeight (AcDb::LineWeight, AcDb::GridLineType, const ACHAR *)
 virtual Acad::ErrorStatus  | setGridLineWeight (AcDb::LineWeight, int=AcDb::kAllGridLines, int=AcDb::kAllRows)
Not implemented yet.
 Acad::ErrorStatus  | setGridProperty (const AcGridProperty &, AcDb::GridLineType, const ACHAR *)
 Acad::ErrorStatus  | setGridVisibility (AcDb::Visibility, AcDb::GridLineType, const ACHAR *)
 virtual Acad::ErrorStatus  | setGridVisibility (AcDb::Visibility, int=AcDb::kAllGridLines, int=AcDb::kAllRows)
Not implemented yet.
virtual Acad::ErrorStatus  | setHorzCellMargin (double)
The function sets the horizontal value for the cell margin of the table style. More...
 Acad::ErrorStatus  | setMargin (AcDb::CellMargin, double, const ACHAR *)
virtual Acad::ErrorStatus  | setName (const ACHAR *)
Sets the name of the table style. More...
 Acad::ErrorStatus  | setRotation (double, const ACHAR *)
 Acad::ErrorStatus  | setTemplate (AcDbTableTemplate *, AcDb::MergeCellStyleOption, AcDbObjectId &)
 Acad::ErrorStatus  | setTemplate (const AcDbObjectId &, AcDb::MergeCellStyleOption)
 Acad::ErrorStatus  | setTextHeight (double, const ACHAR *)
virtual Acad::ErrorStatus  | setTextHeight (double, int=AcDb::kAllRows)
Sets the text size for the.specified row type. More...
Acad::ErrorStatus  | setTextStyle (const AcDbObjectId &, const ACHAR *)
Assigns the text style id to be used for a specified cell style. More...
virtual Acad::ErrorStatus  | setTextStyle (const AcDbObjectId, int=AcDb::kAllRows)
Sets the specified row type of the table to use a desired text style. More...
virtual Acad::ErrorStatus  | setVertCellMargin (double)
The function sets the vertical cell margin of the table style. More...
virtual Acad::ErrorStatus  | suppressHeaderRow (bool)
Controls whether header row is shown or not. More...
virtual Acad::ErrorStatus  | suppressTitleRow (bool)
Controls whether title row is shown or not. More...
virtual double  | textHeight (AcDb::RowType=AcDb::kDataRow) const
Returns the text height for the specified row type. More...
 double  | textHeight (const ACHAR *) const
virtual AcDbObjectId  | textStyle (AcDb::RowType=AcDb::kDataRow) const
Returns the text style id used by the table for a specified row type. More...
AcDbObjectId  | textStyle (const ACHAR *) const
Returns the text style id used by the table for a specified cell style. More...
virtual double  | vertCellMargin () const
The function returns the vertical cell margin of the table style. More...
 virtual  | ~AcDbTableStyle ()
Destructor for AcDbTableStyle class.
 Public Member Functions inherited from AcDbObject
virtual void  | addPersistentReactor (AcDbObjectId)
Adds a persistent reactor to this object reactor list. More...
void  | addReactor (AcDbObjectReactor *) const
Adds a transient reactor to this object. More...
virtual Acad::ErrorStatus  | applyPartialUndo (AcDbDwgFiler *, AcRxClass *)
This function is called during Undo operations on objects, that use the 'Partial Undo meachanism'; this is, this object is opened with assertWriteEnabled(Adesk::kFalse) to indicate that custom Undo filing is used rather than the default Undo filing. More...
 void  | assertNotifyEnabled () const
 void  | assertReadEnabled () const
 void  | assertWriteEnabled (Adesk::Boolean=Adesk::kTrue, Adesk::Boolean=Adesk::kTrue)
virtual Acad::ErrorStatus  | audit (AcDbAuditInfo *)
Performs the audit operation for this object. More...
Acad::ErrorStatus  | cancel ()
Reverts all changes since the object had been opened and closes the object. More...
virtual void  | cancelled (const AcDbObject *)
A handler function for persistent reactors. More...
virtual AcRxObject *  | clone () const
Creates a shallow clone of this object. More...
Acad::ErrorStatus  | close ()
Closes the object. More...
Acad::ErrorStatus  | closeAndPage (Adesk::Boolean=Adesk::kTrue)
Closes the object. More...
virtual Acad::ErrorStatus  | composeForLoad (AcDb::OdaSaveType, AcDb::AcDbDwgVersion)
This function is intended for future MT file loading support. More...
virtual void  | copied (const AcDbObject *, const AcDbObject *)
A handler function for persistent reactors. More...
virtual Acad::ErrorStatus  | copyFrom (const AcRxObject *)
Copies the pSrc object information in this object. More...
Acad::ErrorStatus  | createExtensionDictionary ()
Creates a dictionary as extension dictionary for this object. More...
AcDbDatabase *  | database () const
Returns the database that contains this object. More...
virtual Acad::ErrorStatus  | decomposeForSave (AcDb::AcDbDwgVersion, AcDbObject *&, AcDbObjectId &, Adesk::Boolean &)
This function is called during dwg and dxf output, to allow a custom object to decompose itself, due to provided dwg/dxf target file version. More...
virtual Acad::ErrorStatus  | deepClone (AcDbObject *, AcDbObject *&, AcDbIdMapping &, Adesk::Boolean=Adesk::kTrue) const final
Clones this object, appends it to the owner pOwner and adds an AcDbIdPair record to the idMap. More...
void  | disableUndoRecording (Adesk::Boolean)
Disables or enables the undo recording for the object. More...
Acad::ErrorStatus  | downgradeOpen ()
Sets the open mode for an object opened for write to be opened for read. More...
Acad::ErrorStatus  | downgradeToNotify (Adesk::Boolean)
Sets the open mode for an object opened for write to be opened for notify. More...
virtual AcGiDrawable *  | drawable ()
Retrieves the AcGiDrawable instance of this object. More...
Acad::ErrorStatus  | dwgIn (AcDbDwgFiler *)
Calls the object's dwgInFields function, and reads any XData if present. More...
virtual Acad::ErrorStatus  | dwgInFields (AcDbDwgFiler *)
Reads the object from the DWG filer. More...
Acad::ErrorStatus  | dwgOut (AcDbDwgFiler *) const
Calls the object's dwgOutFields function, and writes any XData if present. More...
virtual Acad::ErrorStatus  | dwgOutFields (AcDbDwgFiler *) const
Writes the object to the DWG filer. More...
Acad::ErrorStatus  | dxfIn (AcDbDxfFiler *)
Calls the object's dxfInFields function, and reads any XData if present. More...
virtual Acad::ErrorStatus  | dxfInFields (AcDbDxfFiler *)
Reads the object from the DXF filer. More...
Acad::ErrorStatus  | dxfOut (AcDbDxfFiler *, Adesk::Boolean, Adesk::uchar *) const
Calls the object's dxfOutFields function, and writes any XData if present. More...
virtual Acad::ErrorStatus  | dxfOutFields (AcDbDxfFiler *) const
Writes the object to the DXF filer. More...
Acad::ErrorStatus  | erase (Adesk::Boolean=Adesk::kTrue)
Sets the bit that indicates that the object is erased. More...
virtual void  | erased (const AcDbObject *, Adesk::Boolean=Adesk::kTrue)
A handler function for persistent reactors. More...
AcDbObjectId  | extensionDictionary () const
Returns the object id of the extension dictionary for this object. More...
void  | getAcDbHandle (AcDbHandle &) const
Returns handle of this object. More...
Acad::ErrorStatus  | getBinaryData (const ACHAR *, Adesk::Int32 &, char *&) const
Creates a copy of the binary data stored as chunks of maximum 127 bytes in the resbuf chain of this object's extension dictionary xrecord entry given by entryName. More...
int  | getBrxOpenCount () const
This function returns the number of open BRX instances for this object. More...
int  | getBrxOpenState () const
This function returns the BRX object open state flags as bitfields, for diagnostic purpose. More...
virtual Acad::ErrorStatus  | getClassID (CLSID *) const final
Gets the COM wrapper Class ID for this entity. More...
int  | getCustomObjectState () const
This function returns the custom object status : 1=isCustomObject 2=DifferentialUndoDisabled. More...
Acad::ErrorStatus  | getField (const ACHAR *, AcDbField *&, AcDb::OpenMode) const
Retrieves the specified Field from this object, and opens it in mode. More...
Acad::ErrorStatus  | getField (const ACHAR *, AcDbObjectId &) const
Gets the pszPropName field object from field dictionary of this AcDbObject object, using pszPropName as key. More...
AcDbObjectId  | getFieldDictionary () const
Returns the Field dictionary associated with this object,. More...
Acad::ErrorStatus  | getFieldDictionary (AcDbDictionary *&, AcDb::OpenMode) const
Gets and opens the field dictionary for this. More...
Acad::ErrorStatus  | getObjectBirthVersion (AcDb::AcDbDwgVersion &, AcDb::MaintenanceReleaseVersion &)
This function is currently not supported by the CAD engine, always returns Acad::eOk, and 'kDHL_CURRENT' + 'kMReleaseCurrent' results. More...
virtual Acad::ErrorStatus  | getObjectSaveVersion (const AcDbDwgFiler *, AcDb::AcDbDwgVersion &, AcDb::MaintenanceReleaseVersion &)
Returns the DWG version for saving the object. More...
virtual Acad::ErrorStatus  | getObjectSaveVersion (const AcDbDxfFiler *, AcDb::AcDbDwgVersion &, AcDb::MaintenanceReleaseVersion &)
Returns the DWG version for saving the object. More...
int  | getOdaOpenCount () const
This function returns the number of open ODA instances for this object. More...
int  | getOdaOpenState () const
This function returns the ODA object open state flags as bitfields, for diagnostic purpose. More...
virtual void  | goodbye (const AcDbObject *)
A handler function for persistent reactors. More...
virtual AcGsNode *  | gsNode () const
Gets the AcGsNode (graphics cache) for this entity. More...
Acad::ErrorStatus  | handOverTo (AcDbObject *, Adesk::Boolean=Adesk::kTrue, Adesk::Boolean=Adesk::kTrue)
Hands over objects identity to another object. More...
bool  | hasFields () const
Return true if this object has single or multiple fields associated with him. More...
bool  | hasPersistentReactor (AcDbObjectId) const
Checks the input objectId in this object reactor list. More...
bool  | hasSaveVersionOverride ()
This function indicates whether this object overrides the filer's save version. More...
virtual AcDbObjectId  | id () const
Returns the database id of this object. More...
Adesk::Boolean  | isAcDbObjectIdsInFlux () const
Checks whether a deep clone operation was completed. More...
Adesk::Boolean  | isAProxy () const
Adesk::Boolean  | isCancelling () const
Adesk::Boolean  | isErased () const
Returns whether this object is erased. More...
Adesk::Boolean  | isEraseStatusToggled () const
Checks whether the object erase status has been toggled. More...
Adesk::Boolean  | isModified () const
Returns whether this object's assertWriteEnabled() has been called since it was opened. More...
Adesk::Boolean  | isModifiedGraphics () const
Checks whether this object graphics will be updated when the object is closed. More...
Adesk::Boolean  | isModifiedXData () const
Checks whether this object's xData was modified. More...
Adesk::Boolean  | isNewObject () const
Returns true if and only if this object has not been closed since it was created. More...
Adesk::Boolean  | isNotifyEnabled () const
Returns whether this object is opened for notify. More...
Adesk::Boolean  | isNotifying () const
virtual Adesk::Boolean  | isPersistent () const
Returns the 'persistent' status of a database object. More...
Adesk::Boolean  | isReadEnabled () const
Returns whether this object is opened for read. More...
 Adesk::Boolean  | isReallyClosing () const
Checks whether the next close call will completely close this object return true if on the next call the object will be completely closed false otherwise.
Adesk::Boolean  | isTransactionResident () const
Gets the object transaction status. More...
Adesk::Boolean  | isUndoing () const
bool  | isUndoRecordingDisabled () const
Returns whether the undo recording for the object is enabled or not. More...
Adesk::Boolean  | isWriteEnabled () const
Returns whether this object is opened for write. More...
virtual AcDb::DuplicateRecordCloning  | mergeStyle () const
Returns the object's merge behavior during cloning. More...
virtual void  | modified (const AcDbObject *)
A handler function for persistent reactors. More...
virtual void  | modifiedGraphics (const AcDbEntity *)
A handler function for persistent reactors. More...
virtual void  | modifiedXData (const AcDbObject *)
A handler function for persistent reactors. More...
virtual void  | modifyUndone (const AcDbObject *)
A handler function for persistent reactors. More...
virtual void  | objectClosed (const AcDbObjectId)
A handler function for persistent reactors. More...
AcDbObjectId  | objectId () const
Returns object id. More...
virtual void  | openedForModify (const AcDbObject *)
A handler function for persistent reactors. More...
AcDbObjectId  | ownerId () const
Returns object id of the owner. More...
AcDbVoidPtrArray *  | reactors ()
Gets the object pointers to reactors. More...
const AcDbVoidPtrArray *  | reactors () const
Gets the object pointers to reactors. More...
virtual void  | reappended (const AcDbObject *)
A handler function for persistent reactors. More...
 virtual void  | recvPropagateModify (const AcDbObject *)
Not implemented yet.
Acad::ErrorStatus  | releaseExtensionDictionary ()
Removes the extension dictionary associated with this object. More...
virtual Acad::ErrorStatus  | removeField (AcDbObjectId)
Removes the Field specified by acFieldId from this object. More...
virtual Acad::ErrorStatus  | removeField (const ACHAR *)
Removes the Field specified by szKeyString from this object. More...
virtual Acad::ErrorStatus  | removeField (const ACHAR *, AcDbObjectId &)
Removes the Field specified by acPszKeyString from this object, and returns its ObjectId value. More...
virtual Acad::ErrorStatus  | removePersistentReactor (AcDbObjectId)
Removes a persistent reactor from this object reactor list. More...
void  | removeReactor (AcDbObjectReactor *) const
Removes a transient reactor to this object. More...
void  | setAcDbObjectIdsInFlux ()
Call this function to indicate that the object IDs of this object and its sub-objects (if any) are not yet valid. More...
Acad::ErrorStatus  | setBinaryData (const ACHAR *, Adesk::Int32, const char *)
Creates a copy of the binary data, divides it in up to 127 bytes binary chunks and
 sets them as resbufs in the resbuf chain of this object's extension dictionary xrecord entry given by entryName. More...
virtual Acad::ErrorStatus  | setField (const ACHAR *, AcDbField *, AcDbObjectId &)
Adds the pAcField field object to field dictionary of this AcDbObject object, using pKey as key. More...
virtual void  | setGsNode (AcGsNode *)
Gets the AcGsNode (graphics cache) for this entity. More...
void  | setHasSaveVersionOverride (bool)
This function can be called to specify that the object has a "save version override". More...
virtual Acad::ErrorStatus  | setOwnerId (AcDbObjectId)
Sets the ownerId data member of the object to be objId. More...
virtual Acad::ErrorStatus  | setXData (const resbuf *)
Sets/removes xData associated with this object. More...
virtual Acad::ErrorStatus  | subCancel ()
Possibility to veto a cancel operation from within custom entities. More...
virtual Acad::ErrorStatus  | subClose ()
virtual Acad::ErrorStatus  | subErase (Adesk::Boolean)
This hook is called during an AcDbObject::erase call, before any actual erase operation is performed. More...
 virtual Acad::ErrorStatus  | subHandOverTo (AcDbObject *)
virtual void  | subObjModified (const AcDbObject *, const AcDbObject *)
A handler function for persistent reactors. More...
 virtual Acad::ErrorStatus  | subOpen (AcDb::OpenMode)
virtual Acad::ErrorStatus  | subSwapIdWith (AcDbObjectId, Adesk::Boolean=Adesk::kFalse, Adesk::Boolean=Adesk::kFalse)
This hook is called during an AcDbObject::swapIdWith() call, before any actual swap operation is performed. More...
Acad::ErrorStatus  | swapIdWith (AcDbObjectId, Adesk::Boolean=Adesk::kFalse, Adesk::Boolean=Adesk::kFalse)
Swaps the object id's between the object identified by param swapId and this object. More...
virtual Acad::ErrorStatus  | swapReferences (const AcDbIdMapping &)
Not implemented yet. More...
virtual void  | unappended (const AcDbObject *)
A handler function for persistent reactors. More...
AcDbDwgFiler *  | undoFiler ()
Gets the undo filer for this object. More...
Acad::ErrorStatus  | upgradeFromNotify (Adesk::Boolean &)
Upgrades the open status of this object to AcDb::kForWrite, if this object is already open (either in AcDb::kForRead, AcDb::kForNotify or AcDb::kForWrite) More...
Acad::ErrorStatus  | upgradeOpen ()
Changes the objects open mode to AcDb::kForWrite and sends notifications. More...
virtual Acad::ErrorStatus  | wblockClone (AcRxObject *, AcDbObject *&, AcDbIdMapping &, Adesk::Boolean=Adesk::kTrue) const final
Clones this object, appends it to the owner pOwner and adds an AcDbIdPair record to the idMap. More...
virtual resbuf *  | xData (const ACHAR *=NULL) const
Returns the xData associated with this object. More...
Acad::ErrorStatus  | xDataTransformBy (const AcGeMatrix3d &)
Transforms the extended data according to parameter transformation matrix. More...
 virtual void  | xmitPropagateModify () const
Not implemented yet.
 virtual  | ~AcDbObject ()
Destructor.
 Public Member Functions inherited from AcGiDrawable
virtual bool  | bounds (AcDbExtents &) const
virtual DrawableType  | drawableType () const
 virtual AcGiDrawStream *  | drawStream () const
virtual AcGsNode *  | gsNode () const =0
virtual AcDbObjectId  | id () const =0
virtual Adesk::Boolean  | isPersistent () const =0
virtual Adesk::UInt32  | regenSupportFlags () const final
Returns whether and to which level this object supports MultiThreading. More...
 virtual Adesk::Boolean  | RolloverHit (Adesk::ULongPtr, Adesk::ULongPtr, Adesk::Boolean)
 virtual Adesk::UInt32  | setAttributes (AcGiDrawableTraits *) final
 virtual void  | setDrawStream (AcGiDrawStream *)
virtual void  | setGsNode (AcGsNode *)=0
 virtual void  | viewportDraw (AcGiViewportDraw *) final
 virtual Adesk::UInt32  | viewportDrawLogicalFlags (AcGiViewportDraw *) final
 virtual Adesk::Boolean  | worldDraw (AcGiWorldDraw *) final
 Public Member Functions inherited from AcRxObject
virtual AcRxObject *  | clone () const
Exported and implemented. More...
 virtual AcRx::Ordering  | comparedTo (const AcRxObject *) const
Exported and implemented.
virtual Acad::ErrorStatus  | copyFrom (const AcRxObject *)
Exported and implemented. More...
 virtual AcRxClass *  | isA () const
Exported and implemented.
virtual Adesk::Boolean  | isEqualTo (const AcRxObject *) const
Exported and implemented. More...
bool  | isKindOf (const AcRxClass *) const
Checks the object class. More...
AcRxObject *  | queryX (const AcRxClass *) const
returns the protocol extension object assigned to this class or a parent class. More...
AcRxObject *  | x (const AcRxClass *) const
returns the protocol extension object assigned to this class or a parent class. More...
 virtual  | ~AcRxObject ()
Destructor.
 Public Attributes
AcDbTableStyle
Default constructor.
 Additional Inherited Members
 Public Types inherited from AcGiDrawable
enum  | DrawableType {
 kGeometry = 0 , kDistantLight , kPointLight , kSpotLight ,
 kAmbientLight , kSolidBackground , kGradientBackground , kImageBackground ,
 kGroundPlaneBackground , kViewport
 }
enum  | SetAttributesFlags {
 kDrawableNone = 0 , kDrawableIsAnEntity = 1 , kDrawableUsesNesting = 2 , kDrawableIsCompoundObject = 4 ,
 kDrawableViewIndependentViewportDraw = 8 , kDrawableIsInvisible = 16 , kDrawableHasAttributes = 32 , kDrawableRegenTypeDependentGeometry = 64 ,
 kDrawableIsDimension = 133 , kDrawableRegenDraw = 256 , kDrawableStandardDisplaySingleLOD = 512 , kDrawableShadedDisplaySingleLOD = 1024 ,
 kDrawableViewDependentViewportDraw = 2048 , kDrawableBlockDependentViewportDraw = 4096 , kDrawableIsExternalReference = 8192 , kDrawableNotPlottable = 16384 ,
 kDrawableNotAllowLCS = 32768 , kDrawableMergeControlOff = 65536 , kThreadedWorldDrawViewportDraw = 131072
 }
 Static Public Member Functions inherited from AcRxObject
 static AcRxObject *  | cast (const AcRxObject *)
 static AcRxClass *  | desc ()
Exported and implemented.
 Static Public Member Functions inherited from AcHeapOperators
 static void  | operator delete (void *)
_
 static void  | operator delete (void *, const char *, int)
 static void  | operator delete (void *, void *)
 static void  | operator delete[] (void *)
_
 static void  | operator delete[] (void *, const char *, int)
 static void *  | operator new (size_t)
_
 static void *  | operator new (size_t, const char *, int)
 static void *  | operator new (size_t, void *p)
 static void *  | operator new[] (size_t)
_
 static void *  | operator new[] (size_t, const char *, int)
 Protected Member Functions inherited from AcDbObject
virtual Acad::ErrorStatus  | subDeepClone (AcDbObject *, AcDbObject *&, AcDbIdMapping &, Adesk::Boolean=true) const
virtual Acad::ErrorStatus  | subGetClassID (CLSID *) const
virtual Adesk::UInt32  | subSetAttributes (AcGiDrawableTraits *)
Sets the values of this object's subentity traits and returns with the calling object's subentity traits. More...
virtual void  | subViewportDraw (AcGiViewportDraw *)
virtual Adesk::UInt32  | subViewportDrawLogicalFlags (AcGiViewportDraw *)
virtual Acad::ErrorStatus  | subWblockClone (AcRxObject *, AcDbObject *&, AcDbIdMapping &, Adesk::Boolean=true) const
virtual Adesk::Boolean  | subWorldDraw (AcGiWorldDraw *)
 Protected Member Functions inherited from AcGiDrawable
virtual Adesk::UInt32  | subRegenSupportFlags () const
Returns whether and to which level this object supports MultiThreading. More...
virtual Adesk::UInt32  | subSetAttributes (AcGiDrawableTraits *)=0
virtual void  | subViewportDraw (AcGiViewportDraw *)=0
 virtual Adesk::UInt32  | subViewportDrawLogicalFlags (AcGiViewportDraw *)
virtual Adesk::Boolean  | subWorldDraw (AcGiWorldDraw *)=0
 Protected Member Functions inherited from AcRxObject
AcRxObject ()
Exported and implemented.
Detailed Description
_
Member Function Documentation
◆ alignment()
 UX_EXPORT_FUNCTION AcDb::CellAlignment AcDbTableStyle::alignment  |  ( |  AcDb::RowType  |  rowType = AcDb::kDataRow | ) |   const
virtual
Returns the alignment for a given row type of the table style.
Parameters
[in] | rowType | row type value: AcDb::kDataRow, AcDb::kTitleRow, AcDb::kHeaderRow. Default value: AcDb::kDataRow.
Returns
AcDb::kTopLeft, AcDb::kTopCenter, AcDb::kTopRight, AcDb::kMiddleLeft, AcDb::kMiddleCenter, AcDb::kMiddleRight, AcDb::kBottomLeft, AcDb::kBottomCenter, AcDb::kBottomRight.
◆ audit()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbTableStyle::audit  |  ( |  AcDbAuditInfo *  |  info | )
virtual
See also
AcDbObject::audit(AcDbAuditInfo*)
Reimplemented from AcDbObject.
◆ backgroundColor()
 UX_EXPORT_FUNCTION AcCmColor AcDbTableStyle::backgroundColor  |  ( |  AcDb::RowType  |  rowType = AcDb::kDataRow | ) |   const
virtual
Returns the background color for the specified row type.
Parameters
[in] | rowType | row type values: AcDb::kDataRow, AcDb::kTitleRow, and AcDb::kHeaderRow. Default value: AcDb::kAllRows.
Returns
AcCmColor object
◆ color()
 UX_EXPORT_FUNCTION AcCmColor AcDbTableStyle::color  |  ( |  AcDb::RowType  |  rowType = AcDb::kDataRow | ) |   const
virtual
Returns the AcCmColor object for the specified row type.
Parameters
[in] | rowType | row type values: AcDb::kDataRow, AcDb::kTitleRow, and AcDb::kHeaderRow. Default value: AcDb::kAllRows.
Returns
AcCmColor object.
◆ createCellStyle()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbTableStyle::createCellStyle  |  ( |  const ACHAR *  |  cellStyle | )
Creates a cell style with the given name.
Parameters
[in] | cellStyle | the name of the cell style
◆ dwgInFields()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbTableStyle::dwgInFields  |  ( |  AcDbDwgFiler *  |  dwgFiler | )
virtual
See also
AcDbObject::dwgInFields(AcDbDwgFiler*)
Reimplemented from AcDbObject.
◆ dwgOutFields()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbTableStyle::dwgOutFields  |  ( |  AcDbDwgFiler *  |  dwgFiler | ) |   const
virtual
See also
AcDbObject::dwgOutFields(AcDbDwgFiler*)
Reimplemented from AcDbObject.
◆ dxfInFields()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbTableStyle::dxfInFields  |  ( |  AcDbDxfFiler *  |  dxfFiler | )
virtual
See also
AcDbObject::dxfInFields(AcDbDxfFiler*)
Reimplemented from AcDbObject.
◆ dxfOutFields()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbTableStyle::dxfOutFields  |  ( |  AcDbDxfFiler *  |  dxfFiler | ) |   const
virtual
See also
AcDbObject::dxfOutFields(AcDbDxfFiler*)
Reimplemented from AcDbObject.
◆ flowDirection()
 UX_EXPORT_FUNCTION AcDb::FlowDirection AcDbTableStyle::flowDirection  |  ( |   | ) |   const
virtual
Returns the order in which the table will be drawn.
Returns
table draw order : from top to bottom that is AcDb::kTtoB or from bottom to top that is AcDb::kBtoT. Default order AcDb::kToB.
◆ getName()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbTableStyle::getName  |  ( |  ACHAR *&  |  pName | ) |   const
virtual
Gets the name of the table style.
Parameters
[out] | pName | pointer to text string representing the name of the table style.
Returns
Acad::eOf if successful, Acad::eOwnerNotSet if the table style is not present in the table style dictionary.
◆ horzCellMargin()
 UX_EXPORT_FUNCTION double AcDbTableStyle::horzCellMargin  |  ( |   | ) |   const
virtual
The function returns the horizontal value for the cell margin of the table style.
Returns
the horizontal value
◆ isBackgroundColorNone()
 UX_EXPORT_FUNCTION bool AcDbTableStyle::isBackgroundColorNone  |  ( |  AcDb::RowType  |  rowType = AcDb::kDataRow | ) |   const
virtual
Returns whether background color is set for the row type @ rowType.
Parameters
[in] | rowType | row type value: AcDb::kDataRow, AcDb::kTitleRow, AcDb::kHeaderRow.
Returns
true, if background color is set, false, it otherwise
◆ isHeaderSuppressed()
 UX_EXPORT_FUNCTION bool AcDbTableStyle::isHeaderSuppressed  |  ( |   | ) |   const
virtual
Returns whether header row is shown by this style or not.
Returns
status of header row - true, it is suppressed, false, it is shown
◆ isTitleSuppressed()
 UX_EXPORT_FUNCTION bool AcDbTableStyle::isTitleSuppressed  |  ( |   | ) |   const
virtual
Returns whether title row is shown by this style or not.
Returns
status of title row - true, it is suppressed, false, it is shown
◆ postTableStyleToDb()
 Acad::ErrorStatus AcDbTableStyle::postTableStyleToDb  |  ( |  AcDbDatabase *  |  pDb,
|  const ACHAR *  |  pName,
|  AcDbObjectId &  |  styleId
)
virtual
Adds this table style to pDb, giving it the name pName.
Parameters
[in] | pDb | database to add the style to
[in] | pName | name under with the style should be added
[out] | styleId | resulting object id of the added style
Returns
Acad::eOk if successful, adequate error status otherwise.
◆ setAlignment()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbTableStyle::setAlignment  |  ( |  AcDb::CellAlignment  |  alignment,
|  int  |  rowTypes = AcDb::kAllRows
)
virtual
Sets the text alignment in the specified table cell.
Parameters
[in] | alignment | alignment cell values: AcDb::kTopLeft, AcDb::kTopCenter, AcDb::kTopRight, AcDb::kMiddleLeft, AcDb::kMiddleCenter, AcDb::kMiddleRight, AcDb::kBottomLeft, AcDb::kBottomCenter, and AcDb::kBottomRight.
[in] | rowTypes | row type values: AcDb::kDataRow, AcDb::kTitleRow, and AcDb::kHeaderRow. Default value: AcDb::kAllRows.
Returns
Acad::eOk if successful, otherwise Acad::eInvalidInput.
◆ setBackgroundColor()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbTableStyle::setBackgroundColor  |  ( |  const AcCmColor &  |  color,
|  int  |  rowType = AcDb::kAllRows
)
virtual
Sets the background color for the specified row type.
Parameters
[in] | color | AcCmColor object.
[in] | rowType | row type values: AcDb::kDataRow, AcDb::kTitleRow, and AcDb::kHeaderRow. Default value: AcDb::kAllRows.
Returns
Acad::eOk if successful, Acad::eInvalidInput otherwise.
◆ setBackgroundColorNone()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbTableStyle::setBackgroundColorNone  |  ( |  bool  |  val,
|  int  |  rowType = AcDb::kAllRows
)
virtual
Enables/Disables the background color for the specified row type.
Parameters
[in] | val | disable or enable background color
[in] | rowType | row type values: AcDb::kDataRow, AcDb::kTitleRow, and AcDb::kHeaderRow. Default value: AcDb::kAllRows.
Returns
Acad::eOk if successful, Acad::eInvalidInput otherwise.
◆ setColor()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbTableStyle::setColor  |  ( |  const AcCmColor &  |  color,
|  int  |  rowType = AcDb::kAllRows
)
virtual
Sets the text color for the specified row type.
Parameters
[in] | color | AcCmColor object
[in] | row | type values: AcDb::kDataRow, AcDb::kTitleRow, and AcDb::kHeaderRow. Default value: AcDb::kAllRows.
Returns
Acad::eOk if successful, Acad::eInvalidInput otherwise.
◆ setFlowDirection()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbTableStyle::setFlowDirection  |  ( |  AcDb::FlowDirection  |  flowDirection | )
virtual
Sets the order in which the table will be drawn.
Parameters
[in] | flowDirection | table draw order: AcDb::kToB, AcDb::BtoT. Default order AcDb::kToB.
Returns
Acad::eOk if successful, otherwise Acad::eInvalidInput.
◆ setHorzCellMargin()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbTableStyle::setHorzCellMargin  |  ( |  double  |  horzCellM | )
virtual
The function sets the horizontal value for the cell margin of the table style.
Parameters
[in] | horizontal | value
Returns
Acad::eOk if successful, Acad::eInvalidInput otherwise
◆ setName()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbTableStyle::setName  |  ( |  const ACHAR *  |  pName | )
virtual
Sets the name of the table style.
Parameters
[in] | pName | pointer to text string.
Returns
Acad::eOk if it is successful, Acad::eInvalidInput, otherwise.
◆ setTextHeight()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbTableStyle::setTextHeight  |  ( |  double  |  height,
|  int  |  rowType = AcDb::kAllRows
)
virtual
Sets the text size for the.specified row type.
Parameters
[in] | height | the height value.
[in] | rowType | the row type value: AcDb::kDataRow, AcDb::kTitleRow, AcDb::kHeaderRow. Default value AcDb::kDataRow.
Returns
Acad::eOk if successful, otherwise Acad::eInvalidInput
◆ setTextStyle() [1/2]
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbTableStyle::setTextStyle  |  ( |  const AcDbObjectId &  |  id,
|  const ACHAR *  |  forCellStyle
)
Assigns the text style id to be used for a specified cell style.
Parameters
[in] | id | of the used text style for specified cell style
[in] | cellStyle | the cell style for which the text style is queried
Returns
Acad::eOk, or error status
◆ setTextStyle() [2/2]
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbTableStyle::setTextStyle  |  ( |  const AcDbObjectId  |  textStyleId,
|  int  |  typeOfRow = AcDb::kAllRows
)
virtual
Sets the specified row type of the table to use a desired text style.
Parameters
[in] | textStyleId | id of the used text style
[in] | typeOfRow | the type of the row for which the text style will be used
Returns
Acad::eOk if successful, or a coressponding error status
◆ setVertCellMargin()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbTableStyle::setVertCellMargin  |  ( |  double  |  vertCellM | )
virtual
The function sets the vertical cell margin of the table style.
Parameters
[in] | vertical | value
Returns
Acad::eOk if successful, Acad::eInvalidInput otherwise
◆ suppressHeaderRow()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbTableStyle::suppressHeaderRow  |  ( |  bool  |  value | )
virtual
Controls whether header row is shown or not.
Parameters
[in] | value | suppress header row or show it
Returns
Acad::eOf if successful, approbriate error status otherwise
◆ suppressTitleRow()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbTableStyle::suppressTitleRow  |  ( |  bool  |  value | )
virtual
Controls whether title row is shown or not.
Parameters
[in] | value | suppress title row or not
Returns
Acad::eOf if successful, approbriate error status otherwise
◆ textHeight()
 UX_EXPORT_FUNCTION double AcDbTableStyle::textHeight  |  ( |  AcDb::RowType  |  rowType = AcDb::kDataRow | ) |   const
virtual
Returns the text height for the specified row type.
Parameters
[in] | rowType | row type value: AcDb::kDataRow, AcDb::kTitleRow, AcDb::kHeaderRow. Default value AcDb::kDataRow.
Returns
the text height
◆ textStyle() [1/2]
 UX_EXPORT_FUNCTION AcDbObjectId AcDbTableStyle::textStyle  |  ( |  AcDb::RowType  |  typeOfRow = AcDb::kDataRow | ) |   const
virtual
Returns the text style id used by the table for a specified row type.
Parameters
[in] | typeOfRow | row type
Returns
id of the used text style for a specified row type
◆ textStyle() [2/2]
 UX_EXPORT_FUNCTION AcDbObjectId AcDbTableStyle::textStyle  |  ( |  const ACHAR *  |  cellStyle | ) |   const
Returns the text style id used by the table for a specified cell style.
Parameters
[in] | cellStyle | the cell style for which the text style is queried
Returns
id of the used text style for specified cell style
◆ vertCellMargin()
 UX_EXPORT_FUNCTION double AcDbTableStyle::vertCellMargin  |  ( |   | ) |   const
virtual
The function returns the vertical cell margin of the table style.
Returns
the vertical value