Public Types | Public Member Functions | Protected Member Functions | List of all members
AcDbTable Class Reference
_ More...
#include <AcDbTable.h>
 Public Types
enum  | TableStyleOverrides {
 kTitleSuppressed = 1 , kHeaderSuppressed , kFlowDirection , kHorzCellMargin ,
 kVertCellMargin , kTitleRowColor , kHeaderRowColor , kDataRowColor ,
 kTitleRowFillNone , kHeaderRowFillNone , kDataRowFillNone , kTitleRowFillColor ,
 kHeaderRowFillColor , kDataRowFillColor , kTitleRowAlignment , kHeaderRowAlignment ,
 kDataRowAlignment , kTitleRowTextStyle , kHeaderRowTextStyle , kDataRowTextStyle ,
 kTitleRowTextHeight , kHeaderRowTextHeight , kDataRowTextHeight , kTitleHorzTopColor = 40 ,
 kTitleHorzInsideColor , kTitleHorzBottomColor , kTitleVertLeftColor , kTitleVertInsideColor ,
 kTitleVertRightColor , kHeaderHorzTopColor , kHeaderHorzInsideColor , kHeaderHorzBottomColor ,
 kHeaderVertLeftColor , kHeaderVertInsideColor , kHeaderVertRightColor , kDataHorzTopColor ,
 kDataHorzInsideColor , kDataHorzBottomColor , kDataVertLeftColor , kDataVertInsideColor ,
 kDataVertRightColor , kTitleHorzTopLineWeight = 70 , kTitleHorzInsideLineWeight , kTitleHorzBottomLineWeight ,
 kTitleVertLeftLineWeight , kTitleVertInsideLineWeight , kTitleVertRightLineWeight , kHeaderHorzTopLineWeight ,
 kHeaderHorzInsideLineWeight , kHeaderHorzBottomLineWeight , kHeaderVertLeftLineWeight , kHeaderVertInsideLineWeight ,
 kHeaderVertRightLineWeight , kDataHorzTopLineWeight , kDataHorzInsideLineWeight , kDataHorzBottomLineWeight ,
 kDataVertLeftLineWeight , kDataVertInsideLineWeight , kDataVertRightLineWeight , kTitleHorzTopVisibility = 100 ,
 kTitleHorzInsideVisibility , kTitleHorzBottomVisibility , kTitleVertLeftVisibility , kTitleVertInsideVisibility ,
 kTitleVertRightVisibility , kHeaderHorzTopVisibility , kHeaderHorzInsideVisibility , kHeaderHorzBottomVisibility ,
 kHeaderVertLeftVisibility , kHeaderVertInsideVisibility , kHeaderVertRightVisibility , kDataHorzTopVisibility ,
 kDataHorzInsideVisibility , kDataHorzBottomVisibility , kDataVertLeftVisibility , kDataVertInsideVisibility ,
 kDataVertRightVisibility , kCellAlignment = 130 , kCellBackgroundFillNone , kCellBackgroundColor ,
 kCellContentColor , kCellTextStyle , kCellTextHeight , kCellTopGridColor ,
 kCellRightGridColor , kCellBottomGridColor , kCellLeftGridColor , kCellTopGridLineWeight ,
 kCellRightGridLineWeight , kCellBottomGridLineWeight , kCellLeftGridLineWeight , kCellTopVisibility ,
 kCellRightVisibility , kCellBottomVisibility , kCellLeftVisibility , kCellDataType
 }
 Public Types inherited from AcDbEntity
enum  | VisualStyleType { kFullVisualStyle = 0 , kFaceVisualStyle = 1 , kEdgeVisualStyle = 2 }
 Public Types inherited from AcGiDrawable
enum  | DrawableType {
 kGeometry = 0 , kDistantLight , kPointLight , kSpotLight ,
 kAmbientLight , kSolidBackground , kGradientBackground , kImageBackground ,
 kGroundPlaneBackground , kViewport
 }
enum  | SetAttributesFlags {
 kDrawableNone = 0 , kDrawableIsAnEntity = 1 , kDrawableUsesNesting = 2 , kDrawableIsCompoundObject = 4 ,
 kDrawableViewIndependentViewportDraw = 8 , kDrawableIsInvisible = 16 , kDrawableHasAttributes = 32 , kDrawableRegenTypeDependentGeometry = 64 ,
 kDrawableIsDimension = 133 , kDrawableRegenDraw = 256 , kDrawableStandardDisplaySingleLOD = 512 , kDrawableShadedDisplaySingleLOD = 1024 ,
 kDrawableViewDependentViewportDraw = 2048 , kDrawableBlockDependentViewportDraw = 4096 , kDrawableIsExternalReference = 8192 , kDrawableNotPlottable = 16384 ,
 kDrawableNotAllowLCS = 32768 , kDrawableMergeControlOff = 65536 , kThreadedWorldDrawViewportDraw = 131072
 }
 Public Member Functions
AcDbTable (const AcDbLinkedTableData *, AcDb::TableCopyOption)
virtual AcDb::CellAlignment  | alignment (AcDb::RowType=AcDb::kDataRow) const
Returns the cell alignment for the specified row type in this table entity. More...
virtual AcDb::CellAlignment  | alignment (int, int) const
Returns the cell alignment for the specified cell in this table entity. More...
virtual AcGePoint3d  | attachmentPoint (int, int) const
Returns the attachment point for the specified table cell. More...
AcGePoint3d  | attachmentPoint (int, int, int) const
Returns the content attachment point for the specified table cell. More...
virtual Acad::ErrorStatus  | audit (AcDbAuditInfo *)
virtual AcCmColor  | backgroundColor (AcDb::RowType=AcDb::kDataRow) const
Returns background color of the specified rows. More...
virtual AcCmColor  | backgroundColor (int, int) const
Returns background color of the specified cell. More...
virtual double  | blockRotation (int, int) const
this function will return angle rotation for block reference More...
virtual double  | blockScale (int, int) const
It returns scale factor. More...
virtual AcDbObjectId  | blockTableRecordId (int, int) const
Returns the block table record object id from the given row and column. More...
 AcDbObjectId  | blockTableRecordId (int, int, int) const
 AcDb::TableBreakFlowDirection  | breakFlowDirection () const
double  | breakHeight (int) const
Returns the break height for the specified table (sub-)part. More...
 AcGeVector3d  | breakOffset (int) const
 AcDb::TableBreakOption  | breakOption () const
double  | breakSpacing () const
Returns the break gap/space when the 'table break' feature is enabled. More...
 bool  | canDelete (int, int, bool) const
 bool  | canInsert (int, bool) const
virtual bool  | castShadows () const
See AcDbBlockReference::castShadows() . More...
 AcCellRange  | cellRange () const
AcDb::CellState  | cellState (int, int) const
Returns the cell state for the specified cell. More...
const ACHAR *  | cellStyle (int, int) const
Returns the style for the specified cell in this table entity. More...
virtual bool  | cellStyleOverrides (int, int, AcDbIntArray &) const
Returns the overrides settings of a cell. More...
virtual AcDb::CellType  | cellType (int, int) const
Returns the type of cell. More...
void  | clearCellOverrides (int, int)
Clears the overrides settings of a cell. More...
 virtual void  | clearSubSelection ()
The function cancels the cells sub selection set from a table.
 virtual void  | clearTableStyleOverrides (int=0)
virtual double  | columnWidth (int) const
Gets the width of the specified column from this table entity. More...
virtual AcCmColor  | contentColor (AcDb::RowType=AcDb::kDataRow) const
Returns color of the specified row type. More...
virtual AcCmColor  | contentColor (int, int) const
Returns color of the specified cell. More...
 AcCmColor  | contentColor (int, int, int) const
AcDb::CellContentLayout  | contentLayout (int, int) const
Returns the cell content layout for the specified cell. More...
 AcDb::CellContentType  | contentType (int, int) const
 AcDb::CellContentType  | contentType (int, int, int) const
Acad::ErrorStatus  | copyFrom (const AcDbLinkedTableData *, AcDb::TableCopyOption)
Copies another table content to this one. More...
Acad::ErrorStatus  | copyFrom (const AcDbLinkedTableData *, AcDb::TableCopyOption, const AcCellRange &, const AcCellRange &, AcCellRange *)
Copies another table content to this one. More...
Acad::ErrorStatus  | copyFrom (const AcDbTable *, AcDb::TableCopyOption, const AcCellRange &, const AcCellRange &, AcCellRange *)
Copies another table content to this one. More...
virtual Acad::ErrorStatus  | copyFrom (const AcRxObject *)
int  | createContent (int, int, int)
Creates a new cell content for specified cell, using given content index. More...
 Acad::ErrorStatus  | createTemplate (AcDbTableTemplate *&, AcDb::TableCopyOption)
AcString  | dataFormat (int, int) const
Returns the data format string for the first content of the specified table cell. More...
AcString  | dataFormat (int, int, int) const
Returns the data format string for the given content of the specified table cell. More...
virtual Acad::ErrorStatus  | deleteCellContent (int, int)
Deletes content for that cell. More...
virtual Acad::ErrorStatus  | deleteColumns (int, int=1)
Deletes some of this table's columns. More...
Acad::ErrorStatus  | deleteContent (const AcCellRange &)
Deletes all content from specified cell range. More...
Acad::ErrorStatus  | deleteContent (int, int)
Deletes all content for the specified cell. More...
Acad::ErrorStatus  | deleteContent (int, int, int)
Deletes the specified content for the specified cell. More...
virtual Acad::ErrorStatus  | deleteRows (int, int=1)
Deletes a number of this table's rows. More...
virtual AcGeVector3d  | direction () const
Returns the horizontal direction of this table object. More...
virtual Acad::ErrorStatus  | dwgInFields (AcDbDwgFiler *)
virtual Acad::ErrorStatus  | dwgOutFields (AcDbDwgFiler *) const
virtual Acad::ErrorStatus  | dxfInFields (AcDbDxfFiler *)
virtual Acad::ErrorStatus  | dxfOutFields (AcDbDxfFiler *) const
Acad::ErrorStatus  | enableBreak (bool)
Defines whether the 'table break' feature is enabled or disabled for this table. More...
 Acad::ErrorStatus  | enableMergeAll (int, int, bool)
virtual void  | erased (const AcDbObject *, Adesk::Boolean=Adesk::kTrue)
virtual AcDbObjectId  | fieldId (int, int) const
Returns the object id of the tspecified cell. More...
 AcDbObjectId  | fieldId (int, int, int) const
 Acad::ErrorStatus  | fill (const AcCellRange &, const AcCellRange &, AcDb::TableFillOption)
virtual AcDb::FlowDirection  | flowDirection () const
Gets the flow direction (Top to bottom or bottom to top) More...
 virtual const ACHAR *  | format (AcDb::RowType)
Not implemented yet.
const ACHAR *  | format (int, int) const
virtual Acad::ErrorStatus  | generateLayout ()
Updates this table entity taking into account the current table style. More...
virtual Acad::ErrorStatus  | getBlockAttributeValue (int, int, const AcDbObjectId &, ACHAR *&) const
Sets the attribute value for the block at the cell specified with row and column, if the content for this cell is a block. More...
 Acad::ErrorStatus  | getBlockAttributeValue (int, int, int, const AcDbObjectId &, ACHAR *&) const
virtual Acad::ErrorStatus  | getCellExtents (int, int, bool, AcGePoint3dArray &) const
Returns the extents points for the specified table cell. More...
 virtual Acad::ErrorStatus  | getCellExtents (int, int, double &, double &, bool) const
Not implemented yet.
const ACHAR *  | getColumnName (int) const
Returns the column name for the specified column. More...
int  | getCustomData (int, int) const
Gets custom data to row, or column, or cell. More...
Acad::ErrorStatus  | getCustomData (int, int, const ACHAR *, AcValue *) const
Gets custom data to row, or column, or cell. More...
int  | getDataLink (const AcCellRange *, AcDbObjectIdArray &) const
Get a data link. More...
AcDbObjectId  | getDataLink (int, int) const
Get a data link of a specific cell. More...
Acad::ErrorStatus  | getDataLink (int, int, AcDbDataLink *&, AcDb::OpenMode) const
Get a data link. More...
AcCellRange  | getDataLinkRange (int, int) const
Returns data linked cell range. More...
virtual Acad::ErrorStatus  | getDataType (AcValue::DataType &, AcValue::UnitType &, AcDb::RowType) const
Returns the data type and unit type for the specified row type. More...
Acad::ErrorStatus  | getDataType (int, int, AcValue::DataType &, AcValue::UnitType &) const
Returns the data type and unit type for the first content of the specified table cell. More...
Acad::ErrorStatus  | getDataType (int, int, int, AcValue::DataType &, AcValue::UnitType &) const
Returns the data type and unit type for the specified content of the specified table cell. More...
 AcString  | getFormula (int, int, int) const
 Acad::ErrorStatus  | getGridProperty (int, int, AcDb::GridLineType, AcGridProperty &) const
Acad::ErrorStatus  | getIndicatorSize (double &, double &) const
Gets the row and column indicator size. More...
 AcDbTableIterator *  | getIterator () const
 AcDbTableIterator *  | getIterator (const AcCellRange *, AcDb::TableIteratorOption) const
AcCellRange  | getMergeRange (int, int) const
The merging range is returned when you call this function. More...
AcDb::GridProperty  | getOverride (int, int, AcDb::GridLineType) const
Returns the grid property override setting. More...
AcDb::CellProperty  | getOverride (int, int, int) const
Returns the cell property override setting. More...
AcCellRange  | getSubSelection () const
Returns the currently selected cell range. More...
virtual Acad::ErrorStatus  | getSubSelection (int &, int &, int &, int &) const
It gets the indexes of the row and column for the cells in the sub selection set. More...
 AcString  | getToolTip (int, int) const
virtual AcCmColor  | gridColor (AcDb::GridLineType, AcDb::RowType=AcDb::kDataRow) const
Get the grid color of the specified grid line and row type. More...
virtual AcCmColor  | gridColor (int, int, AcDb::CellEdgeMask) const
Get the grid color of the specified cell edge. More...
AcCmColor  | gridColor (int, int, AcDb::GridLineType) const
Get the grid color of the specified cell. More...
 double  | gridDoubleLineSpacing (int, int, AcDb::GridLineType) const
 AcDb::GridLineStyle  | gridLineStyle (int, int, AcDb::GridLineType) const
 AcDbObjectId  | gridLinetype (int, int, AcDb::GridLineType) const
virtual AcDb::LineWeight  | gridLineWeight (AcDb::GridLineType, AcDb::RowType=AcDb::kDataRow) const
virtual AcDb::LineWeight  | gridLineWeight (int, int, AcDb::CellEdgeMask) const
AcDb::LineWeight  | gridLineWeight (int, int, AcDb::GridLineType)
virtual AcDb::Visibility  | gridVisibility (AcDb::GridLineType, AcDb::RowType=AcDb::kDataRow) const
Returns the grid visibility for the specified table cell. More...
virtual AcDb::Visibility  | gridVisibility (int, int, AcDb::CellEdgeMask) const
Returns the grid visibility for the specified table cell. More...
AcDb::Visibility  | gridVisibility (int, int, AcDb::GridLineType) const
Returns the grid visibility for the specified table cell. More...
 bool  | hasFormula (int, int, int) const
virtual bool  | hasSubSelection () const
If the Table has a sub selection set it returns TRUE. More...
virtual double  | height () const
Returns the height of the table. More...
virtual bool  | hitTest (const AcGePoint3d &, const AcGeVector3d &, double, double, int &, int &)
The function tests if a ray created by point and direction hits the table and sets the cell hit in row and col. More...
bool  | hitTest (const AcGePoint3d &, const AcGeVector3d &, double, double, int &, int &, int &, AcDb::TableHitItem &)
The function tests if a ray created by point and direction hits the table and sets the cell hit in row and col. More...
virtual double  | horzCellMargin () const
Returns the horizontal cell margin. More...
virtual Acad::ErrorStatus  | insertColumns (int, double, int=1)
Inserts new columns into this table entity at the specified column index. More...
Acad::ErrorStatus  | insertColumnsAndInherit (int, int, int)
Inserts new table columns at specified index, inheriting column parameters from specified column. More...
virtual Acad::ErrorStatus  | insertRows (int, double, int=1)
Inserts a number of rows into this table entity at the specified row index. More...
Acad::ErrorStatus  | insertRowsAndInherit (int, int, int)
Inserts new table rows at specified index, inheriting row parameters from specified row. More...
virtual bool  | isAutoScale (int, int) const
Returns whether the block content for the specified cell will be automatically scaled. More...
bool  | isAutoScale (int, int, int) const
Returns whether the block content at given contents index for the specified cell will be automatically scaled. More...
virtual bool  | isBackgroundColorNone (AcDb::RowType=AcDb::kDataRow) const
Returns whether the background color of the specified rows is disabled. More...
virtual bool  | isBackgroundColorNone (int, int) const
Returns whether background color of the specified cell is disabled. More...
bool  | isBreakEnabled () const
Returns whether the 'table break' feature is enabled or disabled for this table. More...
bool  | isContentEditable (int, int) const
Checks if the cell content can be modified. More...
 bool  | isEmpty (int, int) const
 bool  | isFormatEditable (int, int) const
virtual bool  | isHeaderSuppressed () const
Returns the status of the header row, true if header row is suppressed, @ or false otherwise. More...
bool  | isLinked (int, int) const
Checks if the cell has data link. More...
 bool  | isMergeAllEnabled (int, int) const
virtual bool  | isMergedCell (int, int, int *=NULL, int *=NULL, int *=NULL, int *=NULL) const
Unmerges the cells delimited by the parameters in the argument list.It returns the range of the merged cells too with : More...
bool  | isRegenerateTableSuppressed () const
Sets this AcDbTable instance to disable automatic regeneration. More...
virtual bool  | isTitleSuppressed () const
Returns true if the title row is suppressed. More...
double  | margin (int, int, AcDb::CellMargin) const
Returns the cell margin for specified row, or column, or cell. More...
virtual Acad::ErrorStatus  | mergeCells (int, int, int, int)
Merges the cells delimited by the cells in the argument list. More...
virtual double  | minimumColumnWidth (int) const
It will return for a specified index in the table minimum column. More...
virtual double  | minimumRowHeight (int) const
It will return for a specified index in the table minimum row. More...
virtual double  | minimumTableHeight () const
Returns minimum total height. More...
virtual double  | minimumTableWidth () const
Returns minimum total width. More...
 Acad::ErrorStatus  | moveContent (int, int, int, int)
virtual Adesk::UInt32  | numColumns () const
Returns the number of colums for this table object. More...
int  | numContents (int, int) const
Return the number of contents for the specified cell. More...
virtual Adesk::UInt32  | numRows () const
Returns the number of rows for this table object. More...
virtual void  | objectClosed (const AcDbObjectId)
virtual bool  | receiveShadows () const
See AcDbBlockReference::receiveShadows() . More...
virtual Acad::ErrorStatus  | recomputeTableBlock (bool=true)
Updates the block table record referenced by this table entity.If update is false, the block table record is updated if and only if this table entity has been changed since the block table record was last updated.If update is true, the block table will be unconditionally updated. More...
Acad::ErrorStatus  | removeAllOverrides (int, int)
Clears all override settings. More...
Acad::ErrorStatus  | removeDataLink ()
Remove table data link. More...
Acad::ErrorStatus  | removeDataLink (int, int)
Remove table data link. More...
 virtual bool  | reselectSubRegion (AcDbFullSubentPathArray &) const
Acad::ErrorStatus  | resetValue (int, int)
Resets the cell content for the specified cell. More...
double  | rotation () const
Gets the rotation angle of the table. More...
double  | rotation (int, int, int) const
Gets the rotation angle of the cell content. More...
virtual double  | rowHeight (int) const
Gets the height of the specified row from this table entity. More...
virtual AcDb::RowType  | rowType (int) const
Returns the row type for the row with index index. More...
 double  | scale (int, int, int) const
 virtual Acad::ErrorStatus  | select (const AcGePoint3d &, const AcGeVector3d &, const AcGeVector3d &, double, double, bool, bool, int &, int &, AcDbFullSubentPathArray *=NULL) const
 virtual Acad::ErrorStatus  | select_next_cell (int, int &, int &, AcDbFullSubentPathArray *=NULL, bool=true) const
Not implemented yet.
 virtual Acad::ErrorStatus  | selectSubRegion (const AcGePoint3d &, const AcGePoint3d &, const AcGeVector3d &, const AcGeVector3d &, double, double, AcDb::SelectType, bool, bool, int &, int &, int &, int &, AcDbFullSubentPathArray *=NULL) const
virtual Acad::ErrorStatus  | setAlignment (AcDb::CellAlignment, int=AcDb::kAllRows)
Sets the cell alignment for the specified row types in this table entity. More...
virtual Acad::ErrorStatus  | setAlignment (int, int, AcDb::CellAlignment)
Sets the cell alignment for the specified cell in this table entity. More...
virtual Acad::ErrorStatus  | setAutoScale (int, int, bool)
Declares the block content for the specified cell to be automatically scaled. More...
Acad::ErrorStatus  | setAutoScale (int, int, int, bool)
Declares the block content at given contents index for the specified cell to be automatically scaled. More...
virtual Acad::ErrorStatus  | setBackgroundColor (const AcCmColor &, int=AcDb::kAllRows)
Sets background color of the specified rows. More...
virtual Acad::ErrorStatus  | setBackgroundColor (int, int, const AcCmColor &)
Sets background color of the specified cell. More...
virtual Acad::ErrorStatus  | setBackgroundColorNone (bool, int=AcDb::kAllRows)
Enables/disables background color of the specified rows. More...
virtual Acad::ErrorStatus  | setBackgroundColorNone (int, int, bool)
Enables/disables background color of the specified cell. More...
virtual Acad::ErrorStatus  | setBlockAttributeValue (int, int, const AcDbObjectId &, const ACHAR *)
Sets the attribute value for the attribute defininition attId and for the block at the cell specified with row and column, if the content for this cell is a block. More...
 Acad::ErrorStatus  | setBlockAttributeValue (int, int, int, const AcDbObjectId &, const ACHAR *)
virtual Acad::ErrorStatus  | setBlockRotation (int, int, double)
The rotation angle of the block reference is set by this function. More...
virtual Acad::ErrorStatus  | setBlockScale (int, int, double)
The rotation angle of the block reference is set by this function. More...
virtual Acad::ErrorStatus  | setBlockTableRecordId (int, int, const AcDbObjectId &, bool=false)
Sets the block table record object id at the given row and column. More...
Acad::ErrorStatus  | setBlockTableRecordId (int, int, int, const AcDbObjectId &, bool)
Sets the block table record id at given contents index for the given row and column. More...
 Acad::ErrorStatus  | setBreakFlowDirection (AcDb::TableBreakFlowDirection)
Acad::ErrorStatus  | setBreakHeight (int, double)
Defines the break height for the specified table (sub-)part. More...
 Acad::ErrorStatus  | setBreakOffset (int, const AcGeVector3d &)
 Acad::ErrorStatus  | setBreakOption (AcDb::TableBreakOption)
Acad::ErrorStatus  | setBreakSpacing (double)
Defines the 'break space' for the 'table break' feature for this table. More...
virtual void  | setCastShadows (bool)
See AcDbBlockReference::setCastShadows(bool) . More...
Acad::ErrorStatus  | setCellState (int, int, AcDb::CellState)
Sets the cell state for the specified cell. More...
Acad::ErrorStatus  | setCellStyle (int, int, const ACHAR *)
Sets the style for the specified cell. More...
virtual Acad::ErrorStatus  | setCellType (int, int, AcDb::CellType)
Sets the cell with AcDbTable::kTextCell or AcDbTable::kBlockCell. More...
Acad::ErrorStatus  | setColumnName (int, const ACHAR *)
Sets the cell margin for specified row, or column, or cell. More...
virtual Acad::ErrorStatus  | setColumnWidth (double)
Sets the width of all columns in this table entity. More...
virtual Acad::ErrorStatus  | setColumnWidth (int, double)
Sets the width of the specified column in this table entity. More...
virtual Acad::ErrorStatus  | setContentColor (const AcCmColor &, int=AcDb::kAllRows)
Sets the specified row types with collor. More...
virtual Acad::ErrorStatus  | setContentColor (int, int, const AcCmColor &)
Sets the specified cell with collor. More...
 Acad::ErrorStatus  | setContentColor (int, int, int, const AcCmColor &)
Acad::ErrorStatus  | setContentLayout (int, int, AcDb::CellContentLayout)
Returns the cell content layout for the specified cell. More...
Acad::ErrorStatus  | setCustomData (int, int, const ACHAR *, const AcValue *)
Gets custom data to row, or column, or cell. More...
Acad::ErrorStatus  | setCustomData (int, int, int)
Sets custom data to row, or column, or cell. More...
Acad::ErrorStatus  | setDataFormat (int, int, const ACHAR *)
Defines the data format string for the first content of the specified table cell. More...
Acad::ErrorStatus  | setDataFormat (int, int, int nContent, const ACHAR *)
Defines the data format string for the first content of the specified table cell. More...
Acad::ErrorStatus  | setDataLink (const AcCellRange &, const AcDbObjectId &, bool)
Set table data link. More...
Acad::ErrorStatus  | setDataLink (int, int, const AcDbObjectId &, bool)
Set table data link. More...
virtual Acad::ErrorStatus  | setDataType (AcValue::DataType, AcValue::UnitType)
Defines the data type and units type for the table. More...
virtual Acad::ErrorStatus  | setDataType (AcValue::DataType, AcValue::UnitType, int)
Defines the data type, units type for the specified row types of the table. More...
Acad::ErrorStatus  | setDataType (int, int, AcValue::DataType, AcValue::UnitType)
Sets the data type and unit for the specified content of the specified table cell. More...
Acad::ErrorStatus  | setDataType (int, int, int, AcValue::DataType, AcValue::UnitType)
Sets the data type and unit for the specified content of the specified table cell. More...
virtual Acad::ErrorStatus  | setDirection (const AcGeVector3d &)
Sets the horizontal direction vector for this table object. More...
virtual Acad::ErrorStatus  | setFieldId (int, int, const AcDbObjectId &)
Assigns an AcDbField object to the specified table cell. More...
virtual Acad::ErrorStatus  | setFieldId (int, int, const AcDbObjectId &, AcDb::CellOption)
Assigns an AcDbField object to the specified table cell. More...
Acad::ErrorStatus  | setFieldId (int, int, int, const AcDbObjectId &, AcDb::CellOption)
Assigns an AcDbField object to the specified table cell. More...
virtual Acad::ErrorStatus  | setFlowDirection (AcDb::FlowDirection)
Sets the flow direction (Top to bottom or bottom to top) More...
virtual Acad::ErrorStatus  | setFormat (const ACHAR *)
virtual Acad::ErrorStatus  | setFormat (const ACHAR *, int)
 Acad::ErrorStatus  | setFormat (int, int, const ACHAR *)
 Acad::ErrorStatus  | setFormula (int, int, int, const ACHAR *)
virtual Acad::ErrorStatus  | setGridColor (const AcCmColor &, int, int)
Set the grid color of the specified grid line and row type. More...
Acad::ErrorStatus  | setGridColor (int, int, AcDb::GridLineType, const AcCmColor &)
Set the grid color of the specified cell. More...
virtual Acad::ErrorStatus  | setGridColor (int, int, short, const AcCmColor &)
Set the grid color of the specified cell edge. More...
 Acad::ErrorStatus  | setGridDoubleLineSpacing (int, int, AcDb::GridLineType, double)
 Acad::ErrorStatus  | setGridLineStyle (int, int, AcDb::GridLineType, AcDb::GridLineStyle)
 Acad::ErrorStatus  | setGridLinetype (int, int, AcDb::GridLineType, const AcDbObjectId &)
virtual Acad::ErrorStatus  | setGridLineWeight (AcDb::LineWeight, int, int)
The grid lineweight of the specified row type is set by this function. More...
Acad::ErrorStatus  | setGridLineWeight (int, int, AcDb::GridLineType, AcDb::LineWeight)
The grid lineweight of the specified cell, row or column is set by this function. More...
virtual Acad::ErrorStatus  | setGridLineWeight (int, int, short, AcDb::LineWeight)
The grid lineweight of the specified edge of the cell is set by this function. More...
 Acad::ErrorStatus  | setGridProperty (const AcCellRange &, AcDb::GridLineType, const AcGridProperty &)
 Acad::ErrorStatus  | setGridProperty (int, int, AcDb::GridLineType, const AcGridProperty &)
virtual Acad::ErrorStatus  | setGridVisibility (AcDb::Visibility, int, int)
The grid visibility of the grid line type and row type is set by this function. More...
Acad::ErrorStatus  | setGridVisibility (int, int, AcDb::GridLineType, AcDb::Visibility)
The grid visibility of the specified row column or cell is set by this function. More...
virtual Acad::ErrorStatus  | setGridVisibility (int, int, short, AcDb::Visibility)
The grid visibility of the specified edge is set by this function. More...
virtual Acad::ErrorStatus  | setHeight (double)
Sets the height of table. More...
virtual Acad::ErrorStatus  | setHorzCellMargin (double)
Sets the horizontal cell margin. More...
Acad::ErrorStatus  | setMargin (int, int, AcDb::CellMargin, double)
Sets the cell margin for specified row, or column, or cell. More...
virtual Acad::ErrorStatus  | setNormal (const AcGeVector3d &)
virtual Acad::ErrorStatus  | setNumColumns (int)
Sets the number of columns for this table object. More...
virtual Acad::ErrorStatus  | setNumRows (int)
Sets the number of rows for this table object. More...
Acad::ErrorStatus  | setOverride (int, int, AcDb::GridLineType, AcDb::GridProperty)
Sets the cell property override setting. More...
Acad::ErrorStatus  | setOverride (int, int, int, AcDb::CellProperty)
Sets the cell property override setting. More...
virtual Acad::ErrorStatus  | setPosition (const AcGePoint3d &)
virtual void  | setReceiveShadows (bool)
See AcDbBlockReference::setReceiveShadows(bool) . More...
 virtual void  | setRegen ()
Not implemented yet.
Acad::ErrorStatus  | setRotation (double)
Sets the rotation angle of the table. More...
Acad::ErrorStatus  | setRotation (int, int, int, double)
Sets the rotation angle of the cell content. More...
virtual Acad::ErrorStatus  | setRowHeight (double)
Sets the height of all rows in this table entity. More...
virtual Acad::ErrorStatus  | setRowHeight (int, double)
Sets the height of the specified row in this table entity. More...
 Acad::ErrorStatus  | setScale (int, int, int, double)
Acad::ErrorStatus  | setSize (int, int)
Sets the table size. More...
 Acad::ErrorStatus  | setSubSelection (const AcCellRange &)
virtual Acad::ErrorStatus  | setSubSelection (int, int, int, int)
It sets the indexes of row and column of cells to the sub selection set. More...
virtual Acad::ErrorStatus  | setTableStyle (const AcDbObjectId &)
Sets the object id of the AcDbTableStyle for use by this table entity. More...
virtual Acad::ErrorStatus  | setTextHeight (double, int=AcDb::kAllRows)
Sets the text height of the specified rows by type. More...
virtual Acad::ErrorStatus  | setTextHeight (int, int, double)
Sets the text height of a given cell in this table entity. More...
 Acad::ErrorStatus  | setTextHeight (int, int, int, double)
virtual Acad::ErrorStatus  | setTextRotation (int, int, AcDb::RotationAngle)
Sets the text rotation angle for the specified cell.in this table entity. More...
virtual Acad::ErrorStatus  | setTextString (int, int, const ACHAR *)
Sets the text string for the specified cell in this table entity. More...
Acad::ErrorStatus  | setTextString (int, int, int, const ACHAR *)
Sets the text string for the specified cell in this table entity. More...
virtual Acad::ErrorStatus  | setTextStyle (const AcDbObjectId &, int=AcDb::kAllRows)
Sets the text style used for row r, column c. More...
virtual Acad::ErrorStatus  | setTextStyle (int, int, const AcDbObjectId &)
Sets the text style used for row r, column c. More...
 Acad::ErrorStatus  | setTextStyle (int, int, int, const AcDbObjectId &)
 Acad::ErrorStatus  | setToolTip (int, int, const ACHAR *)
Acad::ErrorStatus  | setValue (int, int, const AcValue &)
Sets the first content of the specified table cell to the given value. More...
Acad::ErrorStatus  | setValue (int, int, int, const AcValue &)
Sets the specified table cell at specified content index to the given value. More...
Acad::ErrorStatus  | setValue (int, int, int, const AcValue &, AcValue::ParseOption)
Sets the specified table cell at specified content index to the given value. More...
 Acad::ErrorStatus  | setValue (int, int, int, LPCTSTR, AcValue::ParseOption)
 Acad::ErrorStatus  | setValue (int, int, LPCTSTR, AcValue::ParseOption)
virtual Acad::ErrorStatus  | setVertCellMargin (double)
Sets the vertical cell margin. More...
virtual Acad::ErrorStatus  | setWidth (double)
Sets the Width of table. More...
virtual Acad::ErrorStatus  | subClose ()
virtual Acad::ErrorStatus  | suppressHeaderRow (bool)
Enable or disable the header row of the table by changing @ the input flag. More...
 virtual void  | suppressInvisibleGrid (bool)
Not implemented yet.
void  | suppressRegenerateTable (bool)
Sets this AcDbTable instance to disable automatic regeneration. More...
virtual Acad::ErrorStatus  | suppressTitleRow (bool)
Suppress/Unsuppress the title row. More...
virtual AcDbObjectId  | tableStyle () const
Returns the object id of the table style used by this table entity. More...
 virtual bool  | tableStyleOverrides (AcDbIntArray &) const
virtual double  | textHeight (AcDb::RowType=AcDb::kDataRow) const
Returns the text height for the specified row type in this table entity. More...
virtual double  | textHeight (int, int) const
Returns the text height for the specified cell in this table entity. More...
 double  | textHeight (int, int, int) const
virtual AcDb::RotationAngle  | textRotation (int, int) const
Gets the the text rotation angle for the specified cell in this table entity. More...
virtual ACHAR *  | textString (int, int) const
Returns the text string in the specified cell in this table entity. More...
virtual Acad::ErrorStatus  | textString (int, int, AcValue::FormatOption, AcString &) const
Returns the text string in the specified cell in this table entity. More...
 AcString  | textString (int, int, int) const
 Acad::ErrorStatus  | textString (int, int, int, AcValue::FormatOption, AcString &) const
virtual const ACHAR *  | textStringConst (int, int) const
Returns the text string which exists in the specified cell. More...
virtual AcDbObjectId  | textStyle (AcDb::RowType=AcDb::kDataRow) const
Returns the object id of the text style used for a rowType. More...
virtual AcDbObjectId  | textStyle (int, int) const
Returns the object id of the text style used for row r, column c. More...
 AcDbObjectId  | textStyle (int, int, int) const
virtual Acad::ErrorStatus  | unmergeCells (int, int, int, int)
Unmerges the cells delimited by the parameters in the argument list. More...
Acad::ErrorStatus  | updateDataLink (AcDb::UpdateDirection, AcDb::UpdateOption)
Update table data link. More...
Acad::ErrorStatus  | updateDataLink (int, int, AcDb::UpdateDirection, AcDb::UpdateOption)
Update table data link. More...
AcValue  | value (int, int) const
get AcValue settings More...
AcValue  | value (int, int, int) const
Sets the specified table cell at specified content index to the given value. More...
AcValue  | value (int, int, int, AcValue::FormatOption) const
Sets the specified table cell at specified content index to the given value. More...
virtual double  | vertCellMargin () const
Returns the vertical cell margin. More...
virtual double  | width () const
Returns the width of the table. More...
 Public Member Functions inherited from AcDbBlockReference
AcDbBlockReference (const AcGePoint3d &, AcDbObjectId)
Acad::ErrorStatus  | appendAttribute (AcDbAttribute *)
Appends the specified attribute pAcAttrib to the attribute list of this block reference. More...
Acad::ErrorStatus  | appendAttribute (AcDbObjectId &, AcDbAttribute *)
Appends the specified Attribute to the attribute list of this block reference and returns the objectId of the newly added attribute. More...
AcDbObjectIterator *  | attributeIterator () const
Returns an attribute iterator. More...
AcDbObjectId  | blockTableRecord () const
Returns the object id of the corresponding block definition (DXF -2). More...
AcGeMatrix3d  | blockTransform () const
Returns an object AcGeMatrix3d representing the MCS for the block reference. More...
virtual Acad::ErrorStatus  | explodeToOwnerSpace () const
Explodes the current AcDbBlockReference and adds the exploded entities to the owner of this block reference. More...
Acad::ErrorStatus  | geomExtentsBestFit (AcDbExtents &, const AcGeMatrix3d &=AcGeMatrix3d::kIdentity) const
Calculates and returns the extents of the block table record that is referenced. More...
virtual Acad::ErrorStatus  | getPlane (AcGePlane &, AcDb::Planarity &) const
Returns plane information. More...
virtual Adesk::Boolean  | isPlanar () const
 AcGeMatrix3d  | nonAnnotationBlockTransform () const
 AcGeScale3d  | nonAnnotationScaleFactors () const
AcGeVector3d  | normal () const
Returns the normal in WCS (DXF 210). More...
Acad::ErrorStatus  | openAttribute (AcDbAttribute *&, AcDbObjectId, AcDb::OpenMode, bool=false)
Opens an attribute owned by this block reference. More...
Acad::ErrorStatus  | openSequenceEnd (AcDbSequenceEnd *&, AcDb::OpenMode)
Opens the SequenceEnd entity for this block reference. More...
virtual AcGePoint3d  | position () const
Returns the insertion Point in WCS (DXF 10). More...
double  | rotation () const
Returns the rotation in radians (DXF 50). More...
 AcGeScale3d  | scaleFactors () const
Returns an object AcGeScale3d representing the 3d scale for the block reference.
virtual Acad::ErrorStatus  | setBlockTableRecord (AcDbObjectId)
Sets the block definition (DXF -2). More...
virtual Acad::ErrorStatus  | setBlockTransform (const AcGeMatrix3d &)
Sets the block MCS to the specified in acMatrix3d. More...
virtual Acad::ErrorStatus  | setNormal (const AcGeVector3d &)
Sets the normal in WCS (DXF 210). More...
virtual Acad::ErrorStatus  | setPosition (const AcGePoint3d &)
Sets the insertion point (DXF 10). More...
virtual Acad::ErrorStatus  | setRotation (double)
Sets the rotation in radians (DXF 50). More...
virtual Acad::ErrorStatus  | setScaleFactors (const AcGeScale3d &)
Sets the block reference to the scale specified by scale3d. More...
virtual Adesk::Boolean  | treatAsAcDbBlockRefForExplode () const
Affects the way the command EXPLODE behaves with custom entities derived from AcDbBlockReference. More...
~AcDbBlockReference ()
destructor.
 Public Member Functions inherited from AcDbEntity
 virtual Acad::ErrorStatus  | addSubentPaths (const AcDbFullSubentPathArray &) final
virtual Acad::ErrorStatus  | applyPartialUndo (AcDbDwgFiler *, AcRxClass *)
virtual Acad::ErrorStatus  | audit (AcDbAuditInfo *)
AcDbObjectId  | blockId () const
Returns the Object ID of the BlockTableRecord that owns this entity. More...
Acad::ErrorStatus  | boundingBoxIntersectWith (const AcDbEntity *, AcDb::Intersect, AcGePoint3dArray &, Adesk::GsMarker, Adesk::GsMarker) const
Finds the intersection between the edges of the bounding box for this entity and the pOhter entity. More...
Acad::ErrorStatus  | boundingBoxIntersectWith (const AcDbEntity *, AcDb::Intersect, const AcGePlane &, AcGePoint3dArray &, Adesk::GsMarker, Adesk::GsMarker) const
First, the function projects the other entity and the bounding box of this entity on plane specified by plane. More...
virtual bool  | bounds (AcDbExtents &) const
Returns the extents of this entity as AcDbExtents. More...
virtual bool  | castShadows () const
Checks if this entity is able to cast shadows. More...
virtual Adesk::Boolean  | cloneMeForDragging () final
Checks if a clone will be created for this entity in case of a drag operation. More...
 virtual AcDb::CollisionType  | collisionType () const
AcCmColor  | color () const
Returns the true color information of the entity. More...
Adesk::UInt16  | colorIndex () const
Returns the color number in a range from 0 to 256. More...
 virtual Acad::ErrorStatus  | deleteSubentPaths (const AcDbFullSubentPathArray &) final
virtual void  | dragStatus (const AcDb::DragStat)
Acad::ErrorStatus  | draw ()
Draws or redraws the entity on screen. More...
virtual AcGiDrawable *  | drawable ()
virtual Acad::ErrorStatus  | dwgInFields (AcDbDwgFiler *)
virtual Acad::ErrorStatus  | dwgOutFields (AcDbDwgFiler *) const
virtual Acad::ErrorStatus  | dxfInFields (AcDbDxfFiler *)
virtual Acad::ErrorStatus  | dxfOutFields (AcDbDxfFiler *) const
AcCmEntityColor  | entityColor () const
Returns the lightweight color information of the entity. More...
virtual Acad::ErrorStatus  | explode (AcDbVoidPtrArray &) const final
virtual Acad::ErrorStatus  | getCompoundObjectTransform (AcGeMatrix3d &) const final
It is used for object without geometry like AcDbMleader. More...
virtual void  | getEcs (AcGeMatrix3d &) const
Returns the transformation matrix from OCS (Object Coordinate System) to WCS (World Coordinate System). More...
virtual Acad::ErrorStatus  | getGeomExtents (AcDbExtents &) const final
Returns extents of this entity. More...
 virtual Acad::ErrorStatus  | getGripEntityUCS (const void *, AcGeVector3d &, AcGePoint3d &, AcGeVector3d &) const final
 virtual Acad::ErrorStatus  | getGripPoints (AcDbGripDataPtrArray &, const double, const int, const AcGeVector3d &, const int) const final
virtual Acad::ErrorStatus  | getGripPoints (AcGePoint3dArray &, AcDbIntArray &, AcDbIntArray &) const final
Append grip points to the specified array. More...
 virtual Acad::ErrorStatus  | getGripPointsAtSubentPath (const AcDbFullSubentPath &, AcDbGripDataPtrArray &, const double, const int, const AcGeVector3d &, const int) const final
virtual Acad::ErrorStatus  | getGsMarkersAtSubentPath (const AcDbFullSubentPath &, AcArray< Adesk::GsMarker > &) const final
virtual Acad::ErrorStatus  | getMaterialMapper (AcGiMapper &) const
virtual Acad::ErrorStatus  | getOsnapPoints (AcDb::OsnapMode, Adesk::GsMarker, const AcGePoint3d &, const AcGePoint3d &, const AcGeMatrix3d &, AcGePoint3dArray &, AcDbIntArray &) const final
Gets the entity osnap points. More...
virtual Acad::ErrorStatus  | getOsnapPoints (AcDb::OsnapMode, Adesk::GsMarker, const AcGePoint3d &, const AcGePoint3d &, const AcGeMatrix3d &, AcGePoint3dArray &, AcDbIntArray &, const AcGeMatrix3d &) const final
Gets the entity osnap points. More...
virtual Acad::ErrorStatus  | getPlane (AcGePlane &, AcDb::Planarity &) const
Returns the plane that contains this entity. More...
AcDb::PlotStyleNameType  | getPlotStyleNameId (AcDbObjectId &) const
Returns the plot style name type and its associated id. More...
virtual Acad::ErrorStatus  | getStretchPoints (AcGePoint3dArray &) const final
Append stretch points to the specified array. More...
 virtual Acad::ErrorStatus  | getSubentClassId (const AcDbFullSubentPath &, CLSID *) const final
 virtual Acad::ErrorStatus  | getSubentPathGeomExtents (const AcDbFullSubentPath &, AcDbExtents &) const final
virtual Acad::ErrorStatus  | getSubentPathsAtGsMarker (AcDb::SubentType, Adesk::GsMarker, const AcGePoint3d &, const AcGeMatrix3d &, int &, AcDbFullSubentPath *&, int=0, AcDbObjectId *=NULL) const final
Gets the subentity paths appropriate for the passed in gs marker. More...
virtual Acad::ErrorStatus  | getTransformedCopy (const AcGeMatrix3d &, AcDbEntity *&) const final
Creates a copy of the current entity applying the transformation matrix. More...
 virtual void  | gripStatus (const AcDb::GripStat) final
virtual AcGsNode *  | gsNode () const
 virtual bool  | hideMeForDragging () const final
virtual Acad::ErrorStatus  | highlight (const AcDbFullSubentPath &=kNullSubent, const Adesk::Boolean=Adesk::kFalse) const final
Highlights part of, or entire entity. More...
virtual Acad::ErrorStatus  | intersectWith (const AcDbEntity *, AcDb::Intersect, AcGePoint3dArray &, Adesk::GsMarker=0, Adesk::GsMarker=0) const final
Finds the intersection between this entity and the pOhter entity. More...
virtual Acad::ErrorStatus  | intersectWith (const AcDbEntity *, AcDb::Intersect, const AcGePlane &, AcGePoint3dArray &, Adesk::GsMarker=0, Adesk::GsMarker=0) const final
Projects this entity and the pOhter entity on plane, finds the intersection points between these projections and then projects back the points onto the caller entity. More...
 virtual bool  | isContentSnappable () const final
virtual Adesk::Boolean  | isPlanar () const
ACHAR *  | layer () const
Returns the layername. More...
AcDbObjectId  | layerId () const
Returns the Object ID of the LayerTableRecord referenced by this entity. More...
ACHAR *  | linetype () const
Gets the linetype value. More...
AcDbObjectId  | linetypeId () const
Gets the linetypeId value. More...
 double  | linetypeScale () const
returns the linetype scale factor for the entity
AcDb::LineWeight  | lineWeight () const
Gets the entity line weight. More...
virtual void  | list () const final
Prints the properties in drawing window. More...
ACHAR *  | material () const
Gets the material assigned to this entity. More...
AcDbObjectId  | materialId () const
Gets the AcDbObjectId of the material assigned to this entity. More...
virtual Acad::ErrorStatus  | moveGripPointsAt (const AcDbIntArray &, const AcGeVector3d &) final
Move the grip points pointed by the indexes specified in indexArray using the translationVector param direction and length Override this method in custom entities to define your own behaviour. More...
 virtual Acad::ErrorStatus  | moveGripPointsAt (const AcDbVoidPtrArray &, const AcGeVector3d &, const int) final
 virtual Acad::ErrorStatus  | moveGripPointsAtSubentPaths (const AcDbFullSubentPathArray &, const AcDbVoidPtrArray &, const AcGeVector3d &, const int) final
virtual Acad::ErrorStatus  | moveStretchPointsAt (const AcDbIntArray &, const AcGeVector3d &) final
Move the stretch points pointed by the indexes specified in indexArray with the offest specified by translationVector Override this method in custom entities to define your own behaviour. More...
ACHAR *  | plotStyleName () const
Returns the name of the plotStyleName string associated with this entity (DXF 390). More...
virtual bool  | receiveShadows () const
Checks if this entity is able to receive shadows. More...
void  | recordGraphicsModified (Adesk::Boolean=Adesk::kTrue)
Controls the entity display update when closing it Entities not updated when closed are updated at the first regen. More...
virtual void  | saveAs (AcGiWorldDraw *, AcDb::SaveType)
Generates the graphics primitives when a DWG save requiring proxy graphics to be saved is made. More...
virtual void  | setCastShadows (bool)
Sets this entity's flag regarding casting shadows. More...
virtual Acad::ErrorStatus  | setColor (const AcCmColor &, Adesk::Boolean=Adesk::kTrue)
Sets the color information of this entity from an AcCmColor instance. More...
virtual Acad::ErrorStatus  | setColor (const AcCmColor &, bool, AcDbDatabase *)
Sets the color property of this entity from an AcCmColor instance. More...
virtual Acad::ErrorStatus  | setColorIndex (Adesk::UInt16, Adesk::Boolean=Adesk::kTrue)
Sets the color index of this entity (DXF 62). More...
void  | setDatabaseDefaults ()
Applies the default properties of the entities database to this entity. More...
void  | setDatabaseDefaults (AcDbDatabase *)
Applies the default properties of the specified database to this entity. More...
virtual void  | setGsNode (AcGsNode *)
virtual Acad::ErrorStatus  | setLayer (AcDbObjectId, Adesk::Boolean=Adesk::kTrue, bool=false)
Sets the layer to be referenced by this entity (DXF 8). More...
virtual Acad::ErrorStatus  | setLayer (const ACHAR *, Adesk::Boolean=Adesk::kTrue, bool=false)
Sets the layer to be referenced by this entity (DXF 8). More...
virtual Acad::ErrorStatus  | setLinetype (AcDbObjectId, Adesk::Boolean=Adesk::kTrue)
Sets the entities linetype to ltypeObjectId. More...
virtual Acad::ErrorStatus  | setLinetype (const ACHAR *, Adesk::Boolean=Adesk::kTrue)
Sets the entities linetype to the linetpye referenced by layerName. More...
virtual Acad::ErrorStatus  | setLinetypeScale (double, Adesk::Boolean=Adesk::kTrue)
sets value as entity linetype scale factor More...
virtual Acad::ErrorStatus  | setLineWeight (AcDb::LineWeight, Adesk::Boolean=Adesk::kTrue)
Sets the entity line weight. More...
virtual Acad::ErrorStatus  | setMaterial (AcDbObjectId, Adesk::Boolean=Adesk::kTrue)
Not implemented yet. More...
virtual Acad::ErrorStatus  | setMaterial (const ACHAR *, Adesk::Boolean=Adesk::kTrue)
Assigns the material to the entity. More...
virtual Acad::ErrorStatus  | setMaterialMapper (const AcGiMapper &, Adesk::Boolean=Adesk::kTrue)
It is used for apply material (scale, rotation, projection, mode overrides) to an identity.If it is used AcGiMapper::kIdentity it will apply for entity a default mapper. More...
virtual Acad::ErrorStatus  | setPlotStyleName (AcDb::PlotStyleNameType, AcDbObjectId=AcDbObjectId::kNull, Adesk::Boolean=Adesk::kTrue)
Sets the plot style of this entity. More...
virtual Acad::ErrorStatus  | setPlotStyleName (const ACHAR *, Adesk::Boolean=Adesk::kTrue)
Sets the plot style of this entity. More...
Acad::ErrorStatus  | setPropertiesFrom (const AcDbEntity *, Adesk::Boolean=Adesk::kTrue)
Copies the properties color, layer, linetype, linetypescale and visibility from the source entity pEntity to this entity. More...
virtual void  | setReceiveShadows (bool)
Sets this entity's flag regarding receiving shadows. More...
virtual Acad::ErrorStatus  | setTransparency (const AcCmTransparency &, Adesk::Boolean=Adesk::kTrue)
Sets the transparency setting of this entity, and returns eOk if successful. More...
virtual Acad::ErrorStatus  | setVisibility (AcDb::Visibility, Adesk::Boolean=Adesk::kTrue) final
notyetdocumented. More...
 virtual Acad::ErrorStatus  | setVisualStyle (AcDbObjectId, VisualStyleType=kFullVisualStyle, Adesk::Boolean=true)
 virtual void  | subentGripStatus (const AcDb::GripStat, const AcDbFullSubentPath &) final
virtual AcDbEntity *  | subentPtr (const AcDbFullSubentPath &) const final
Creates an entity as a copy of the subentity given by acSubentPath. More...
virtual void  | subSetDatabaseDefaults (AcDbDatabase *)
This function is called by AcDbEntity::setDatabaseDefaults(), to allow custom entities to set their related sub entities, if any; default implementation does nothing. More...
virtual Acad::ErrorStatus  | transformBy (const AcGeMatrix3d &) final
Applies given transformation (matrix) to the entity. More...
 virtual Acad::ErrorStatus  | transformSubentPathsBy (const AcDbFullSubentPathArray &, const AcGeMatrix3d &) final
 AcCmTransparency  | transparency () const
Returns the transparency setting of this entity.
virtual Acad::ErrorStatus  | unhighlight (const AcDbFullSubentPath &=kNullSubent, const Adesk::Boolean=Adesk::kFalse) const final
Unhighlights previously highlighted part of entity, or entire entity. More...
AcDb::Visibility  | visibility () const
Gets the visibility state. More...
 AcDbObjectId  | visualStyleId (VisualStyleType=kFullVisualStyle) const
 Public Member Functions inherited from AcDbObject
virtual void  | addPersistentReactor (AcDbObjectId)
Adds a persistent reactor to this object reactor list. More...
void  | addReactor (AcDbObjectReactor *) const
Adds a transient reactor to this object. More...
virtual Acad::ErrorStatus  | applyPartialUndo (AcDbDwgFiler *, AcRxClass *)
This function is called during Undo operations on objects, that use the 'Partial Undo meachanism'; this is, this object is opened with assertWriteEnabled(Adesk::kFalse) to indicate that custom Undo filing is used rather than the default Undo filing. More...
 void  | assertNotifyEnabled () const
 void  | assertReadEnabled () const
 void  | assertWriteEnabled (Adesk::Boolean=Adesk::kTrue, Adesk::Boolean=Adesk::kTrue)
virtual Acad::ErrorStatus  | audit (AcDbAuditInfo *)
Performs the audit operation for this object. More...
Acad::ErrorStatus  | cancel ()
Reverts all changes since the object had been opened and closes the object. More...
virtual void  | cancelled (const AcDbObject *)
A handler function for persistent reactors. More...
virtual AcRxObject *  | clone () const
Creates a shallow clone of this object. More...
Acad::ErrorStatus  | close ()
Closes the object. More...
Acad::ErrorStatus  | closeAndPage (Adesk::Boolean=Adesk::kTrue)
Closes the object. More...
virtual Acad::ErrorStatus  | composeForLoad (AcDb::OdaSaveType, AcDb::AcDbDwgVersion)
This function is intended for future MT file loading support. More...
virtual void  | copied (const AcDbObject *, const AcDbObject *)
A handler function for persistent reactors. More...
virtual Acad::ErrorStatus  | copyFrom (const AcRxObject *)
Copies the pSrc object information in this object. More...
Acad::ErrorStatus  | createExtensionDictionary ()
Creates a dictionary as extension dictionary for this object. More...
AcDbDatabase *  | database () const
Returns the database that contains this object. More...
virtual Acad::ErrorStatus  | decomposeForSave (AcDb::AcDbDwgVersion, AcDbObject *&, AcDbObjectId &, Adesk::Boolean &)
This function is called during dwg and dxf output, to allow a custom object to decompose itself, due to provided dwg/dxf target file version. More...
virtual Acad::ErrorStatus  | deepClone (AcDbObject *, AcDbObject *&, AcDbIdMapping &, Adesk::Boolean=Adesk::kTrue) const final
Clones this object, appends it to the owner pOwner and adds an AcDbIdPair record to the idMap. More...
void  | disableUndoRecording (Adesk::Boolean)
Disables or enables the undo recording for the object. More...
Acad::ErrorStatus  | downgradeOpen ()
Sets the open mode for an object opened for write to be opened for read. More...
Acad::ErrorStatus  | downgradeToNotify (Adesk::Boolean)
Sets the open mode for an object opened for write to be opened for notify. More...
virtual AcGiDrawable *  | drawable ()
Retrieves the AcGiDrawable instance of this object. More...
Acad::ErrorStatus  | dwgIn (AcDbDwgFiler *)
Calls the object's dwgInFields function, and reads any XData if present. More...
virtual Acad::ErrorStatus  | dwgInFields (AcDbDwgFiler *)
Reads the object from the DWG filer. More...
Acad::ErrorStatus  | dwgOut (AcDbDwgFiler *) const
Calls the object's dwgOutFields function, and writes any XData if present. More...
virtual Acad::ErrorStatus  | dwgOutFields (AcDbDwgFiler *) const
Writes the object to the DWG filer. More...
Acad::ErrorStatus  | dxfIn (AcDbDxfFiler *)
Calls the object's dxfInFields function, and reads any XData if present. More...
virtual Acad::ErrorStatus  | dxfInFields (AcDbDxfFiler *)
Reads the object from the DXF filer. More...
Acad::ErrorStatus  | dxfOut (AcDbDxfFiler *, Adesk::Boolean, Adesk::uchar *) const
Calls the object's dxfOutFields function, and writes any XData if present. More...
virtual Acad::ErrorStatus  | dxfOutFields (AcDbDxfFiler *) const
Writes the object to the DXF filer. More...
Acad::ErrorStatus  | erase (Adesk::Boolean=Adesk::kTrue)
Sets the bit that indicates that the object is erased. More...
virtual void  | erased (const AcDbObject *, Adesk::Boolean=Adesk::kTrue)
A handler function for persistent reactors. More...
AcDbObjectId  | extensionDictionary () const
Returns the object id of the extension dictionary for this object. More...
void  | getAcDbHandle (AcDbHandle &) const
Returns handle of this object. More...
Acad::ErrorStatus  | getBinaryData (const ACHAR *, Adesk::Int32 &, char *&) const
Creates a copy of the binary data stored as chunks of maximum 127 bytes in the resbuf chain of this object's extension dictionary xrecord entry given by entryName. More...
int  | getBrxOpenCount () const
This function returns the number of open BRX instances for this object. More...
int  | getBrxOpenState () const
This function returns the BRX object open state flags as bitfields, for diagnostic purpose. More...
virtual Acad::ErrorStatus  | getClassID (CLSID *) const final
Gets the COM wrapper Class ID for this entity. More...
int  | getCustomObjectState () const
This function returns the custom object status : 1=isCustomObject 2=DifferentialUndoDisabled. More...
Acad::ErrorStatus  | getField (const ACHAR *, AcDbField *&, AcDb::OpenMode) const
Retrieves the specified Field from this object, and opens it in mode. More...
Acad::ErrorStatus  | getField (const ACHAR *, AcDbObjectId &) const
Gets the pszPropName field object from field dictionary of this AcDbObject object, using pszPropName as key. More...
AcDbObjectId  | getFieldDictionary () const
Returns the Field dictionary associated with this object,. More...
Acad::ErrorStatus  | getFieldDictionary (AcDbDictionary *&, AcDb::OpenMode) const
Gets and opens the field dictionary for this. More...
Acad::ErrorStatus  | getObjectBirthVersion (AcDb::AcDbDwgVersion &, AcDb::MaintenanceReleaseVersion &)
This function is currently not supported by the CAD engine, always returns Acad::eOk, and 'kDHL_CURRENT' + 'kMReleaseCurrent' results. More...
virtual Acad::ErrorStatus  | getObjectSaveVersion (const AcDbDwgFiler *, AcDb::AcDbDwgVersion &, AcDb::MaintenanceReleaseVersion &)
Returns the DWG version for saving the object. More...
virtual Acad::ErrorStatus  | getObjectSaveVersion (const AcDbDxfFiler *, AcDb::AcDbDwgVersion &, AcDb::MaintenanceReleaseVersion &)
Returns the DWG version for saving the object. More...
int  | getOdaOpenCount () const
This function returns the number of open ODA instances for this object. More...
int  | getOdaOpenState () const
This function returns the ODA object open state flags as bitfields, for diagnostic purpose. More...
virtual void  | goodbye (const AcDbObject *)
A handler function for persistent reactors. More...
virtual AcGsNode *  | gsNode () const
Gets the AcGsNode (graphics cache) for this entity. More...
Acad::ErrorStatus  | handOverTo (AcDbObject *, Adesk::Boolean=Adesk::kTrue, Adesk::Boolean=Adesk::kTrue)
Hands over objects identity to another object. More...
bool  | hasFields () const
Return true if this object has single or multiple fields associated with him. More...
bool  | hasPersistentReactor (AcDbObjectId) const
Checks the input objectId in this object reactor list. More...
bool  | hasSaveVersionOverride ()
This function indicates whether this object overrides the filer's save version. More...
virtual AcDbObjectId  | id () const
Returns the database id of this object. More...
Adesk::Boolean  | isAcDbObjectIdsInFlux () const
Checks whether a deep clone operation was completed. More...
Adesk::Boolean  | isAProxy () const
Adesk::Boolean  | isCancelling () const
Adesk::Boolean  | isErased () const
Returns whether this object is erased. More...
Adesk::Boolean  | isEraseStatusToggled () const
Checks whether the object erase status has been toggled. More...
Adesk::Boolean  | isModified () const
Returns whether this object's assertWriteEnabled() has been called since it was opened. More...
Adesk::Boolean  | isModifiedGraphics () const
Checks whether this object graphics will be updated when the object is closed. More...
Adesk::Boolean  | isModifiedXData () const
Checks whether this object's xData was modified. More...
Adesk::Boolean  | isNewObject () const
Returns true if and only if this object has not been closed since it was created. More...
Adesk::Boolean  | isNotifyEnabled () const
Returns whether this object is opened for notify. More...
Adesk::Boolean  | isNotifying () const
virtual Adesk::Boolean  | isPersistent () const
Returns the 'persistent' status of a database object. More...
Adesk::Boolean  | isReadEnabled () const
Returns whether this object is opened for read. More...
 Adesk::Boolean  | isReallyClosing () const
Checks whether the next close call will completely close this object return true if on the next call the object will be completely closed false otherwise.
Adesk::Boolean  | isTransactionResident () const
Gets the object transaction status. More...
Adesk::Boolean  | isUndoing () const
bool  | isUndoRecordingDisabled () const
Returns whether the undo recording for the object is enabled or not. More...
Adesk::Boolean  | isWriteEnabled () const
Returns whether this object is opened for write. More...
virtual AcDb::DuplicateRecordCloning  | mergeStyle () const
Returns the object's merge behavior during cloning. More...
virtual void  | modified (const AcDbObject *)
A handler function for persistent reactors. More...
virtual void  | modifiedGraphics (const AcDbEntity *)
A handler function for persistent reactors. More...
virtual void  | modifiedXData (const AcDbObject *)
A handler function for persistent reactors. More...
virtual void  | modifyUndone (const AcDbObject *)
A handler function for persistent reactors. More...
virtual void  | objectClosed (const AcDbObjectId)
A handler function for persistent reactors. More...
AcDbObjectId  | objectId () const
Returns object id. More...
virtual void  | openedForModify (const AcDbObject *)
A handler function for persistent reactors. More...
AcDbObjectId  | ownerId () const
Returns object id of the owner. More...
AcDbVoidPtrArray *  | reactors ()
Gets the object pointers to reactors. More...
const AcDbVoidPtrArray *  | reactors () const
Gets the object pointers to reactors. More...
virtual void  | reappended (const AcDbObject *)
A handler function for persistent reactors. More...
 virtual void  | recvPropagateModify (const AcDbObject *)
Not implemented yet.
Acad::ErrorStatus  | releaseExtensionDictionary ()
Removes the extension dictionary associated with this object. More...
virtual Acad::ErrorStatus  | removeField (AcDbObjectId)
Removes the Field specified by acFieldId from this object. More...
virtual Acad::ErrorStatus  | removeField (const ACHAR *)
Removes the Field specified by szKeyString from this object. More...
virtual Acad::ErrorStatus  | removeField (const ACHAR *, AcDbObjectId &)
Removes the Field specified by acPszKeyString from this object, and returns its ObjectId value. More...
virtual Acad::ErrorStatus  | removePersistentReactor (AcDbObjectId)
Removes a persistent reactor from this object reactor list. More...
void  | removeReactor (AcDbObjectReactor *) const
Removes a transient reactor to this object. More...
void  | setAcDbObjectIdsInFlux ()
Call this function to indicate that the object IDs of this object and its sub-objects (if any) are not yet valid. More...
Acad::ErrorStatus  | setBinaryData (const ACHAR *, Adesk::Int32, const char *)
Creates a copy of the binary data, divides it in up to 127 bytes binary chunks and
 sets them as resbufs in the resbuf chain of this object's extension dictionary xrecord entry given by entryName. More...
virtual Acad::ErrorStatus  | setField (const ACHAR *, AcDbField *, AcDbObjectId &)
Adds the pAcField field object to field dictionary of this AcDbObject object, using pKey as key. More...
virtual void  | setGsNode (AcGsNode *)
Gets the AcGsNode (graphics cache) for this entity. More...
void  | setHasSaveVersionOverride (bool)
This function can be called to specify that the object has a "save version override". More...
virtual Acad::ErrorStatus  | setOwnerId (AcDbObjectId)
Sets the ownerId data member of the object to be objId. More...
virtual Acad::ErrorStatus  | setXData (const resbuf *)
Sets/removes xData associated with this object. More...
virtual Acad::ErrorStatus  | subCancel ()
Possibility to veto a cancel operation from within custom entities. More...
virtual Acad::ErrorStatus  | subClose ()
virtual Acad::ErrorStatus  | subErase (Adesk::Boolean)
This hook is called during an AcDbObject::erase call, before any actual erase operation is performed. More...
 virtual Acad::ErrorStatus  | subHandOverTo (AcDbObject *)
virtual void  | subObjModified (const AcDbObject *, const AcDbObject *)
A handler function for persistent reactors. More...
 virtual Acad::ErrorStatus  | subOpen (AcDb::OpenMode)
virtual Acad::ErrorStatus  | subSwapIdWith (AcDbObjectId, Adesk::Boolean=Adesk::kFalse, Adesk::Boolean=Adesk::kFalse)
This hook is called during an AcDbObject::swapIdWith() call, before any actual swap operation is performed. More...
Acad::ErrorStatus  | swapIdWith (AcDbObjectId, Adesk::Boolean=Adesk::kFalse, Adesk::Boolean=Adesk::kFalse)
Swaps the object id's between the object identified by param swapId and this object. More...
virtual Acad::ErrorStatus  | swapReferences (const AcDbIdMapping &)
Not implemented yet. More...
virtual void  | unappended (const AcDbObject *)
A handler function for persistent reactors. More...
AcDbDwgFiler *  | undoFiler ()
Gets the undo filer for this object. More...
Acad::ErrorStatus  | upgradeFromNotify (Adesk::Boolean &)
Upgrades the open status of this object to AcDb::kForWrite, if this object is already open (either in AcDb::kForRead, AcDb::kForNotify or AcDb::kForWrite) More...
Acad::ErrorStatus  | upgradeOpen ()
Changes the objects open mode to AcDb::kForWrite and sends notifications. More...
virtual Acad::ErrorStatus  | wblockClone (AcRxObject *, AcDbObject *&, AcDbIdMapping &, Adesk::Boolean=Adesk::kTrue) const final
Clones this object, appends it to the owner pOwner and adds an AcDbIdPair record to the idMap. More...
virtual resbuf *  | xData (const ACHAR *=NULL) const
Returns the xData associated with this object. More...
Acad::ErrorStatus  | xDataTransformBy (const AcGeMatrix3d &)
Transforms the extended data according to parameter transformation matrix. More...
 virtual void  | xmitPropagateModify () const
Not implemented yet.
 virtual  | ~AcDbObject ()
Destructor.
 Public Member Functions inherited from AcGiDrawable
virtual bool  | bounds (AcDbExtents &) const
virtual DrawableType  | drawableType () const
 virtual AcGiDrawStream *  | drawStream () const
virtual AcGsNode *  | gsNode () const =0
virtual AcDbObjectId  | id () const =0
virtual Adesk::Boolean  | isPersistent () const =0
virtual Adesk::UInt32  | regenSupportFlags () const final
Returns whether and to which level this object supports MultiThreading. More...
 virtual Adesk::Boolean  | RolloverHit (Adesk::ULongPtr, Adesk::ULongPtr, Adesk::Boolean)
 virtual Adesk::UInt32  | setAttributes (AcGiDrawableTraits *) final
 virtual void  | setDrawStream (AcGiDrawStream *)
virtual void  | setGsNode (AcGsNode *)=0
 virtual void  | viewportDraw (AcGiViewportDraw *) final
 virtual Adesk::UInt32  | viewportDrawLogicalFlags (AcGiViewportDraw *) final
 virtual Adesk::Boolean  | worldDraw (AcGiWorldDraw *) final
 Public Member Functions inherited from AcRxObject
virtual AcRxObject *  | clone () const
Exported and implemented. More...
 virtual AcRx::Ordering  | comparedTo (const AcRxObject *) const
Exported and implemented.
virtual Acad::ErrorStatus  | copyFrom (const AcRxObject *)
Exported and implemented. More...
 virtual AcRxClass *  | isA () const
Exported and implemented.
virtual Adesk::Boolean  | isEqualTo (const AcRxObject *) const
Exported and implemented. More...
bool  | isKindOf (const AcRxClass *) const
Checks the object class. More...
AcRxObject *  | queryX (const AcRxClass *) const
returns the protocol extension object assigned to this class or a parent class. More...
AcRxObject *  | x (const AcRxClass *) const
returns the protocol extension object assigned to this class or a parent class. More...
 virtual  | ~AcRxObject ()
Destructor.
 Protected Member Functions
virtual Acad::ErrorStatus  | subExplode (AcDbVoidPtrArray &) const
virtual Acad::ErrorStatus  | subGetGeomExtents (AcDbExtents &) const
virtual Acad::ErrorStatus  | subGetGripPoints (AcGePoint3dArray &, AcDbIntArray &, AcDbIntArray &) const
virtual Acad::ErrorStatus  | subGetOsnapPoints (AcDb::OsnapMode, Adesk::GsMarker, const AcGePoint3d &, const AcGePoint3d &, const AcGeMatrix3d &, AcGePoint3dArray &, AcDbIntArray &) const
virtual Acad::ErrorStatus  | subGetStretchPoints (AcGePoint3dArray &) const
virtual Acad::ErrorStatus  | subGetTransformedCopy (const AcGeMatrix3d &, AcDbEntity *&) const
virtual void  | subList () const
virtual Acad::ErrorStatus  | subMoveGripPointsAt (const AcDbIntArray &, const AcGeVector3d &)
virtual Acad::ErrorStatus  | subMoveStretchPointsAt (const AcDbIntArray &, const AcGeVector3d &)
virtual Acad::ErrorStatus  | subTransformBy (const AcGeMatrix3d &)
virtual Adesk::Boolean  | subWorldDraw (AcGiWorldDraw *)
 Protected Member Functions inherited from AcDbBlockReference
virtual Acad::ErrorStatus  | subGetClassID (CLSID *) const
Gets the COM wrapper Class ID for this entity. More...
virtual Acad::ErrorStatus  | subGetGsMarkersAtSubentPath (const AcDbFullSubentPath &, AcArray< Adesk::GsMarker > &) const
getGsMarkersAtSubentPath. More...
virtual Acad::ErrorStatus  | subGetSubentPathsAtGsMarker (AcDb::SubentType, Adesk::GsMarker, const AcGePoint3d &, const AcGeMatrix3d &, int &, AcDbFullSubentPath *&, int=0, AcDbObjectId *=NULL) const
getSubentPathsAtGsMarker. More...
virtual Acad::ErrorStatus  | subGetTransformedCopy (const AcGeMatrix3d &, AcDbEntity *&) const
virtual void  | subGripStatus (const AcDb::GripStat)
gripStatus. More...
virtual Acad::ErrorStatus  | subHighlight (const AcDbFullSubentPath &=kNullSubent, const Adesk::Boolean=Adesk::kFalse) const
Highlights this insert or part of it. More...
virtual AcDbEntity *  | subSubentPtr (const AcDbFullSubentPath &) const
subentPtr. More...
virtual Acad::ErrorStatus  | subUnhighlight (const AcDbFullSubentPath &=kNullSubent, const Adesk::Boolean=Adesk::kFalse) const
Unhighlights this insert or part of it. More...
virtual Adesk::Boolean  | subWorldDraw (AcGiWorldDraw *)
Creates a viewport-independent graphical representation of the object. More...
 Protected Member Functions inherited from AcDbEntity
 virtual Acad::ErrorStatus  | subAddSubentPaths (const AcDbFullSubentPathArray &)
 virtual Adesk::Boolean  | subCloneMeForDragging ()
 virtual Acad::ErrorStatus  | subDeleteSubentPaths (const AcDbFullSubentPathArray &)
virtual Acad::ErrorStatus  | subExplode (AcDbVoidPtrArray &) const
 virtual Acad::ErrorStatus  | subGetCompoundObjectTransform (AcGeMatrix3d &) const
virtual Acad::ErrorStatus  | subGetGeomExtents (AcDbExtents &) const
virtual Acad::ErrorStatus  | subGetGripEntityUCS (const void *, AcGeVector3d &, AcGePoint3d &, AcGeVector3d &) const
virtual Acad::ErrorStatus  | subGetGripPoints (AcDbGripDataPtrArray &, const double, const int, const AcGeVector3d &, const int) const
virtual Acad::ErrorStatus  | subGetGripPoints (AcGePoint3dArray &, AcDbIntArray &, AcDbIntArray &) const
 virtual Acad::ErrorStatus  | subGetGripPointsAtSubentPath (const AcDbFullSubentPath &, AcDbGripDataPtrArray &, const double, const int, const AcGeVector3d &, const int) const
virtual Acad::ErrorStatus  | subGetGsMarkersAtSubentPath (const AcDbFullSubentPath &, AcArray< Adesk::GsMarker > &) const
virtual Acad::ErrorStatus  | subGetOsnapPoints (AcDb::OsnapMode, Adesk::GsMarker, const AcGePoint3d &, const AcGePoint3d &, const AcGeMatrix3d &, AcGePoint3dArray &, AcDbIntArray &) const
 virtual Acad::ErrorStatus  | subGetOsnapPoints (AcDb::OsnapMode, Adesk::GsMarker, const AcGePoint3d &, const AcGePoint3d &, const AcGeMatrix3d &, AcGePoint3dArray &, AcDbIntArray &, const AcGeMatrix3d &) const
virtual Acad::ErrorStatus  | subGetStretchPoints (AcGePoint3dArray &) const
 virtual Acad::ErrorStatus  | subGetSubentClassId (const AcDbFullSubentPath &, CLSID *) const
 virtual Acad::ErrorStatus  | subGetSubentPathGeomExtents (const AcDbFullSubentPath &, AcDbExtents &) const
virtual Acad::ErrorStatus  | subGetSubentPathsAtGsMarker (AcDb::SubentType, Adesk::GsMarker, const AcGePoint3d &, const AcGeMatrix3d &, int &, AcDbFullSubentPath *&, int=0, AcDbObjectId *=nullptr) const
virtual Acad::ErrorStatus  | subGetTransformedCopy (const AcGeMatrix3d &, AcDbEntity *&) const
virtual void  | subGripStatus (const AcDb::GripStat)
 virtual bool  | subHideMeForDragging () const
virtual Acad::ErrorStatus  | subHighlight (const AcDbFullSubentPath &=kNullSubent, const Adesk::Boolean=false) const
virtual Acad::ErrorStatus  | subIntersectWith (const AcDbEntity *, AcDb::Intersect, AcGePoint3dArray &, Adesk::GsMarker=0, Adesk::GsMarker=0) const
virtual Acad::ErrorStatus  | subIntersectWith (const AcDbEntity *, AcDb::Intersect, const AcGePlane &, AcGePoint3dArray &, Adesk::GsMarker=0, Adesk::GsMarker=0) const
virtual bool  | subIsContentSnappable () const
virtual void  | subList () const
virtual Acad::ErrorStatus  | subMoveGripPointsAt (const AcDbIntArray &, const AcGeVector3d &)
virtual Acad::ErrorStatus  | subMoveGripPointsAt (const AcDbVoidPtrArray &, const AcGeVector3d &, const int)
 virtual Acad::ErrorStatus  | subMoveGripPointsAtSubentPaths (const AcDbFullSubentPathArray &, const AcDbVoidPtrArray &, const AcGeVector3d &, const int)
virtual Acad::ErrorStatus  | subMoveStretchPointsAt (const AcDbIntArray &, const AcGeVector3d &)
virtual Adesk::UInt32  | subSetAttributes (AcGiDrawableTraits *)
Sets the values of this object's subentity traits and returns with the calling object's subentity traits. More...
virtual Acad::ErrorStatus  | subSetVisibility (AcDb::Visibility, Adesk::Boolean=true)
 virtual void  | subSubentGripStatus (const AcDb::GripStat, const AcDbFullSubentPath &)
virtual AcDbEntity *  | subSubentPtr (const AcDbFullSubentPath &) const
virtual Acad::ErrorStatus  | subTransformBy (const AcGeMatrix3d &)
 virtual Acad::ErrorStatus  | subTransformSubentPathsBy (const AcDbFullSubentPathArray &, const AcGeMatrix3d &)
virtual Acad::ErrorStatus  | subUnhighlight (const AcDbFullSubentPath &=kNullSubent, const Adesk::Boolean=false) const
virtual void  | subViewportDraw (AcGiViewportDraw *)
 virtual AcDb::Visibility  | subVisibility () const
virtual Adesk::Boolean  | subWorldDraw (AcGiWorldDraw *)
 Protected Member Functions inherited from AcDbObject
virtual Acad::ErrorStatus  | subDeepClone (AcDbObject *, AcDbObject *&, AcDbIdMapping &, Adesk::Boolean=true) const
virtual Acad::ErrorStatus  | subGetClassID (CLSID *) const
virtual Adesk::UInt32  | subSetAttributes (AcGiDrawableTraits *)
Sets the values of this object's subentity traits and returns with the calling object's subentity traits. More...
virtual void  | subViewportDraw (AcGiViewportDraw *)
virtual Adesk::UInt32  | subViewportDrawLogicalFlags (AcGiViewportDraw *)
virtual Acad::ErrorStatus  | subWblockClone (AcRxObject *, AcDbObject *&, AcDbIdMapping &, Adesk::Boolean=true) const
virtual Adesk::Boolean  | subWorldDraw (AcGiWorldDraw *)
 Protected Member Functions inherited from AcGiDrawable
virtual Adesk::UInt32  | subRegenSupportFlags () const
Returns whether and to which level this object supports MultiThreading. More...
virtual Adesk::UInt32  | subSetAttributes (AcGiDrawableTraits *)=0
virtual void  | subViewportDraw (AcGiViewportDraw *)=0
 virtual Adesk::UInt32  | subViewportDrawLogicalFlags (AcGiViewportDraw *)
virtual Adesk::Boolean  | subWorldDraw (AcGiWorldDraw *)=0
 Protected Member Functions inherited from AcRxObject
AcRxObject ()
Exported and implemented.
 Additional Inherited Members
 Static Public Member Functions inherited from AcRxObject
 static AcRxObject *  | cast (const AcRxObject *)
 static AcRxClass *  | desc ()
Exported and implemented.
 Static Public Member Functions inherited from AcHeapOperators
 static void  | operator delete (void *)
_
 static void  | operator delete (void *, const char *, int)
 static void  | operator delete (void *, void *)
 static void  | operator delete[] (void *)
_
 static void  | operator delete[] (void *, const char *, int)
 static void *  | operator new (size_t)
_
 static void *  | operator new (size_t, const char *, int)
 static void *  | operator new (size_t, void *p)
 static void *  | operator new[] (size_t)
_
 static void *  | operator new[] (size_t, const char *, int)
 Public Attributes inherited from AcDbBlockReference
AcDbBlockReference
Default constructor. More...
 Public Attributes inherited from AcDbEntity
AcDbEntity
This protected constructor sets the initial value for color to 257, and for the objectids for layer and linetype to AcDbObjectId::kNull. More...
Detailed Description
_
Member Function Documentation
◆ alignment() [1/2]
 UX_EXPORT_FUNCTION AcDb::CellAlignment AcDbTable::alignment  |  ( |  AcDb::RowType  |  rowType = AcDb::kDataRow | ) |   const
virtual
Returns the cell alignment for the specified row type in this table entity.
Parameters
[in] | rowType | row type
Returns
the cell alignment for the specified row type
◆ alignment() [2/2]
 UX_EXPORT_FUNCTION AcDb::CellAlignment AcDbTable::alignment  |  ( |  int  |  r,
|  int  |  c
) |   |  const
virtual
Returns the cell alignment for the specified cell in this table entity.
Parameters
[in] | r | row index of the cell
[in] | c | column index of the cell
Returns
the cell alignment for the specified cell
◆ attachmentPoint() [1/2]
 UX_EXPORT_FUNCTION AcGePoint3d AcDbTable::attachmentPoint  |  ( |  int  |  row,
|  int  |  column
) |   |  const
virtual
Returns the attachment point for the specified table cell.
Parameters
[in] | row | - row index
[in] | column | - column index
Returns
Acad::eOk or error status
◆ attachmentPoint() [2/2]
 UX_EXPORT_FUNCTION AcGePoint3d AcDbTable::attachmentPoint  |  ( |  int  |  row,
|  int  |  column,
|  int  |  contentIndex
) |   |  const
Returns the content attachment point for the specified table cell.
Parameters
[in] | row | - row index
[in] | column | - column index
[in] | index | - content index (0-based)
Returns
Acad::eOk or error status
◆ audit()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbTable::audit  |  ( |  AcDbAuditInfo *  |  info | )
virtual
See also
AcDbBlockReference::audit(AcDbAuditInfo*)
Reimplemented from AcDbEntity.
◆ backgroundColor() [1/2]
 UX_EXPORT_FUNCTION AcCmColor AcDbTable::backgroundColor  |  ( |  AcDb::RowType  |  rowType = AcDb::kDataRow | ) |   const
virtual
Returns background color of the specified rows.
Parameters
[in] | rowType | - one of AcDb::kDataRow, AcDb::kTitleRow, AcDb::kHeaderRow if not specified AcDb::kDataRow is used
Returns
Background color
◆ backgroundColor() [2/2]
 UX_EXPORT_FUNCTION AcCmColor AcDbTable::backgroundColor  |  ( |  int  |  row,
|  int  |  column
) |   |  const
virtual
Returns background color of the specified cell.
Parameters
[in] | row | row index of the cell
[in] | column | column index of the cell
Returns
Background color
◆ blockRotation()
 UX_EXPORT_FUNCTION double AcDbTable::blockRotation  |  ( |  int  |  row,
|  int  |  column
) |   |  const
virtual
this function will return angle rotation for block reference
Parameters
[in] | row | row index of the cell
[in] | column | column index of the cell @Returns rotation angle of the block reference
Date
2014-11-14 adrianp implemented
◆ blockScale()
 UX_EXPORT_FUNCTION double AcDbTable::blockScale  |  ( |  int  |  row,
|  int  |  column
) |   |  const
virtual
It returns scale factor.
Parameters
[in] | row | row index of the cell
[in] | column | column index of the cell @Returns scale factor
◆ blockTableRecordId()
 UX_EXPORT_FUNCTION AcDbObjectId AcDbTable::blockTableRecordId  |  ( |  int  |  r,
|  int  |  c
) |   |  const
virtual
Returns the block table record object id from the given row and column.
Parameters
[in] | r | row index
[in] | c | column index
Returns
the block table record object id
◆ breakHeight()
 UX_EXPORT_FUNCTION double AcDbTable::breakHeight  |  ( |  int  |  tableIndex | ) |   const
Returns the break height for the specified table (sub-)part.
Parameters
[in] | tableIndex | - index of the table part (should be >= 0)
Returns
true or false
◆ breakSpacing()
 UX_EXPORT_FUNCTION double AcDbTable::breakSpacing  |  ( |   | ) |   const
Returns the break gap/space when the 'table break' feature is enabled.
Returns
true or false
◆ castShadows()
 UX_EXPORT_FUNCTION bool AcDbTable::castShadows  |  ( |   | ) |   const
virtual
See AcDbBlockReference::castShadows() .
Returns
always false for this type
Reimplemented from AcDbEntity.
◆ cellState()
 UX_EXPORT_FUNCTION AcDb::CellState AcDbTable::cellState  |  ( |  int  |  row,
|  int  |  column
) |   |  const
Returns the cell state for the specified cell.
Parameters
[in] | row | the row index
[in] | column | the column index
Returns
AcDb::CellState
◆ cellStyle()
 UX_EXPORT_FUNCTION const ACHAR * AcDbTable::cellStyle  |  ( |  int  |  r,
|  int  |  c
) |   |  const
Returns the style for the specified cell in this table entity.
Parameters
[in] | r | cell's row index
[in] | c | cell's column index
Returns
cell style
◆ cellStyleOverrides()
 UX_EXPORT_FUNCTION bool AcDbTable::cellStyleOverrides  |  ( |  int  |  numRows,
|  int  |  numColumns,
|  AcDbIntArray &  |  overrideSettings
) |   |  const
virtual
Returns the overrides settings of a cell.
Parameters
[in] | numRows | row index of the cell
[in] | numColumns | column index of a cell
[out] | overrideSettings | cells override settings
Returns
true if succeded
◆ cellType()
 UX_EXPORT_FUNCTION AcDb::CellType AcDbTable::cellType  |  ( |  int  |  r,
|  int  |  c
) |   |  const
virtual
Returns the type of cell.
Parameters
[in] | r | row index of the cell
[in] | c | column index of the cell
Returns
AcDbTable::kTextCell or AcDbTable::kBlockCell
◆ clearCellOverrides()
 UX_EXPORT_FUNCTION void AcDbTable::clearCellOverrides  |  ( |  int  |  rows,
|  int  |  columns
)
Clears the overrides settings of a cell.
Parameters
[in] | rows | row index of the cell
[in] | columns | column index of a cell
Returns
true if succeded, false otherwise
◆ columnWidth()
 UX_EXPORT_FUNCTION double AcDbTable::columnWidth  |  ( |  int  |  c | ) |   const
virtual
Gets the width of the specified column from this table entity.
Parameters
[in] | c | column index
Returns
the width of the specified column
◆ contentColor() [1/2]
 UX_EXPORT_FUNCTION AcCmColor AcDbTable::contentColor  |  ( |  AcDb::RowType  |  rowType = AcDb::kDataRow | ) |   const
virtual
Returns color of the specified row type.
Parameters
[in] | rowType | column index of the cell
Returns
color
◆ contentColor() [2/2]
 UX_EXPORT_FUNCTION AcCmColor AcDbTable::contentColor  |  ( |  int  |  r,
|  int  |  c
) |   |  const
virtual
Returns color of the specified cell.
Parameters
[in] | row | row index of the cell
[in] | column | column index of the cell
Returns
color
◆ contentLayout()
 AcDb::CellContentLayout AcDbTable::contentLayout  |  ( |  int  |  row,
|  int  |  column
) |   |  const
Returns the cell content layout for the specified cell.
Parameters
[in] | row | the row index
[in] | column | the column index
Returns
AcDb::CellContentLayout
◆ copyFrom() [1/4]
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbTable::copyFrom  |  ( |  const AcDbLinkedTableData *  |  pLinkTableSrc,
|  AcDb::TableCopyOption  |  option
)
Copies another table content to this one.
Parameters
[in] | pLinkTableSrc | source table to be copied
[in] | option | table copy option
Returns
Acad::eOk, or error status
◆ copyFrom() [2/4]
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbTable::copyFrom  |  ( |  const AcDbLinkedTableData *  |  pLinkTableSrc,
|  AcDb::TableCopyOption  |  option,
|  const AcCellRange &  |  cellRangeSrc,
|  const AcCellRange &  |  targetCellRange,
|  AcCellRange *  |  pOutRange
)
Copies another table content to this one.
Parameters
[in] | pLinkTableSrc | source table to be copied
[in] | option | table copy option
[in] | cellRangeSrc | source table input range to copy
[in] | targetCellRange | target input range
[out] | pOutRange | output referecence of the target cell range
Returns
Acad::eOk, or error status
◆ copyFrom() [3/4]
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbTable::copyFrom  |  ( |  const AcDbTable *  |  pTableSrc,
|  AcDb::TableCopyOption  |  option,
|  const AcCellRange &  |  cellRangeSrc,
|  const AcCellRange &  |  targetCellRange,
|  AcCellRange *  |  pOutRange
)
Copies another table content to this one.
Parameters
[in] | pTableSrc | source table to be copied
[in] | option | table copy option
[in] | cellRangeSrc | source table input range to copy
[in] | targetCellRange | target input range
[out] | pTargetCellRange | output referecence of the target cell range
Returns
Acad::eOk, or error status
◆ copyFrom() [4/4]
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbTable::copyFrom  |  ( |  const AcRxObject *  |  source | )
virtual
Reimplemented from AcDbObject.
◆ createContent()
 UX_EXPORT_FUNCTION int AcDbTable::createContent  |  ( |  int  |  row,
|  int  |  column,
|  int  |  contentsIndex
)
Creates a new cell content for specified cell, using given content index.
Parameters
[in] | row | the row index
[in] | column | the column index
[in] | contentsIndex | the contents index (or -1, to add)
Returns
index of added content, or -1 if failed
◆ dataFormat() [1/2]
 UX_EXPORT_FUNCTION AcString AcDbTable::dataFormat  |  ( |  int  |  row,
|  int  |  column
) |   |  const
Returns the data format string for the first content of the specified table cell.
Parameters
[in] | row | - row index
[in] | column | - column index
Returns
applied format string
◆ dataFormat() [2/2]
 UX_EXPORT_FUNCTION AcString AcDbTable::dataFormat  |  ( |  int  |  row,
|  int  |  column,
|  int  |  contentIndex
) |   |  const
Returns the data format string for the given content of the specified table cell.
Parameters
[in] | row | - row index
[in] | column | - column index
[in] | contentIndex | - index of the content
Returns
applied format string
◆ deleteCellContent()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbTable::deleteCellContent  |  ( |  int  |  row,
|  int  |  column
)
virtual
Deletes content for that cell.
Parameters
[in] | row | row index of the cell
[in] | column | column index of the cell
Returns
Acad::eOk if successful, otherwise Acad::eInvalidInput.
◆ deleteColumns()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbTable::deleteColumns  |  ( |  int  |  index,
|  int  |  num = 1
)
virtual
Deletes some of this table's columns.
Parameters
[in] | index | value from which the columns are being deleted.
[in] | num | the number of columns to be deleted.
Returns
Acad::eOk if successful, otherwise Acad::eInvalidInput.
◆ deleteContent() [1/3]
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbTable::deleteContent  |  ( |  const AcCellRange &  |  range | )
Deletes all content from specified cell range.
Parameters
[in] | range | - the row index
Returns
Acad::eOk, or error status
◆ deleteContent() [2/3]
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbTable::deleteContent  |  ( |  int  |  row,
|  int  |  column
)
Deletes all content for the specified cell.
Parameters
[in] | row | the row index
[in] | column | the column index
Returns
Acad::eOk, or error status
◆ deleteContent() [3/3]
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbTable::deleteContent  |  ( |  int  |  row,
|  int  |  column,
|  int  |  contentIndex
)
Deletes the specified content for the specified cell.
Parameters
[in] | row | - the row index
[in] | column | - the column index
[in] | contentIndex | - the content index
Returns
Acad::eOk, or error status
◆ deleteRows()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbTable::deleteRows  |  ( |  int  |  index,
|  int  |  num = 1
)
virtual
Deletes a number of this table's rows.
Parameters
[in] | index | value from which the rows are being deleted.
[in] | num | the number of rows to be deleted.
Returns
Acad::eOk if successful, otherwise Acad::eInvalidInput.
◆ direction()
 UX_EXPORT_FUNCTION AcGeVector3d AcDbTable::direction  |  ( |   | ) |   const
virtual
Returns the horizontal direction of this table object.
Returns
horizontal direction vector
◆ dwgInFields()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbTable::dwgInFields  |  ( |  AcDbDwgFiler *  |  dwgFiler | )
virtual
See also
AcDbBlockReference::dwgInFields(AcDbDwgFiler*)
Reimplemented from AcDbEntity.
◆ dwgOutFields()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbTable::dwgOutFields  |  ( |  AcDbDwgFiler *  |  dwgFiler | ) |   const
virtual
See also
AcDbBlockReference::dwgOutFields(AcDbDwgFiler*)
Reimplemented from AcDbEntity.
◆ dxfInFields()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbTable::dxfInFields  |  ( |  AcDbDxfFiler *  |  dxfFiler | )
virtual
See also
AcDbBlockReference::dxfInFields(AcDbDxfFiler*)
Reimplemented from AcDbEntity.
◆ dxfOutFields()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbTable::dxfOutFields  |  ( |  AcDbDxfFiler *  |  dxfFiler | ) |   const
virtual
See also
AcDbBlockReference::dxfOutFields(AcDbDxfFiler*)
Reimplemented from AcDbEntity.
◆ enableBreak()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbTable::enableBreak  |  ( |  bool  |  enabled | )
Defines whether the 'table break' feature is enabled or disabled for this table.
Parameters
[in] | enabled | - true or false
Returns
Acad::eOk, or error status
◆ erased()
 UX_EXPORT_FUNCTION void AcDbTable::erased  |  ( |  const AcDbObject *  |  erasedObj,
|  Adesk::Boolean  |  bIsErased = Adesk::kTrue
)
virtual
See also
AcDbBlockReference::erased(const AcDbObject*, Adesk::Boolean)
Date
2008-12-06 laurentiuv implemented
Reimplemented from AcDbObject.
◆ fieldId()
 UX_EXPORT_FUNCTION AcDbObjectId AcDbTable::fieldId  |  ( |  int  |  r,
|  int  |  c
) |   |  const
virtual
Returns the object id of the tspecified cell.
Returns
the object id of the cell
◆ flowDirection()
 UX_EXPORT_FUNCTION AcDb::FlowDirection AcDbTable::flowDirection  |  ( |   | ) |   const
virtual
Gets the flow direction (Top to bottom or bottom to top)
Returns
flow direction
◆ format()
 UX_EXPORT_FUNCTION const ACHAR * AcDbTable::format  |  ( |  int  |  r,
|  int  |  c
) |   |  const
Parameters
[in] | r | index for the cell specifying the zero-based row
[in] | c | index for the cell specifying the zero-based column
Returns
Acad::eOk, if successful, appropriate Error Status otherwise
◆ generateLayout()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbTable::generateLayout  |  ( |   | )
virtual
Updates this table entity taking into account the current table style.
Returns
Acad::eOk, if successful, error code otherwise
◆ getBlockAttributeValue()
 Acad::ErrorStatus AcDbTable::getBlockAttributeValue  |  ( |  int  |  row,
|  int  |  column,
|  const AcDbObjectId &  |  attId,
|  ACHAR *&  |  value
) |   |  const
virtual
Sets the attribute value for the block at the cell specified with row and column, if the content for this cell is a block.
Parameters
[in] | row | row index of the cell
[in] | column | column index of the cell
[in] | attId | Object id of the attribute definition
[out] | value | (overwritten) value of the attribute definition. Caller has to free.
Returns
Acad::eOk, if successful, appropriate Error Status otherwise
◆ getCellExtents()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbTable::getCellExtents  |  ( |  int  |  row,
|  int  |  column,
|  bool  |  outerCellSize,
|  AcGePoint3dArray &  |  points
) |   |  const
virtual
Returns the extents points for the specified table cell.
Parameters
[in] | row | - row index; if negative, all rows are used
[in] | column | - column index; if negative, all columns are used
[in] | outerCellSize | - if true, the cell margins are included, otherwise margins are excluded
[out] | points | - the extents points
Returns
Acad::eOk or error status
◆ getColumnName()
 UX_EXPORT_FUNCTION const ACHAR * AcDbTable::getColumnName  |  ( |  int  |  column | ) |   const
Returns the column name for the specified column.
Parameters
[in] | column | index (or -1 for row only)
Returns
column name
◆ getCustomData() [1/2]
 UX_EXPORT_FUNCTION int AcDbTable::getCustomData  |  ( |  int  |  row,
|  int  |  col
) |   |  const
Gets custom data to row, or column, or cell.
Parameters
[in] | row | index for the cell specifying the zero-based row, or -1 for column
[in] | col | index for the cell specifying the zero-based column, or -1 for row
Returns
custom data in row or column or cell, as specified
◆ getCustomData() [2/2]
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbTable::getCustomData  |  ( |  int  |  row,
|  int  |  col,
|  const ACHAR *  |  key,
|  AcValue *  |  data
) |   |  const
Gets custom data to row, or column, or cell.
Parameters
[in] | row | index for the cell specifying the zero-based row, or -1 for column
[in] | col | index for the cell specifying the zero-based column, or -1 for row
[in] | key | specifies the key for the data to be retrieved
[in] | data | receives the custom data
Returns
Acad::eOk for success, or error status otherwise
◆ getDataLink() [1/3]
 UX_EXPORT_FUNCTION int AcDbTable::getDataLink  |  ( |  const AcCellRange *  |  pRangePtr,
|  AcDbObjectIdArray &  |  idsDataLink
) |   |  const
Get a data link.
Parameters
[in] | pRangePtr | - data link pointer range
[out] | idsDataLink | - data link collection
Returns
count of returned data links
◆ getDataLink() [2/3]
 UX_EXPORT_FUNCTION AcDbObjectId AcDbTable::getDataLink  |  ( |  int  |  row,
|  int  |  column
) |   |  const
Get a data link of a specific cell.
Parameters
[in] | row | - row index
[in] | column | - column index
Returns
object id of the data link.
◆ getDataLink() [3/3]
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbTable::getDataLink  |  ( |  int  |  row,
|  int  |  column,
|  AcDbDataLink *&  |  pDataLinkPtr,
|  AcDb::OpenMode  |  openMode
) |   |  const
Get a data link.
Parameters
[in] | row | - row index
[in] | column | - column index
[out] | pDataLinkPtr | - pointer to the open data link
[in] | openMode | - value format options
Returns
Acad::eOk, or error status
◆ getDataLinkRange()
 UX_EXPORT_FUNCTION AcCellRange AcDbTable::getDataLinkRange  |  ( |  int  |  row,
|  int  |  column
) |   |  const
Returns data linked cell range.
Parameters
[in] | row | - row index
[in] | column | - column index
Returns
AcCellRange if succeded, invalid range otherwise
◆ getDataType() [1/3]
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbTable::getDataType  |  ( |  AcValue::DataType &  |  dataType,
|  AcValue::UnitType &  |  unitType,
|  AcDb::RowType  |  rowType
) |   |  const
virtual
Returns the data type and unit type for the specified row type.
Parameters
[out] | dataType | - returns the data type
[out] | unitType | - returns the data unit
[in] | rowType | - row type
Returns
Acad::eOk or error status
◆ getDataType() [2/3]
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbTable::getDataType  |  ( |  int  |  row,
|  int  |  column,
|  AcValue::DataType &  |  dataType,
|  AcValue::UnitType &  |  unitType
) |   |  const
Returns the data type and unit type for the first content of the specified table cell.
Parameters
[in] | row | - row index
[in] | column | - column index
[out] | dataType | - returns the data type
[out] | unitType | - returns the data unit
Returns
Acad::eOk or error status
◆ getDataType() [3/3]
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbTable::getDataType  |  ( |  int  |  row,
|  int  |  column,
|  int  |  contentIndex,
|  AcValue::DataType &  |  dataType,
|  AcValue::UnitType &  |  unitType
) |   |  const
Returns the data type and unit type for the specified content of the specified table cell.
Parameters
[in] | row | - row index
[in] | column | - column index
[in] | contentIndex | - index of the content to retrieve type and unit for
[out] | dataType | - returns the data type
[out] | unitType | - returns the data unit
Returns
Acad::eOk or error status
◆ getIndicatorSize()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbTable::getIndicatorSize  |  ( |  double &  |  dWidth,
|  double &  |  dHeight
) |   |  const
Gets the row and column indicator size.
Parameters
[out] | dWidth | width of the row indicator
[out] | dHeight | height of the column indicator
Returns
Acad::eOk, or error status
◆ getMergeRange()
 UX_EXPORT_FUNCTION AcCellRange AcDbTable::getMergeRange  |  ( |  int  |  row,
|  int  |  column
) |   |  const
The merging range is returned when you call this function.
Invalid otherwise.
Parameters
[in] | row | the row index
[in] | column | the column index
Returns
index of added content, or -1 if failed
◆ getOverride() [1/2]
 UX_EXPORT_FUNCTION AcDb::GridProperty AcDbTable::getOverride  |  ( |  int  |  row,
|  int  |  column,
|  AcDb::GridLineType  |  gridTypeProperty
) |   |  const
Returns the grid property override setting.
Parameters
[in] | row | row index of the cell
[in] | column | column index of a cell
[in] | gridTypeProperty | AcDb::GridLineType property
Returns
AcDb::GridProperty if succeded, AcDb::kGridPropInvalid otherwise
◆ getOverride() [2/2]
 UX_EXPORT_FUNCTION AcDb::CellProperty AcDbTable::getOverride  |  ( |  int  |  row,
|  int  |  column,
|  int  |  index
) |   |  const
Returns the cell property override setting.
Parameters
[in] | row | row index of the cell
[in] | column | column index of a cell
[in] | index | the index content of the hit cell
Returns
AcDb::CellProperty if succeded, AcDb::kCellPropInvalid otherwise
◆ getSubSelection() [1/2]
 UX_EXPORT_FUNCTION AcCellRange AcDbTable::getSubSelection  |  ( |   | ) |   const
Returns the currently selected cell range.
Returns
AcCellRange - the selected AcCellRange
◆ getSubSelection() [2/2]
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbTable::getSubSelection  |  ( |  int &  |  rowMin,
|  int &  |  rowMax,
|  int &  |  colMin,
|  int &  |  colMax
) |   |  const
virtual
It gets the indexes of the row and column for the cells in the sub selection set.
Parameters
[out] | It | outputs zero based bottom limit of row index
[out] | It | outputs zero based top limit of row index
[out] | It | outputs zero based bottom limit of column index
[out] | It | outputs zero based top limit of column index @If successful it returns Acad::eOk, otherwise it returns Acad::eSubSelectionSetEmpty.
◆ gridColor() [1/3]
 UX_EXPORT_FUNCTION AcCmColor AcDbTable::gridColor  |  ( |  AcDb::GridLineType  |  border,
|  AcDb::RowType  |  r = AcDb::kDataRow
) |   |  const
virtual
Get the grid color of the specified grid line and row type.
Parameters
[in] | border | types of line
[in] | r | row type
Returns
grid color
◆ gridColor() [2/3]
 UX_EXPORT_FUNCTION AcCmColor AcDbTable::gridColor  |  ( |  int  |  r,
|  int  |  c,
|  AcDb::CellEdgeMask  |  cellEdge
) |   |  const
virtual
Get the grid color of the specified cell edge.
Parameters
[in] | row | row index of the cell
[in] | column | column index of the cell
[in] | cellEdge | The index for the cell
Returns
grid color
◆ gridColor() [3/3]
 UX_EXPORT_FUNCTION AcCmColor AcDbTable::gridColor  |  ( |  int  |  row,
|  int  |  column,
|  AcDb::GridLineType  |  border
) |   |  const
Get the grid color of the specified cell.
Parameters
[in] | row | row index of the cell
[in] | column | column index of the cell
[in] | border | types of line
Returns
grid color
◆ gridLineWeight() [1/3]
 UX_EXPORT_FUNCTION AcDb::LineWeight AcDbTable::gridLineWeight  |  ( |  AcDb::GridLineType  |  border,
|  AcDb::RowType  |  rowType = AcDb::kDataRow
) |   |  const
virtual
Parameters
[in] | border | types of line
[in] | rowType | - one of AcDb::kDataRow, AcDb::kTitleRow, AcDb::kHeaderRow
Returns
The grid lineweight for a specified row type and gridline
◆ gridLineWeight() [2/3]
 UX_EXPORT_FUNCTION AcDb::LineWeight AcDbTable::gridLineWeight  |  ( |  int  |  r,
|  int  |  c,
|  AcDb::CellEdgeMask  |  cellEdge
) |   |  const
virtual
Parameters
[in] | r | row index
[in] | c | column index
[in] | cellEdge | The index for the cell
Returns
The grid lineweight of the specified edge of the cell is returned by this function
◆ gridLineWeight() [3/3]
 UX_EXPORT_FUNCTION AcDb::LineWeight AcDbTable::gridLineWeight  |  ( |  int  |  r,
|  int  |  c,
|  AcDb::GridLineType  |  border
)
Parameters
[in] | r | row index
[in] | c | column index
[in] | border | The index for the cell
Returns
The grid lineweight of the specified cell row or column is returned by this function
◆ gridVisibility() [1/3]
 UX_EXPORT_FUNCTION AcDb::Visibility AcDbTable::gridVisibility  |  ( |  AcDb::GridLineType  |  border,
|  AcDb::RowType  |  rowType = AcDb::kDataRow
) |   |  const
virtual
Returns the grid visibility for the specified table cell.
Parameters
[in] | border | types of line
[in] | rowType | row type
Returns
It is visible or not for the specified cell
◆ gridVisibility() [2/3]
 UX_EXPORT_FUNCTION AcDb::Visibility AcDbTable::gridVisibility  |  ( |  int  |  r,
|  int  |  c,
|  AcDb::CellEdgeMask  |  cellEdge
) |   |  const
virtual
Returns the grid visibility for the specified table cell.
Parameters
[in] | r | row index
[in] | c | column index
Returns
Is it visible or not for the specified cell
◆ gridVisibility() [3/3]
 UX_EXPORT_FUNCTION AcDb::Visibility AcDbTable::gridVisibility  |  ( |  int  |  r,
|  int  |  c,
|  AcDb::GridLineType  |  border
) |   |  const
Returns the grid visibility for the specified table cell.
Parameters
[in] | r | row index
[in] | c | column index
[in] | border | types of line
Returns
Is it visible or not for the specified cell
◆ hasSubSelection()
 UX_EXPORT_FUNCTION bool AcDbTable::hasSubSelection  |  ( |   | ) |   const
virtual
If the Table has a sub selection set it returns TRUE.
@ If the Table does not have a sub selection set it returns FALSE
◆ height()
 UX_EXPORT_FUNCTION double AcDbTable::height  |  ( |   | ) |   const
virtual
Returns the height of the table.
Returns
height value.
◆ hitTest() [1/2]
 UX_EXPORT_FUNCTION bool AcDbTable::hitTest  |  ( |  const AcGePoint3d &  |  point,
|  const AcGeVector3d &  |  direction,
|  double  |  width,
|  double  |  height,
|  int &  |  row,
|  int &  |  col
)
virtual
The function tests if a ray created by point and direction hits the table and sets the cell hit in row and col.
Parameters
[in] | point | a point on the ray
[in] | direction | the rays direction
[in] | width | the aperture width used for the ray to test if it hits the table
[in] | height | the aperture height used for the ray to test if it hits the table
[out] | row | the row of the hit cell, 0 otherwise
[out] | col | the column of the hit cell, 0 otherwise
Returns
true if the ray hits the table, false otherwise
◆ hitTest() [2/2]
 UX_EXPORT_FUNCTION bool AcDbTable::hitTest  |  ( |  const AcGePoint3d &  |  point,
|  const AcGeVector3d &  |  direction,
|  double  |  width,
|  double  |  height,
|  int &  |  row,
|  int &  |  col,
|  int &  |  index,
|  AcDb::TableHitItem &  |  hitItem
)
The function tests if a ray created by point and direction hits the table and sets the cell hit in row and col.
Parameters
[in] | point | a point on the ray
[in] | direction | the rays direction
[in] | width | the aperture width used for the ray to test if it hits the table
[in] | height | the aperture height used for the ray to test if it hits the table
[out] | row | the row of the hit cell, 0 otherwise
[out] | col | the column of the hit cell, 0 otherwise
[out] | index | the index content of the hit cell, 0 otherwise
Returns
true if the ray hits the table, false otherwise
◆ horzCellMargin()
 UX_EXPORT_FUNCTION double AcDbTable::horzCellMargin  |  ( |   | ) |   const
virtual
Returns the horizontal cell margin.
Returns
horizontal cell margin value.
◆ insertColumns()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbTable::insertColumns  |  ( |  int  |  c,
|  double  |  w,
|  int  |  numCol = 1
)
virtual
Inserts new columns into this table entity at the specified column index.
Parameters
[in] | c | column index
[in] | w | width of the inserted columns
[in] | numCol | number of columns to insert
Returns
Acad::eOk, if successful, error code otherwise
◆ insertColumnsAndInherit()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbTable::insertColumnsAndInherit  |  ( |  int  |  atColumn,
|  int  |  fromColumn,
|  int  |  numColumns
)
Inserts new table columns at specified index, inheriting column parameters from specified column.
Parameters
[in] | atColumn | - column index where to insert the new rows
[in] | fromColumn | - column index to inherit the column parameters from
[in] | numColumns | - number of columns to be inserted
Returns
Acad::eOk or error status
◆ insertRows()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbTable::insertRows  |  ( |  int  |  r,
|  double  |  h,
|  int  |  numRows = 1
)
virtual
Inserts a number of rows into this table entity at the specified row index.
Parameters
[in] | r | row index
[in] | h | height of the inserted rows
[in] | numRows | number of rows to insert
Returns
Acad::eOk, if successful, error code otherwise
◆ insertRowsAndInherit()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbTable::insertRowsAndInherit  |  ( |  int  |  atRow,
|  int  |  fromRow,
|  int  |  numRaws
)
Inserts new table rows at specified index, inheriting row parameters from specified row.
Parameters
[in] | atRow | - row index where to insert the new rows
[in] | fromRow | - row index to inherit the row parameters from
[in] | numRaws | - number of rows to be inserted
Returns
Acad::eOk or error status
◆ isAutoScale() [1/2]
 UX_EXPORT_FUNCTION bool AcDbTable::isAutoScale  |  ( |  int  |  row,
|  int  |  column
) |   |  const
virtual
Returns whether the block content for the specified cell will be automatically scaled.
Parameters
[in] | row | the row index
[in] | column | the column index
Returns
true/false
◆ isAutoScale() [2/2]
 UX_EXPORT_FUNCTION bool AcDbTable::isAutoScale  |  ( |  int  |  row,
|  int  |  column,
|  int  |  contentIndex
) |   |  const
Returns whether the block content at given contents index for the specified cell will be automatically scaled.
Parameters
[in] | row | the row index
[in] | column | the column index
[in] | contentIndex | the contents index
Returns
true/false
◆ isBackgroundColorNone() [1/2]
 UX_EXPORT_FUNCTION bool AcDbTable::isBackgroundColorNone  |  ( |  AcDb::RowType  |  rowType = AcDb::kDataRow | ) |   const
virtual
Returns whether the background color of the specified rows is disabled.
Parameters
[in] | rowType | - one of AcDb::kDataRow, AcDb::kTitleRow, AcDb::kHeaderRow if not specified AcDb::kDataRow is used
Returns
true, if no background color, false otherwise
◆ isBackgroundColorNone() [2/2]
 UX_EXPORT_FUNCTION bool AcDbTable::isBackgroundColorNone  |  ( |  int  |  row,
|  int  |  column
) |   |  const
virtual
Returns whether background color of the specified cell is disabled.
Parameters
[in] | row | row index of the cell
[in] | column | column index of the cell if not specified background is set to whole table
Returns
true, if no background color, false otherwise
◆ isBreakEnabled()
 UX_EXPORT_FUNCTION bool AcDbTable::isBreakEnabled  |  ( |   | ) |   const
Returns whether the 'table break' feature is enabled or disabled for this table.
Returns
true or false
◆ isContentEditable()
 UX_EXPORT_FUNCTION bool AcDbTable::isContentEditable  |  ( |  int  |  row,
|  int  |  column
) |   |  const
Checks if the cell content can be modified.
Parameters
[in] | row | the row index
[in] | column | the column index
Returns
index of added content, or -1 if failed
◆ isHeaderSuppressed()
 UX_EXPORT_FUNCTION bool AcDbTable::isHeaderSuppressed  |  ( |   | ) |   const
virtual
Returns the status of the header row, true if header row is suppressed, @ or false otherwise.
Returns
true if header row is suppressed, false otherwise
◆ isLinked()
 UX_EXPORT_FUNCTION bool AcDbTable::isLinked  |  ( |  int  |  row,
|  int  |  column
) |   |  const
Checks if the cell has data link.
Parameters
[in] | row | the row index
[in] | column | the column index
Returns
true if succeded, false otherwise
◆ isMergedCell()
 bool AcDbTable::isMergedCell  |  ( |  int  |  row,
|  int  |  col,
|  int *  |  minimumRow = NULL,
|  int *  |  maximumRow = NULL,
|  int *  |  minimumCol = NULL,
|  int *  |  maximumCol = NULL
) |   |  const
virtual
Unmerges the cells delimited by the parameters in the argument list.It returns the range of the merged cells too with :
Parameters
[out] | minRow | row index
[out] | maxRow | row index
[out] | minCol | col index
[out] | maxCol | col index
◆ isRegenerateTableSuppressed()
 UX_EXPORT_FUNCTION bool AcDbTable::isRegenerateTableSuppressed  |  ( |   | ) |   const
Sets this AcDbTable instance to disable automatic regeneration.
Returns
true/false, indicating whether this tableuses automatic regeneration or not
◆ isTitleSuppressed()
 UX_EXPORT_FUNCTION bool AcDbTable::isTitleSuppressed  |  ( |   | ) |   const
virtual
Returns true if the title row is suppressed.
Returns
true if the title row is suppressed.
◆ margin()
 UX_EXPORT_FUNCTION double AcDbTable::margin  |  ( |  int  |  row,
|  int  |  column,
|  AcDb::CellMargin  |  marginType
) |   |  const
Returns the cell margin for specified row, or column, or cell.
Parameters
[in] | row | index (or -1 for column only)
[in] | column | index (or -1 for row only)
[in] | marginType | specifies the particular margin
Returns
double margin
◆ mergeCells()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbTable::mergeCells  |  ( |  int  |  minRow,
|  int  |  maxRow,
|  int  |  minCol,
|  int  |  maxCol
)
virtual
Merges the cells delimited by the cells in the argument list.
Keeps the value found in .* the left-uppermost cell
Parameters
[in] | minRow | row index
[in] | maxRow | row index
[in] | minCol | col index
[in] | maxCol | col index
Returns
Acad::eOk, if successful, error code otherwise
◆ minimumColumnWidth()
 UX_EXPORT_FUNCTION double AcDbTable::minimumColumnWidth  |  ( |  int  |  col | ) |   const
virtual
It will return for a specified index in the table minimum column.
Returns
minimum column for a specified index.
◆ minimumRowHeight()
 UX_EXPORT_FUNCTION double AcDbTable::minimumRowHeight  |  ( |  int  |  row | ) |   const
virtual
It will return for a specified index in the table minimum row.
Returns
minimum row for a specified index.
◆ minimumTableHeight()
 UX_EXPORT_FUNCTION double AcDbTable::minimumTableHeight  |  ( |   | ) |   const
virtual
Returns minimum total height.
Returns
minimum total height.
◆ minimumTableWidth()
 UX_EXPORT_FUNCTION double AcDbTable::minimumTableWidth  |  ( |   | ) |   const
virtual
Returns minimum total width.
Returns
minimum total width.
◆ numColumns()
 UX_EXPORT_FUNCTION Adesk::UInt32 AcDbTable::numColumns  |  ( |   | ) |   const
virtual
Returns the number of colums for this table object.
Returns
the number of columns
◆ numContents()
 UX_EXPORT_FUNCTION int AcDbTable::numContents  |  ( |  int  |  row,
|  int  |  column
) |   |  const
Return the number of contents for the specified cell.
Parameters
[in] | row | the row index
[in] | column | the column index
Returns
Acad::eOk, or error status
◆ numRows()
 UX_EXPORT_FUNCTION Adesk::UInt32 AcDbTable::numRows  |  ( |   | ) |   const
virtual
Returns the number of rows for this table object.
Returns
the number of rows
◆ objectClosed()
 UX_EXPORT_FUNCTION void AcDbTable::objectClosed  |  ( |  const AcDbObjectId  |  id | )
virtual
See also
AcDbBlockReference::objectClosed(const AcDbObjectId)
Reimplemented from AcDbObject.
◆ receiveShadows()
 UX_EXPORT_FUNCTION bool AcDbTable::receiveShadows  |  ( |   | ) |   const
virtual
See AcDbBlockReference::receiveShadows() .
Returns
always false for this type
Reimplemented from AcDbEntity.
◆ recomputeTableBlock()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbTable::recomputeTableBlock  |  ( |  bool  |  update = true | )
virtual
Updates the block table record referenced by this table entity.If update is false, the block table record is updated if and only if this table entity has been changed since the block table record was last updated.If update is true, the block table will be unconditionally updated.
Parameters
[in] | update | force an update of block table record.
Returns
Acad::eOk, if successful, error code otherwise
◆ removeAllOverrides()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbTable::removeAllOverrides  |  ( |  int  |  row,
|  int  |  column
)
Clears all override settings.
Parameters
[in] | row | row index of the cell, -1 for colummns
[in] | column | column index of a cell, -1 for rows.
Returns
Acad::eOk for success, or error status otherwise
◆ removeDataLink() [1/2]
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbTable::removeDataLink  |  ( |   | )
Remove table data link.
Returns
Acad::eOk, or error status
◆ removeDataLink() [2/2]
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbTable::removeDataLink  |  ( |  int  |  row,
|  int  |  col
)
Remove table data link.
Parameters
[in] | row | index for the cell specifying the zero-based row, or -1 for column
[in] | col | index for the cell specifying the zero-based column, or -1 for row
Returns
Acad::eOk, or error status
◆ resetValue()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbTable::resetValue  |  ( |  int  |  row,
|  int  |  column
)
Resets the cell content for the specified cell.
Parameters
[in] | row | the row index
[in] | column | the column index
Returns
Acad::eOk, or error status
◆ rotation() [1/2]
 UX_EXPORT_FUNCTION double AcDbTable::rotation  |  ( |   | ) |   const
Gets the rotation angle of the table.
Returns
rotation angle
◆ rotation() [2/2]
 UX_EXPORT_FUNCTION double AcDbTable::rotation  |  ( |  int  |  row,
|  int  |  column,
|  int  |  content
) |   |  const
Gets the rotation angle of the cell content.
Parameters
[in] | row | row index
[in] | column | column index
[in] | content | content index
Returns
rotation angle
◆ rowHeight()
 UX_EXPORT_FUNCTION double AcDbTable::rowHeight  |  ( |  int  |  r | ) |   const
virtual
Gets the height of the specified row from this table entity.
Parameters
[in] | r | row index
Returns
the height of the specified row
◆ rowType()
 UX_EXPORT_FUNCTION AcDb::RowType AcDbTable::rowType  |  ( |  int  |  index | ) |   const
virtual
Returns the row type for the row with index index.
Parameters
[in] | index | row index
Returns
the row type, possible values: AcDb::kTitleRow, AcDb::kHeaderRow, or AcDb::kDataRow.
◆ setAlignment() [1/2]
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbTable::setAlignment  |  ( |  AcDb::CellAlignment  |  alignment,
|  int  |  rowTypes = AcDb::kAllRows
)
virtual
Sets the cell alignment for the specified row types in this table entity.
Parameters
[in] | alignment | alignment
[in] | rowTypes | row types
Returns
Acad::eOk, if successful, error code otherwise
◆ setAlignment() [2/2]
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbTable::setAlignment  |  ( |  int  |  r,
|  int  |  c,
|  AcDb::CellAlignment  |  alignment
)
virtual
Sets the cell alignment for the specified cell in this table entity.
Parameters
[in] | r | row index of the cell
[in] | c | column index of the cell
[in] | alignment | alignment
Returns
Acad::eOk, if successful, error code otherwise
◆ setAutoScale() [1/2]
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbTable::setAutoScale  |  ( |  int  |  row,
|  int  |  column,
|  bool  |  autoScaled
)
virtual
Declares the block content for the specified cell to be automatically scaled.
Parameters
[in] | row | the row index
[in] | column | the column index
[in] | autoScaled | true/false
Returns
Acad::eOk, or error status
◆ setAutoScale() [2/2]
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbTable::setAutoScale  |  ( |  int  |  row,
|  int  |  column,
|  int  |  contentIndex,
|  bool  |  autoScaled
)
Declares the block content at given contents index for the specified cell to be automatically scaled.
Parameters
[in] | row | the row index
[in] | column | the column index
[in] | contentIndex | the contents index
[in] | autoScaled | true/false
Returns
Acad::eOk, or error status
◆ setBackgroundColor() [1/2]
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbTable::setBackgroundColor  |  ( |  const AcCmColor &  |  c,
|  int  |  rowType = AcDb::kAllRows
)
virtual
Sets background color of the specified rows.
Parameters
[in] | c | Color to set
[in] | rowType | - one of AcDb::kDataRow, AcDb::kTitleRow, AcDb::kHeaderRow if not specified background is set to whole table
Returns
Acad::eOk, if successful, Acad::eInvalidInput otherwise
◆ setBackgroundColor() [2/2]
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbTable::setBackgroundColor  |  ( |  int  |  row,
|  int  |  column,
|  const AcCmColor &  |  c
)
virtual
Sets background color of the specified cell.
Parameters
[in] | row | row index of the cell
[in] | column | column index of the cell
[in] | c | Color to set
Returns
Acad::eOk, if successful, Acad::eInvalidInput otherwise
◆ setBackgroundColorNone() [1/2]
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbTable::setBackgroundColorNone  |  ( |  bool  |  noBgColor,
|  int  |  rowtype = AcDb::kAllRows
)
virtual
Enables/disables background color of the specified rows.
Parameters
[in] | noBgColor | disable/enable background color
[in] | rowType | - one of AcDb::kDataRow, AcDb::kTitleRow, AcDb::kHeaderRow if not specified background is set to whole table
Returns
Acad::eOk, if successful, Acad::eInvalidInput otherwise
◆ setBackgroundColorNone() [2/2]
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbTable::setBackgroundColorNone  |  ( |  int  |  row,
|  int  |  column,
|  bool  |  noBgColor
)
virtual
Enables/disables background color of the specified cell.
Parameters
[in] | row | row index of the cell
[in] | column | column index of the cell
[in] | noBgColor | disable/enable background color
Returns
Acad::eOk, if successful, Acad::eInvalidInput otherwise
◆ setBlockAttributeValue()
 Acad::ErrorStatus AcDbTable::setBlockAttributeValue  |  ( |  int  |  row,
|  int  |  column,
|  const AcDbObjectId &  |  attId,
|  const ACHAR *  |  value
)
virtual
Sets the attribute value for the attribute defininition attId and for the block at the cell specified with row and column, if the content for this cell is a block.
Parameters
[in] | row | row index of the cell
[in] | column | column index of the cell
[in] | attId | Object id of the attribute definition
[in] | value | to set
Returns
Acad::eOk, if successful, appropriate Error Status otherwise
◆ setBlockRotation()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbTable::setBlockRotation  |  ( |  int  |  row,
|  int  |  column,
|  double  |  rotationAngle
)
virtual
The rotation angle of the block reference is set by this function.
Parameters
[in] | row | row index of the cell
[in] | column | column index of the cell
[in] | rotationAngle | rotation angle
Returns
Acad::eOk, if successful, appropriate Error Status otherwise
◆ setBlockScale()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbTable::setBlockScale  |  ( |  int  |  row,
|  int  |  column,
|  double  |  blockScale
)
virtual
The rotation angle of the block reference is set by this function.
Parameters
[in] | row | row index of the cell
[in] | column | column index of the cell
[in] | blockScale | scale for block
Returns
Acad::eOk, if successful, appropriate Error Status otherwise
◆ setBlockTableRecordId() [1/2]
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbTable::setBlockTableRecordId  |  ( |  int  |  r,
|  int  |  c,
|  const AcDbObjectId &  |  id,
|  bool  |  fit = false
)
virtual
Sets the block table record object id at the given row and column.
Parameters
[in] | r | row index
[in] | c | column index
[in] | id | object id of the block table record object
[in] | fit | chooses if the block table record will be automatically fit in the cell
Returns
Acad::eOk if successful, Acad::eInvalidInput otherwise
◆ setBlockTableRecordId() [2/2]
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbTable::setBlockTableRecordId  |  ( |  int  |  r,
|  int  |  c,
|  int  |  idx,
|  const AcDbObjectId &  |  id,
|  bool  |  fit
)
Sets the block table record id at given contents index for the given row and column.
Parameters
[in] | r | row index
[in] | c | column index
[in] | idx | contents index
[in] | id | object id of the block table record object
[in] | fit | chooses if the block table record will be automatically fit in the cell
Returns
Acad::eOk if successful, Acad::eInvalidInput otherwise
◆ setBreakHeight()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbTable::setBreakHeight  |  ( |  int  |  tableIndex,
|  double  |  tableHeight
)
Defines the break height for the specified table (sub-)part.
Parameters
[in] | tableIndex | - index of the table part (should be >= 0)
[in] | tableHeight | - the break height for the specified table part
Returns
true or false
◆ setBreakSpacing()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbTable::setBreakSpacing  |  ( |  double  |  spacing | )
Defines the 'break space' for the 'table break' feature for this table.
Parameters
[in] | enabled | - true or false
Returns
Acad::eOk, or error status
◆ setCastShadows()
 UX_EXPORT_FUNCTION void AcDbTable::setCastShadows  |  ( |  bool  |  value | )
virtual
See AcDbBlockReference::setCastShadows(bool) .
Parameters
[in] | value | ignored
Reimplemented from AcDbEntity.
◆ setCellState()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbTable::setCellState  |  ( |  int  |  row,
|  int  |  column,
|  AcDb::CellState  |  cellState
)
Sets the cell state for the specified cell.
Parameters
[in] | row | the row index
[in] | column | the column index
[in] | cellState | the cell state to be applied
Returns
Acad::eOk, or error status
◆ setCellStyle()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbTable::setCellStyle  |  ( |  int  |  r,
|  int  |  c,
|  const ACHAR *  |  cellStyle
)
Sets the style for the specified cell.
Parameters
[in] | r | cell's row index
[in] | c | cell's column index
[in] | cellStyle | name of the style
Returns
Acad::eOk if successful, error code otherwise
◆ setCellType()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbTable::setCellType  |  ( |  int  |  r,
|  int  |  c,
|  AcDb::CellType  |  cellType
)
virtual
Sets the cell with AcDbTable::kTextCell or AcDbTable::kBlockCell.
Parameters
[in] | r | row index
[in] | c | column index
[in]
return Acad::eOk if successful, Acad::eInvalidInput otherwise
◆ setColumnName()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbTable::setColumnName  |  ( |  int  |  column,
|  const ACHAR *  |  columnName
)
Sets the cell margin for specified row, or column, or cell.
Parameters
[in] | column | the column index
[in] | columnName | the name for the specified column
Returns
Acad::eOk, or error status
◆ setColumnWidth() [1/2]
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbTable::setColumnWidth  |  ( |  double  |  w | )
virtual
Sets the width of all columns in this table entity.
Parameters
[in] | w | columns width
Returns
Acad::eOk, if successful, error code otherwise
◆ setColumnWidth() [2/2]
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbTable::setColumnWidth  |  ( |  int  |  c,
|  double  |  w
)
virtual
Sets the width of the specified column in this table entity.
Parameters
[in] | c | column index
[in] | w | column width
Returns
Acad::eOk, if successful, error code otherwise
◆ setContentColor() [1/2]
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbTable::setContentColor  |  ( |  const AcCmColor &  |  col,
|  int  |  rowType = AcDb::kAllRows
)
virtual
Sets the specified row types with collor.
Parameters
[in] | c | color to set
[in] | rowType | one of AcDb::kDataRow, AcDb::kTitleRow, AcDb::kHeaderRow
Returns
Acad::eOk, if successful, error code otherwise
◆ setContentColor() [2/2]
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbTable::setContentColor  |  ( |  int  |  r,
|  int  |  c,
|  const AcCmColor &  |  col
)
virtual
Sets the specified cell with collor.
Parameters
[in] | r | row index
[in] | c | column index
[in] | c | color to set
Returns
Acad::eOk, if successful, error code otherwise
◆ setContentLayout()
 Acad::ErrorStatus AcDbTable::setContentLayout  |  ( |  int  |  row,
|  int  |  column,
|  AcDb::CellContentLayout  |  layout
)
Returns the cell content layout for the specified cell.
Parameters
[in] | row | the row index
[in] | column | the column index
[in] | layout | to be used for the specified cell
Returns
Acad::eOk, or error status
◆ setCustomData() [1/2]
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbTable::setCustomData  |  ( |  int  |  row,
|  int  |  col,
|  const ACHAR *  |  key,
|  const AcValue *  |  data
)
Gets custom data to row, or column, or cell.
Parameters
[in] | row | index for the cell specifying the zero-based row, or -1 for column
[in] | col | index for the cell specifying the zero-based column, or -1 for row
[in] | key | specifies the key for the data to be stored
[in] | data | to be stored for cell, row or column
Returns
Acad::eOk for success, or error status otherwise
◆ setCustomData() [2/2]
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbTable::setCustomData  |  ( |  int  |  row,
|  int  |  col,
|  int  |  data
)
Sets custom data to row, or column, or cell.
Parameters
[in] | row | index for the cell specifying the zero-based row, or -1 for column
[in] | col | index for the cell specifying the zero-based column, or -1 for row
[in] | data | to be stored for cell, row or column
Returns
Acad::eOk for success, or error status otherwise
◆ setDataFormat() [1/2]
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbTable::setDataFormat  |  ( |  int  |  row,
|  int  |  column,
|  const ACHAR *  |  szFormat
)
Defines the data format string for the first content of the specified table cell.
Parameters
[in] | row | - row index
[in] | column | - column index
[in] | szFormat | - format specification
Returns
Acad::eOk, or error status
◆ setDataFormat() [2/2]
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbTable::setDataFormat  |  ( |  int  |  row,
|  int  |  column,
|  int  |  contentIndex,
|  const ACHAR *  |  szFormat
)
Defines the data format string for the first content of the specified table cell.
Parameters
[in] | row | - row index
[in] | column | - column index
[in] | contentIndex | - index of the content
[in] | szFormat | - format specification
Returns
Acad::eOk, or error status
◆ setDataLink() [1/2]
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbTable::setDataLink  |  ( |  const AcCellRange &  |  cellRange,
|  const AcDbObjectId &  |  dataLinkId,
|  bool  |  toUpdate
)
Set table data link.
Parameters
[in] | cellRange | input cell range for data link
[in] | dataLinkId | object id of the data link
[in] | toUpdate | if true, updates the data link after setting it, false otherwise
Returns
Acad::eOk, or error status
◆ setDataLink() [2/2]
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbTable::setDataLink  |  ( |  int  |  row,
|  int  |  col,
|  const AcDbObjectId &  |  dataLinkId,
|  bool  |  toUpdate
)
Set table data link.
Parameters
[in] | row | index for the cell specifying the zero-based row, or -1 for column
[in] | col | index for the cell specifying the zero-based column, or -1 for row
[in] | dataLinkId | object id of the data link
[in] | toUpdate | if true, updates the data link after setting it, false otherwise
Returns
Acad::eOk, or error status
◆ setDataType() [1/4]
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbTable::setDataType  |  ( |  AcValue::DataType  |  dataType,
|  AcValue::UnitType  |  unitType
)
virtual
Defines the data type and units type for the table.
Parameters
[in] | dataType | - the data type
[in] | unitType | - the units type
Returns
Acad::eOk or error status
◆ setDataType() [2/4]
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbTable::setDataType  |  ( |  AcValue::DataType  |  dataType,
|  AcValue::UnitType  |  unitType,
|  int  |  rowTypes
)
virtual
Defines the data type, units type for the specified row types of the table.
Parameters
[in] | dataType | - the data type
[in] | unitType | - the units type
[in] | rowTypes | - the affected row types
Returns
Acad::eOk or error status
◆ setDataType() [3/4]
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbTable::setDataType  |  ( |  int  |  row,
|  int  |  column,
|  AcValue::DataType  |  dataType,
|  AcValue::UnitType  |  unitType
)
Sets the data type and unit for the specified content of the specified table cell.
Parameters
[in] | row | - row index
[in] | column | - column index
[in] | dataType | - data type
[in] | unitType | - data unit
Returns
Acad::eOk or error status
◆ setDataType() [4/4]
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbTable::setDataType  |  ( |  int  |  row,
|  int  |  column,
|  int  |  contentIndex,
|  AcValue::DataType  |  dataType,
|  AcValue::UnitType  |  unitType
)
Sets the data type and unit for the specified content of the specified table cell.
Parameters
[in] | row | - row index
[in] | column | - column index
[in] | contentIndex | - content index
[in] | dataType | - data type
[in] | unitType | - data unit
Returns
Acad::eOk or error status
◆ setDirection()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbTable::setDirection  |  ( |  const AcGeVector3d &  |  hor | )
virtual
Sets the horizontal direction vector for this table object.
Parameters
[in] | hor | horizontal direction vector.
Returns
Acad::eOk if successful, Acad::eInvalidInput otherwise.
◆ setFieldId() [1/3]
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbTable::setFieldId  |  ( |  int  |  row,
|  int  |  column,
|  const AcDbObjectId &  |  fieldId
)
virtual
Assigns an AcDbField object to the specified table cell.
Parameters
[in] | row | - the row of the table cell
[in] | column | - the column of the table cell
[in] | fieldId | - the AcDbField object to be assigned to the cell
Returns
Acad::eOk if successful, error status otherwise.
◆ setFieldId() [2/3]
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbTable::setFieldId  |  ( |  int  |  row,
|  int  |  column,
|  const AcDbObjectId &  |  fieldId,
|  AcDb::CellOption  |  option
)
virtual
Assigns an AcDbField object to the specified table cell.
Parameters
[in] | row | - the row of the table cell
[in] | column | - the column of the table cell
[in] | fieldId | - the AcDbField object to be assigned to the cell
[in] | option | - specifies whether to apply the cell formatting to the field or not
Returns
Acad::eOk if successful, error status otherwise.
◆ setFieldId() [3/3]
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbTable::setFieldId  |  ( |  int  |  row,
|  int  |  column,
|  int  |  contentIdx,
|  const AcDbObjectId &  |  fieldId,
|  AcDb::CellOption  |  option
)
Assigns an AcDbField object to the specified table cell.
Parameters
[in] | row | - the row of the table cell
[in] | column | - the column of the table cell
[in] | contentIdx | - the index of the content to be assigned the field
[in] | fieldId | - the AcDbField object to be assigned to the cell
[in] | option | - specifies whether to apply the cell formatting to the field or not
Returns
Acad::eOk if successful, error status otherwise.
◆ setFlowDirection()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbTable::setFlowDirection  |  ( |  AcDb::FlowDirection  |  fd | )
virtual
Sets the flow direction (Top to bottom or bottom to top)
Parameters
[in] | fd | flow direction to set
Returns
appropriate error status
◆ setFormat() [1/2]
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbTable::setFormat  |  ( |  const ACHAR *  |  strFormat | )
virtual
Parameters
[in] | strFormat | string to set
Returns
Acad::eOk, if successful, error code otherwise
◆ setFormat() [2/2]
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbTable::setFormat  |  ( |  const ACHAR *  |  strFormat,
|  int  |  rowTypes
)
virtual
Parameters
[in] | strFormat | string to set
Returns
Acad::eOk, if successful, error code otherwise
◆ setGridColor() [1/3]
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbTable::setGridColor  |  ( |  const AcCmColor &  |  c,
|  int  |  borders,
|  int  |  r
)
virtual
Set the grid color of the specified grid line and row type.
Parameters
[in] | c | color
[in] | borders | types of line
[in] | r | row types
Returns
Acad::eOk if successful, Acad::eInvalidInput otherwise.
◆ setGridColor() [2/3]
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbTable::setGridColor  |  ( |  int  |  row,
|  int  |  column,
|  AcDb::GridLineType  |  border,
|  const AcCmColor &  |  col
)
Set the grid color of the specified cell.
Parameters
[in] | row | row index of the cell
[in] | column | column index of the cell
[in] | border | types of line
[in] | col | color to set
Returns
Acad::eOk if successful, Acad::eInvalidInput otherwise.
◆ setGridColor() [3/3]
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbTable::setGridColor  |  ( |  int  |  r,
|  int  |  c,
|  short  |  numberEdge,
|  const AcCmColor &  |  colorEdge
)
virtual
Set the grid color of the specified cell edge.
Parameters
[in] | r | row index
[in] | c | column index
[in] | numberEdge | It can be kTopMask, kRightMask, kBottomMask, kLeftMask
[in] | colorEdge | color for set
Returns
Acad::eOk if successful, Acad::eInvalidInput otherwise.
◆ setGridLineWeight() [1/3]
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbTable::setGridLineWeight  |  ( |  AcDb::LineWeight  |  lineWeight,
|  int  |  nBorders,
|  int  |  nRows
)
virtual
The grid lineweight of the specified row type is set by this function.
Parameters
[in] | lineWeight | The grid lineweight for a specified row type and gridline
[in] | nBorders | types of line
[in] | nRows | It can be one of AcDb::kDataRow, AcDb::kTitleRow, AcDb::kHeaderRow
Returns
Acad::eOk if successful, Acad::eInvalidInput otherwise.
◆ setGridLineWeight() [2/3]
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbTable::setGridLineWeight  |  ( |  int  |  r,
|  int  |  c,
|  AcDb::GridLineType  |  border,
|  AcDb::LineWeight  |  lineWeight
)
The grid lineweight of the specified cell, row or column is set by this function.
Parameters
[in] | r | row index
[in] | c | column index
[in] | border | types of line
[in] | lineWeight | The specified edge of the cell for the grid is set by this parameter.
Returns
Acad::eOk if successful, Acad::eInvalidInput otherwise.
◆ setGridLineWeight() [3/3]
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbTable::setGridLineWeight  |  ( |  int  |  r,
|  int  |  c,
|  short  |  numberEdge,
|  AcDb::LineWeight  |  lineWeight
)
virtual
The grid lineweight of the specified edge of the cell is set by this function.
Parameters
[in] | r | row index
[in] | c | column index
[in] | numberEdge | It can be kTopMask, kRightMask, kBottomMask, kLeftMask
[in] | lineWeight | The specified edge of the cell for the grid is set by this parameter.
Returns
Acad::eOk if successful, Acad::eInvalidInput otherwise.
◆ setGridVisibility() [1/3]
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbTable::setGridVisibility  |  ( |  AcDb::Visibility  |  isVisible,
|  int  |  border,
|  int  |  rowType
)
virtual
The grid visibility of the grid line type and row type is set by this function.
Parameters
[in] | isVisible | The specified edge of the cell for the grid line type and row type is set by this parameter.
[in] | border | types of line
[in] | rowType | row types
Returns
Acad::eOk if successful, Acad::eInvalidInput otherwise.
◆ setGridVisibility() [2/3]
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbTable::setGridVisibility  |  ( |  int  |  r,
|  int  |  c,
|  AcDb::GridLineType  |  border,
|  AcDb::Visibility  |  isVisible
)
The grid visibility of the specified row column or cell is set by this function.
Parameters
[in] | r | row index
[in] | c | column index
[in] | border | types of line
[in] | isVisible | The specified edge of the cell for the grid is set by this parameter.
Returns
Acad::eOk if successful, Acad::eInvalidInput otherwise.
◆ setGridVisibility() [3/3]
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbTable::setGridVisibility  |  ( |  int  |  r,
|  int  |  c,
|  short  |  numberEdge,
|  AcDb::Visibility  |  isVisible
)
virtual
The grid visibility of the specified edge is set by this function.
Parameters
[in] | r | row index
[in] | c | column index
[in] | numberEdge | It can be kTopMask, kRightMask, kBottomMask, kLeftMask
[in] | isVisible | The specified edge of the cell for the grid is set by this parameter.
Returns
Acad::eOk if successful, Acad::eInvalidInput otherwise.
◆ setHeight()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbTable::setHeight  |  ( |  double  |  height | )
virtual
Sets the height of table.
Parameters
[in] | height | value.
Returns
Acad::eOk if successful, otherwise Acad::eInvalidInput.
◆ setHorzCellMargin()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbTable::setHorzCellMargin  |  ( |  double  |  horzCellMargin | )
virtual
Sets the horizontal cell margin.
Parameters
[in] | horzCellMargin | horizontal cell margin value.
Returns
Acad::eOk if successful, otherwise Acad::eInvalidInput.
◆ setMargin()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbTable::setMargin  |  ( |  int  |  row,
|  int  |  column,
|  AcDb::CellMargin  |  marginType,
|  double  |  margin
)
Sets the cell margin for specified row, or column, or cell.
Parameters
[in] | row | index (or -1 for column only)
[in] | column | index (or -1 for row only)
[in] | marginType | specifies the particular margin
[in] | margin | is the double value for the specified row/column/cell + margin type
Returns
double margin
◆ setNormal()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbTable::setNormal  |  ( |  const AcGeVector3d &  |  acVector | )
virtual
See also
AcDbBlockReference::setNormal(const AcGeVector3d&)
Reimplemented from AcDbBlockReference.
◆ setNumColumns()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbTable::setNumColumns  |  ( |  int  |  numColumns | )
virtual
Sets the number of columns for this table object.
Parameters
[in] | numColumns | number of columns
Returns
Acad::eOk if successful, otherwise Acad::eInvalidInput.
◆ setNumRows()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbTable::setNumRows  |  ( |  int  |  numRows | )
virtual
Sets the number of rows for this table object.
Parameters
[in] | numRows | number of rows
Returns
Acad::eOk if successful, otherwise Acad::eInvalidInput.
◆ setOverride() [1/2]
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbTable::setOverride  |  ( |  int  |  row,
|  int  |  column,
|  AcDb::GridLineType  |  gridTypeProperty,
|  AcDb::GridProperty  |  gridProperty
)
Sets the cell property override setting.
Parameters
[in] | row | row index of the cell
[in] | column | column index of a cell
[in] | gridTypeProperty | AcDb::GridLineType property
[in] | gridProperty | AcDb::GridProperty override property
Returns
Acad::eOk for success, or error status otherwise
◆ setOverride() [2/2]
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbTable::setOverride  |  ( |  int  |  row,
|  int  |  column,
|  int  |  index,
|  AcDb::CellProperty  |  cellProperty
)
Sets the cell property override setting.
Parameters
[in] | row | row index of the cell
[in] | column | column index of a cell
[in] | index | the index content of the hit cell
Returns
Acad::eOk for success, or error status otherwise
◆ setPosition()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbTable::setPosition  |  ( |  const AcGePoint3d &  |  acPoint | )
virtual
See also
AcDbBlockReference::setPosition(const AcGePoint3d&)
Reimplemented from AcDbBlockReference.
◆ setReceiveShadows()
 UX_EXPORT_FUNCTION void AcDbTable::setReceiveShadows  |  ( |  bool  |  value | )
virtual
See AcDbBlockReference::setReceiveShadows(bool) .
Parameters
[in] | value | ignored
Reimplemented from AcDbEntity.
◆ setRotation() [1/2]
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbTable::setRotation  |  ( |  double  |  rot | )
virtual
Sets the rotation angle of the table.
Parameters
[in] | rotation | angle
Returns
Acad::eOk for success, or error status otherwise
Reimplemented from AcDbBlockReference.
◆ setRotation() [2/2]
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbTable::setRotation  |  ( |  int  |  row,
|  int  |  column,
|  int  |  content,
|  double  |  rot
)
Sets the rotation angle of the cell content.
Parameters
[in] | row | row index
[in] | column | column index
[in] | content | content index
[in] | rotation | angle
Returns
Acad::eOk for success, or error status otherwise
◆ setRowHeight() [1/2]
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbTable::setRowHeight  |  ( |  double  |  h | )
virtual
Sets the height of all rows in this table entity.
Parameters
[in] | h | row height
Returns
Acad::eOk, if successful, error code otherwise
◆ setRowHeight() [2/2]
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbTable::setRowHeight  |  ( |  int  |  r,
|  double  |  h
)
virtual
Sets the height of the specified row in this table entity.
Parameters
[in] | r | row index
[in] | h | row height
Returns
Acad::eOk, if successful, error code otherwise
◆ setSize()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbTable::setSize  |  ( |  int  |  r,
|  int  |  c
)
Sets the table size.
Parameters
[in] | r | number of rows
[in] | c | number of columns
Returns
Acad::eOk if successful, error code otherwise
◆ setSubSelection()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbTable::setSubSelection  |  ( |  int  |  rowMin,
|  int  |  rowMax,
|  int  |  colMin,
|  int  |  colMax
)
virtual
It sets the indexes of row and column of cells to the sub selection set.
Parameters
[in] | Zero | based bottom limit of row index
[in] | Zero | based top limit of row index
[in] | Zero | based bottom limit of column index
[in] | Zero | based top limit of column index @If successful it returns Acad::eOk, otherwise it returns Acad::eInvalidInput.
◆ setTableStyle()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbTable::setTableStyle  |  ( |  const AcDbObjectId &  |  tableStyleId | )
virtual
Sets the object id of the AcDbTableStyle for use by this table entity.
Parameters
[in] | tableStyleId | object id of the table style
Returns
Acad::eOk, if successful
◆ setTextHeight() [1/2]
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbTable::setTextHeight  |  ( |  double  |  h,
|  int  |  type = AcDb::kAllRows
)
virtual
Sets the text height of the specified rows by type.
Parameters
[in] | h | text height
[in] | type | row types
Returns
Acad::eOk, if successful, error code otherwise
◆ setTextHeight() [2/2]
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbTable::setTextHeight  |  ( |  int  |  r,
|  int  |  c,
|  double  |  h
)
virtual
Sets the text height of a given cell in this table entity.
Parameters
[in] | r | row index of the cell
[in] | c | column index of the cell
[in] | h | text height
Returns
Acad::eOk, if successful, error code otherwise
◆ setTextRotation()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbTable::setTextRotation  |  ( |  int  |  r,
|  int  |  c,
|  AcDb::RotationAngle  |  rotation
)
virtual
Sets the text rotation angle for the specified cell.in this table entity.
Parameters
[in] | r | row index of the cell
[in] | c | column index of the cell
[in] | rotation | rotation angle for the text string
Returns
Acad::eOk if successful, error code otherwise
◆ setTextString() [1/2]
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbTable::setTextString  |  ( |  int  |  r,
|  int  |  c,
|  const ACHAR *  |  textString
)
virtual
Sets the text string for the specified cell in this table entity.
Parameters
[in] | r | row index of the cell
[in] | c | column index of the cell
[in] | textString | text string
Returns
Acad::eOk if successful, otherwise Acad::eInvalidInput
◆ setTextString() [2/2]
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbTable::setTextString  |  ( |  int  |  r,
|  int  |  c,
|  int  |  indexContent,
|  const ACHAR *  |  textString
)
Sets the text string for the specified cell in this table entity.
Parameters
[in] | r | row index of the cell
[in] | c | column index of the cell
[in] | c | indexContent index must be between 0 and number of contents
[in] | textString | text string
Returns
Acad::eOk if successful, otherwise Acad::eInvalidInput
◆ setTextStyle() [1/2]
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbTable::setTextStyle  |  ( |  const AcDbObjectId &  |  id,
|  int  |  rowTypes = AcDb::kAllRows
)
virtual
Sets the text style used for row r, column c.
Parameters
[in] | id | of the text style object
[in] | rowType | - one of AcDb::kDataRow, AcDb::kTitleRow, AcDb::kHeaderRow or combination of them, if not specified background is set to whole table
Returns
Acad::eOk if successful, error code otherwise
◆ setTextStyle() [2/2]
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbTable::setTextStyle  |  ( |  int  |  r,
|  int  |  c,
|  const AcDbObjectId &  |  id
)
virtual
Sets the text style used for row r, column c.
Parameters
[in] | r | index of the row
[in] | c | index of the column
[in] | id | of the text style object
Returns
Acad::eOk if successful, error code otherwise
◆ setValue() [1/3]
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbTable::setValue  |  ( |  int  |  row,
|  int  |  column,
|  const AcValue &  |  value
)
Sets the first content of the specified table cell to the given value.
Parameters
[in] | row | index for the cell specifying the zero-based row
[in] | column | index for the cell specifying the zero-based column
[in] | value | value to set
Returns
Acad::eOk, if successful, error code otherwise
◆ setValue() [2/3]
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbTable::setValue  |  ( |  int  |  row,
|  int  |  column,
|  int  |  contentIndex,
|  const AcValue &  |  value
)
Sets the specified table cell at specified content index to the given value.
Parameters
[in] | row | - index for the cell specifying the zero-based row
[in] | column | - index for the cell specifying the zero-based column
[in] | contentIndex | - the content index for the cell
[in] | value | - the value to set
Returns
Acad::eOk, if successful, error code otherwise
◆ setValue() [3/3]
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbTable::setValue  |  ( |  int  |  row,
|  int  |  column,
|  int  |  contentIndex,
|  const AcValue &  |  value,
|  AcValue::ParseOption  |  option
)
Sets the specified table cell at specified content index to the given value.
Parameters
[in] | row | - index for the cell specifying the zero-based row
[in] | column | - index for the cell specifying the zero-based column
[in] | contentIndex | - the content index for the cell
[in] | value | - the value to set
Returns
Acad::eOk, if successful, error code otherwise
◆ setVertCellMargin()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbTable::setVertCellMargin  |  ( |  double  |  vertCellMargin | )
virtual
Sets the vertical cell margin.
Parameters
[in] | vertCellMargin | vertical cell margin value.
Returns
Acad::eOk if successful, otherwise Acad::eInvalidInput.
◆ setWidth()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbTable::setWidth  |  ( |  double  |  width | )
virtual
Sets the Width of table.
Parameters
[in] | width | value.
Returns
Acad::eOk if successful, otherwise Acad::eInvalidInput.
◆ subClose()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbTable::subClose  |  ( |   | )
virtual
See also
AcDbBlockReference::subClose()
Reimplemented from AcDbObject.
◆ subExplode()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbTable::subExplode  |  ( |  AcDbVoidPtrArray &  |  pointerArray | ) |   const
protectedvirtual
See also
AcDbBlockReference::explode(AcDbVoidPtrArray&) const
Reimplemented from AcDbEntity.
◆ subGetGeomExtents()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbTable::subGetGeomExtents  |  ( |  AcDbExtents &  |  resultBox | ) |   const
protectedvirtual
See also
AcDbBlockReference::getGeomExtents(AcDbExtents&)
Reimplemented from AcDbEntity.
◆ subGetGripPoints()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbTable::subGetGripPoints  |  ( |  AcGePoint3dArray &  |  pointArray,
|  AcDbIntArray &  |  snapSettingsArray,
|  AcDbIntArray &  |  idArray
) |   |  const
protectedvirtual
See also
AcDbBlockReference::getGripPoints
Reimplemented from AcDbEntity.
◆ subGetOsnapPoints()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbTable::subGetOsnapPoints  |  ( |  AcDb::OsnapMode  |  mode,
|  Adesk::GsMarker  |  subEntSelectMarker,
|  const AcGePoint3d &  |  pickedPnt,
|  const AcGePoint3d &  |  lastSelectedPnt,
|  const AcGeMatrix3d &  |  matrix,
|  AcGePoint3dArray &  |  snapIOArray,
|  AcDbIntArray &  |  idArray
) |   |  const
protectedvirtual
See also
AcDbBlockReference::getOsnapPoints
Reimplemented from AcDbEntity.
◆ subGetStretchPoints()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbTable::subGetStretchPoints  |  ( |  AcGePoint3dArray &  |  pointArray | ) |   const
protectedvirtual
See also
AcDbBlockReference::getStretchPoints
Reimplemented from AcDbEntity.
◆ subGetTransformedCopy()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbTable::subGetTransformedCopy  |  ( |  const AcGeMatrix3d &  |  matrix,
|  AcDbEntity *&  |  resultEntity
) |   |  const
protectedvirtual
See also
AcDbBlockReference::getTransformedCopy(const AcGeMatrix3d&, AcDbEntity*&)
Reimplemented from AcDbBlockReference.
◆ subList()
 UX_EXPORT_FUNCTION void AcDbTable::subList  |  ( |   | ) |   const
protectedvirtual
See also
AcDbBlockReference::list()
Reimplemented from AcDbEntity.
◆ subMoveGripPointsAt()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbTable::subMoveGripPointsAt  |  ( |  const AcDbIntArray &  |  indexArray,
|  const AcGeVector3d &  |  translationVector
)
protectedvirtual
See also
AcDbBlockReference::moveGripPointsAt
Reimplemented from AcDbEntity.
◆ subMoveStretchPointsAt()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbTable::subMoveStretchPointsAt  |  ( |  const AcDbIntArray &  |  indexArray,
|  const AcGeVector3d &  |  translationVector
)
protectedvirtual
See also
AcDbBlockReference::subMoveStretchPointsAt
Reimplemented from AcDbEntity.
◆ subTransformBy()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbTable::subTransformBy  |  ( |  const AcGeMatrix3d &  |  matrix | )
protectedvirtual
See also
AcDbBlockReference::transformBy
Reimplemented from AcDbEntity.
◆ subWorldDraw()
 UX_EXPORT_FUNCTION Adesk::Boolean AcDbTable::subWorldDraw  |  ( |  AcGiWorldDraw *  |  pWorldDraw | )
protectedvirtual
See also
AcDbBlockReference::worldDraw(AcGiWorldDraw*)
Reimplemented from AcDbBlockReference.
◆ suppressHeaderRow()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbTable::suppressHeaderRow  |  ( |  bool  |  doSuppress | )
virtual
Enable or disable the header row of the table by changing @ the input flag.
Parameters
[in] | suppressHeaderRow | the flag used to change the status of the header row
Returns
Acad::eOk if successful, otherwise Acad::eInvalidInput.
◆ suppressRegenerateTable()
 UX_EXPORT_FUNCTION void AcDbTable::suppressRegenerateTable  |  ( |  bool  |  suppressRegen | )
Sets this AcDbTable instance to disable automatic regeneration.
Parameters
[in] | suppressRegen | true, to disable table regeneration; false to enable regeneration
Returns
void
◆ suppressTitleRow()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbTable::suppressTitleRow  |  ( |  bool  |  value | )
virtual
Suppress/Unsuppress the title row.
Parameters
[in] | value | which sets if the title row is suppressed or not
Returns
Acad::eOk, if successful, error code otherwise
◆ tableStyle()
 UX_EXPORT_FUNCTION AcDbObjectId AcDbTable::tableStyle  |  ( |   | ) |   const
virtual
Returns the object id of the table style used by this table entity.
Returns
the object id of the table style used
◆ textHeight() [1/2]
 UX_EXPORT_FUNCTION double AcDbTable::textHeight  |  ( |  AcDb::RowType  |  rowType = AcDb::kDataRow | ) |   const
virtual
Returns the text height for the specified row type in this table entity.
Parameters
[in] | rowType | row type
Returns
the text height for the specified row type
◆ textHeight() [2/2]
 UX_EXPORT_FUNCTION double AcDbTable::textHeight  |  ( |  int  |  r,
|  int  |  c
) |   |  const
virtual
Returns the text height for the specified cell in this table entity.
Parameters
[in] | r | row index of the cell
[in] | c | column index of the cell
Returns
the text height for the specified cell
◆ textRotation()
 UX_EXPORT_FUNCTION AcDb::RotationAngle AcDbTable::textRotation  |  ( |  int  |  r,
|  int  |  c
) |   |  const
virtual
Gets the the text rotation angle for the specified cell in this table entity.
Parameters
[in] | r | row index
[in] | c | column index
Returns
text rotation angle for the specified cell
◆ textString() [1/2]
 UX_EXPORT_FUNCTION ACHAR * AcDbTable::textString  |  ( |  int  |  r,
|  int  |  c
) |   |  const
virtual
Returns the text string in the specified cell in this table entity.
Parameters
[in] | r | row index of the cell
[in] | c | column index of the cell
Returns
the text string in the specified cell
◆ textString() [2/2]
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbTable::textString  |  ( |  int  |  r,
|  int  |  c,
|  AcValue::FormatOption  |  e,
|  AcString &  |  str
) |   |  const
virtual
Returns the text string in the specified cell in this table entity.
Parameters
[in] | r | row index of the cell
[in] | c | column index of the cell
Returns
the text string in the specified cell
◆ textStringConst()
 UX_EXPORT_FUNCTION const ACHAR * AcDbTable::textStringConst  |  ( |  int  |  r,
|  int  |  c
) |   |  const
virtual
Returns the text string which exists in the specified cell.
Returns
the text string which exists in the specified cell
◆ textStyle() [1/2]
 UX_EXPORT_FUNCTION AcDbObjectId AcDbTable::textStyle  |  ( |  AcDb::RowType  |  rowType = AcDb::kDataRow | ) |   const
virtual
Returns the object id of the text style used for a rowType.
Parameters
[in] | rowType | - one of AcDb::kDataRow, AcDb::kTitleRow, AcDb::kHeaderRow default is AcDb::kDataRow
Returns
the object id of the text style used
◆ textStyle() [2/2]
 UX_EXPORT_FUNCTION AcDbObjectId AcDbTable::textStyle  |  ( |  int  |  r,
|  int  |  c
) |   |  const
virtual
Returns the object id of the text style used for row r, column c.
Parameters
[in] | r | index of the row
[in] | c | index of the column
Returns
the object id of the text style used
◆ unmergeCells()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbTable::unmergeCells  |  ( |  int  |  minRow,
|  int  |  maxRow,
|  int  |  minCol,
|  int  |  maxCol
)
virtual
Unmerges the cells delimited by the parameters in the argument list.
Parameters
[in] | minRow | row index
[in] | maxRow | row index
[in] | minCol | col index
[in] | maxCol | col index
Returns
Acad::eOk, if successful, error code otherwise
◆ updateDataLink() [1/2]
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbTable::updateDataLink  |  ( |  AcDb::UpdateDirection  |  dir,
|  AcDb::UpdateOption  |  acOption
)
Update table data link.
Parameters
[in] | dir | update direction
[in] | acOption | update option
Returns
Acad::eOk, or error status
◆ updateDataLink() [2/2]
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbTable::updateDataLink  |  ( |  int  |  row,
|  int  |  col,
|  AcDb::UpdateDirection  |  dir,
|  AcDb::UpdateOption  |  acOption
)
Update table data link.
Parameters
[in] | row | index for the cell specifying the zero-based row, or -1 for column
[in] | col | index for the cell specifying the zero-based column, or -1 for row
[in] | dir | update direction
[in] | acOption | update option
Returns
Acad::eOk, or error status
◆ value() [1/3]
 UX_EXPORT_FUNCTION AcValue AcDbTable::value  |  ( |  int  |  r,
|  int  |  c
) |   |  const
get AcValue settings
Parameters
[in] | r | index for the cell specifying the zero-based row
[in] | c | index for the cell specifying the zero-based column
Returns
AcValue
◆ value() [2/3]
 UX_EXPORT_FUNCTION AcValue AcDbTable::value  |  ( |  int  |  row,
|  int  |  column,
|  int  |  contentIndex
) |   |  const
Sets the specified table cell at specified content index to the given value.
Parameters
[in] | row | - index for the cell specifying the zero-based row
[in] | column | - index for the cell specifying the zero-based column
[in] | contentIndex | - the content index for the cell
[in] | value | - the value to set
Returns
Acad::eOk, if successful, error code otherwise
◆ value() [3/3]
 UX_EXPORT_FUNCTION AcValue AcDbTable::value  |  ( |  int  |  row,
|  int  |  column,
|  int  |  contentIndex,
|  AcValue::FormatOption  |  option
) |   |  const
Sets the specified table cell at specified content index to the given value.
Parameters
[in] | row | - index for the cell specifying the zero-based row
[in] | column | - index for the cell specifying the zero-based column
[in] | contentIndex | - the content index for the cell
[in] | value | - the value to set
Returns
Acad::eOk, if successful, error code otherwise
◆ vertCellMargin()
 UX_EXPORT_FUNCTION double AcDbTable::vertCellMargin  |  ( |   | ) |   const
virtual
Returns the vertical cell margin.
Returns
vertCellMargin vertical cell margin value.
◆ width()
 UX_EXPORT_FUNCTION double AcDbTable::width  |  ( |   | ) |   const
virtual
Returns the width of the table.
Returns
width value.