Public Member Functions | Static Public Attributes | Protected Attributes | List of all members
AcDbObjectId Class Reference
_ More...
#include <AcDbObjectId.h>
 Public Member Functions
AcDbObjectId (const AcDbStub *)
 LONG_PTR  | asOldId () const
 void  | convertToRedirectedId ()
If this ObjectId has been redirected from another database, then the function will set this ObjectId to that ObjectId value actually used in that other database.
AcDbDatabase *  | database () const
Returns the database this object is resident in. More...
AcDbHandle  | handle () const
Returns the handle associated with this object ID. More...
bool  | isEffectivelyErased () const
Returns true if the object associated with this object ID is erased. More...
bool  | isErased () const
Returns true if the object associated with this object ID is erased. More...
 bool  | isNull () const
bool  | isResident () const
Returns whether this ObjectId is actually memory-resident or not ("left on disk" then). More...
bool  | isValid () const
AcDbHandle  | nonForwardedHandle () const
If this ObjectId is an object inside a XRef database, then this function returns the handle of this object as used inside the XRef. More...
AcRxClass *  | objectClass () const
Returns the object class descriptor for the AcDbObject assigned to this AcDbObjectId. More...
bool  | objectLeftOnDisk () const
Returns whether this ObjectId is actually non-memory-resident ("left on disk"). More...
operator AcDbStub * () const
 bool  | operator!= (const AcDbObjectId &) const
 bool  | operator!= (const AcDbStub *) const
 bool  | operator< (const AcDbObjectId &) const
 bool  | operator< (const AcDbStub *) const
 bool  | operator<= (const AcDbObjectId &) const
 bool  | operator<= (const AcDbStub *) const
 AcDbObjectId &  | operator= (const AcDbObjectId &)
 AcDbObjectId &  | operator= (const AcDbStub *)
 bool  | operator== (const AcDbObjectId &) const
 bool  | operator== (const AcDbStub *) const
 bool  | operator> (const AcDbObjectId &) const
 bool  | operator> (const AcDbStub *) const
 bool  | operator>= (const AcDbObjectId &) const
 bool  | operator>= (const AcDbStub *) const
AcDbDatabase *  | originalDatabase () const
Gets the original database with which the object having this id is associated. More...
 AcDbObjectId &  | setFromOldId (LONG_PTR)
 void  | setNull ()
 Static Public Attributes
 static const AcDbObjectId  | kNull
 Protected Attributes
 AcDbStub *  | mId
Detailed Description
_
Member Function Documentation
◆ database()
 UX_EXPORT_FUNCTION AcDbDatabase * AcDbObjectId::database  |  ( |   | ) |   const
Returns the database this object is resident in.
Returns
pointer to database, if sucessfull NULL, otherwise
◆ handle()
 UX_EXPORT_FUNCTION AcDbHandle AcDbObjectId::handle  |  ( |   | ) |   const
Returns the handle associated with this object ID.
Date
2007-07-19 laurentiuv created
◆ isEffectivelyErased()
 UX_EXPORT_FUNCTION bool AcDbObjectId::isEffectivelyErased  |  ( |   | ) |   const
Returns true if the object associated with this object ID is erased.
or if any of the owners in the ownership hierarchy for the object (in other words, the object's owner, the object's owner's owner, etc.) are erased
Date
2007-07-16 laurentiuv created
◆ isErased()
 UX_EXPORT_FUNCTION bool AcDbObjectId::isErased  |  ( |   | ) |   const
Returns true if the object associated with this object ID is erased.
Date
2007-07-16 laurentiuv created
◆ isResident()
 UX_EXPORT_FUNCTION bool AcDbObjectId::isResident  |  ( |   | ) |   const
Returns whether this ObjectId is actually memory-resident or not ("left on disk" then).
Returns
true/false, indicating whether the object is actually in-memory
◆ isValid()
 UX_EXPORT_FUNCTION bool AcDbObjectId::isValid  |  ( |   | ) |   const
Note
2007-04-10 monikah: for some reason I do not know, this static member is not exported correctly with .def file
 2007-04-25 lucd: the solution is not to export it, but to instantiate it in the client application just like it is done here. The obivous place to do this is in drxEntryPoint.cpp
 2008-03-01 lucd: it is now exported by means of BRX_IMPORTEXPORT in our BRX headers
◆ nonForwardedHandle()
 UX_EXPORT_FUNCTION AcDbHandle AcDbObjectId::nonForwardedHandle  |  ( |   | ) |   const
If this ObjectId is an object inside a XRef database, then this function returns the handle of this object as used inside the XRef.
Otherwise, result is same as
Returns
handle of this object as used inside the associated XRef; if this object is not inside a XRef, it returns the normal AcDbObjectId::handle() value
◆ objectClass()
 UX_EXPORT_FUNCTION AcRxClass * AcDbObjectId::objectClass  |  ( |   | ) |   const
Returns the object class descriptor for the AcDbObject assigned to this AcDbObjectId.
Returns
AcRxClass - the class of the object, or AcRxObject::desc() if the ID is kNull
◆ objectLeftOnDisk()
 UX_EXPORT_FUNCTION bool AcDbObjectId::objectLeftOnDisk  |  ( |   | ) |   const
Returns whether this ObjectId is actually non-memory-resident ("left on disk").
Returns
true/false, indicating whether the object is actually "on disk"
◆ originalDatabase()
 UX_EXPORT_FUNCTION AcDbDatabase * AcDbObjectId::originalDatabase  |  ( |   | ) |   const
Gets the original database with which the object having this id is associated.
Returns
pointer to database