Public Member Functions | List of all members
AcDbTransactionManager Class Referenceabstract
_ More...
#include <AcDbTransactionManager.h>
 Public Member Functions
virtual Acad::ErrorStatus  | abortTransaction ()=0
Terminates the current (top) transaction. More...
virtual Acad::ErrorStatus  | addNewlyCreatedDBRObject (AcDbObject *, bool=true)=0
Adds a newly created (not closed previously) object to the topmost transaction. More...
virtual void  | addReactor (AcTransactionReactor *)=0
Adds a new AcTransactionReactor to current AcDbTransactionManagerImp. More...
virtual Acad::ErrorStatus  | endTransaction ()=0
Commits all changes to objects for the current transaction. More...
virtual Acad::ErrorStatus  | getAllObjects (AcDbVoidPtrArray &)=0
Fills the passed array with all transaction objects. More...
virtual Acad::ErrorStatus  | getObject (AcDbObject *&, AcDbObjectId, AcDb::OpenMode, bool=false)=0
Opens object to be used inside transaction. More...
 virtual Acad::ErrorStatus  | markObjectPageable (AcDbObject *)=0
Not implemented yet.
virtual int  | numActiveTransactions ()=0
Returns number of active transactions for this Transaction Manager. More...
 virtual Acad::ErrorStatus  | queueForGraphicsFlush ()=0
virtual void  | removeReactor (AcTransactionReactor *)=0
Removes acTAReactor reactor from the current AcDbTransactionManager. More...
virtual AcTransaction *  | startTransaction ()=0
Begins a new transaction on the database for this Transaction Manager object. More...
virtual AcTransaction *  | topTransaction ()=0
Returns pointer to the top (most recent) transaction. More...
 Public Member Functions inherited from AcRxObject
virtual AcRxObject *  | clone () const
Exported and implemented. More...
 virtual AcRx::Ordering  | comparedTo (const AcRxObject *) const
Exported and implemented.
virtual Acad::ErrorStatus  | copyFrom (const AcRxObject *)
Exported and implemented. More...
 virtual AcRxClass *  | isA () const
Exported and implemented.
virtual Adesk::Boolean  | isEqualTo (const AcRxObject *) const
Exported and implemented. More...
bool  | isKindOf (const AcRxClass *) const
Checks the object class. More...
AcRxObject *  | queryX (const AcRxClass *) const
returns the protocol extension object assigned to this class or a parent class. More...
AcRxObject *  | x (const AcRxClass *) const
returns the protocol extension object assigned to this class or a parent class. More...
 virtual  | ~AcRxObject ()
Destructor.
 Additional Inherited Members
 Static Public Member Functions inherited from AcRxObject
 static AcRxObject *  | cast (const AcRxObject *)
 static AcRxClass *  | desc ()
Exported and implemented.
 Protected Member Functions inherited from AcRxObject
AcRxObject ()
Exported and implemented.
Detailed Description
_
Member Function Documentation
◆ abortTransaction()
 Acad::ErrorStatus AcDbTransactionManager::abortTransaction  |  ( |   | )
pure virtual
Terminates the current (top) transaction.
Begins an immediate rollback of all changes to objects since the start of the current transaction. This rollback is applied for all transaction-resident objects.
Returns
Acad::eOk if successful,
 Acad::eNoActiveTransactions if no transaction is currently running
◆ addNewlyCreatedDBRObject()
 Acad::ErrorStatus AcDbTransactionManager::addNewlyCreatedDBRObject  |  ( |  AcDbObject *  |  pObj,
|  bool  |  addIt = true
)
pure virtual
Adds a newly created (not closed previously) object to the topmost transaction.
This is a preliminary function implementation. It allows to add to transaction a database object, which was created/added to database AFTER a transaction has been started.
Parameters
[in] | pObj | pointer to object to be added to transaction
[in] | addIt | not used
Returns
Acad::eOk if successful
 Acad::eNotNewlyCreated if object is not a newly created one. Acad::eNoActiveTransactions if no transaction is currently running
◆ addReactor()
 void AcDbTransactionManager::addReactor  |  ( |  AcTransactionReactor *  |  newOne | )
pure virtual
Adds a new AcTransactionReactor to current AcDbTransactionManagerImp.
Parameters
[in] | newOne | AcTransactionReactor to be added
◆ endTransaction()
 Acad::ErrorStatus AcDbTransactionManager::endTransaction  |  ( |   | )
pure virtual
Commits all changes to objects for the current transaction.
Returns
Acad::eOk if successful,
 Acad::eNoActiveTransactions if no transaction is currently running
◆ getAllObjects()
 Acad::ErrorStatus AcDbTransactionManager::getAllObjects  |  ( |  AcDbVoidPtrArray &  |  objPtrArray | )
pure virtual
Fills the passed array with all transaction objects.
Parameters
[in,out] | objPtrArray | passed array, on return filled with all transaction objects
◆ getObject()
 Acad::ErrorStatus AcDbTransactionManager::getObject  |  ( |  AcDbObject *&  |  pObject,
|  AcDbObjectId  |  objId,
|  AcDb::OpenMode  |  eMode,
|  bool  |  openErased = false
)
pure virtual
Opens object to be used inside transaction.
Object opened using this function should not be closed. They are closed by Transaction Manager on transaction end (or abort).
Parameters
[out] | pObject | receives the opened object pointer
[in] | id | of the object to open
[in] | eMode | to open object in
[in] | openErased
Returns
Acad::eOk if successful
 Acad::eWasErased if object is erased and openErased set to false Acad::eNoActiveTransactions if no transaction is currently running
◆ numActiveTransactions()
 int AcDbTransactionManager::numActiveTransactions  |  ( |   | )
pure virtual
Returns number of active transactions for this Transaction Manager.
Returns
number of active transactions
◆ removeReactor()
 void AcDbTransactionManager::removeReactor  |  ( |  AcTransactionReactor *  |  acTAReactor | )
pure virtual
Removes acTAReactor reactor from the current AcDbTransactionManager.
Parameters
[in] | acTAReactor | AcTransactionReactor to be removed
◆ startTransaction()
 AcTransaction * AcDbTransactionManager::startTransaction  |  ( |   | )
pure virtual
Begins a new transaction on the database for this Transaction Manager object.
Returns
a pointer to AcTransaction object if successful, NULL otherwise.
◆ topTransaction()
 AcTransaction * AcDbTransactionManager::topTransaction  |  ( |   | )
pure virtual
Returns pointer to the top (most recent) transaction.
Returns
pointer to the top transaction