Public Types | Public Member Functions | List of all members
AcDbHandle Class Reference
_ More...
#include <AcDbHandle.h>
 Public Types
enum  | { kMaxValueBytes = 8 , kStrSiz = 17 }
 Public Member Functions
AcDbHandle (const ACHAR *)
Constructs a handle with value represented by argument as hexadecimal string.
AcDbHandle (const Adesk::UInt64 &)
AcDbHandle (int, int)
 int  | byte (Adesk::UInt32) const
 int  | compare (const AcDbHandle &) const
 void  | copyFromOldType (const Adesk::UInt8[8])
 void  | copyToOldType (Adesk::UInt8[8]) const
 void  | decrement ()
bool  | getIntoAsciiBuffer (ACHAR *, size_t) const
Returns the hexidecmal representation of this Handle object as a null terminated string. More...
 template<size_t cch>
bool  | getIntoAsciiBuffer (ACHAR(&sbuf)[cch]) const
 void  | getValueBytes (Adesk::UInt8 *, Adesk::UInt8 *) const
 Adesk::UInt32  | high () const
 void  | increment ()
 bool  | isNull () const
 bool  | isOne () const
 Adesk::UInt32  | low () const
operator Adesk::UInt32 () const
operator Adesk::UInt64 () const
 bool  | operator!= (const AcDbHandle &) const
 AcDbHandle  | operator+ (Adesk::UInt64) const
 AcDbHandle  | operator+ (Adesk::ULongPtr) const
 AcDbHandle  | operator+ (const AcDbHandle &) const
 AcDbHandle &  | operator++ ()
 AcDbHandle  | operator++ (int)
 AcDbHandle &  | operator+= (const AcDbHandle &)
 AcDbHandle  | operator- (const AcDbHandle &) const
 AcDbHandle &  | operator-= (const AcDbHandle &)
 bool  | operator< (const AcDbHandle &) const
bool  | operator<= (const AcDbHandle &) const
Verifies whether this handle is lesser or equal than the other handle. More...
 AcDbHandle &  | operator= (Adesk::UInt32)
 AcDbHandle &  | operator= (Adesk::UInt64)
 AcDbHandle &  | operator= (const AcDbHandle &)
AcDbHandle &  | operator= (const ACHAR *)
Assignment operator, the string parameter is converted to handle integer 64 bit value. More...
 bool  | operator== (const AcDbHandle &) const
 bool  | operator> (const AcDbHandle &) const
bool  | operator>= (const AcDbHandle &) const
Verifies whether this handle is greater or equal than the other handle. More...
 void  | print () const
 bool  | restZeros (int) const
 void  | setHigh (Adesk::UInt32)
 void  | setLow (Adesk::UInt32)
 void  | setNull ()
 void  | setValueBytes (Adesk::UInt8, const Adesk::UInt8 *)
 AcDbHandle  | slowOperatorPlus (const AcDbHandle &) const
Detailed Description
_
Member Function Documentation
◆ getIntoAsciiBuffer()
 UX_EXPORT_FUNCTION bool AcDbHandle::getIntoAsciiBuffer  |  ( |  ACHAR *  |  buffer,
|  size_t  |  cchBuf
) |   |  const
Returns the hexidecmal representation of this Handle object as a null terminated string.
Caller has to provide a string buffer of at least 17 ACHAR long.
Parameters
[out] | buffer | ACHAR buffer, hexrepresentation is copied in it. no leading "0" are provided.
[in] | cchBuf | size of buffer (in characters)
Returns
true if successful
◆ operator<=()
 UX_EXPORT_FUNCTION bool AcDbHandle::operator<=  |  ( |  const AcDbHandle &  |  other | ) |   const
Verifies whether this handle is lesser or equal than the other handle.
Parameters
[in] | other | handle to compare with
Returns
reference to handle
◆ operator=()
 UX_EXPORT_FUNCTION AcDbHandle & AcDbHandle::operator=  |  ( |  const ACHAR *  |  handleStr | )
Assignment operator, the string parameter is converted to handle integer 64 bit value.
Parameters
[in] | handleStr | string
Returns
reference to handle
◆ operator>=()
 UX_EXPORT_FUNCTION bool AcDbHandle::operator>=  |  ( |  const AcDbHandle &  |  other | ) |   const
Verifies whether this handle is greater or equal than the other handle.
Parameters
[in] | other | handle to compare with
Returns
reference to handle