Public Member Functions | Public Attributes | Protected Member Functions | List of all members
AcDb3dSolid Class Reference
_ More...
#include <AcDb3dSolid.h>
 Public Member Functions
virtual void *  | body () const
Gets the contained modeler geometry of this solid. More...
virtual Acad::ErrorStatus  | booleanOper (AcDb::BoolOperType, AcDb3dSolid *)
Constructs a solid from the current solid and the input solid by unifying, intersecting or substracting one from another. More...
virtual Acad::ErrorStatus  | chamferEdges (const AcArray< AcDbSubentId * > &, const AcDbSubentId &, double, double)
This method create on the edges of a solid a chamfer. More...
virtual Acad::ErrorStatus  | checkInterference (const AcDb3dSolid *, Adesk::Boolean, Adesk::Boolean &, AcDb3dSolid *&) const
Verifies if this solid do interfere with input pSolid. More...
virtual Acad::ErrorStatus  | cleanBody ()
Eliminates all the faces and edges unnecesary for the topology of solid. More...
 virtual Acad::ErrorStatus  | convertToBrepAtSubentPaths (const AcDbFullSubentPathArray &)
!!! NOT IMPLEMENTED YET.
virtual Acad::ErrorStatus  | copyEdge (const AcDbSubentId &, AcDbEntity *&)
Copies the edge of the solid given by subentId by allocating a new AcDbEntity object and assigning its address to the given pAcNewEntity pointer. More...
virtual Acad::ErrorStatus  | copyFace (const AcDbSubentId &, AcDbEntity *&)
Copies the face of the solid given by subentId by allocating a new AcDbEntity object and assigning its address to the given pAcNewEntity pointer. More...
virtual Acad::ErrorStatus  | copyFrom (const AcRxObject *)
virtual Acad::ErrorStatus  | createBox (double, double, double)
Creates a solid box. More...
virtual Acad::ErrorStatus  | createExtrudedSolid (AcDbEntity *, const AcDbSubentId &, const AcGeVector3d &, AcDbSweepOptions &)
Creates a solid by extruding a face. More...
virtual Acad::ErrorStatus  | createExtrudedSolid (AcDbEntity *, const AcDbSubentId &, double, AcDbSweepOptions &)
Creates a solid by extruding a face. More...
virtual Acad::ErrorStatus  | createExtrudedSolid (AcDbEntity *, const AcGeVector3d &, AcDbSweepOptions &)
Creates a solid by sweeping a planar curve, region, or planar surface in the direction of the given vector using a distance equal to the length of the vector. More...
virtual Acad::ErrorStatus  | createFrom (const AcDbEntity *)
Creates a 3d solid from an entity that describes a closed volume. More...
virtual Acad::ErrorStatus  | createFrustum (double, double, double, double)
Creates a cylinder or a cone according to parameter values. More...
virtual Acad::ErrorStatus  | createLoftedSolid (AcArray< AcDbEntity * > &, AcArray< AcDbEntity * > &, AcDbEntity *, AcDbLoftOptions &)
Constructs a lofted solid using as defining elements a set of curves and some loft options. More...
virtual Acad::ErrorStatus  | createPyramid (double, int, double, double=0.0)
Creates a solid pyramid. More...
virtual Acad::ErrorStatus  | createRevolvedSolid (AcDbEntity *, const AcDbSubentId &, const AcGePoint3d &, const AcGeVector3d &, double, double, AcDbRevolveOptions &)
Creates a solid by revolving a face of an entity. More...
virtual Acad::ErrorStatus  | createRevolvedSolid (AcDbEntity *, const AcGePoint3d &, const AcGeVector3d &, double, double, AcDbRevolveOptions &)
Creates a solid by revolving a curve, a region or a planar surface. More...
Acad::ErrorStatus  | createSculptedSolid (const AcArray< AcDbEntity * > &, const AcGeIntArray &)
Creates a 3d solid from the enclosed volume formed by the limiting bodies. More...
virtual Acad::ErrorStatus  | createSphere (double)
Creates a solid sphere. More...
virtual Acad::ErrorStatus  | createSweptSolid (AcDbEntity *, AcDbEntity *, AcDbSweepOptions &)
Creates a solid entity by sweeping swetpEnt, which is a curve, region or planar surface, along a given path pPathEnt. More...
virtual Acad::ErrorStatus  | createSweptSolid (AcDbEntity *, const AcDbSubentId &, AcDbEntity *, AcDbSweepOptions &)
Creates a solid by sweeping a face of a given entity along a given curve path pPathEnt. More...
virtual Acad::ErrorStatus  | createTorus (double, double)
Creates a solid torus. More...
virtual Acad::ErrorStatus  | createWedge (double, double, double)
Creates a solid wedge. More...
virtual Acad::ErrorStatus  | extrude (const AcDbRegion *, double, double=0.0)
Creates an extruded solid. More...
virtual Acad::ErrorStatus  | extrudeAlongPath (const AcDbRegion *, const AcDbCurve *, double=0.0)
Creates a solid by extrusion along a given path. More...
virtual Acad::ErrorStatus  | extrudeFaces (const AcArray< AcDbSubentId * > &, double, double)
Creates a solid by extruding the selected faces of the solid. More...
virtual Acad::ErrorStatus  | extrudeFacesAlongPath (const AcArray< AcDbSubentId * > &, const AcDbCurve *)
Modifies a solid by extruding the selected faces of the solid along a given curve path. More...
virtual Acad::ErrorStatus  | filletEdges (const AcArray< AcDbSubentId * > &, const AcGeDoubleArray &, const AcGeDoubleArray &, const AcGeDoubleArray &)
Fillet solid edges for a given array with subentity ids and a given radius array. More...
 virtual Acad::ErrorStatus  | getArea (double &) const
Returns the surface area of the AcDb3dSolid object.
virtual Acad::ErrorStatus  | getMassProp (double &, AcGePoint3d &, double[3], double[3], double[3], AcGeVector3d[3], double[3], AcDbExtents &) const
Gets this object volume properties. More...
virtual Acad::ErrorStatus  | getSection (const AcGePlane &, AcDbRegion *&) const
Return the intersection region between the solid and the specified plane. More...
virtual Acad::ErrorStatus  | getSlice (AcDbSurface *, bool, AcDb3dSolid *&)
Solid is sliced by a given surface and is set with the solid part that contain the positive normal side of plane. More...
virtual Acad::ErrorStatus  | getSlice (const AcGePlane &, Adesk::Boolean, AcDb3dSolid *&)
Solid is sliced by a given plane and is set with the solid part that contain the positive normal side of plane. More...
virtual Acad::ErrorStatus  | getSubentColor (const AcDbSubentId &, AcCmColor &) const
Returns the color of a subentity. More...
virtual Acad::ErrorStatus  | getSubentMaterial (const AcDbSubentId &, AcDbObjectId &) const
Returns the color of a subentity. More...
virtual Acad::ErrorStatus  | getSubentMaterialMapper (const AcDbSubentId &, AcGiMapper &) const
Returns the material mapper of a subentity. More...
virtual Acad::ErrorStatus  | imprintEntity (const AcDbEntity *)
Imprints the intersection of a given entity with a solid on the solid's face. More...
 virtual AcDbSubentId  | internalSubentId (void *) const
!!! NOT IMPLEMENTED YET.
 virtual void *  | internalSubentPtr (const AcDbSubentId &) const
!!! NOT IMPLEMENTED YET.
virtual Adesk::Boolean  | isNull () const
Checks if this AcDb3dSolid object has a ShapeManager object. More...
virtual Adesk::UInt32  | numChanges () const
Returns the number of changes that occured for this 3d solid. More...
virtual Acad::ErrorStatus  | offsetBody (double)
Offsets all the parts of the solid with a specified distance. More...
virtual Acad::ErrorStatus  | offsetFaces (const AcArray< AcDbSubentId * > &, double)
Offset the solid's faces, if possible, containend in acFaceSubentIdsArray, with distance offsetDist. More...
virtual bool  | recordHistory () const
Returns the record state of solid history. More...
virtual Acad::ErrorStatus  | removeFaces (const AcArray< AcDbSubentId * > &)
Removes the solid's faces, if possible, containend in acFaceSubentIdsArray. More...
virtual Acad::ErrorStatus  | revolve (const AcDbRegion *, const AcGePoint3d &, const AcGeVector3d &, double)
Creates a solid by revolving the input region around a given axis. More...
virtual Acad::ErrorStatus  | separateBody (AcArray< AcDb3dSolid * > &)
Separates current solid into multiple solids. More...
virtual Acad::ErrorStatus  | setBody (const void *)
Set a solid with specified body. More...
virtual Acad::ErrorStatus  | setRecordHistory (bool)
Sets the record state of solid history. More...
virtual Acad::ErrorStatus  | setShowHistory (bool)
Sets the visibility.of solid history. More...
virtual Acad::ErrorStatus  | setSubentColor (const AcDbSubentId &, const AcCmColor &)
Sets the color of the specified subentity. More...
virtual Acad::ErrorStatus  | setSubentMaterial (const AcDbSubentId &, AcDbObjectId)
Sets the material of the specified subentity. More...
virtual Acad::ErrorStatus  | setSubentMaterialMapper (const AcDbSubentId &, const AcGiMapper &)
Sets the material mapper of the specified subentity. More...
virtual Acad::ErrorStatus  | shellBody (const AcArray< AcDbSubentId * > &, double)
Given a valid offset the solid is changed into a solid shell having the faces offset inside if the input offset is negative and offset outside if there are positive. More...
virtual bool  | showHistory () const
Returns true if solid history is visible, otherwise false. More...
virtual Acad::ErrorStatus  | stlOut (const ACHAR *, Adesk::Boolean, double=0.0) const
Writes an STL format file for the data of this AcDb3dSolid object. More...
virtual Acad::ErrorStatus  | taperFaces (const AcArray< AcDbSubentId * > &, const AcGePoint3d &, const AcGeVector3d &, double)
This method tapers the input faces depending by a point and an input vector which will be drafted by a given angle. More...
 virtual Acad::ErrorStatus  | transformFaces (const AcArray< AcDbSubentId * > &, const AcGeMatrix3d &)
!!! NOT IMPLEMENTED YET.
 virtual  | ~AcDb3dSolid ()
Destructor.
 Public Member Functions inherited from AcDbEntity
 virtual Acad::ErrorStatus  | addSubentPaths (const AcDbFullSubentPathArray &) final
virtual Acad::ErrorStatus  | applyPartialUndo (AcDbDwgFiler *, AcRxClass *)
virtual Acad::ErrorStatus  | audit (AcDbAuditInfo *)
AcDbObjectId  | blockId () const
Returns the Object ID of the BlockTableRecord that owns this entity. More...
Acad::ErrorStatus  | boundingBoxIntersectWith (const AcDbEntity *, AcDb::Intersect, AcGePoint3dArray &, Adesk::GsMarker, Adesk::GsMarker) const
Finds the intersection between the edges of the bounding box for this entity and the pOhter entity. More...
Acad::ErrorStatus  | boundingBoxIntersectWith (const AcDbEntity *, AcDb::Intersect, const AcGePlane &, AcGePoint3dArray &, Adesk::GsMarker, Adesk::GsMarker) const
First, the function projects the other entity and the bounding box of this entity on plane specified by plane. More...
virtual bool  | bounds (AcDbExtents &) const
Returns the extents of this entity as AcDbExtents. More...
virtual bool  | castShadows () const
Checks if this entity is able to cast shadows. More...
virtual Adesk::Boolean  | cloneMeForDragging () final
Checks if a clone will be created for this entity in case of a drag operation. More...
 virtual AcDb::CollisionType  | collisionType () const
AcCmColor  | color () const
Returns the true color information of the entity. More...
Adesk::UInt16  | colorIndex () const
Returns the color number in a range from 0 to 256. More...
 virtual Acad::ErrorStatus  | deleteSubentPaths (const AcDbFullSubentPathArray &) final
virtual void  | dragStatus (const AcDb::DragStat)
Acad::ErrorStatus  | draw ()
Draws or redraws the entity on screen. More...
virtual AcGiDrawable *  | drawable ()
virtual Acad::ErrorStatus  | dwgInFields (AcDbDwgFiler *)
virtual Acad::ErrorStatus  | dwgOutFields (AcDbDwgFiler *) const
virtual Acad::ErrorStatus  | dxfInFields (AcDbDxfFiler *)
virtual Acad::ErrorStatus  | dxfOutFields (AcDbDxfFiler *) const
AcCmEntityColor  | entityColor () const
Returns the lightweight color information of the entity. More...
virtual Acad::ErrorStatus  | explode (AcDbVoidPtrArray &) const final
virtual Acad::ErrorStatus  | getCompoundObjectTransform (AcGeMatrix3d &) const final
It is used for object without geometry like AcDbMleader. More...
virtual void  | getEcs (AcGeMatrix3d &) const
Returns the transformation matrix from OCS (Object Coordinate System) to WCS (World Coordinate System). More...
virtual Acad::ErrorStatus  | getGeomExtents (AcDbExtents &) const final
Returns extents of this entity. More...
 virtual Acad::ErrorStatus  | getGripEntityUCS (const void *, AcGeVector3d &, AcGePoint3d &, AcGeVector3d &) const final
 virtual Acad::ErrorStatus  | getGripPoints (AcDbGripDataPtrArray &, const double, const int, const AcGeVector3d &, const int) const final
virtual Acad::ErrorStatus  | getGripPoints (AcGePoint3dArray &, AcDbIntArray &, AcDbIntArray &) const final
Append grip points to the specified array. More...
 virtual Acad::ErrorStatus  | getGripPointsAtSubentPath (const AcDbFullSubentPath &, AcDbGripDataPtrArray &, const double, const int, const AcGeVector3d &, const int) const final
virtual Acad::ErrorStatus  | getGsMarkersAtSubentPath (const AcDbFullSubentPath &, AcArray< Adesk::GsMarker > &) const final
virtual Acad::ErrorStatus  | getMaterialMapper (AcGiMapper &) const
virtual Acad::ErrorStatus  | getOsnapPoints (AcDb::OsnapMode, Adesk::GsMarker, const AcGePoint3d &, const AcGePoint3d &, const AcGeMatrix3d &, AcGePoint3dArray &, AcDbIntArray &) const final
Gets the entity osnap points. More...
virtual Acad::ErrorStatus  | getOsnapPoints (AcDb::OsnapMode, Adesk::GsMarker, const AcGePoint3d &, const AcGePoint3d &, const AcGeMatrix3d &, AcGePoint3dArray &, AcDbIntArray &, const AcGeMatrix3d &) const final
Gets the entity osnap points. More...
virtual Acad::ErrorStatus  | getPlane (AcGePlane &, AcDb::Planarity &) const
Returns the plane that contains this entity. More...
AcDb::PlotStyleNameType  | getPlotStyleNameId (AcDbObjectId &) const
Returns the plot style name type and its associated id. More...
virtual Acad::ErrorStatus  | getStretchPoints (AcGePoint3dArray &) const final
Append stretch points to the specified array. More...
 virtual Acad::ErrorStatus  | getSubentClassId (const AcDbFullSubentPath &, CLSID *) const final
 virtual Acad::ErrorStatus  | getSubentPathGeomExtents (const AcDbFullSubentPath &, AcDbExtents &) const final
virtual Acad::ErrorStatus  | getSubentPathsAtGsMarker (AcDb::SubentType, Adesk::GsMarker, const AcGePoint3d &, const AcGeMatrix3d &, int &, AcDbFullSubentPath *&, int=0, AcDbObjectId *=NULL) const final
Gets the subentity paths appropriate for the passed in gs marker. More...
virtual Acad::ErrorStatus  | getTransformedCopy (const AcGeMatrix3d &, AcDbEntity *&) const final
Creates a copy of the current entity applying the transformation matrix. More...
 virtual void  | gripStatus (const AcDb::GripStat) final
virtual AcGsNode *  | gsNode () const
 virtual bool  | hideMeForDragging () const final
virtual Acad::ErrorStatus  | highlight (const AcDbFullSubentPath &=kNullSubent, const Adesk::Boolean=Adesk::kFalse) const final
Highlights part of, or entire entity. More...
virtual Acad::ErrorStatus  | intersectWith (const AcDbEntity *, AcDb::Intersect, AcGePoint3dArray &, Adesk::GsMarker=0, Adesk::GsMarker=0) const final
Finds the intersection between this entity and the pOhter entity. More...
virtual Acad::ErrorStatus  | intersectWith (const AcDbEntity *, AcDb::Intersect, const AcGePlane &, AcGePoint3dArray &, Adesk::GsMarker=0, Adesk::GsMarker=0) const final
Projects this entity and the pOhter entity on plane, finds the intersection points between these projections and then projects back the points onto the caller entity. More...
 virtual bool  | isContentSnappable () const final
virtual Adesk::Boolean  | isPlanar () const
ACHAR *  | layer () const
Returns the layername. More...
AcDbObjectId  | layerId () const
Returns the Object ID of the LayerTableRecord referenced by this entity. More...
ACHAR *  | linetype () const
Gets the linetype value. More...
AcDbObjectId  | linetypeId () const
Gets the linetypeId value. More...
 double  | linetypeScale () const
returns the linetype scale factor for the entity
AcDb::LineWeight  | lineWeight () const
Gets the entity line weight. More...
virtual void  | list () const final
Prints the properties in drawing window. More...
ACHAR *  | material () const
Gets the material assigned to this entity. More...
AcDbObjectId  | materialId () const
Gets the AcDbObjectId of the material assigned to this entity. More...
virtual Acad::ErrorStatus  | moveGripPointsAt (const AcDbIntArray &, const AcGeVector3d &) final
Move the grip points pointed by the indexes specified in indexArray using the translationVector param direction and length Override this method in custom entities to define your own behaviour. More...
 virtual Acad::ErrorStatus  | moveGripPointsAt (const AcDbVoidPtrArray &, const AcGeVector3d &, const int) final
 virtual Acad::ErrorStatus  | moveGripPointsAtSubentPaths (const AcDbFullSubentPathArray &, const AcDbVoidPtrArray &, const AcGeVector3d &, const int) final
virtual Acad::ErrorStatus  | moveStretchPointsAt (const AcDbIntArray &, const AcGeVector3d &) final
Move the stretch points pointed by the indexes specified in indexArray with the offest specified by translationVector Override this method in custom entities to define your own behaviour. More...
ACHAR *  | plotStyleName () const
Returns the name of the plotStyleName string associated with this entity (DXF 390). More...
virtual bool  | receiveShadows () const
Checks if this entity is able to receive shadows. More...
void  | recordGraphicsModified (Adesk::Boolean=Adesk::kTrue)
Controls the entity display update when closing it Entities not updated when closed are updated at the first regen. More...
virtual void  | saveAs (AcGiWorldDraw *, AcDb::SaveType)
Generates the graphics primitives when a DWG save requiring proxy graphics to be saved is made. More...
virtual void  | setCastShadows (bool)
Sets this entity's flag regarding casting shadows. More...
virtual Acad::ErrorStatus  | setColor (const AcCmColor &, Adesk::Boolean=Adesk::kTrue)
Sets the color information of this entity from an AcCmColor instance. More...
virtual Acad::ErrorStatus  | setColor (const AcCmColor &, bool, AcDbDatabase *)
Sets the color property of this entity from an AcCmColor instance. More...
virtual Acad::ErrorStatus  | setColorIndex (Adesk::UInt16, Adesk::Boolean=Adesk::kTrue)
Sets the color index of this entity (DXF 62). More...
void  | setDatabaseDefaults ()
Applies the default properties of the entities database to this entity. More...
void  | setDatabaseDefaults (AcDbDatabase *)
Applies the default properties of the specified database to this entity. More...
virtual void  | setGsNode (AcGsNode *)
virtual Acad::ErrorStatus  | setLayer (AcDbObjectId, Adesk::Boolean=Adesk::kTrue, bool=false)
Sets the layer to be referenced by this entity (DXF 8). More...
virtual Acad::ErrorStatus  | setLayer (const ACHAR *, Adesk::Boolean=Adesk::kTrue, bool=false)
Sets the layer to be referenced by this entity (DXF 8). More...
virtual Acad::ErrorStatus  | setLinetype (AcDbObjectId, Adesk::Boolean=Adesk::kTrue)
Sets the entities linetype to ltypeObjectId. More...
virtual Acad::ErrorStatus  | setLinetype (const ACHAR *, Adesk::Boolean=Adesk::kTrue)
Sets the entities linetype to the linetpye referenced by layerName. More...
virtual Acad::ErrorStatus  | setLinetypeScale (double, Adesk::Boolean=Adesk::kTrue)
sets value as entity linetype scale factor More...
virtual Acad::ErrorStatus  | setLineWeight (AcDb::LineWeight, Adesk::Boolean=Adesk::kTrue)
Sets the entity line weight. More...
virtual Acad::ErrorStatus  | setMaterial (AcDbObjectId, Adesk::Boolean=Adesk::kTrue)
Not implemented yet. More...
virtual Acad::ErrorStatus  | setMaterial (const ACHAR *, Adesk::Boolean=Adesk::kTrue)
Assigns the material to the entity. More...
virtual Acad::ErrorStatus  | setMaterialMapper (const AcGiMapper &, Adesk::Boolean=Adesk::kTrue)
It is used for apply material (scale, rotation, projection, mode overrides) to an identity.If it is used AcGiMapper::kIdentity it will apply for entity a default mapper. More...
virtual Acad::ErrorStatus  | setPlotStyleName (AcDb::PlotStyleNameType, AcDbObjectId=AcDbObjectId::kNull, Adesk::Boolean=Adesk::kTrue)
Sets the plot style of this entity. More...
virtual Acad::ErrorStatus  | setPlotStyleName (const ACHAR *, Adesk::Boolean=Adesk::kTrue)
Sets the plot style of this entity. More...
Acad::ErrorStatus  | setPropertiesFrom (const AcDbEntity *, Adesk::Boolean=Adesk::kTrue)
Copies the properties color, layer, linetype, linetypescale and visibility from the source entity pEntity to this entity. More...
virtual void  | setReceiveShadows (bool)
Sets this entity's flag regarding receiving shadows. More...
virtual Acad::ErrorStatus  | setTransparency (const AcCmTransparency &, Adesk::Boolean=Adesk::kTrue)
Sets the transparency setting of this entity, and returns eOk if successful. More...
virtual Acad::ErrorStatus  | setVisibility (AcDb::Visibility, Adesk::Boolean=Adesk::kTrue) final
notyetdocumented. More...
 virtual Acad::ErrorStatus  | setVisualStyle (AcDbObjectId, VisualStyleType=kFullVisualStyle, Adesk::Boolean=true)
 virtual void  | subentGripStatus (const AcDb::GripStat, const AcDbFullSubentPath &) final
virtual AcDbEntity *  | subentPtr (const AcDbFullSubentPath &) const final
Creates an entity as a copy of the subentity given by acSubentPath. More...
virtual void  | subSetDatabaseDefaults (AcDbDatabase *)
This function is called by AcDbEntity::setDatabaseDefaults(), to allow custom entities to set their related sub entities, if any; default implementation does nothing. More...
virtual Acad::ErrorStatus  | transformBy (const AcGeMatrix3d &) final
Applies given transformation (matrix) to the entity. More...
 virtual Acad::ErrorStatus  | transformSubentPathsBy (const AcDbFullSubentPathArray &, const AcGeMatrix3d &) final
 AcCmTransparency  | transparency () const
Returns the transparency setting of this entity.
virtual Acad::ErrorStatus  | unhighlight (const AcDbFullSubentPath &=kNullSubent, const Adesk::Boolean=Adesk::kFalse) const final
Unhighlights previously highlighted part of entity, or entire entity. More...
AcDb::Visibility  | visibility () const
Gets the visibility state. More...
 AcDbObjectId  | visualStyleId (VisualStyleType=kFullVisualStyle) const
 Public Member Functions inherited from AcDbObject
virtual void  | addPersistentReactor (AcDbObjectId)
Adds a persistent reactor to this object reactor list. More...
void  | addReactor (AcDbObjectReactor *) const
Adds a transient reactor to this object. More...
virtual Acad::ErrorStatus  | applyPartialUndo (AcDbDwgFiler *, AcRxClass *)
This function is called during Undo operations on objects, that use the 'Partial Undo meachanism'; this is, this object is opened with assertWriteEnabled(Adesk::kFalse) to indicate that custom Undo filing is used rather than the default Undo filing. More...
 void  | assertNotifyEnabled () const
 void  | assertReadEnabled () const
 void  | assertWriteEnabled (Adesk::Boolean=Adesk::kTrue, Adesk::Boolean=Adesk::kTrue)
virtual Acad::ErrorStatus  | audit (AcDbAuditInfo *)
Performs the audit operation for this object. More...
Acad::ErrorStatus  | cancel ()
Reverts all changes since the object had been opened and closes the object. More...
virtual void  | cancelled (const AcDbObject *)
A handler function for persistent reactors. More...
virtual AcRxObject *  | clone () const
Creates a shallow clone of this object. More...
Acad::ErrorStatus  | close ()
Closes the object. More...
Acad::ErrorStatus  | closeAndPage (Adesk::Boolean=Adesk::kTrue)
Closes the object. More...
virtual Acad::ErrorStatus  | composeForLoad (AcDb::OdaSaveType, AcDb::AcDbDwgVersion)
This function is intended for future MT file loading support. More...
virtual void  | copied (const AcDbObject *, const AcDbObject *)
A handler function for persistent reactors. More...
virtual Acad::ErrorStatus  | copyFrom (const AcRxObject *)
Copies the pSrc object information in this object. More...
Acad::ErrorStatus  | createExtensionDictionary ()
Creates a dictionary as extension dictionary for this object. More...
AcDbDatabase *  | database () const
Returns the database that contains this object. More...
virtual Acad::ErrorStatus  | decomposeForSave (AcDb::AcDbDwgVersion, AcDbObject *&, AcDbObjectId &, Adesk::Boolean &)
This function is called during dwg and dxf output, to allow a custom object to decompose itself, due to provided dwg/dxf target file version. More...
virtual Acad::ErrorStatus  | deepClone (AcDbObject *, AcDbObject *&, AcDbIdMapping &, Adesk::Boolean=Adesk::kTrue) const final
Clones this object, appends it to the owner pOwner and adds an AcDbIdPair record to the idMap. More...
void  | disableUndoRecording (Adesk::Boolean)
Disables or enables the undo recording for the object. More...
Acad::ErrorStatus  | downgradeOpen ()
Sets the open mode for an object opened for write to be opened for read. More...
Acad::ErrorStatus  | downgradeToNotify (Adesk::Boolean)
Sets the open mode for an object opened for write to be opened for notify. More...
virtual AcGiDrawable *  | drawable ()
Retrieves the AcGiDrawable instance of this object. More...
Acad::ErrorStatus  | dwgIn (AcDbDwgFiler *)
Calls the object's dwgInFields function, and reads any XData if present. More...
virtual Acad::ErrorStatus  | dwgInFields (AcDbDwgFiler *)
Reads the object from the DWG filer. More...
Acad::ErrorStatus  | dwgOut (AcDbDwgFiler *) const
Calls the object's dwgOutFields function, and writes any XData if present. More...
virtual Acad::ErrorStatus  | dwgOutFields (AcDbDwgFiler *) const
Writes the object to the DWG filer. More...
Acad::ErrorStatus  | dxfIn (AcDbDxfFiler *)
Calls the object's dxfInFields function, and reads any XData if present. More...
virtual Acad::ErrorStatus  | dxfInFields (AcDbDxfFiler *)
Reads the object from the DXF filer. More...
Acad::ErrorStatus  | dxfOut (AcDbDxfFiler *, Adesk::Boolean, Adesk::uchar *) const
Calls the object's dxfOutFields function, and writes any XData if present. More...
virtual Acad::ErrorStatus  | dxfOutFields (AcDbDxfFiler *) const
Writes the object to the DXF filer. More...
Acad::ErrorStatus  | erase (Adesk::Boolean=Adesk::kTrue)
Sets the bit that indicates that the object is erased. More...
virtual void  | erased (const AcDbObject *, Adesk::Boolean=Adesk::kTrue)
A handler function for persistent reactors. More...
AcDbObjectId  | extensionDictionary () const
Returns the object id of the extension dictionary for this object. More...
void  | getAcDbHandle (AcDbHandle &) const
Returns handle of this object. More...
Acad::ErrorStatus  | getBinaryData (const ACHAR *, Adesk::Int32 &, char *&) const
Creates a copy of the binary data stored as chunks of maximum 127 bytes in the resbuf chain of this object's extension dictionary xrecord entry given by entryName. More...
int  | getBrxOpenCount () const
This function returns the number of open BRX instances for this object. More...
int  | getBrxOpenState () const
This function returns the BRX object open state flags as bitfields, for diagnostic purpose. More...
virtual Acad::ErrorStatus  | getClassID (CLSID *) const final
Gets the COM wrapper Class ID for this entity. More...
int  | getCustomObjectState () const
This function returns the custom object status : 1=isCustomObject 2=DifferentialUndoDisabled. More...
Acad::ErrorStatus  | getField (const ACHAR *, AcDbField *&, AcDb::OpenMode) const
Retrieves the specified Field from this object, and opens it in mode. More...
Acad::ErrorStatus  | getField (const ACHAR *, AcDbObjectId &) const
Gets the pszPropName field object from field dictionary of this AcDbObject object, using pszPropName as key. More...
AcDbObjectId  | getFieldDictionary () const
Returns the Field dictionary associated with this object,. More...
Acad::ErrorStatus  | getFieldDictionary (AcDbDictionary *&, AcDb::OpenMode) const
Gets and opens the field dictionary for this. More...
Acad::ErrorStatus  | getObjectBirthVersion (AcDb::AcDbDwgVersion &, AcDb::MaintenanceReleaseVersion &)
This function is currently not supported by the CAD engine, always returns Acad::eOk, and 'kDHL_CURRENT' + 'kMReleaseCurrent' results. More...
virtual Acad::ErrorStatus  | getObjectSaveVersion (const AcDbDwgFiler *, AcDb::AcDbDwgVersion &, AcDb::MaintenanceReleaseVersion &)
Returns the DWG version for saving the object. More...
virtual Acad::ErrorStatus  | getObjectSaveVersion (const AcDbDxfFiler *, AcDb::AcDbDwgVersion &, AcDb::MaintenanceReleaseVersion &)
Returns the DWG version for saving the object. More...
int  | getOdaOpenCount () const
This function returns the number of open ODA instances for this object. More...
int  | getOdaOpenState () const
This function returns the ODA object open state flags as bitfields, for diagnostic purpose. More...
virtual void  | goodbye (const AcDbObject *)
A handler function for persistent reactors. More...
virtual AcGsNode *  | gsNode () const
Gets the AcGsNode (graphics cache) for this entity. More...
Acad::ErrorStatus  | handOverTo (AcDbObject *, Adesk::Boolean=Adesk::kTrue, Adesk::Boolean=Adesk::kTrue)
Hands over objects identity to another object. More...
bool  | hasFields () const
Return true if this object has single or multiple fields associated with him. More...
bool  | hasPersistentReactor (AcDbObjectId) const
Checks the input objectId in this object reactor list. More...
bool  | hasSaveVersionOverride ()
This function indicates whether this object overrides the filer's save version. More...
virtual AcDbObjectId  | id () const
Returns the database id of this object. More...
Adesk::Boolean  | isAcDbObjectIdsInFlux () const
Checks whether a deep clone operation was completed. More...
Adesk::Boolean  | isAProxy () const
Adesk::Boolean  | isCancelling () const
Adesk::Boolean  | isErased () const
Returns whether this object is erased. More...
Adesk::Boolean  | isEraseStatusToggled () const
Checks whether the object erase status has been toggled. More...
Adesk::Boolean  | isModified () const
Returns whether this object's assertWriteEnabled() has been called since it was opened. More...
Adesk::Boolean  | isModifiedGraphics () const
Checks whether this object graphics will be updated when the object is closed. More...
Adesk::Boolean  | isModifiedXData () const
Checks whether this object's xData was modified. More...
Adesk::Boolean  | isNewObject () const
Returns true if and only if this object has not been closed since it was created. More...
Adesk::Boolean  | isNotifyEnabled () const
Returns whether this object is opened for notify. More...
Adesk::Boolean  | isNotifying () const
virtual Adesk::Boolean  | isPersistent () const
Returns the 'persistent' status of a database object. More...
Adesk::Boolean  | isReadEnabled () const
Returns whether this object is opened for read. More...
 Adesk::Boolean  | isReallyClosing () const
Checks whether the next close call will completely close this object return true if on the next call the object will be completely closed false otherwise.
Adesk::Boolean  | isTransactionResident () const
Gets the object transaction status. More...
Adesk::Boolean  | isUndoing () const
bool  | isUndoRecordingDisabled () const
Returns whether the undo recording for the object is enabled or not. More...
Adesk::Boolean  | isWriteEnabled () const
Returns whether this object is opened for write. More...
virtual AcDb::DuplicateRecordCloning  | mergeStyle () const
Returns the object's merge behavior during cloning. More...
virtual void  | modified (const AcDbObject *)
A handler function for persistent reactors. More...
virtual void  | modifiedGraphics (const AcDbEntity *)
A handler function for persistent reactors. More...
virtual void  | modifiedXData (const AcDbObject *)
A handler function for persistent reactors. More...
virtual void  | modifyUndone (const AcDbObject *)
A handler function for persistent reactors. More...
virtual void  | objectClosed (const AcDbObjectId)
A handler function for persistent reactors. More...
AcDbObjectId  | objectId () const
Returns object id. More...
virtual void  | openedForModify (const AcDbObject *)
A handler function for persistent reactors. More...
AcDbObjectId  | ownerId () const
Returns object id of the owner. More...
AcDbVoidPtrArray *  | reactors ()
Gets the object pointers to reactors. More...
const AcDbVoidPtrArray *  | reactors () const
Gets the object pointers to reactors. More...
virtual void  | reappended (const AcDbObject *)
A handler function for persistent reactors. More...
 virtual void  | recvPropagateModify (const AcDbObject *)
Not implemented yet.
Acad::ErrorStatus  | releaseExtensionDictionary ()
Removes the extension dictionary associated with this object. More...
virtual Acad::ErrorStatus  | removeField (AcDbObjectId)
Removes the Field specified by acFieldId from this object. More...
virtual Acad::ErrorStatus  | removeField (const ACHAR *)
Removes the Field specified by szKeyString from this object. More...
virtual Acad::ErrorStatus  | removeField (const ACHAR *, AcDbObjectId &)
Removes the Field specified by acPszKeyString from this object, and returns its ObjectId value. More...
virtual Acad::ErrorStatus  | removePersistentReactor (AcDbObjectId)
Removes a persistent reactor from this object reactor list. More...
void  | removeReactor (AcDbObjectReactor *) const
Removes a transient reactor to this object. More...
void  | setAcDbObjectIdsInFlux ()
Call this function to indicate that the object IDs of this object and its sub-objects (if any) are not yet valid. More...
Acad::ErrorStatus  | setBinaryData (const ACHAR *, Adesk::Int32, const char *)
Creates a copy of the binary data, divides it in up to 127 bytes binary chunks and
 sets them as resbufs in the resbuf chain of this object's extension dictionary xrecord entry given by entryName. More...
virtual Acad::ErrorStatus  | setField (const ACHAR *, AcDbField *, AcDbObjectId &)
Adds the pAcField field object to field dictionary of this AcDbObject object, using pKey as key. More...
virtual void  | setGsNode (AcGsNode *)
Gets the AcGsNode (graphics cache) for this entity. More...
void  | setHasSaveVersionOverride (bool)
This function can be called to specify that the object has a "save version override". More...
virtual Acad::ErrorStatus  | setOwnerId (AcDbObjectId)
Sets the ownerId data member of the object to be objId. More...
virtual Acad::ErrorStatus  | setXData (const resbuf *)
Sets/removes xData associated with this object. More...
virtual Acad::ErrorStatus  | subCancel ()
Possibility to veto a cancel operation from within custom entities. More...
virtual Acad::ErrorStatus  | subClose ()
virtual Acad::ErrorStatus  | subErase (Adesk::Boolean)
This hook is called during an AcDbObject::erase call, before any actual erase operation is performed. More...
 virtual Acad::ErrorStatus  | subHandOverTo (AcDbObject *)
virtual void  | subObjModified (const AcDbObject *, const AcDbObject *)
A handler function for persistent reactors. More...
 virtual Acad::ErrorStatus  | subOpen (AcDb::OpenMode)
virtual Acad::ErrorStatus  | subSwapIdWith (AcDbObjectId, Adesk::Boolean=Adesk::kFalse, Adesk::Boolean=Adesk::kFalse)
This hook is called during an AcDbObject::swapIdWith() call, before any actual swap operation is performed. More...
Acad::ErrorStatus  | swapIdWith (AcDbObjectId, Adesk::Boolean=Adesk::kFalse, Adesk::Boolean=Adesk::kFalse)
Swaps the object id's between the object identified by param swapId and this object. More...
virtual Acad::ErrorStatus  | swapReferences (const AcDbIdMapping &)
Not implemented yet. More...
virtual void  | unappended (const AcDbObject *)
A handler function for persistent reactors. More...
AcDbDwgFiler *  | undoFiler ()
Gets the undo filer for this object. More...
Acad::ErrorStatus  | upgradeFromNotify (Adesk::Boolean &)
Upgrades the open status of this object to AcDb::kForWrite, if this object is already open (either in AcDb::kForRead, AcDb::kForNotify or AcDb::kForWrite) More...
Acad::ErrorStatus  | upgradeOpen ()
Changes the objects open mode to AcDb::kForWrite and sends notifications. More...
virtual Acad::ErrorStatus  | wblockClone (AcRxObject *, AcDbObject *&, AcDbIdMapping &, Adesk::Boolean=Adesk::kTrue) const final
Clones this object, appends it to the owner pOwner and adds an AcDbIdPair record to the idMap. More...
virtual resbuf *  | xData (const ACHAR *=NULL) const
Returns the xData associated with this object. More...
Acad::ErrorStatus  | xDataTransformBy (const AcGeMatrix3d &)
Transforms the extended data according to parameter transformation matrix. More...
 virtual void  | xmitPropagateModify () const
Not implemented yet.
 virtual  | ~AcDbObject ()
Destructor.
 Public Member Functions inherited from AcGiDrawable
virtual bool  | bounds (AcDbExtents &) const
virtual DrawableType  | drawableType () const
 virtual AcGiDrawStream *  | drawStream () const
virtual AcGsNode *  | gsNode () const =0
virtual AcDbObjectId  | id () const =0
virtual Adesk::Boolean  | isPersistent () const =0
virtual Adesk::UInt32  | regenSupportFlags () const final
Returns whether and to which level this object supports MultiThreading. More...
 virtual Adesk::Boolean  | RolloverHit (Adesk::ULongPtr, Adesk::ULongPtr, Adesk::Boolean)
 virtual Adesk::UInt32  | setAttributes (AcGiDrawableTraits *) final
 virtual void  | setDrawStream (AcGiDrawStream *)
virtual void  | setGsNode (AcGsNode *)=0
 virtual void  | viewportDraw (AcGiViewportDraw *) final
 virtual Adesk::UInt32  | viewportDrawLogicalFlags (AcGiViewportDraw *) final
 virtual Adesk::Boolean  | worldDraw (AcGiWorldDraw *) final
 Public Member Functions inherited from AcRxObject
virtual AcRxObject *  | clone () const
Exported and implemented. More...
 virtual AcRx::Ordering  | comparedTo (const AcRxObject *) const
Exported and implemented.
virtual Acad::ErrorStatus  | copyFrom (const AcRxObject *)
Exported and implemented. More...
 virtual AcRxClass *  | isA () const
Exported and implemented.
virtual Adesk::Boolean  | isEqualTo (const AcRxObject *) const
Exported and implemented. More...
bool  | isKindOf (const AcRxClass *) const
Checks the object class. More...
AcRxObject *  | queryX (const AcRxClass *) const
returns the protocol extension object assigned to this class or a parent class. More...
AcRxObject *  | x (const AcRxClass *) const
returns the protocol extension object assigned to this class or a parent class. More...
 virtual  | ~AcRxObject ()
Destructor.
 Public Attributes
AcDb3dSolid
Default constructor.
 Public Attributes inherited from AcDbEntity
AcDbEntity
This protected constructor sets the initial value for color to 257, and for the objectids for layer and linetype to AcDbObjectId::kNull. More...
 Protected Member Functions
virtual Acad::ErrorStatus  | subGetGsMarkersAtSubentPath (const AcDbFullSubentPath &, AcArray< Adesk::GsMarker > &) const
virtual Acad::ErrorStatus  | subGetSubentPathsAtGsMarker (AcDb::SubentType, Adesk::GsMarker, const AcGePoint3d &, const AcGeMatrix3d &, int &, AcDbFullSubentPath *&, int=0, AcDbObjectId *=NULL) const
virtual void  | subList () const
virtual AcDbEntity *  | subSubentPtr (const AcDbFullSubentPath &) const
virtual void  | subViewportDraw (AcGiViewportDraw *)
Creates a viewport-dependent graphical representation of this object. More...
virtual Adesk::Boolean  | subWorldDraw (AcGiWorldDraw *)
Creates a viewport-independent graphical representation of the object. More...
 Protected Member Functions inherited from AcDbEntity
 virtual Acad::ErrorStatus  | subAddSubentPaths (const AcDbFullSubentPathArray &)
 virtual Adesk::Boolean  | subCloneMeForDragging ()
 virtual Acad::ErrorStatus  | subDeleteSubentPaths (const AcDbFullSubentPathArray &)
virtual Acad::ErrorStatus  | subExplode (AcDbVoidPtrArray &) const
 virtual Acad::ErrorStatus  | subGetCompoundObjectTransform (AcGeMatrix3d &) const
virtual Acad::ErrorStatus  | subGetGeomExtents (AcDbExtents &) const
virtual Acad::ErrorStatus  | subGetGripEntityUCS (const void *, AcGeVector3d &, AcGePoint3d &, AcGeVector3d &) const
virtual Acad::ErrorStatus  | subGetGripPoints (AcDbGripDataPtrArray &, const double, const int, const AcGeVector3d &, const int) const
virtual Acad::ErrorStatus  | subGetGripPoints (AcGePoint3dArray &, AcDbIntArray &, AcDbIntArray &) const
 virtual Acad::ErrorStatus  | subGetGripPointsAtSubentPath (const AcDbFullSubentPath &, AcDbGripDataPtrArray &, const double, const int, const AcGeVector3d &, const int) const
virtual Acad::ErrorStatus  | subGetGsMarkersAtSubentPath (const AcDbFullSubentPath &, AcArray< Adesk::GsMarker > &) const
virtual Acad::ErrorStatus  | subGetOsnapPoints (AcDb::OsnapMode, Adesk::GsMarker, const AcGePoint3d &, const AcGePoint3d &, const AcGeMatrix3d &, AcGePoint3dArray &, AcDbIntArray &) const
 virtual Acad::ErrorStatus  | subGetOsnapPoints (AcDb::OsnapMode, Adesk::GsMarker, const AcGePoint3d &, const AcGePoint3d &, const AcGeMatrix3d &, AcGePoint3dArray &, AcDbIntArray &, const AcGeMatrix3d &) const
virtual Acad::ErrorStatus  | subGetStretchPoints (AcGePoint3dArray &) const
 virtual Acad::ErrorStatus  | subGetSubentClassId (const AcDbFullSubentPath &, CLSID *) const
 virtual Acad::ErrorStatus  | subGetSubentPathGeomExtents (const AcDbFullSubentPath &, AcDbExtents &) const
virtual Acad::ErrorStatus  | subGetSubentPathsAtGsMarker (AcDb::SubentType, Adesk::GsMarker, const AcGePoint3d &, const AcGeMatrix3d &, int &, AcDbFullSubentPath *&, int=0, AcDbObjectId *=nullptr) const
virtual Acad::ErrorStatus  | subGetTransformedCopy (const AcGeMatrix3d &, AcDbEntity *&) const
virtual void  | subGripStatus (const AcDb::GripStat)
 virtual bool  | subHideMeForDragging () const
virtual Acad::ErrorStatus  | subHighlight (const AcDbFullSubentPath &=kNullSubent, const Adesk::Boolean=false) const
virtual Acad::ErrorStatus  | subIntersectWith (const AcDbEntity *, AcDb::Intersect, AcGePoint3dArray &, Adesk::GsMarker=0, Adesk::GsMarker=0) const
virtual Acad::ErrorStatus  | subIntersectWith (const AcDbEntity *, AcDb::Intersect, const AcGePlane &, AcGePoint3dArray &, Adesk::GsMarker=0, Adesk::GsMarker=0) const
virtual bool  | subIsContentSnappable () const
virtual void  | subList () const
virtual Acad::ErrorStatus  | subMoveGripPointsAt (const AcDbIntArray &, const AcGeVector3d &)
virtual Acad::ErrorStatus  | subMoveGripPointsAt (const AcDbVoidPtrArray &, const AcGeVector3d &, const int)
 virtual Acad::ErrorStatus  | subMoveGripPointsAtSubentPaths (const AcDbFullSubentPathArray &, const AcDbVoidPtrArray &, const AcGeVector3d &, const int)
virtual Acad::ErrorStatus  | subMoveStretchPointsAt (const AcDbIntArray &, const AcGeVector3d &)
virtual Adesk::UInt32  | subSetAttributes (AcGiDrawableTraits *)
Sets the values of this object's subentity traits and returns with the calling object's subentity traits. More...
virtual Acad::ErrorStatus  | subSetVisibility (AcDb::Visibility, Adesk::Boolean=true)
 virtual void  | subSubentGripStatus (const AcDb::GripStat, const AcDbFullSubentPath &)
virtual AcDbEntity *  | subSubentPtr (const AcDbFullSubentPath &) const
virtual Acad::ErrorStatus  | subTransformBy (const AcGeMatrix3d &)
 virtual Acad::ErrorStatus  | subTransformSubentPathsBy (const AcDbFullSubentPathArray &, const AcGeMatrix3d &)
virtual Acad::ErrorStatus  | subUnhighlight (const AcDbFullSubentPath &=kNullSubent, const Adesk::Boolean=false) const
virtual void  | subViewportDraw (AcGiViewportDraw *)
 virtual AcDb::Visibility  | subVisibility () const
virtual Adesk::Boolean  | subWorldDraw (AcGiWorldDraw *)
 Protected Member Functions inherited from AcDbObject
virtual Acad::ErrorStatus  | subDeepClone (AcDbObject *, AcDbObject *&, AcDbIdMapping &, Adesk::Boolean=true) const
virtual Acad::ErrorStatus  | subGetClassID (CLSID *) const
virtual Adesk::UInt32  | subSetAttributes (AcGiDrawableTraits *)
Sets the values of this object's subentity traits and returns with the calling object's subentity traits. More...
virtual void  | subViewportDraw (AcGiViewportDraw *)
virtual Adesk::UInt32  | subViewportDrawLogicalFlags (AcGiViewportDraw *)
virtual Acad::ErrorStatus  | subWblockClone (AcRxObject *, AcDbObject *&, AcDbIdMapping &, Adesk::Boolean=true) const
virtual Adesk::Boolean  | subWorldDraw (AcGiWorldDraw *)
 Protected Member Functions inherited from AcGiDrawable
virtual Adesk::UInt32  | subRegenSupportFlags () const
Returns whether and to which level this object supports MultiThreading. More...
virtual Adesk::UInt32  | subSetAttributes (AcGiDrawableTraits *)=0
virtual void  | subViewportDraw (AcGiViewportDraw *)=0
 virtual Adesk::UInt32  | subViewportDrawLogicalFlags (AcGiViewportDraw *)
virtual Adesk::Boolean  | subWorldDraw (AcGiWorldDraw *)=0
 Protected Member Functions inherited from AcRxObject
AcRxObject ()
Exported and implemented.
 Additional Inherited Members
 Public Types inherited from AcDbEntity
enum  | VisualStyleType { kFullVisualStyle = 0 , kFaceVisualStyle = 1 , kEdgeVisualStyle = 2 }
 Public Types inherited from AcGiDrawable
enum  | DrawableType {
 kGeometry = 0 , kDistantLight , kPointLight , kSpotLight ,
 kAmbientLight , kSolidBackground , kGradientBackground , kImageBackground ,
 kGroundPlaneBackground , kViewport
 }
enum  | SetAttributesFlags {
 kDrawableNone = 0 , kDrawableIsAnEntity = 1 , kDrawableUsesNesting = 2 , kDrawableIsCompoundObject = 4 ,
 kDrawableViewIndependentViewportDraw = 8 , kDrawableIsInvisible = 16 , kDrawableHasAttributes = 32 , kDrawableRegenTypeDependentGeometry = 64 ,
 kDrawableIsDimension = 133 , kDrawableRegenDraw = 256 , kDrawableStandardDisplaySingleLOD = 512 , kDrawableShadedDisplaySingleLOD = 1024 ,
 kDrawableViewDependentViewportDraw = 2048 , kDrawableBlockDependentViewportDraw = 4096 , kDrawableIsExternalReference = 8192 , kDrawableNotPlottable = 16384 ,
 kDrawableNotAllowLCS = 32768 , kDrawableMergeControlOff = 65536 , kThreadedWorldDrawViewportDraw = 131072
 }
 Static Public Member Functions inherited from AcRxObject
 static AcRxObject *  | cast (const AcRxObject *)
 static AcRxClass *  | desc ()
Exported and implemented.
 Static Public Member Functions inherited from AcHeapOperators
 static void  | operator delete (void *)
_
 static void  | operator delete (void *, const char *, int)
 static void  | operator delete (void *, void *)
 static void  | operator delete[] (void *)
_
 static void  | operator delete[] (void *, const char *, int)
 static void *  | operator new (size_t)
_
 static void *  | operator new (size_t, const char *, int)
 static void *  | operator new (size_t, void *p)
 static void *  | operator new[] (size_t)
_
 static void *  | operator new[] (size_t, const char *, int)
Detailed Description
_
Member Function Documentation
◆ body()
 UX_EXPORT_FUNCTION void * AcDb3dSolid::body  |  ( |   | ) |   const
virtual
Gets the contained modeler geometry of this solid.
Returns
Pointer to the modeler geometry of this entity
◆ booleanOper()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDb3dSolid::booleanOper  |  ( |  AcDb::BoolOperType  |  operationType,
|  AcDb3dSolid *  |  solid
)
virtual
Constructs a solid from the current solid and the input solid by unifying, intersecting or substracting one from another.
Type of operation is specified by operationType parameter.
Parameters
[in] | operationType | boolean operation to be performed. It can be: AcDb::kBoolUnite, AcDb::kBoolIntersect or AcDb::kBoolSubtract
[in] | solid | input solid to perform operation with
Returns
Acad::eOk if successful, Acad::eInvalidInput if solid is NULL, Acad::eGeneralModelingFailure otherwise
◆ chamferEdges()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDb3dSolid::chamferEdges  |  ( |  const AcArray< AcDbSubentId * > &  |  edgeSubentityIds,
|  const AcDbSubentId &  |  baseFaceSubentityId,
|  double  |  firstDistanceChamfer,
|  double  |  secondDistanceChamfer
)
virtual
This method create on the edges of a solid a chamfer.
Parameters
[in] | edgeSubentityIds | contains subentities ids of faces that will be chamfered
[in] | baseFaceSubentityId | id of subentity Area (Area contain all edges for chamfer)
[in] | firstDistanceChamfer | is the distance beetween chamfer and edges on the base
[in] | secondDistanceChamfer | is the distance beetween chamfer and base
Returns
on succes return Acad::eOk, otherwise Acad:eInvalidInput (if baseFaceSubentityId is null) or Acad::eGeneralModelingFailure
◆ checkInterference()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDb3dSolid::checkInterference  |  ( |  const AcDb3dSolid *  |  pSolid,
|  Adesk::Boolean  |  createSolid,
|  Adesk::Boolean &  |  doInterfere,
|  AcDb3dSolid *&  |  pNewSolid
) |   |  const
virtual
Verifies if this solid do interfere with input pSolid.
If solids interfere, then doInterfere will be set to Adesk::kTrue. In this case if createSolid is set to Adesk::kTrue, then a new solid is created and pNewSolid will point to it. The generated solid will represent the common volume of the intersecting solids.
Parameters
[in] | pSolid | The other solid with
[in] | createSolid | Input flag that indicates if create a new solid if input solids do interfere
[out] | doInterfere | Output flag which will have value Adesk::kTrue if solids interfere or Adesk::kFalse otherwise
[out] | pNewSolid | Generated solid that represents the common volume of interfering input solids
Returns
Acad::eOk if operation was succesfuly performed, Acad::eInvalidInput if pNewSolid is NULL
Remarks
Generated solid may have different properties comparing with other CAD platforms when generated
◆ cleanBody()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDb3dSolid::cleanBody  |  ( |  void  |   | )
virtual
Eliminates all the faces and edges unnecesary for the topology of solid.
Returns
on succes return Acad::eOk, otherwise Acad::eGeneralModelingFailure
◆ copyEdge()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDb3dSolid::copyEdge  |  ( |  const AcDbSubentId &  |  acSubentId,
|  AcDbEntity *&  |  pAcNewEntity
)
virtual
Copies the edge of the solid given by subentId by allocating a new AcDbEntity object and assigning its address to the given pAcNewEntity pointer.
Parameters
[in] | acSubentId | subentity id which specifies the edge to be copied
[out] | pAcNewEntity | reference to the pointer to be assigned with the new entity
Returns
Acad::eOk if successful,
 Acad::eInvalidInput if the given subentity id is not valid or the solid is null
◆ copyFace()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDb3dSolid::copyFace  |  ( |  const AcDbSubentId &  |  acSubentId,
|  AcDbEntity *&  |  pAcNewEntity
)
virtual
Copies the face of the solid given by subentId by allocating a new AcDbEntity object and assigning its address to the given pAcNewEntity pointer.
Parameters
[in] | acSubentId | subentity id which specifies the face to be copied
[out] | pAcNewEntity | reference to the pointer to be assigned with the new entity
Returns
Acad::eOk if successful,
 Acad::eInvalidInput if the given subentity id is not valid,
 Acad::eGeneralModelingFailure if acSubentId is of edge or vertex type
◆ copyFrom()
 Acad::ErrorStatus AcDb3dSolid::copyFrom  |  ( |  const AcRxObject *  |  pAcSource | )
virtual
Reimplemented from AcDbObject.
◆ createBox()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDb3dSolid::createBox  |  ( |  double  |  xSize,
|  double  |  ySize,
|  double  |  zSize
)
virtual
Creates a solid box.
Parameters
[in] | xSize | length of the box
[in] | ySize | width of the box
[in] | zSize | height of the box
◆ createExtrudedSolid() [1/3]
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDb3dSolid::createExtrudedSolid  |  ( |  AcDbEntity *  |  pSweepEntity,
|  const AcDbSubentId &  |  faceSubentityId,
|  const AcGeVector3d &  |  direction,
|  AcDbSweepOptions &  |  sweepOptions
)
virtual
Creates a solid by extruding a face.
Parameters
[in] | pSweepEntity | Pointer to the entity whose face is to be extruded
[in] | faceSubentityId | Subentity id of the face to extrude
[in] | direction | The vector that indicates the direction and distance of the extrude operation
[in] | sweepOptions | Input sweep options
Returns
Acad::eOk if successful,
 errorcode otherwise
◆ createExtrudedSolid() [2/3]
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDb3dSolid::createExtrudedSolid  |  ( |  AcDbEntity *  |  pSweepEntity,
|  const AcDbSubentId &  |  faceSubentityId,
|  double  |  param,
|  AcDbSweepOptions &  |  sweepOptions
)
virtual
Creates a solid by extruding a face.
Parameters
[in] | pSweepEntity | Input pointer to the entity whose face is to be extruded
[in] | faceSubentityId | Input subentity id of the face to extrude
[in] | param | Input multiplier for the direction vector
[in] | sweepOptions | Input sweep options
Returns
Acad::eOk if successful,
 errorcode otherwise
◆ createExtrudedSolid() [3/3]
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDb3dSolid::createExtrudedSolid  |  ( |  AcDbEntity *  |  pSweepEntity,
|  const AcGeVector3d &  |  direction,
|  AcDbSweepOptions &  |  sweepOption
)
virtual
Creates a solid by sweeping a planar curve, region, or planar surface in the direction of the given vector using a distance equal to the length of the vector.
Parameters
[in] | pSweepEntity | Pointer to the entity whose face is to be extruded
[in] | direction | The vector that indicates the direction and distance of the extrude operation
[in] | sweepOptions | Input sweep options
Returns
Acad::eOk if successful,
 errorcode otherwise
◆ createFrom()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDb3dSolid::createFrom  |  ( |  const AcDbEntity *  |  sourceEntity | )
virtual
Creates a 3d solid from an entity that describes a closed volume.
Parameters
[in] | sourceEntity | entity describing closed volume
Returns
Acad::eOk if successful
errorcode otherwise (Acad::eInvalidInput, Acad::eGeneralModelingFailure)
◆ createFrustum()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDb3dSolid::createFrustum  |  ( |  double  |  objectHeight,
|  double  |  xBaseRadius,
|  double  |  yBaseRadius,
|  double  |  xUpperRadius
)
virtual
Creates a cylinder or a cone according to parameter values.
Parameters
[in] | objectHeight | object height
[in] | xBaseRadius | object X base radius
[in] | xBaseRadius | object Y base radius
[in] | xUpperRadius | object upper radius
Returns
Acad::eOk if successful
errorcode otherwise (Acad::eOutOfRange, Acad::eGeneralModelingFailure)
◆ createLoftedSolid()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDb3dSolid::createLoftedSolid  |  ( |  AcArray< AcDbEntity * > &  |  crossSectionCurves,
|  AcArray< AcDbEntity * > &  |  guideCurves,
|  AcDbEntity *  |  pathCurve,
|  AcDbLoftOptions &  |  options
)
virtual
Constructs a lofted solid using as defining elements a set of curves and some loft options.
Parameters
[in] | crossSectionCurves | Lofting operation is performed through the set of cross section curves which are contained in this array. Each of those curves defines a cross section through which the lofted solid will pass. This parameter is mandatory.
[in] | guideCurves | An optional parameter which specifies the curves used through which the shape of the lofted solid can be guided. Guide curves can be in any number but each of them should start from the first cross section, pass through each cross section and end at the last cross section.
[in] | pathCurve | Another optional parameter through which the lofting operation can control the construction of the solid.
[in] | options | Options through which can be specified different lofting options such as align direction, draft angle etc.
Returns
Acad::eOk if creation is successful, Acad::eInvalidInput if given parameters fails validation, Acad::eFail or Acad:eGeneralModelingFailure if creation is unsuccessful.
◆ createPyramid()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDb3dSolid::createPyramid  |  ( |  double  |  height,
|  int  |  sides,
|  double  |  bottomRadius,
|  double  |  topRadius = 0.0
)
virtual
Creates a solid pyramid.
Parameters
[in] | height | height of the pyramid
[in] | sides | number of sides (3 <= sides <= 64)
[in] | bottomRadius | radius of the inscribed bottom circle
[in] | topRadius | radius of the inscribed top circle
◆ createRevolvedSolid() [1/2]
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDb3dSolid::createRevolvedSolid  |  ( |  AcDbEntity *  |  pEntRev,
|  const AcDbSubentId &  |  subEntId,
|  const AcGePoint3d &  |  axisPt,
|  const AcGeVector3d &  |  axisDir,
|  double  |  revAngle,
|  double  |  startAngle,
|  AcDbRevolveOptions &  |  revolveOptions
)
virtual
Creates a solid by revolving a face of an entity.
Parameters
[in] | pEntRev | entity whose face is going to be revolved
[in] | subEntId | entity's face
[in] | axisPt | point on axis of revolution
[in] | axisDir | direction of revolution axis
[in] | revAngle | revolution angle
[in] | startAngle | start angle of rotation
[in] | revolveOption | revolve option
Returns
Acad::eOk if the solid is created, otherwise the appropriate error status
◆ createRevolvedSolid() [2/2]
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDb3dSolid::createRevolvedSolid  |  ( |  AcDbEntity *  |  pEntRev,
|  const AcGePoint3d &  |  axisPt,
|  const AcGeVector3d &  |  axisDir,
|  double  |  revAngle,
|  double  |  startAngle,
|  AcDbRevolveOptions &  |  revolveOptions
)
virtual
Creates a solid by revolving a curve, a region or a planar surface.
Parameters
[in] | pRevEnt | entity to be revolved
[in] | axisPt | point on revolution axis
[in] | axisDir | direction of revolution axis
[in] | revAngle | rotation angle
[in] | startAngle | start angle of rotation
[in] | revolveOption | revolve option
Returns
Acad::eOk if the solid is created, otherwise the appropriate error status
◆ createSculptedSolid()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDb3dSolid::createSculptedSolid  |  ( |  const AcArray< AcDbEntity * > &  |  limitingBodies,
|  const AcGeIntArray &  |  limitingFlags
)
Creates a 3d solid from the enclosed volume formed by the limiting bodies.
Parameters
[in] | limitingBodies | surfaces and solids to form the enclosed space
[in] | limitingFlags | flags (not currently used)
Returns
Acad::eOk if successful, an errorcode otherwise
◆ createSphere()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDb3dSolid::createSphere  |  ( |  double  |  radius | )
virtual
Creates a solid sphere.
Parameters
[in] | radius | radius of the sphere
◆ createSweptSolid() [1/2]
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDb3dSolid::createSweptSolid  |  ( |  AcDbEntity *  |  pSweepEnt,
|  AcDbEntity *  |  pPathEnt,
|  AcDbSweepOptions &  |  sweepOptions
)
virtual
Creates a solid entity by sweeping swetpEnt, which is a curve, region or planar surface, along a given path pPathEnt.
Parameters
[in] | pSweepEnt | entity to be swept
[in] | pPathEnt | path along pSweepEnt is swept
[in] | sweepOptions | sweep option
Returns
Acad::eOk if the solid is created, otherwise the appropriate error status
◆ createSweptSolid() [2/2]
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDb3dSolid::createSweptSolid  |  ( |  AcDbEntity *  |  pSweepEnt,
|  const AcDbSubentId &  |  subEntId,
|  AcDbEntity *  |  pPathEnt,
|  AcDbSweepOptions &  |  sweepOptions
)
virtual
Creates a solid by sweeping a face of a given entity along a given curve path pPathEnt.
Parameters
[in] | pSweepEnt | entity whose face is going to be swept
[in] | subEntId | entity face to be swept
[in] | pPathEnt | curve path along pSweepEnt is swept
[in] | sweepOptions | sweep option
Returns
Acad::eOk if the solid is created, otherwise the appropriate error status
◆ createTorus()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDb3dSolid::createTorus  |  ( |  double  |  torusRadius,
|  double  |  tubeRadius
)
virtual
Creates a solid torus.
Parameters
[in] | torusRadius | radius of the sphere
[in] | tubeRadius | radius of the sphere
◆ createWedge()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDb3dSolid::createWedge  |  ( |  double  |  xSize,
|  double  |  ySize,
|  double  |  zSize
)
virtual
Creates a solid wedge.
Parameters
[in] | xSize | length of the wedge
[in] | ySize | width of the wedge
[in] | zSize | height of the wedge
◆ extrude()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDb3dSolid::extrude  |  ( |  const AcDbRegion *  |  pRegion,
|  double  |  height,
|  double  |  taperAng = 0.0
)
virtual
Creates an extruded solid.
Parameters
[in] | pRegion | region object to extrude
[in] | height | height of the extruded solid
[in] | taperAng | taper angle (in radians)
◆ extrudeAlongPath()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDb3dSolid::extrudeAlongPath  |  ( |  const AcDbRegion *  |  pRegion,
|  const AcDbCurve *  |  pPath,
|  double  |  taperAng = 0.0
)
virtual
Creates a solid by extrusion along a given path.
Parameters
[in] | pRegion | region object to extrude along the given path
[in] | pPath | path entity to be used as extrusion path
[in] | taperAng | taper angle (in radians)
◆ extrudeFaces()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDb3dSolid::extrudeFaces  |  ( |  const AcArray< AcDbSubentId * > &  |  faceArraySubentityIds,
|  double  |  dist,
|  double  |  taperAng
)
virtual
Creates a solid by extruding the selected faces of the solid.
Parameters
[in] | faceArraySubentityIds | ids of the faces to be extruded
[in] | dist | height of the extruded faces
[in] | taperAng | taper angle(in radians)
Returns
Acad::eOk if successful,
 Acad::eGeneralModelingFailure if absolute value of @dist <= 1.0E-06,
 Acad::eInvalidInput if absolute value of @taperAng < 1.0E-06
◆ extrudeFacesAlongPath()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDb3dSolid::extrudeFacesAlongPath  |  ( |  const AcArray< AcDbSubentId * > &  |  faceArraySubentityIds,
|  const AcDbCurve *  |  pCurvePath
)
virtual
Modifies a solid by extruding the selected faces of the solid along a given curve path.
Parameters
[in] | faceArraySubentityIds | ids of the faces to be extruded
[in] | pCurvePath | path entity to be used as extrusion path
Returns
Acad::eOk if successful,
 Acad::eGeneralModelingFailure if the operation can't be applied to the solid,
 Acad::eInvalidInput if pCurvePath is NULL or faceArraySubentityIds is empty
◆ filletEdges()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDb3dSolid::filletEdges  |  ( |  const AcArray< AcDbSubentId * > &  |  acSubentIdsArr,
|  const AcGeDoubleArray &  |  radiusArr,
|  const AcGeDoubleArray &  |  setbackStart,
|  const AcGeDoubleArray &  |  setbackEnd
)
virtual
Fillet solid edges for a given array with subentity ids and a given radius array.
Parameters
[in] | acSubentIdsArr | array with the subentity ids for which fillet will pe applied
[in] | radiusArr | array containing the radius values for the subentity ids array
[in] | setbackStart | start setback array
[in] | setbackEnd | end setback array
Returns
return Acad::eOk in case fillet succeeded, otherwise if fails return Acad::eFailedToSetEdgeRounds, Acad::eFailedToBlend or Acad::eInvalidInput
◆ getMassProp()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDb3dSolid::getMassProp  |  ( |  double &  |  solidVolume,
|  AcGePoint3d &  |  solidCentroid,
|  double  |  momentInertia[3],
|  double  |  productsInertia[3],
|  double  |  principalMoments[3],
|  AcGeVector3d  |  principalAxes[3],
|  double  |  gyrationRadius[3],
|  AcDbExtents &  |  solidExtents
) |   |  const
virtual
Gets this object volume properties.
Parameters
[out] | solidVolume | volume
[out] | solidCentroid | centroid
[out] | momentInertia | X,Y,Z inertia moments
[out] | productsInertia | X,Y,Z inertia products
[out] | principalMoments | X,Y,Z principal moments
[out] | principalAxes | X,Y,Z principal axes
[out] | gyrationRadius | X,Y,Z gyration radius
[out] | solidExtents | extents box
Returns
Acad::eOk if successful error code otherwise
◆ getSection()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDb3dSolid::getSection  |  ( |  const AcGePlane &  |  inpPlane,
|  AcDbRegion *&  |  region
) |   |  const
virtual
Return the intersection region between the solid and the specified plane.
Parameters
[in] | inpPlane | plane used for obtaining the section region
[out] | region | section region obtained from the intersection between the solid and the plane
Returns
Acad::eOk if successful,
 error code otherwise
◆ getSlice() [1/2]
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDb3dSolid::getSlice  |  ( |  AcDbSurface *  |  inpSurface,
|  bool  |  alsoNegativePart,
|  AcDb3dSolid *&  |  negativePart
)
virtual
Solid is sliced by a given surface and is set with the solid part that contain the positive normal side of plane.
Parameters
[in] | inpSurface | surface that will be used to slice this solid
[in] | alsoNegativePart | - if is set to true, the solid part that contains the negative normal side of plane, otherwise that is NULL
[out] | negativePart | - if isNegativePart == true then negative part is returned too
Returns
Acad::eOk if successful error code otherwise
◆ getSlice() [2/2]
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDb3dSolid::getSlice  |  ( |  const AcGePlane &  |  inpPlane,
|  Adesk::Boolean  |  isNegativePart,
|  AcDb3dSolid *&  |  negativePart
)
virtual
Solid is sliced by a given plane and is set with the solid part that contain the positive normal side of plane.
Parameters
[in] | inpPlane | plane that will slice the solid
[in] | isNegativePart | if is set to Adesk::kTrue you can obtain the solid part that contain the negative normal side of plane, otherwise is NULL
[out] | negativePart | if isNegativePart == Adesk::kTrue then negative part is returned too
Returns
Acad::eOk if successful error code otherwise
◆ getSubentColor()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDb3dSolid::getSubentColor  |  ( |  const AcDbSubentId &  |  subentId,
|  AcCmColor &  |  color
) |   |  const
virtual
Returns the color of a subentity.
Parameters
[in] | subentId | subentity
[out] | color | subentity color
Returns
Acad::eOk if subentity type is a face or an edge, otherwise Acad::eInvalidInput
◆ getSubentMaterial()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDb3dSolid::getSubentMaterial  |  ( |  const AcDbSubentId &  |  subentId,
|  AcDbObjectId &  |  materialId
) |   |  const
virtual
Returns the color of a subentity.
Parameters
[in] | subentId | subentity
[out] | color | subentity color
Returns
Acad::eOk if subentity type is a face, otherwise Acad::eInvalidInput
◆ getSubentMaterialMapper()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDb3dSolid::getSubentMaterialMapper  |  ( |  const AcDbSubentId &  |  subentId,
|  AcGiMapper &  |  mapper
) |   |  const
virtual
Returns the material mapper of a subentity.
Parameters
[in] | subentId | subentity
[out] | mapper | subentity material mapper
Returns
Acad::eOk if subentity type is a face, otherwise Acad::eInvalidInput
◆ imprintEntity()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDb3dSolid::imprintEntity  |  ( |  const AcDbEntity *  |  pEntity | )
virtual
Imprints the intersection of a given entity with a solid on the solid's face.
Parameters
[in] | pEntity | entity whose intersection with the solid will be imprinted
Returns
Acad::eOk if successful, otherwise an appropriate error status
◆ isNull()
 UX_EXPORT_FUNCTION Adesk::Boolean AcDb3dSolid::isNull  |  ( |   | ) |   const
virtual
Checks if this AcDb3dSolid object has a ShapeManager object.
Returns
Adesk::kTrue if true,
 Adesk::kFalse if false
◆ numChanges()
 UX_EXPORT_FUNCTION Adesk::UInt32 AcDb3dSolid::numChanges  |  ( |   | ) |   const
virtual
Returns the number of changes that occured for this 3d solid.
Returns
number of changes
◆ offsetBody()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDb3dSolid::offsetBody  |  ( |  double  |  offsetDist | )
virtual
Offsets all the parts of the solid with a specified distance.
Parameters
[in] | offsetDist | offset distance
Returns
on succes Acad::eOk, otherwise Acad:eInvalidInput or Acad::eGeneralModelingFailure.
◆ offsetFaces()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDb3dSolid::offsetFaces  |  ( |  const AcArray< AcDbSubentId * > &  |  acSubentIdsArray,
|  double  |  offsetDist
)
virtual
Offset the solid's faces, if possible, containend in acFaceSubentIdsArray, with distance offsetDist.
Parameters
[in] | acFaceSubentIdsArray | represent the input array which contains pointers to the solid's faces
[in] | offsetDist | represent the distance to offset
Returns
Acad::eOk if successful or if the solid is NULL(no ShapeManager object assigned),
 Acad::eGeneralModelingFailure if the operation can't be applied to the solid,or if @acSubentIdArray contains some AcDbSubEntId types different then AcDb::kFaceSubentType, or if a face from the array is invalid
 Acad::eInvalidInput if @acSubentIdArray contains some AcDbSubEntId types different then AcDb::kFaceSubentType, or if a face from the array is invalid
◆ recordHistory()
 UX_EXPORT_FUNCTION bool AcDb3dSolid::recordHistory  |  ( |   | ) |   const
virtual
Returns the record state of solid history.
Returns
record state of solid history
Note
For internal reasons solid history will not be supported. This method will not modify the solid.
◆ removeFaces()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDb3dSolid::removeFaces  |  ( |  const AcArray< AcDbSubentId * > &  |  acSubentIdsArray | )
virtual
Removes the solid's faces, if possible, containend in acFaceSubentIdsArray.
Parameters
[in] | acFaceSubentIdsArray | represent the input array which contains pointers to the solid's faces
Returns
Acad::eOk if successful or if the solid is NULL(no ShapeManager object assigned),
 Acad::eGeneralModelingFailure if the operation can't be applied to the solid,or if @acSubentIdArray contains some AcDbSubEntId types different then AcDb::kFaceSubentType, or if a face from array is invalid
 Acad::eInvalidInput if @acSubentIdArray contains some AcDbSubEntId types different then AcDb::kFaceSubentType, or if a face from the array is invalid
◆ revolve()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDb3dSolid::revolve  |  ( |  const AcDbRegion *  |  pRegion,
|  const AcGePoint3d &  |  pntOfAxis,
|  const AcGeVector3d &  |  direction,
|  double  |  rotationAngle
)
virtual
Creates a solid by revolving the input region around a given axis.
Parameters
[in] | pRegion | region that will be revolved
[in] | pntOfAxis | point on the axis of revolution
[in] | direction | direction of the axis of revolution
[in] | rotationAngle | revolution angle
Remarks
May return different results comparing with other CAD engines.
◆ separateBody()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDb3dSolid::separateBody  |  ( |  AcArray< AcDb3dSolid * > &  |  acSolidArray | )
virtual
Separates current solid into multiple solids.
The solid can be separated only if the composed solids have disjoint volumes.
Parameters
[in] | acSolidArray | the list of newly created solids.
Returns
Acad::eOk if successful, otherwise an apropriate error status.
◆ setBody()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDb3dSolid::setBody  |  ( |  const void *  |  body | )
virtual
Set a solid with specified body.
Parameters
[in] | Body | to set solid
Returns
Return eOk in case of succes , eInvalidInput otherwise
◆ setRecordHistory()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDb3dSolid::setRecordHistory  |  ( |  bool  |  isRecording | )
virtual
Sets the record state of solid history.
Parameters
[in] | isRecording | flag that sets the current state of solid history
Returns
Acad::eOk if record state is set, otherwise an error code is returned
Note
For internal reasons solid history will not be supported. This method will not modify the solid.
◆ setShowHistory()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDb3dSolid::setShowHistory  |  ( |  bool  |  isVisible | )
virtual
Sets the visibility.of solid history.
Parameters
[in] | isVisible | flag that sets the visibility of solid history
Returns
Acad::eOk if visibility of solid history is set, otherwise an error code is returned
Note
For internal reasons solid history will not be supported. This method will not modify the solid.
◆ setSubentColor()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDb3dSolid::setSubentColor  |  ( |  const AcDbSubentId &  |  subentId,
|  const AcCmColor &  |  color
)
virtual
Sets the color of the specified subentity.
Parameters
[in] | subentId | subentity
[in] | color | subentity color
Returns
Acad::eOk if subentity type is a face or an edge, otherwise Acad::eInvalidInput
◆ setSubentMaterial()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDb3dSolid::setSubentMaterial  |  ( |  const AcDbSubentId &  |  subentId,
|  AcDbObjectId  |  materialId
)
virtual
Sets the material of the specified subentity.
Parameters
[in] | subentId | subentity
[in] | materialId | subentity material
Returns
Acad::eOk if subentity type is a face, otherwise Acad::eInvalidInput
◆ setSubentMaterialMapper()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDb3dSolid::setSubentMaterialMapper  |  ( |  const AcDbSubentId &  |  subentId,
|  const AcGiMapper &  |  mapper
)
virtual
Sets the material mapper of the specified subentity.
Parameters
[in] | subentId | subentity
[in] | mapper | subentity material mapper
Returns
Acad::eOk if subentity type is a face, otherwise Acad::eInvalidInput
◆ shellBody()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDb3dSolid::shellBody  |  ( |  const AcArray< AcDbSubentId * > &  |  acArraySubentIds,
|  double  |  offset
)
virtual
Given a valid offset the solid is changed into a solid shell having the faces offset inside if the input offset is negative and offset outside if there are positive.
Parameters
[in] | acArraySubentIds | contains subentities ids of faces that will be removed from the obtained shell
[in] | offset | offset distance of the solid faces
Returns
on succes return Acad::eOk, otherwise Acad::eGeneralModelingFailure
◆ showHistory()
 UX_EXPORT_FUNCTION bool AcDb3dSolid::showHistory  |  ( |   | ) |   const
virtual
Returns true if solid history is visible, otherwise false.
Returns
true if solid history is visible, otherwise false
Note
For internal reasons solid history will not be supported. This method will not modify the solid.
◆ stlOut()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDb3dSolid::stlOut  |  ( |  const ACHAR *  |  outfile,
|  Adesk::Boolean  |  asAscii,
|  double  |  maxSurfaceDeviation = 0.0
) |   |  const
virtual
Writes an STL format file for the data of this AcDb3dSolid object.
Parameters
[in] | outfile | the file to be created
[in] | asAscii | indicate file format ASCII or binary
[in] | maxSurfaceDeviation | maximum surface deviation value
Returns
Acad::eOk if successful,
 error code otherwise
◆ subGetGsMarkersAtSubentPath()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDb3dSolid::subGetGsMarkersAtSubentPath  |  ( |  const AcDbFullSubentPath &  |  subentId,
|  AcArray< Adesk::GsMarker > &  |  markerArray
) |   |  const
protectedvirtual
See also
AcDbEntity::getGsMarkersAtSubentPath(const AcDbFullSubentPath&, AcDbIntArray&)
Reimplemented from AcDbEntity.
◆ subGetSubentPathsAtGsMarker()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDb3dSolid::subGetSubentPathsAtGsMarker  |  ( |  AcDb::SubentType  |  eSubentType,
|  Adesk::GsMarker  |  gsMarker,
|  const AcGePoint3d &  |  pntIn,
|  const AcGeMatrix3d &  |  transformationMatrix,
|  int &  |  pathCnt,
|  AcDbFullSubentPath *&  |  pSubentPathArr,
|  int  |  insCnt = 0,
|  AcDbObjectId *  |  pContainerArray = NULL
) |   |  const
protectedvirtual
See also
AcDbEntity::getSubentPathsAtGsMarker(AcDb::SubentType, Adesk::GsMarker, const AcGePoint3d&, const AcGeMatrix3d&, int&, AcDbFullSubentPath*&, int, AcDbObjectId*)
Reimplemented from AcDbEntity.
◆ subList()
 UX_EXPORT_FUNCTION void AcDb3dSolid::subList  |  ( |   | ) |   const
protectedvirtual
See also
AcDbEntity::list()
Reimplemented from AcDbEntity.
◆ subSubentPtr()
 UX_EXPORT_FUNCTION AcDbEntity * AcDb3dSolid::subSubentPtr  |  ( |  const AcDbFullSubentPath &  |  pathId | ) |   const
protectedvirtual
See also
AcDbEntity::subentPtr(const AcDbFullSubentPath&)
Reimplemented from AcDbEntity.
◆ subViewportDraw()
 UX_EXPORT_FUNCTION void AcDb3dSolid::subViewportDraw  |  ( |  AcGiViewportDraw *  |  pVd | )
protectedvirtual
Creates a viewport-dependent graphical representation of this object.
This function is called for every viewport, if the object's worldDraw returns false.
Parameters
[in] | pVd | pointer to initialized AcGiViewportDraw interface
Reimplemented from AcDbEntity.
◆ subWorldDraw()
 UX_EXPORT_FUNCTION Adesk::Boolean AcDb3dSolid::subWorldDraw  |  ( |  AcGiWorldDraw *  |  pWd | )
protectedvirtual
Creates a viewport-independent graphical representation of the object.
Parameters
[in] | pWd | Pointer to initialized AcGiWorldDraw interface
Returns
if false, viewportDraw() must be called,
 if true, the graphical representation is viewport-independent
Reimplemented from AcDbEntity.
◆ taperFaces()
 Acad::ErrorStatus AcDb3dSolid::taperFaces  |  ( |  const AcArray< AcDbSubentId * > &  |  acArraySubentIds,
|  const AcGePoint3d &  |  origPoint,
|  const AcGeVector3d &  |  directionVector,
|  double  |  angle
)
virtual
This method tapers the input faces depending by a point and an input vector which will be drafted by a given angle.
Faces that will be lying on the plane defined by the input point and the input vector, will not be tapered.
Parameters
[in] | acArraySubentIds | contains subentities ids of one face ore more, that will be tapered
[in] | basePoint | input origin for draft plane
[in] | Input | direction for draft plane
[in] | Input | angle [radians] for tapered
Returns
on success returns Acad::eOk, otherwise Acad::eGeneralModelingFailure