Public Member Functions | Public Attributes | List of all members
AcDbXrecordIterator Class Reference
_ More...
#include <AcDbXrecordIterator.h>
 Public Member Functions
AcDbXrecordIterator (const AcDbXrecord *)
int  | curRestype () const
Returns the group code found in the restype field of the current resbuf structure pointed by the iterator. More...
bool  | done () const
Checks if the iterator is set on the last resbuf structure stored in the AcDbXrecord. More...
Acad::ErrorStatus  | getCurResbuf (resbuf &, AcDbDatabase *) const
Copies into curResbuf the restype and resvalue data from the current resbuf structure. More...
Acad::ErrorStatus  | next ()
Moves the iterator forward on the next resbuf structure of the AcDbXrecord's data. More...
 void  | start ()
Moves the iterator to the first resbuf structure stored in the AcDbXrecord.
 virtual  | ~AcDbXrecordIterator ()
Destructor.
 Public Member Functions inherited from AcRxObject
virtual AcRxObject *  | clone () const
Exported and implemented. More...
 virtual AcRx::Ordering  | comparedTo (const AcRxObject *) const
Exported and implemented.
virtual Acad::ErrorStatus  | copyFrom (const AcRxObject *)
Exported and implemented. More...
 virtual AcRxClass *  | isA () const
Exported and implemented.
virtual Adesk::Boolean  | isEqualTo (const AcRxObject *) const
Exported and implemented. More...
bool  | isKindOf (const AcRxClass *) const
Checks the object class. More...
AcRxObject *  | queryX (const AcRxClass *) const
returns the protocol extension object assigned to this class or a parent class. More...
AcRxObject *  | x (const AcRxClass *) const
returns the protocol extension object assigned to this class or a parent class. More...
 virtual  | ~AcRxObject ()
Destructor.
 Public Attributes
AcDbXrecordIterator
The constructor creates an iterator through the data contained in the AcDbXrecord object pointed by pXrec. More...
 Additional Inherited Members
 Static Public Member Functions inherited from AcRxObject
 static AcRxObject *  | cast (const AcRxObject *)
 static AcRxClass *  | desc ()
Exported and implemented.
 Protected Member Functions inherited from AcRxObject
AcRxObject ()
Exported and implemented.
Detailed Description
_
Member Function Documentation
◆ curRestype()
 UX_EXPORT_FUNCTION int AcDbXrecordIterator::curRestype  |  ( |   | ) |   const
Returns the group code found in the restype field of the current resbuf structure pointed by the iterator.
Returns
group code of the current resbuf structure
◆ done()
 UX_EXPORT_FUNCTION bool AcDbXrecordIterator::done  |  ( |   | ) |   const
Checks if the iterator is set on the last resbuf structure stored in the AcDbXrecord.
Returns
true if the iterator is set on the last record of the resbuf structure
 @ false otherwise
◆ getCurResbuf()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbXrecordIterator::getCurResbuf  |  ( |  resbuf &  |  curResbuf,
|  AcDbDatabase *  |  pDatabase
) |   |  const
Copies into curResbuf the restype and resvalue data from the current resbuf structure.
Parameters
[out] | curResbuf | resbuf structure were to copy the current resbuf pointed by the @iterator
[in] | pDatabase | pointer to the database that will translate a handle to an object @id in case the iterated Xrecord is not database resident
Returns
Acad::eOk if successful
 @ Acad::eIteratorDone if the iterator is already positioned on the last resbuf
 @ Acad::eInvalidDxfCode in case the Xrecord contains an invalid group code
◆ next()
 UX_EXPORT_FUNCTION Acad::ErrorStatus AcDbXrecordIterator::next  |  ( |   | )
Moves the iterator forward on the next resbuf structure of the AcDbXrecord's data.
Returns
Acad::eOk if successful
 @ Acad::eIteratorDone if the iterator is already positioned on the last resbuf
Member Data Documentation
◆ AcDbXrecordIterator
 UX_EXPORT_FUNCTION AcDbXrecordIterator::AcDbXrecordIterator
The constructor creates an iterator through the data contained in the AcDbXrecord object pointed by pXrec.
The AcDbXrecord object referred by pXrec must exist.
Parameters
[in] | pXrec | pointer to the AcDbXrecord object that will have its data iterated