Public Member Functions | Public Attributes | List of all members
AcDbCivilVAlignmentParabola Class Reference
Civil VerticalAlignment Parabola class. More...
#include <AcDbCivilAlignments.h>
 Public Member Functions
AcDbCivilVAlignmentParabola (AcDbCivilDbVAlignment *alignment)
double  | gradeIn () const
Returns the grade at start point of this vertical alignment parabola element. More...
double  | gradeOut () const
Returns the grade at end point of this vertical alignment parabola element. More...
double  | radius () const
Returns the radius of this vertical alignment parabola element. More...
bool  | setRadius (double rad)
Assigns the radius for this vertical alignment parabola element. More...
virtual  | ~AcDbCivilVAlignmentParabola ()
Destructor. More...
 Public Member Functions inherited from AcDbCivilVAlignmentCurve
AcGePoint2d  | endPoint () const
Returns the end point of the alignment curve element. More...
double  | length () const
Returns the total length of the alignment curve element. More...
AcGePoint2d  | startPoint () const
Returns the start point of the alignment curve element. More...
virtual  | ~AcDbCivilVAlignmentCurve ()
Destructor. More...
 Public Member Functions inherited from AcDbCivilVAlignmentElement
Adesk::UInt64  | id () const
Returns the ID of this vertical alignment element. More...
Adesk::UInt64  | nextId () const
Returns the ID of vertical alignment element next to this vertical alignment element. More...
AcDbCivilVAlignmentElement::EParameterConstraint  | parameterConstraint () const
Returns the type of parameter constraint for this vertical alignment element. More...
Adesk::UInt64  | previousId () const
Returns the ID of vertical alignment element previous to this vertical alignment element. More...
bool  | setNextId (Adesk::UInt64 id)
Defines the next element ID for the specified element in this vertical alignment element. More...
bool  | setParameterConstraint (AcDbCivilVAlignmentElement::EParameterConstraint constraint)
Defines the parameter constraint type for this vertical alignment element. More...
bool  | setPreviousId (Adesk::UInt64 id)
Defines the previous element ID for the specified element in this vertical alignment element. More...
bool  | setTangencyConstraint (AcDbCivilVAlignmentElement::ETangencyConstraint constraint)
Defines the tangency constraint type for this vertical alignment element. More...
AcDbCivilVAlignmentElement::ETangencyConstraint  | tangencyConstraint () const
Returns the type of tangency constraint for this vertical alignment element. More...
AcDbCivilVAlignmentElement::EElementType  | type () const
Returns the type of this vertical alignment element. More...
virtual  | ~AcDbCivilVAlignmentElement ()
Destructor. More...
 Public Member Functions inherited from AcRxObject
virtual AcRxObject *  | clone () const
Exported and implemented. More...
 virtual AcRx::Ordering  | comparedTo (const AcRxObject *) const
Exported and implemented.
virtual Acad::ErrorStatus  | copyFrom (const AcRxObject *)
Exported and implemented. More...
 virtual AcRxClass *  | isA () const
Exported and implemented.
virtual Adesk::Boolean  | isEqualTo (const AcRxObject *) const
Exported and implemented. More...
bool  | isKindOf (const AcRxClass *) const
Checks the object class. More...
AcRxObject *  | queryX (const AcRxClass *) const
returns the protocol extension object assigned to this class or a parent class. More...
AcRxObject *  | x (const AcRxClass *) const
returns the protocol extension object assigned to this class or a parent class. More...
 virtual  | ~AcRxObject ()
Destructor.
 Public Attributes
AcDbCivilVAlignmentParabola
Constructor; creates an empty parabola alignment element. More...
 Additional Inherited Members
 Public Types inherited from AcDbCivilVAlignmentElement
enum class  | EElementType {
 eUndefined = 0 , eTangent = 1 , eArc = 2 , eParabola = 3 ,
 ePVI = 100
 }
enum class  | EParameterConstraint {
 eUndefined = 0 , ePassThroughPoints = 1 , eRadius = 2 , eLength = 3 ,
 eAngle = 4 , eAutomatic = 5 , ePointOnTangent = 6
 }
enum class  | ETangencyConstraint {
 eUndefined = 0 , eFixed = 1 , ePrevious = 2 , eNext = 3 ,
 eBoth = 4
 }
 Static Public Member Functions inherited from AcRxObject
 static AcRxObject *  | cast (const AcRxObject *)
 static AcRxClass *  | desc ()
Exported and implemented.
 Protected Member Functions inherited from AcRxObject
AcRxObject ()
Exported and implemented.
Detailed Description
Civil VerticalAlignment Parabola class.
Constructor & Destructor Documentation
◆ ~AcDbCivilVAlignmentParabola()
 UX_EXPORT_FUNCTION AcDbCivilVAlignmentParabola::~AcDbCivilVAlignmentParabola  |  ( |   | )
virtual
Destructor.
Date
2021 torstenm implemented
Member Function Documentation
◆ gradeIn()
 UX_EXPORT_FUNCTION double AcDbCivilVAlignmentParabola::gradeIn  |  ( |   | ) |   const
Returns the grade at start point of this vertical alignment parabola element.
Returns
double - the grade at start point
Date
2021 torstenm implemented
◆ gradeOut()
 UX_EXPORT_FUNCTION double AcDbCivilVAlignmentParabola::gradeOut  |  ( |   | ) |   const
Returns the grade at end point of this vertical alignment parabola element.
Returns
double - the grade at end point
Date
2021 torstenm implemented
◆ radius()
 UX_EXPORT_FUNCTION double AcDbCivilVAlignmentParabola::radius  |  ( |   | ) |   const
Returns the radius of this vertical alignment parabola element.
Returns
double - the radius value used
Date
2021 torstenm implemented
◆ setRadius()
 UX_EXPORT_FUNCTION bool AcDbCivilVAlignmentParabola::setRadius  |  ( |  double  |  rad | )
Assigns the radius for this vertical alignment parabola element.
Parameters
[in] | rad | - the radius to be assigned
Returns
bool - 'true' if successful, 'false' otherwise
Date
2021 torstenm implemented
Member Data Documentation
◆ AcDbCivilVAlignmentParabola
 UX_EXPORT_FUNCTION AcDbCivilVAlignmentParabola::AcDbCivilVAlignmentParabola
Constructor; creates an empty parabola alignment element.
CopyConstructor.
Date
2021 torstenm implemented
Parameters
[in] | alignment | - the source object to copy from
Date
2021 torstenm implemented